Grasshopper API
Examples
This section of the Grasshopper SDK Documentation features code examples for typical 3rd party development.
Components
My First Component (VB, C#)
Simple Mathematics (VB, C#)
Simple Geometry (VB, C#)
Advanced Geometry (VB, C#)
Reading and Writing Lists (VB, C#)
Reading and Writing Trees (VB, C#)
Custom Component Options (VB, C#)
Variable Parameters (VB, C#)
Custom Previews (VB, C#)
Parameters and Data
Simple Parameters (VB, C#)
Simple Data Types (VB, C#)
GUI
Extending the GUI (VB, C#)
Custom Attributes (VB, C#)