Grasshopper API
CentralSettings.CanvasToolbarChanged Event
 Raised whenever the CanvasToolbar setting changes.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static event CentralSettings.CanvasToolbarChangedEventHandler CanvasToolbarChanged
Public Shared Event CanvasToolbarChanged As CentralSettings.CanvasToolbarChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CanvasToolbarChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace