Grasshopper API
CentralSettings.PanelDefaultFontChanged Event
 Raised whenever the PanelDefaultFontFamily or PanelDefaultFontSize settings change.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static event CentralSettings.PanelDefaultFontChangedEventHandler PanelDefaultFontChanged
Public Shared Event PanelDefaultFontChanged As CentralSettings.PanelDefaultFontChangedEventHandler
Value
Type: Grasshopper.CentralSettings.PanelDefaultFontChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace