Grasshopper API
GH_Slider_Obsolete Events
The GH_Slider_Obsolete type exposes the following members.
Events
Name | Description
ValueChanged
 Raised whenever the value of the slider is changed via GUI interaction.
Top
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace