Grasshopper API
GH_MenuTextBox Events
The GH_MenuTextBox type exposes the following members.
Events
Name | Description
KeyDown
 Raised whenever a key is pressed.
TextChanged
 Raised whenever the text in the textbox changes.
Top
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace