Grasshopper API
GH_ComponentParamServer Events
The GH_ComponentParamServer type exposes the following members.
Events
Name | Description
ParameterChanged
 Raised whenever there is a change to any parameter. If you only care about NickName or Source changes, handle the ParameterNickNameChanged or ParameterSourcesChanged events instead.
ParameterNickNameChanged
 Raised whenever a parameter nickname change is accepted.
ParameterSourcesChanged
 Raised whenever the source list of an input parameter is changed.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace