Grasshopper API
GH_DocumentServer Events
The GH_DocumentServer type exposes the following members.
Events
Name | Description
DocumentAdded
DocumentRemoved
Top
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace