Grasshopper API
GH_Document Events
The GH_Document type exposes the following members.
Events
Name | Description
ContextChanged
 The context for this document was changed.
DefaultPreviewColourChanged
 This even is raised whenever the global default for Normal preview colour is changed.
DefaultSelectedPreviewColourChanged
 This even is raised whenever the global default for Selected preview colour is changed.
EnabledChanged
 The Enabled state was changed on this document.
EnableSolutionsChanged
 Raised whenever the Shared EnabledSolutions property is changed.
FilePathChanged
 Raised whenever the FilePath of the document is modified.
ModifiedChanged
 The modified flag on the document was changed.
ObjectsAdded
 Raised after a collection of objects was added to the document.
ObjectsDeleted
 Raised after a collection of objects was removed from the document. At this point, the objects still exist, but they no longer belong to this document.
SettingsChanged
 Some settings of the document were changed.
SolutionEnd
 This event is raised whenever a new solution request has been handled. Even if the document is locked.
SolutionStart
 This event is raised whenever a new solution is requested. Even if the document is locked.
UndoStateChanged
 Raised whenever there is a change to the document undo/redo stack.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace