Grasshopper API
CentralSettings Events
The CentralSettings type exposes the following members.
Events
Name | Description
AuthorAddressChanged
 Raised whenever the AuthorAddress field is changed.
AuthorCompanyChanged
 Raised whenever the AuthorCompany field is changed.
AuthorCopyrightChanged
 Raised whenever the AuthorCopyright field is changed.
AuthorEMailChanged
 Raised whenever the AuthorEMail field is changed.
AuthorNameChanged
 Raised whenever the AuthorName field is changed.
AuthorPhoneChanged
 Raised whenever the AuthorPhone field is changed.
AuthorWebsiteChanged
 Raised whenever the AuthorWebsite field is changed.
CanvasFancyWiresChanged
 Raised whenever the CanvasFancyWires setting changes.
CanvasFullNamesChanged
 Raised whenever the CanvasFullNames setting changes.
CanvasObjectIconsChanged
 Raised whenever the CanvasObjectIcons setting changes.
CanvasObsoleteTagsChanged
 Raised whenever the CanvasObsoleteTags setting changes.
CanvasRadialMenuChanged
 Raised whenever the CanvasRadialMenu setting changes.
CanvasToolbarChanged
 Raised whenever the CanvasToolbar setting changes.
CanvasZuiZoomLevelChanged
 Raised whenever the CanvasZuiZoomLevel setting changes.
ComponentCascadeMenusChanged
 Raised whenever the ComponentCascadeMenus setting changes.
CreateSolutionUndoRecordChanged
 Raised whenever the CreateSolutionUndoRecord setting changes.
FormattingChanged
 Raised whenever a formatting setting is changed.
LoadMechanismChanged
 Raised whenever the load mechanism of a certain plugin changes.
LoadProtectionChanged
 Raised whenever the load protection of a certain plugin changes.
PanelDefaultFontChanged
 Raised whenever the PanelDefaultFontFamily or PanelDefaultFontSize settings change.
PreviewBumpZBufferChanged
 Raised whenever the PreviewBumpZBuffer setting changes.
PreviewGumballsChanged
 Raised whenever the PreviewGumballs setting changes.
PreviewMeshEdgesChanged
 Raised whenever the PreviewMeshEdges setting changes.
PreviewPlaneRadiusChanged
 Raised whenever the PreviewPlaneRadius setting changes.
PreviewPointStyleChanged
 Raised whenever the PreviewPointStyle setting changes.
PruderyLevelChanged
 Raised whenever the PruderyLevel setting changes.
RibbonAllIconsChanged
 Raised whenever the RibbonAllIcons setting changes.
RibbonDrawTabIconsChanged
 Raised whenever the RibbonDrawTabIcons setting changes.
RibbonSeparatorsChanged
 Raised whenever the RibbonSeparators setting changes.
RibbonVisibleChanged
 Raised whenever the RibbonVisible setting changes.
TemplateFileChanged
 Raised whenever the TemplateFile property is changed.
TooltipWiggleRadiusChanged
 Raised whenever the TooltipWiggleRadius setting changes.
UiScaleChanged
 Raised whenever the UiScale setting changes.
Top
See Also
Reference
CentralSettings Class
Grasshopper Namespace