Grasshopper API
GH_DigitScrollerBase Events
The GH_DigitScrollerBase type exposes the following members.
Events
Name | Description
Invalidated
 Raised whenever the display of this scroller is changed, but not the value.
ValueChanged
 Raised whenever the value of this scroller is changed due to User-Interface methods.
Top
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace