Grasshopper API
GH_NamedView Events
The GH_NamedView type exposes the following members.
Events
Name | Description
SmoothFrame
 This event is raised during smooth animations.
Top
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace