Grasshopper API
GH_AutoSaveSettings Events
The GH_AutoSaveSettings type exposes the following members.
Events
Name | Description
AutoSaveFileFormatChanged
EnableAutoSaveChanged
SaveOnDataFlatteningChanged
SaveOnDocumentUnloadChanged
SaveOnObjectAddedChanged
SaveOnObjectChangeChanged
SaveOnObjectRemovedChanged
SaveOnWireEventChanged
Top
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace