Grasshopper API
Instances Events
The Instances type exposes the following members.
Events
Name | Description
CanvasCreated
 Raised when the main canvas is created.
CanvasDestroyed
 Raised when the main canvas is destroyed.
Top
See Also
Reference
Instances Class
Grasshopper Namespace