Grasshopper API
IGH_DocumentObject Events
The IGH_DocumentObject type exposes the following members.
Events
Name | Description
AttributesChanged
 Raised whenever the number or kind of attributes changes. This event is handled by GH_Documents who subsequently wipe their attribute caches.
DisplayExpired
 Raised whenever the display (on the Canvas) of a certain object becomes invalid.
ObjectChanged
 Raised whenever some property of the object changes that would affect remote instances.
PingDocument
 Raised whenever an object needs to know which GH_Document it belongs to.
PreviewExpired
 Raised whenever the display (in the Rhino viewports) of a certain object becomes invalid.
SolutionExpired
 Raised whenever the solution of a certain object becomes invalid.
Top
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace