Grasshopper API
GH_DocumentEditor Events
The GH_DocumentEditor type exposes the following members.
Events
Name | Description
AggregateShortcutMenuItems
 This event is raised whenever a GH_DocumentEditor collects all shortcuttable menu items. If you added items to the menu and you want to be able to have custom shortcuts on these items, you must handle this event and insert your own items.
EditorFoldStateChanged
 This event is raised whenever the main windows folds or unfolds.
Top
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace