Grasshopper API
GH_Canvas Events
The GH_Canvas type exposes the following members.
Events
Name | Description
CanvasPaintBackground
 Raised after the background has been drawn.
CanvasPaintBegin
 Raised before a new paint operation starts. This event is always raised, even if the Canvas isn't visible.
CanvasPaintEnd
 Raised after a paint operation completes. This event is always raised, even if the Canvas isn't visible.
CanvasPostPaintGroups
 Raised after group drawing completes.
CanvasPostPaintObjects
 Raised after object drawing completes.
CanvasPostPaintOverlay
 Raised after object overlay drawing completes.
CanvasPostPaintWidgets
 Raised after widgets are drawn. This is the final event in the Drawing pipeline.
CanvasPostPaintWires
 Raised after wire drawing completes.
CanvasPrePaintGroups
 Raised before group drawing starts.
CanvasPrePaintObjects
 Raised before object drawing starts.
CanvasPrePaintOverlay
 Raised before object overlay drawing starts.
CanvasPrePaintWidgets
 Raised before Widgets are drawn.
CanvasPrePaintWires
 Raised before wire drawing starts.
Document_ModifiedChanged
Document_ObjectsAdded
Document_ObjectsDeleted
Document_SettingsChanged
DocumentChanged
 This event is raised whenever a different document is loaded into this canvas.
DocumentObjectMouseDown
 This event is raised whenever the left mouse button is pressed while over a Document object.
ModifiersChanged
 This event is raised whenever the ModifiersEnabled property changes.
NavigationSettingsChanged
 Raised whenever any of the shared navigation properties changed.
ViewportChanged
 This event is raised whenever the viewport properties are modified, for example when the pan or zoom values are affected.
WidgetListCreated
 This event is raised once for every GH_Canvas object that is created anew. The event is Shared (static) because it is raised inside the constructor of a GH_Canvas object and therefor cannot be registered on an instance.
Top
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace