Grasshopper API
GH_ColourPicker Events
The GH_ColourPicker type exposes the following members.
Events
Name | Description
ColourChanged
 Raised whenever the value of the slider is changed via GUI interaction.
Top
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace