Grasshopper API
GH_TooltipComponent Events
The GH_TooltipComponent type exposes the following members.
Events
Name | Description
PopulateTooltip
 This event is raised just prior to the tooltip display.
Top
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace