Grasshopper API
GH_ColourPickerBase Events
The GH_ColourPickerBase type exposes the following members.
Events
Name | Description
ColorChanged
 Raised whenever the color of this picker is changed due to User-Interface methods.
Invalidated
 Raised whenever a redraw is required.
Top
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace