Grasshopper API
GH_SliderBase Events
The GH_SliderBase type exposes the following members.
Events
Name | Description
ValueChanged
 Raised whenever the value of this slider is changed due to User-Interface methods.
Top
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace