Grasshopper API
GH_Line.B Field
 End of line.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point3D B
Public B As GH_Point3D
Field Value
Type: GH_Point3D
See Also
Reference
GH_Line Structure
GH_IO.Types Namespace