Grasshopper API
GH_Chunk.m_index Field
 Index of this chunk. This field is set only once, during construction. A negative index indicates no index qualifier has been set.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected int m_index
Protected m_index As Integer
Field Value
Type: Int32
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace