Grasshopper API
GH_Chunk.m_items Field
 The list of nodes contained within this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected SortedDictionary<ID, GH_Item> m_items
Protected m_items As SortedDictionary(Of ID, GH_Item)
Field Value
Type: SortedDictionary<ID, GH_Item>
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace