Grasshopper API
GH_Chunk.m_chunks Field
 Dictionary of sub-chunks contained within this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected GH_Chunk.ChunkKeyedCollection m_chunks
Protected m_chunks As GH_Chunk.ChunkKeyedCollection
Field Value
Type: GH_Chunk.ChunkKeyedCollection
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace