Grasshopper API
GH_Chunk.m_name Field
 Name of this chunk. This field is set only once, during construction.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected string m_name
Protected m_name As String
Field Value
Type: String
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace