Grasshopper API
GH_Chunk.m_archive Field
 Pointer to the archive that owns the Root of the tree this chunk belongs to.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected GH_Archive m_archive
Protected m_archive As GH_Archive
Field Value
Type: GH_Archive
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace