Grasshopper API
GH_Interval2D.u Field
 One dimensional component in U direction.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval1D u
Public u As GH_Interval1D
Field Value
Type: GH_Interval1D
See Also
Reference
GH_Interval2D Structure
GH_IO.Types Namespace