Grasshopper API
GH_Plane.YAxis Field
 Y axis vector of plane.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point3D YAxis
Public YAxis As GH_Point3D
Field Value
Type: GH_Point3D
See Also
Reference
GH_Plane Structure
GH_IO.Types Namespace