Grasshopper API
GH_BoundingBox.Min Field
 Minimum corner of box.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point3D Min
Public Min As GH_Point3D
Field Value
Type: GH_Point3D
See Also
Reference
GH_BoundingBox Structure
GH_IO.Types Namespace