Grasshopper API
GH_Chunk.m_comments Field
 List of text comments. This list is automatically instantiated once the first comment is added.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected List<string> m_comments
Protected m_comments As List(Of String)
Field Value
Type: List<String>
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace