Grasshopper API
GH_Plane.XAxis Field
 X axis vector of plane.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point3D XAxis
Public XAxis As GH_Point3D
Field Value
Type: GH_Point3D
See Also
Reference
GH_Plane Structure
GH_IO.Types Namespace