Grasshopper API
GH_Point3D.x Field
 X coordinate of point.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public double x
Public x As Double
Field Value
Type: Double
See Also
Reference
GH_Point3D Structure
GH_IO.Types Namespace