Grasshopper API
GH_Chunk.name_comp Field
 Comparison flag to use when comparing names.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected static StringComparison name_comp
Protected Shared name_comp As StringComparison
Field Value
Type: StringComparison
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace