Grasshopper API
GH_Point4D.y Field
 Y coordinate of point.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public double y
Public y As Double
Field Value
Type: Double
See Also
Reference
GH_Point4D Structure
GH_IO.Types Namespace