Grasshopper API
GH_Point4D.z Field
 Z coordinate of point.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public double z
Public z As Double
Field Value
Type: Double
See Also
Reference
GH_Point4D Structure
GH_IO.Types Namespace