Grasshopper API
GH_TypeLib.t_rc_subd Field
Rhino.Geometry.SubD
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_subd
Public Shared t_rc_subd As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace