Grasshopper API
GH_TypeLib.id_rc_leader Field
Rhino.Geometry.Leader
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_leader
Public Shared id_rc_leader As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace