Grasshopper API
GH_TypeLib.id_rc_angulardimension Field
Rhino.Geometry.AngularDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_angulardimension
Public Shared id_rc_angulardimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace