Grasshopper API
GH_TypeLib.id_gh_lineardimension Field
Grasshopper.Kenel.Types.GH_LinearDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_lineardimension
Public Shared id_gh_lineardimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace