Grasshopper API
GH_TypeLib.t_rc_annotationbase Field
Rhino.Geometry.AnnotationBase
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_annotationbase
Public Shared t_rc_annotationbase As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace