Grasshopper API
GH_TypeLib.id_rc_textentity Field
Rhino.Geometry.TextEntity
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_textentity
Public Shared id_rc_textentity As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace