Grasshopper API
GH_TypeLib.t_rc_angulardimension Field
Rhino.Geometry.AngularDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_angulardimension
Public Shared t_rc_angulardimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace