Grasshopper API
GH_TypeLib.t_rc_textdot Field
Rhino.Geometry.TextDot
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_textdot
Public Shared t_rc_textdot As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace