Grasshopper API
Param_ModelUnitSystem.Values Field
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IEnumerable<ModelUnitSystem> Values
Public Values As IEnumerable(Of ModelUnitSystem)
Field Value
Type: IEnumerable<ModelUnitSystem>
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace