Grasshopper API
GH_TypeLib.id_rc_subd Field
Rhino.Geometry.SubD
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_subd
Public Shared id_rc_subd As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace