Grasshopper API
GH_TypeLib.id_gh_subd Field
Grasshopper.Kernel.Types.GH_SubD
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_subd
Public Shared id_gh_subd As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace