Grasshopper API
GH_TypeLib.t_rc_detailview Field
Rhino.Geometry.DetailView
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_detailview
Public Shared t_rc_detailview As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace