Grasshopper API
GH_TypeLib.t_rc_instancereference Field
Rhino.Geometry.InstanceReferenceGeometry
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_instancereference
Public Shared t_rc_instancereference As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace