Grasshopper API
GH_TypeLib.id_rc_radialdimension Field
Rhino.Geometry.RadialDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_radialdimension
Public Shared id_rc_radialdimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace