Grasshopper API
GH_TypeLib.t_gh_textentity Field
Grasshopper.Kenel.Types.GH_TextEntity
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_textentity
Public Shared t_gh_textentity As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace