Grasshopper API
ModelFont._InstalledFamilies Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string[] _InstalledFamilies
Public Shared _InstalledFamilies As String()
Field Value
Type: String[]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace