Grasshopper API
ModelUserText.Empty Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static readonly ModelUserText Empty
Public Shared ReadOnly Empty As ModelUserText
Field Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace