Grasshopper API
GH_TypeLib.t_rc_clippingplane Field
Rhino.Geometry.ClippingPlane
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_clippingplane
Public Shared t_rc_clippingplane As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace