Grasshopper API
GH_TypeLib.id_gh_centermark Field
Grasshopper.Kenel.Types.GH_Centermark
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_centermark
Public Shared id_gh_centermark As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace