Grasshopper API
GH_TypeLib.id_gh_clippingplane Field
Grasshopper.Kernel.Types.GH_ClippingPlane
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_clippingplane
Public Shared id_gh_clippingplane As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace