Grasshopper API
GH_Document.IgnoredUnknowns Field
 A collection of missing component IDs to ignore during file load operations. Erase this cache to re-enable all the load warnings.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static readonly HashSet<Guid> IgnoredUnknowns
Public Shared ReadOnly IgnoredUnknowns As HashSet(Of Guid)
Field Value
Type: HashSet<Guid>
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace