Grasshopper API
GH_TypeLib.id_gh_textdot Field
Grasshopper.Kenel.Types.GH_TextDot
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_textdot
Public Shared id_gh_textdot As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace