Grasshopper API
GH_TypeLib.t_rc_ordinatedimension Field
Rhino.Geometry.OrdinateDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_ordinatedimension
Public Shared t_rc_ordinatedimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace