Grasshopper API
GH_TypeLib.t_rc_light Field
Rhino.Geometry.Light
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_light
Public Shared t_rc_light As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace