Grasshopper API
ModelTags.Empty Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static readonly ModelTags Empty
Public Shared ReadOnly Empty As ModelTags
Field Value
Type: ModelTags
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace