Grasshopper API
GH_TypeLib.id_gh_detailview Field
Grasshopper.Kenel.Types.GH_DetailView
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_detailview
Public Shared id_gh_detailview As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace