Grasshopper API
ModelContentName.Comparer Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static readonly StringComparer Comparer
Public Shared ReadOnly Comparer As StringComparer
Field Value
Type: StringComparer
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace