Grasshopper API
GH_TypeLib.id_rc_ordinatedimension Field
Rhino.Geometry.OrdinateDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_ordinatedimension
Public Shared id_rc_ordinatedimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace