Grasshopper API
GH_TypeLib.t_gh_centermark Field
Grasshopper.Kenel.Types.GH_Centermark
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_centermark
Public Shared t_gh_centermark As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace