Grasshopper API
GH_TypeLib.id_rc_detailview Field
Rhino.Geometry.DetailView
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_detailview
Public Shared id_rc_detailview As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace