Grasshopper API
GH_TypeLib.t_rc_dimension Field
Rhino.Geometry.Dimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_dimension
Public Shared t_rc_dimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace