Grasshopper API
GH_TypeLib.t_rc_textentity Field
Rhino.Geometry.TextEntity
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_textentity
Public Shared t_rc_textentity As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace