Grasshopper API
GH_TypeLib.id_gh_hatch Field
Grasshopper.Kernel.Types.GH_Hatch
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_hatch
Public Shared id_gh_hatch As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace