Grasshopper API
GH_TypeLib.id_gh_pointcloud Field
Grasshopper.Kernel.Types.GH_PointCloud
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_pointcloud
Public Shared id_gh_pointcloud As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace