Grasshopper API
GH_TypeLib.id_rc_lineardimension Field
Rhino.Geometry.LinearDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_lineardimension
Public Shared id_rc_lineardimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace