Grasshopper API
GH_AsynchFileData.IsLocal Field
 Gets whether Grasshopper thinks the file it is watching is on a local machine.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public readonly bool IsLocal
Public ReadOnly IsLocal As Boolean
Field Value
Type: Boolean
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace