Grasshopper API
GH_TypeLib.id_gh_instancereference Field
Grasshopper.Kenel.Types.GH_InstanceReference
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_instancereference
Public Shared id_gh_instancereference As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace