Grasshopper API
GH_TypeLib.id_rc_clippingplane Field
Rhino.Geometry.ClippingPlane
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_clippingplane
Public Shared id_rc_clippingplane As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace