Grasshopper API
GH_TypeLib.id_gh_angulardimension Field
Grasshopper.Kenel.Types.GH_AngularDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_angulardimension
Public Shared id_gh_angulardimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace