Grasshopper API
GH_TypeLib.t_gh_annotationbase Field
Grasshopper.Kenel.Types.GH_AnnotationBase
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_annotationbase
Public Shared t_gh_annotationbase As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace