Grasshopper API
GH_TypeLib.id_gh_textentity Field
Grasshopper.Kenel.Types.GH_TextEntity
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_textentity
Public Shared id_gh_textentity As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace