Grasshopper API
GH_TypeLib.t_gh_subd Field
Grasshopper.Kernel.Types.GH_Brep
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_subd
Public Shared t_gh_subd As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace