Grasshopper API
Instances.LoadOneByOne Field
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool LoadOneByOne
Public Shared LoadOneByOne As Boolean
Field Value
Type: Boolean
See Also
Reference
Instances Class
Grasshopper Namespace