Grasshopper API
GH_TypeLib.t_rc_point Field
Rhino.Geometry.Point
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_point
Public Shared t_rc_point As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace