Grasshopper API
GH_TypeLib.t_gh_light Field
Grasshopper.Kenel.Types.GH_Light
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_light
Public Shared t_gh_light As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace