Grasshopper API
GH_TypeLib.t_gh_leader Field
Grasshopper.Kenel.Types.GH_Leader
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_leader
Public Shared t_gh_leader As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace