Grasshopper API
GH_TypeLib.id_rc_light Field
Rhino.Geometry.Light
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_light
Public Shared id_rc_light As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace