Grasshopper API
GH_TypeLib.t_gh_radialdimension Field
Grasshopper.Kenel.Types.GH_RadialDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_radialdimension
Public Shared t_gh_radialdimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace