Grasshopper API
Param_ModelSpaceViewport.ViewportItem.Page Field
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Page
Public Page As String
Field Value
Type: String
See Also
Reference
Param_ModelSpaceViewport.ViewportItem Structure
Grasshopper.Rhinoceros.Display.Params Namespace