Grasshopper API
GH_TypeLib.t_gh_modelobject Field
Grasshopper.Rhinoceros.Model.ModelObject
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_modelobject
Public Shared t_gh_modelobject As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace