Grasshopper API
GH_TypeLib.t_gh_textdot Field
Grasshopper.Kenel.Types.GH_TextDot
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_textdot
Public Shared t_gh_textdot As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace