Grasshopper API
GH_TypeLib.t_rc_pointcloud Field
Rhino.Geometry.PointCloud
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_pointcloud
Public Shared t_rc_pointcloud As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace