Grasshopper API
GH_TypeLib.id_gh_light Field
Grasshopper.Kenel.Types.GH_Light
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_light
Public Shared id_gh_light As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace