Grasshopper API
GH_TypeLib.id_gh_dimension Field
Grasshopper.Kenel.Types.GH_Dimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_dimension
Public Shared id_gh_dimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace