Grasshopper API
GH_TypeLib.t_rc_leader Field
Rhino.Geometry.Leader
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_leader
Public Shared t_rc_leader As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace