Grasshopper API
GH_TypeLib.id_gh_modelobject Field
Grasshopper.Rhinoceros.Model.GH_ModelObject
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_modelobject
Public Shared id_gh_modelobject As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace