Grasshopper API
GH_TypeLib.t_gh_detailview Field
Grasshopper.Kenel.Types.GH_DetailView
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_detailview
Public Shared t_gh_detailview As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace