Grasshopper API
GH_TypeLib.id_rc_instancereference Field
Rhino.Geometry.InstanceReferenceGeometry
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_instancereference
Public Shared id_rc_instancereference As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace