Grasshopper API
GH_TypeLib.id_gh_ordinatedimension Field
Grasshopper.Kenel.Types.GH_OrdinateDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_ordinatedimension
Public Shared id_gh_ordinatedimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace