Grasshopper API
GH_TypeLib.t_gh_clippingplane Field
Grasshopper.Kenel.Types.GH_ClippingPlane
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_clippingplane
Public Shared t_gh_clippingplane As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace