Grasshopper API
ModelUnitSystem.Value._MetersPerUnit Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double _MetersPerUnit
Public _MetersPerUnit As Double
Field Value
Type: Double
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace