Grasshopper API
Param_ModelLineWidth.Values Field
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IEnumerable<ModelLineWidth> Values
Public Values As IEnumerable(Of ModelLineWidth)
Field Value
Type: IEnumerable<ModelLineWidth>
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace