Grasshopper API
GH_AsynchFileData.FilePath Field
 Gets the location this instance is watching.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public readonly string FilePath
Public ReadOnly FilePath As String
Field Value
Type: String
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace