Grasshopper API
GH_TypeLib.id_rc_pointcloud Field
Rhino.Geometry.PointCloud
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_pointcloud
Public Shared id_rc_pointcloud As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace