Grasshopper API
GH_TypeLib.t_gh_hatch Field
Grasshopper.Kenel.Types.GH_Hatch
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_hatch
Public Shared t_gh_hatch As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace