Grasshopper API
ModelUnitSystem.Value._Factor Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double _Factor
Public _Factor As Double
Field Value
Type: Double
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace