Grasshopper API
GH_TypeLib.t_gh_instancereference Field
Grasshopper.Kenel.Types.GH_InstanceReference
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_instancereference
Public Shared t_gh_instancereference As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace