Grasshopper API
GH_TypeLib.id_rc_textdot Field
Rhino.Geometry.TextDot
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_textdot
Public Shared id_rc_textdot As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace