Grasshopper API
GH_TypeLib.id_rc_point Field
Rhino.Geometry.Point
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_point
Public Shared id_rc_point As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace