Grasshopper API
GH_TypeLib.t_gh_ordinatedimension Field
Grasshopper.Kenel.Types.GH_OrdinateDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_ordinatedimension
Public Shared t_gh_ordinatedimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace