Grasshopper API
GH_TypeLib.id_rc_centermark Field
Rhino.Geometry.Centermark
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_centermark
Public Shared id_rc_centermark As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace