Grasshopper API
GH_TypeLib.t_rc_hatch Field
Rhino.Geometry.Hatch
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_hatch
Public Shared t_rc_hatch As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace