Grasshopper API
Param_ModelSpaceViewport.ViewportItem.Name Field
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Name
Public Name As String
Field Value
Type: String
See Also
Reference
Param_ModelSpaceViewport.ViewportItem Structure
Grasshopper.Rhinoceros.Display.Params Namespace