Grasshopper API
GH_TypeLib.id_gh_radialdimension Field
Grasshopper.Kenel.Types.GH_RadialDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_radialdimension
Public Shared id_gh_radialdimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace