Grasshopper API
GH_TypeLib.t_rc_centermark Field
Rhino.Geometry.Centermark
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_centermark
Public Shared t_rc_centermark As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace