Grasshopper API
GH_TypeLib.t_gh_extrusion Field
Grasshopper.Kernel.Types.GH_Extrusion
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_extrusion
Public Shared t_gh_extrusion As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace