Grasshopper API
GH_TypeLib.id_gh_leader Field
Grasshopper.Kenel.Types.GH_Leader
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_leader
Public Shared id_gh_leader As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace