Grasshopper API
ModelData.Serial Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal int Serial
Protected Friend Serial As Integer
Field Value
Type: Int32
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace