Grasshopper API
GH_TypeLib.id_rc_hatch Field
Rhino.Geometry.Hatch
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_hatch
Public Shared id_rc_hatch As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace