Grasshopper API
GH_TypeLib.t_gh_angulardimension Field
Grasshopper.Kenel.Types.GH_AngularDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_angulardimension
Public Shared t_gh_angulardimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace