Grasshopper API
Param_ModelSpaceViewport.ViewportItem.ModelSpaceViewport Field
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSpaceViewport ModelSpaceViewport
Public ModelSpaceViewport As ModelSpaceViewport
Field Value
Type: ModelSpaceViewport
See Also
Reference
Param_ModelSpaceViewport.ViewportItem Structure
Grasshopper.Rhinoceros.Display.Params Namespace