Grasshopper API
GH_TypeLib.id_gh_extrusion Field
Grasshopper.Kernel.Types.GH_Extrusion
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_gh_extrusion
Public Shared id_gh_extrusion As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace