Grasshopper API
ModelFont._InstalledFonts Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelFont[] _InstalledFonts
Public Shared _InstalledFonts As ModelFont()
Field Value
Type: ModelFont[]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace