Grasshopper API
GH_TypeLib.id_rc_dimension Field
Rhino.Geometry.Dimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Guid id_rc_dimension
Public Shared id_rc_dimension As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace