Grasshopper API
ModelContentName.Empty Field
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static readonly ModelContentName Empty
Public Shared ReadOnly Empty As ModelContentName
Field Value
Type: ModelContentName
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace