Grasshopper API
GH_TypeLib.t_gh_dimension Field
Grasshopper.Kenel.Types.GH_Dimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_dimension
Public Shared t_gh_dimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace