Grasshopper API
GH_TypeLib.t_rc_radialdimension Field
Rhino.Geometry.RadialDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_radialdimension
Public Shared t_rc_radialdimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace