Grasshopper API
GH_TypeLib.t_rc_lineardimension Field
Rhino.Geometry.LinearDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_rc_lineardimension
Public Shared t_rc_lineardimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace