Grasshopper API
GH_TypeLib.t_gh_lineardimension Field
Grasshopper.Kenel.Types.GH_LinearDimension
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_lineardimension
Public Shared t_gh_lineardimension As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace