Grasshopper API
GH_TypeLib.t_gh_pointcloud Field
Grasshopper.Kernel.Types.GH_PointCloud
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Type t_gh_pointcloud
Public Shared t_gh_pointcloud As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace