Grasshopper API
GH_Point3D Fields
The GH_Point3D type exposes the following members.
Fields
Name | Description
x
 X coordinate of point.
y
 Y coordinate of point.
z
 Z coordinate of point.
Top
See Also
Reference
GH_Point3D Structure
GH_IO.Types Namespace