Grasshopper API
GH_PointRefData Fields
The GH_PointRefData type exposes the following members.
Fields
Name | Description
m_RefID
m_RefIndex
m_RefParam
m_RefType
Top
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace