Grasshopper API
GH_Chunk Fields
The GH_Chunk type exposes the following members.
Fields
Name | Description
m_archive
 Pointer to the archive that owns the Root of the tree this chunk belongs to.
m_chunks
 Dictionary of sub-chunks contained within this chunk.
m_comments
 List of text comments. This list is automatically instantiated once the first comment is added.
m_index
 Index of this chunk. This field is set only once, during construction. A negative index indicates no index qualifier has been set.
m_items
 The list of nodes contained within this chunk.
m_name
 Name of this chunk. This field is set only once, during construction.
name_comp
 Comparison flag to use when comparing names.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace