Grasshopper API
GH_ScriptVariant Fields
The GH_ScriptVariant type exposes the following members.
Fields
Name | Description
m_type
m_value
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace