Grasshopper API
GH_PingDocumentEventArgs Fields
The GH_PingDocumentEventArgs type exposes the following members.
Fields
Name | Description
m_document
Top
See Also
Reference
GH_PingDocumentEventArgs Class
Grasshopper.Kernel Namespace