Grasshopper API
GH_RuntimeFile Fields
The GH_RuntimeFile type exposes the following members.
Fields
Name | Description
TagAuthor
 String tag used to identify Author fields in documentation source files.
TagAutoLink
 String tag used to signal whether automatic linking to a topic is allowed.
TagBeginner
 String tag used t o identify Beginner Level Help Content in documentation source files.
TagCategory
 String tag used to identify Category fields in documentation source files.
TagComponent
 String tag used to identify Component IDs in documentation source files.
TagContact
 String tag used to identify Author contact details in documentation source files.
TagDescription
 String tag used t o identify Description fields in glossary source files.
TagErranyms
 String tag used to identify Do Not Confuse collections in documentation source files.
TagExpert
 String tag used t o identify Expert Level Help Content in documentation source files.
TagInclude
 String tag used to signal whether inclusion of a topic is allowed.
TagIntermediate
 String tag used t o identify Intermediate Level Help Content in documentation source files.
TagKeywords
 String tag used to identify Keyword collections in documentation source files.
TagPronunciation
 String tag used to identify Pronunciaion Guide fields (IPA) in glossary source files.
TagRhinoCommand
 String tag used to identify Similar Rhino Commands in documentation source files.
TagSeeAlso
 String tag used to identify See Also collections in documentation source files.
TagSynonyms
 String tag used to identify Synonym collections in glossary source files.
TagTitle
 String tag used to identify title fields in documentation source files.
Top
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace