Grasshopper API
GH_TypeLib Fields
The GH_TypeLib type exposes the following members.
Fields
Name | Description
id_bool
System.Boolean
id_byte
System.Byte
id_char
System.Char
id_color
System.Drawing.Color
id_decimal
System.Decimal
id_double
System.Double
id_gh_angulardimension
Grasshopper.Kenel.Types.GH_AngularDimension
id_gh_arc
Grasshopper.Kernel.Types.GH_Arc
id_gh_bool
Grasshopper.Kernel.Types.GH_Boolean
id_gh_box
Grasshopper.Kernel.Types.GH_Box
id_gh_brep
Grasshopper.Kernel.Types.GH_Brep
id_gh_centermark
Grasshopper.Kenel.Types.GH_Centermark
id_gh_circle
Grasshopper.Kernel.Types.GH_Circle
id_gh_clippingplane
Grasshopper.Kernel.Types.GH_ClippingPlane
id_gh_colour
Grasshopper.Kernel.Types.GH_Colour
id_gh_complex
Grasshopper.Kernel.Types.Complex
id_gh_complexnumber
Grasshopper.Kernel.Types.GH_ComplexNumber
id_gh_curve
Grasshopper.Kernel.Types.GH_Curve
id_gh_detailview
Grasshopper.Kenel.Types.GH_DetailView
id_gh_dimension
Grasshopper.Kenel.Types.GH_Dimension
id_gh_extrusion
Grasshopper.Kernel.Types.GH_Extrusion
id_gh_goo
Grasshopper.Kernel.Types.IGH_Goo
id_gh_guid
Grasshopper.Kernel.Types.GH_Guid
id_gh_hatch
Grasshopper.Kernel.Types.GH_Hatch
id_gh_instancereference
Grasshopper.Kenel.Types.GH_InstanceReference
id_gh_int
Grasshopper.Kernel.Types.GH_Integer
id_gh_interval
Grasshopper.Kernel.Types.GH_Interval
id_gh_interval2D
Grasshopper.Kernel.Types.GH_Interval2D
id_gh_leader
Grasshopper.Kenel.Types.GH_Leader
id_gh_light
Grasshopper.Kenel.Types.GH_Light
id_gh_line
Grasshopper.Kernel.Types.GH_Line
id_gh_lineardimension
Grasshopper.Kenel.Types.GH_LinearDimension
id_gh_material
Grasshopper.Kernel.Types.GH_Material
id_gh_matrix
Grasshopper.Kernel.Types.GH_Matrix
id_gh_mesh
Grasshopper.Kernel.Types.GH_Mesh
id_gh_meshface
Grasshopper.Kernel.Types.GH_MeshFace
id_gh_modelobject
Grasshopper.Rhinoceros.Model.GH_ModelObject
id_gh_number
Grasshopper.Kernel.Types.GH_Number
id_gh_objwrapper
Grasshopper.Kernel.Types.GH_ObjectWrapper
id_gh_ordinatedimension
Grasshopper.Kenel.Types.GH_OrdinateDimension
id_gh_path
Grasshopper.Kernel.Data.GH_Path
id_gh_plane
Grasshopper.Kernel.Types.GH_Plane
id_gh_point
Grasshopper.Kernel.Types.GH_Point
id_gh_pointcloud
Grasshopper.Kernel.Types.GH_PointCloud
id_gh_radialdimension
Grasshopper.Kenel.Types.GH_RadialDimension
id_gh_rectangle
Grasshopper.Kernel.Types.GH_Rectangle
id_gh_string
Grasshopper.Kernel.Types.GH_String
id_gh_structpath
Grasshopper.Kernel.Types.GH_StructurePath
id_gh_subd
Grasshopper.Kernel.Types.GH_SubD
id_gh_surface
Grasshopper.Kernel.Types.GH_Surface
id_gh_textdot
Grasshopper.Kenel.Types.GH_TextDot
id_gh_textentity
Grasshopper.Kenel.Types.GH_TextEntity
id_gh_time
Grasshopper.Kernel.Types.GH_Time
id_gh_transform
Grasshopper.Kernel.Types.GH_Transform
id_gh_uvinterval
Grasshopper.Kernel.Types.UVInterval
id_gh_vector
Grasshopper.Kernel.Types.GH_Vector
id_guid
System.Guid
id_int16
System.Int16
id_int32
System.Int32
id_int64
System.Int64
id_object
System.Object
id_point
System.Drawing.Point
id_pointf
System.Drawing.PointF
id_rc_angulardimension
Rhino.Geometry.AngularDimension
id_rc_arc
Rhino.Geometry.Arc
id_rc_arccurve
Rhino.Geometry.ArcCurve
id_rc_boundingbox
Rhino.Geometry.BoundingBox
id_rc_box
Rhino.Geometry.Box
id_rc_brep
Rhino.Geometry.Brep
id_rc_brepedge
Rhino.Geometry.MeshEdge
id_rc_brepface
Rhino.Geometry.MeshFace
id_rc_centermark
Rhino.Geometry.Centermark
id_rc_circle
Rhino.Geometry.Circle
id_rc_clippingplane
Rhino.Geometry.ClippingPlane
id_rc_cone
Rhino.Geometry.Cone
id_rc_curve
Rhino.Geometry.Curve
id_rc_cylinder
Rhino.Geometry.Cylinder
id_rc_detailview
Rhino.Geometry.DetailView
id_rc_dimension
Rhino.Geometry.Dimension
id_rc_ellipse
Rhino.Geometry.Circle
id_rc_extrusion
Rhino.Geometry.Extrusion
id_rc_hatch
Rhino.Geometry.Hatch
id_rc_instancereference
Rhino.Geometry.InstanceReferenceGeometry
id_rc_interval
Rhino.Geometry.Interval
id_rc_leader
Rhino.Geometry.Leader
id_rc_light
Rhino.Geometry.Light
id_rc_line
Rhino.Geometry.Line
id_rc_lineardimension
Rhino.Geometry.LinearDimension
id_rc_linecurve
Rhino.Geometry.LineCurve
id_rc_matrix
Rhino.Geometry.Matrix
id_rc_mesh
Rhino.Geometry.Mesh
id_rc_meshface
Rhino.Geometry.MeshFace
id_rc_nurbscurve
Rhino.Geometry.NurbsCurve
id_rc_nurbssurface
Rhino.Geometry.NurbsSurface
id_rc_ordinatedimension
Rhino.Geometry.OrdinateDimension
id_rc_plane
Rhino.Geometry.Plane
id_rc_planesurface
Rhino.Geometry.PlaneSurface
id_rc_point
Rhino.Geometry.Point
id_rc_point3d
Rhino.Geometry.Point3d
id_rc_point3f
Rhino.Geometry.Point3f
id_rc_pointcloud
Rhino.Geometry.PointCloud
id_rc_polycurve
Rhino.Geometry.PolyCurve
id_rc_polyline
Rhino.Geometry.Polyline
id_rc_polylinecurve
Rhino.Geometry.PolylineCurve
id_rc_radialdimension
Rhino.Geometry.RadialDimension
id_rc_rectangle
Rhino.Geometry.Rectangle3d
id_rc_revsurface
Rhino.Geometry.RevSurface
id_rc_sphere
Rhino.Geometry.Torus
id_rc_subd
Rhino.Geometry.SubD
id_rc_sumsurface
Rhino.Geometry.SumSurface
id_rc_surface
Rhino.Geometry.Surface
id_rc_textdot
Rhino.Geometry.TextDot
id_rc_textentity
Rhino.Geometry.TextEntity
id_rc_torus
Rhino.Geometry.Torus
id_rc_transform
Rhino.Geometry.Transform
id_rc_vector3d
Rhino.Geometry.Vector3d
id_rc_vector3f
Rhino.Geometry.Vector3f
id_rectangle
System.Drawing.Rectangle
id_rectanglef
System.Drawing.RectangleF
id_single
System.Single
id_size
System.Drawing.Size
id_sizef
System.Drawing.SizeF
id_string
System.String
id_time
System.Date
id_uint16
System.UInt16
id_uint32
System.UInt32
id_uint64
System.UInt64
t_bool
System.Boolean
t_byte
System.Byte
t_char
System.Char
t_color
System.Drawing.Color
t_decimal
System.Decimal
t_double
System.Double
t_gh_angulardimension
Grasshopper.Kenel.Types.GH_AngularDimension
t_gh_annotationbase
Grasshopper.Kenel.Types.GH_AnnotationBase
t_gh_arc
Grasshopper.Kernel.Types.GH_Arc
t_gh_bool
Grasshopper.Kernel.Types.GH_Boolean
t_gh_box
Grasshopper.Kernel.Types.GH_Box
t_gh_brep
Grasshopper.Kernel.Types.GH_Brep
t_gh_centermark
Grasshopper.Kenel.Types.GH_Centermark
t_gh_circle
Grasshopper.Kernel.Types.GH_Circle
t_gh_clippingplane
Grasshopper.Kenel.Types.GH_ClippingPlane
t_gh_colour
Grasshopper.Kernel.Types.GH_Colour
t_gh_complex
Grasshopper.Kernel.Types.Complex
t_gh_complexnumber
Grasshopper.Kernel.Types.GH_ComplexNumber
t_gh_curve
Grasshopper.Kernel.Types.GH_Curve
t_gh_detailview
Grasshopper.Kenel.Types.GH_DetailView
t_gh_dimension
Grasshopper.Kenel.Types.GH_Dimension
t_gh_extrusion
Grasshopper.Kernel.Types.GH_Extrusion
t_gh_goo
Grasshopper.Kernel.Types.IGH_Goo
t_gh_guid
Grasshopper.Kernel.Types.GH_Guid
t_gh_hatch
Grasshopper.Kenel.Types.GH_Hatch
t_gh_instancereference
Grasshopper.Kenel.Types.GH_InstanceReference
t_gh_int
Grasshopper.Kernel.Types.GH_Integer
t_gh_interval
Grasshopper.Kernel.Types.GH_Interval
t_gh_interval2D
Grasshopper.Kernel.Types.GH_Interval2D
t_gh_leader
Grasshopper.Kenel.Types.GH_Leader
t_gh_light
Grasshopper.Kenel.Types.GH_Light
t_gh_line
Grasshopper.Kernel.Types.GH_Line
t_gh_lineardimension
Grasshopper.Kenel.Types.GH_LinearDimension
t_gh_material
Grasshopper.Kernel.Types.GH_Material
t_gh_matrix
Grasshopper.Kernel.Types.GH_Matrix
t_gh_mesh
Grasshopper.Kernel.Types.GH_Mesh
t_gh_meshface
Grasshopper.Kernel.Types.GH_MeshFace
t_gh_modelobject
Grasshopper.Rhinoceros.Model.ModelObject
t_gh_number
Grasshopper.Kernel.Types.GH_Number
t_gh_objwrapper
Grasshopper.Kernel.Types.GH_ObjectWrapper
t_gh_ordinatedimension
Grasshopper.Kenel.Types.GH_OrdinateDimension
t_gh_path
Grasshopper.Kernel.Data.GH_Path
t_gh_plane
Grasshopper.Kernel.Types.GH_Plane
t_gh_point
Grasshopper.Kernel.Types.GH_Point
t_gh_pointcloud
Grasshopper.Kernel.Types.GH_PointCloud
t_gh_radialdimension
Grasshopper.Kenel.Types.GH_RadialDimension
t_gh_rectangle
Grasshopper.Kernel.Types.GH_Rectangle
t_gh_string
Grasshopper.Kernel.Types.GH_String
t_gh_structpath
Grasshopper.Kernel.Types.GH_StructurePath
t_gh_subd
Grasshopper.Kernel.Types.GH_Brep
t_gh_surface
Grasshopper.Kernel.Types.GH_Surface
t_gh_textdot
Grasshopper.Kenel.Types.GH_TextDot
t_gh_textentity
Grasshopper.Kenel.Types.GH_TextEntity
t_gh_time
Grasshopper.Kernel.Types.GH_Time
t_gh_transform
Grasshopper.Kernel.Types.GH_Transform
t_gh_uvinterval
Grasshopper.Kernel.Types.UVInterval
t_gh_vector
Grasshopper.Kernel.Types.GH_Vector
t_guid
System.Guid
t_int16
System.Int16
t_int32
System.Int32
t_int64
System.Int64
t_object
System.Object
t_point
System.Drawing.Point
t_pointf
System.Drawing.PointF
t_rc_angulardimension
Rhino.Geometry.AngularDimension
t_rc_annotationbase
Rhino.Geometry.AnnotationBase
t_rc_arc
Rhino.Geometry.Arc
t_rc_arccurve
Rhino.Geometry.ArcCurve
t_rc_boundingbox
Rhino.Geometry.BoundingBox
t_rc_box
Rhino.Geometry.Box
t_rc_brep
Rhino.Geometry.Brep
t_rc_brepedge
Rhino.Geometry.MeshEdge
t_rc_brepface
Rhino.Geometry.MeshFace
t_rc_centermark
Rhino.Geometry.Centermark
t_rc_circle
Rhino.Geometry.Circle
t_rc_clippingplane
Rhino.Geometry.ClippingPlane
t_rc_cone
Rhino.Geometry.Cone
t_rc_curve
Rhino.Geometry.Curve
t_rc_cylinder
Rhino.Geometry.Cylinder
t_rc_detailview
Rhino.Geometry.DetailView
t_rc_dimension
Rhino.Geometry.Dimension
t_rc_ellipse
Rhino.Geometry.Circle
t_rc_extrusion
 Rhino.Geometry.Extrusion.
t_rc_hatch
Rhino.Geometry.Hatch
t_rc_instancereference
Rhino.Geometry.InstanceReferenceGeometry
t_rc_interval
Rhino.Geometry.Interval
t_rc_leader
Rhino.Geometry.Leader
t_rc_light
Rhino.Geometry.Light
t_rc_line
Rhino.Geometry.Line
t_rc_lineardimension
Rhino.Geometry.LinearDimension
t_rc_linecurve
Rhino.Geometry.LineCurve
t_rc_matrix
Rhino.Geometry.Matrix
t_rc_mesh
Rhino.Geometry.Mesh
t_rc_meshface
Rhino.Geometry.MeshFace
t_rc_nurbscurve
Rhino.Geometry.NurbsCurve
t_rc_nurbssurface
Rhino.Geometry.NurbsSurface
t_rc_ordinatedimension
Rhino.Geometry.OrdinateDimension
t_rc_plane
Rhino.Geometry.Plane
t_rc_planesurface
Rhino.Geometry.PlaneSurface
t_rc_point
Rhino.Geometry.Point
t_rc_point3d
Rhino.Geometry.Point3d
t_rc_point3f
Rhino.Geometry.Point3f
t_rc_pointcloud
Rhino.Geometry.PointCloud
t_rc_polycurve
Rhino.Geometry.PolyCurve
t_rc_polyline
Rhino.Geometry.Polyline
t_rc_polylinecurve
Rhino.Geometry.PolylineCurve
t_rc_radialdimension
Rhino.Geometry.RadialDimension
t_rc_rectangle
Rhino.Geometry.Rectangle3d
t_rc_revsurface
Rhino.Geometry.RevSurface
t_rc_sphere
Rhino.Geometry.Torus
t_rc_subd
Rhino.Geometry.SubD
t_rc_sumsurface
Rhino.Geometry.SumSurface
t_rc_surface
Rhino.Geometry.Surface
t_rc_textdot
Rhino.Geometry.TextDot
t_rc_textentity
Rhino.Geometry.TextEntity
t_rc_torus
Rhino.Geometry.Torus
t_rc_transform
Rhino.Geometry.Transform
t_rc_vector3d
Rhino.Geometry.Vector3d
t_rc_vector3f
Rhino.Geometry.Vector3f
t_rectangle
System.Drawing.Rectangle
t_rectanglef
System.Drawing.RectangleF
t_single
System.Single
t_size
System.Drawing.Size
t_sizef
System.Drawing.SizeF
t_string
System.String
t_time
System.Date
t_uint16
System.UInt16
t_uint32
System.UInt32
t_uint64
System.UInt64
Top
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace