Grasshopper API
GH_Capsule Fields
The GH_Capsule type exposes the following members.
Fields
Name | Description
DefaultHighlight
 The default size (in pixel units) of the highlight bar.
DefaultRadius
 The default radius (in pixel units) of the rounded corners.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace