Grasshopper API
GH_CodeString Fields
The GH_CodeString type exposes the following members.
Fields
Name | Description
DoubleQuote
m_Segments
Top
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace