Grasshopper API
GH_Point4D Fields
The GH_Point4D type exposes the following members.
Fields
Name | Description
w
 W coordinate of point.
x
 X coordinate of point.
y
 Y coordinate of point.
z
 Z coordinate of point.
Top
See Also
Reference
GH_Point4D Structure
GH_IO.Types Namespace