Grasshopper API
GH_Param<T> Fields
The GH_Param<T> generic type exposes the following members.
Fields
Name | Description
m_data
 Contains the runtime data for this parameter, also known as "Volatile" data.
Top
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace