Grasshopper API
GH_PreviewExpiredEventArgs Fields
The GH_PreviewExpiredEventArgs type exposes the following members.
Fields
Name | Description
m_redraw
Top
See Also
Reference
GH_PreviewExpiredEventArgs Class
Grasshopper.Kernel Namespace