Grasshopper API
GH_ValueProxy<T> Fields
The GH_ValueProxy<T> generic type exposes the following members.
Fields
Name | Description
m_IsStringProxy
m_Name
m_UserString
m_Valid
m_Value
Top
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace