Grasshopper API
GH_AsynchFileData Fields
The GH_AsynchFileData type exposes the following members.
Fields
Name | Description
FilePath
 Gets the location this instance is watching.
IsLocal
 Gets whether Grasshopper thinks the file it is watching is on a local machine.
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace