Grasshopper API
GH_ParserSymbol Fields
The GH_ParserSymbol type exposes the following members.
Fields
Name | Description
m_class
m_level
m_token
Top
See Also
Reference
GH_ParserSymbol Class
Grasshopper.Kernel.Expressions Namespace