Grasshopper API
GH_FadeAnimation Fields
The GH_FadeAnimation type exposes the following members.
Fields
Name | Description
Delay
 Gets the number of milliseconds between redraws (25 milliseconds, resulting in ~40 fps)
Top
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace