Grasshopper API
GH_ExpressionString Fields
The GH_ExpressionString type exposes the following members.
Fields
Name | Description
bracket_closed
bracket_open
colon
comma
dot
dquote
invalid
linefeed
m_t
paren_close
paren_open
quote
return
scolon
space
tab
underbar
Top
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace