Grasshopper API
GH_Canvas Fields
The GH_Canvas type exposes the following members.
Fields
Name | Description
ScheduleInactive
 Defines the delay used to indicate the absence of a schedule.
ThumbnailHeight
ThumbnailWidth
Top
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace