Grasshopper API
Value Fields
The ModelUnitSystem.Value type exposes the following members.
Fields
Name | Description
_Factor
Top
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace