Grasshopper API
GH_Line Fields
The GH_Line type exposes the following members.
Fields
Name | Description
A
 Start of line.
B
 End of line.
Top
See Also
Reference
GH_Line Structure
GH_IO.Types Namespace