Grasshopper API
GH_Plane Fields
The GH_Plane type exposes the following members.
Fields
Name | Description
Origin
 Origin point of plane.
XAxis
 X axis vector of plane.
YAxis
 Y axis vector of plane.
Top
See Also
Reference
GH_Plane Structure
GH_IO.Types Namespace