Grasshopper API
GH_TrackerFrame Fields
The GH_TrackerFrame type exposes the following members.
Fields
Name | Description
Buttons
 The state of the mouse buttons of the frame.
Keys
 The state of the modifier keys (Contro, Shift and Alt) of the frame.
PositionControl
 The position (in control coordinates) of the frame.
PositionScreen
 The position (in screen coordinates) of the frame.
Tag
 Optional Tag object (to be supplied by user).
Time
 The time at which this frame was recorded.
Top
See Also
Reference
GH_TrackerFrame Structure
Grasshopper.GUI Namespace