Grasshopper API
GH_CodeStringSegment Fields
The GH_CodeStringSegment type exposes the following members.
Fields
Name | Description
m_IsCode
m_String
Top
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace