Grasshopper API
GH_DisplayExpiredEventArgs Fields
The GH_DisplayExpiredEventArgs type exposes the following members.
Fields
Name | Description
m_redraw
Top
See Also
Reference
GH_DisplayExpiredEventArgs Class
Grasshopper.Kernel Namespace