Grasshopper API
GH_ArchivedUndoAction Fields
The GH_ArchivedUndoAction type exposes the following members.
Fields
Name | Description
m_data
 Internal data storage for serialized archives.
Top
See Also
Reference
GH_ArchivedUndoAction Class
Grasshopper.Kernel.Undo Namespace