Grasshopper API
GH_FloatingParamAttributes Fields
The GH_FloatingParamAttributes type exposes the following members.
Fields
Name | Description
DefaultWidth
 Defines the default (and minimum) width of a floating parameter.
IconHeight
 Defines the default height of a floating parameter in Icon display mode.
TextHeight
 Defines the default height of a floating parameter in Text display mode.
Top
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace