Grasshopper API
ViewportItem Fields
The Param_ModelSpaceViewport.ViewportItem type exposes the following members.
Fields
Name | Description
ModelSpaceViewport
Name
Page
Top
See Also
Reference
Param_ModelSpaceViewport.ViewportItem Structure
Grasshopper.Rhinoceros.Display.Params Namespace