Grasshopper API
GH_TreeFilter Fields
The GH_TreeFilter type exposes the following members.
Fields
Name | Description
ItemClose
ItemOpen
PathClose
PathOpen
PathSeparator
SegmentSeparator
StringDelimeter
Top
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace