Grasshopper API
GH_Version Fields
The GH_Version type exposes the following members.
Fields
Name | Description
major
 Major component of version structure.
minor
 Minor component of version structure.
revision
 Revision component of version structure.
Top
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace