Grasshopper API
GH_Interval2D Fields
The GH_Interval2D type exposes the following members.
Fields
Name | Description
u
 One dimensional component in U direction.
v
 One dimensional component in V direction.
Top
See Also
Reference
GH_Interval2D Structure
GH_IO.Types Namespace