Grasshopper API
GH_Skin Fields
The GH_Skin type exposes the following members.
Fields
Name | Description
canvas_back
 Specifies canvas background colour.
canvas_edge
 Specifies canvas edge colour.
canvas_grid
 Specifies canvas grid colour.
canvas_grid_col
 Specifies the interval of the canvas grid columns.
canvas_grid_row
 Specifies the interval of the canvas grid rows.
canvas_mono
 Canvas monochromatic flag. If True, the canvas background is a solid colour.
canvas_mono_color
 If canvas_mono is set to true, this colour specified the solid background fill for the canvas.
canvas_shade
 Specifies the colour of the canvas drop shadow.
canvas_shade_size
 Specifies the size of the canvas drop shadow.
group_back
 Specifies the default fill colour for Group objects.
palette_black_selected
Black palette, selected.
palette_black_standard
Black palette, unselected.
palette_blue_selected
Blue palette, selected.
palette_blue_standard
Blue palette, unselected.
palette_brown_selected
Brown palette, selected.
palette_brown_standard
Brown palette, unselected.
palette_error_selected
 Errors, selected palette. Default background for parameters and components that carry errors.
palette_error_standard
 Errors, unselected palette. Default background for parameters and components that carry errors.
palette_grey_selected
Grey palette, selected.
palette_grey_standard
Grey palette, unselected.
palette_hidden_selected
 Hidden, selected palette. Default background for PanelHidden (preview=off) parameters and components.
palette_hidden_standard
 Hidden, unselected palette. Default background for PanelHidden (preview=off) parameters and components.
palette_locked_selected
 Locked, selected palette. Default background for locked parameters and components.
palette_locked_standard
 Locked, unselected palette. Default background for locked parameters and components.
palette_normal_selected
 Normal, selected palette. Default background for parameters and components.
palette_normal_standard
 Normal, unselected palette. Default background for parameters and components.
palette_pink_selected
Pink palette, selected.
palette_pink_standard
Pink palette, unselected.
palette_trans_selected
Transparent palette, selected.
palette_trans_standard
Transparent palette, unselected.
palette_warning_selected
 Warnings, selected palette. Default background for parameters and components that carry warnings.
palette_warning_standard
 Warnings, unselected palette. Default background for parameters and components that carry warnings.
palette_white_selected
White palette, selected.
palette_white_standard
White palette, unselected.
panel_back
 Specifies the default fill colour for Panel objects.
wire_default
 Specifies the default wire colour.
wire_empty
 Specifies the colour for empty (null) wires.
wire_selected_a
 Specifies the colour for wires at the selected end.
wire_selected_b
 Specifies the colour for wires at the unselected end.
zui_edge
 Specifies the default edge colour for ZUI elements.
zui_edge_highlight
 Specifies the default edge colour for highlighted ZUI elements.
zui_fill
 Specifies the default fill colour for ZUI elements.
zui_fill_highlight
 Specifies the default fill colour for highlighted ZUI elements.
Top
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace