Grasshopper API
GH_ComponentAttributes Fields
The GH_ComponentAttributes type exposes the following members.
Fields
Name | Description
m_innerBounds
 Represents the Rectangle that contains the component black box.
Top
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace