Grasshopper API
GH_Interval1D Fields
The GH_Interval1D type exposes the following members.
Fields
Name | Description
a
 Start of interval.
b
 End of interval.
Top
See Also
Reference
GH_Interval1D Structure
GH_IO.Types Namespace