Grasshopper API
ModelFont Fields
The ModelFont type exposes the following members.
Fields
Name | Description
_InstalledFamilies
_InstalledFonts
Top
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace