Grasshopper API
GH_AssemblyFolderInfo Fields
The GH_AssemblyFolderInfo type exposes the following members.
Fields
Name | Description
Folder
 The actual full path to the folder.
Type
 Identifies the type of assembly folder.
Top
See Also
Reference
GH_AssemblyFolderInfo Structure
Grasshopper.Kernel Namespace