Grasshopper API
ModelContentName Fields
The ModelContentName type exposes the following members.
Fields
Name | Description
Comparer
Empty
Top
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace