Grasshopper API
Param_ModelLineWidth Fields
The Param_ModelLineWidth type exposes the following members.
Fields
Name | Description
Values
Top
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace