Grasshopper API
GH_Convert Fields
The GH_Convert type exposes the following members.
Fields
Name | Description
PureDateTicks
 Represents the total number of ticks past midnight that (by Grasshopper convention) identifies a pure date.
PureTimeTicks
 Represents the total number of ticks past a whole second that (by Grasshopper convention) identifies a pure time.
Top
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace