Grasshopper API
GH_Viewport Fields
The GH_Viewport type exposes the following members.
Fields
Name | Description
ZoomDefault
ZoomDefaultLower
ZoomDefaultUpper
ZoomMaximum
ZoomMinimum
Top
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace