Grasshopper API
ModelUserText Fields
The ModelUserText type exposes the following members.
Fields
Name | Description
Empty
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace