Grasshopper API
GH_Chunk.GetDrawingRectangle Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Rectangle GetDrawingRectangle(
	string item_name
)
Public Function GetDrawingRectangle (
	item_name As String
) As Rectangle
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: Rectangle
The inner value of the item.
Implements
GH_IReader.GetDrawingRectangle(String)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_Chunk Class
GetDrawingRectangle Overload
GH_IO.Serialization Namespace