Grasshopper API
GH_IReader.GetPoint3D Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
GH_Point3D GetPoint3D(
	string item_name
)
Function GetPoint3D (
	item_name As String
) As GH_Point3D
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: GH_Point3D
The inner value of the item.
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_IReader Interface
GetPoint3D Overload
GH_IO.Serialization Namespace