Grasshopper API
GH_Chunk.RemoveItem Method (String, Int32)
 Remove an indexed item from this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool RemoveItem(
	string itemName,
	int itemIndex
)
Public Function RemoveItem (
	itemName As String,
	itemIndex As Integer
) As Boolean
Parameters
itemName
Type: System.String
Name of item.
itemIndex
Type: System.Int32
Index of item.
Return Value
Type: Boolean
True on success, false on failure.
Implements
GH_IWriter.RemoveItem(String, Int32)
See Also
Reference
GH_Chunk Class
RemoveItem Overload
GH_IO.Serialization Namespace