Grasshopper API
GH_Chunk.SetInterval1D Method (String, GH_Interval1D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetInterval1D(
	string item_name,
	GH_Interval1D item_value
)
Public Sub SetInterval1D (
	item_name As String,
	item_value As GH_Interval1D
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: GH_IO.Types.GH_Interval1D
Value of item to add.
Implements
GH_IWriter.SetInterval1D(String, GH_Interval1D)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetInterval1D Overload
GH_IO.Serialization Namespace