Grasshopper API
GH_Chunk.SetString Method (String, String)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetString(
	string item_name,
	string item_value
)
Public Sub SetString (
	item_name As String,
	item_value As String
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.String
Value of item to add.
Implements
GH_IWriter.SetString(String, String)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetString Overload
GH_IO.Serialization Namespace