Grasshopper API
GH_Chunk.SetPath Method (String, String, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetPath(
	string item_name,
	string absolutePath,
	string basePath
)
Public Sub SetPath (
	item_name As String,
	absolutePath As String,
	basePath As String
)
Parameters
item_name
Type: System.String
Name of item to add.
absolutePath
Type: System.String
Absolute path to store.
basePath
Type: System.String
Base path. This will be used to also store a relative path.
Implements
GH_IWriter.SetPath(String, String, String)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_Chunk Class
SetPath Overload
GH_IO.Serialization Namespace