Grasshopper API
GH_Chunk.ChunkExists Method (String, Int32)
 Checks whether a chunk with the specified name and index exists in the litter. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool ChunkExists(
	string name,
	int index
)
Public Function ChunkExists (
	name As String,
	index As Integer
) As Boolean
Parameters
name
Type: System.String
Name of chunk to test for.
index
Type: System.Int32
Index of chunk to test for. If less than zero, ChunkExists(string name) is called instead.
Return Value
Type: Boolean
True if a chunk with the specified name and index exists, otherwise false.
Implements
GH_IReader.ChunkExists(String, Int32)
See Also
Reference
GH_Chunk Class
ChunkExists Overload
GH_IO.Serialization Namespace