Grasshopper API
GH_IBinarySupport.Write Method
 Called when an object is required to serialize itself.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void Write(
	BinaryWriter writer
)
Sub Write (
	writer As BinaryWriter
)
Parameters
writer
Type: System.IO.BinaryWriter
Writer object to be used for serialization.
See Also
Reference
GH_IBinarySupport Interface
GH_IO.Serialization Namespace