Grasshopper API
GH_IReader.TryGetDrawingRectangle Method (String, Rectangle)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetDrawingRectangle(
	string item_name,
	ref Rectangle value
)
Function TryGetDrawingRectangle (
	item_name As String,
	ByRef value As Rectangle
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.Rectangle
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetDrawingRectangle Overload
GH_IO.Serialization Namespace