Grasshopper API
GH_Archive.SaveFileDialog Method
 Displays a standard SaveFileDialog with all the fields set to cater for Grasshopper files.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static bool SaveFileDialog(
	string title,
	ref string filePath,
	List<string> additionalFilters
)
Public Shared Function SaveFileDialog (
	title As String,
	ByRef filePath As String,
	additionalFilters As List(Of String)
) As Boolean
Parameters
title
Type: System.String
Title of the dialog. If null, the default title will be used.
filePath
Type: System.String
Path to file picked by user. If file_path represents a valid string, the dialog is set up to match.
additionalFilters
Type: System.Collections.Generic.List<String>
A list of additional file format filters or null. Filter strings must be in typical FileDialog.Filter syntax: "File Name (*.ext)|*.ext"
Return Value
Type: Boolean
True is user picked a new path, False if user cancelled.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace