Grasshopper API
GH_Item.ToString Method
 Converts the struct into a human readable format.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Item Class
GH_IO.Types Namespace