Grasshopper API
GH_Archive.ExtractObject Method
 Extract a target object from the data tree.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool ExtractObject(
	GH_ISerializable target,
	string targetName
)
Public Function ExtractObject (
	target As GH_ISerializable,
	targetName As String
) As Boolean
Parameters
target
Type: GH_IO.GH_ISerializable
Object to extract. Cannot be null.
targetName
Type: System.String
Name of object to extract, name must identify an existing chunk.
Return Value
Type: Boolean
True on succes, false on failure.
Exceptions
Exception | Condition
MemberAccessException | Thrown if the Root node hasn't been instantiated yet.
ArgumentNullException | Thrown if target is a null reference.
ArgumentNullException | Thrown if the target_name is null or empty.
MemberAccessException | Thrown if the target_name cannot be resolved.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace