Grasshopper API
GH_Plane Constructor (Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Plane(
	double Ox,
	double Oy,
	double Oz,
	double Xx,
	double Xy,
	double Xz,
	double Yx,
	double Yy,
	double Yz
)
Public Sub New (
	Ox As Double,
	Oy As Double,
	Oz As Double,
	Xx As Double,
	Xy As Double,
	Xz As Double,
	Yx As Double,
	Yy As Double,
	Yz As Double
)
Parameters
Ox
Type: System.Double
X coordinate of plane origin.
Oy
Type: System.Double
Y coordinate of plane origin.
Oz
Type: System.Double
Z coordinate of plane origin.
Xx
Type: System.Double
X component of plane x axis.
Xy
Type: System.Double
Y component of plane x axis.
Xz
Type: System.Double
Z component of plane x axis.
Yx
Type: System.Double
X component of plane y axis.
Yy
Type: System.Double
Y component of plane y axis.
Yz
Type: System.Double
Z component of plane y axis.
See Also
Reference
GH_Plane Structure
GH_Plane Overload
GH_IO.Types Namespace