Grasshopper API
GH_Archive.MessageCount Method
 Gets the number of messages recorded since the most recent IO operation began.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int MessageCount()
Public Function MessageCount As Integer
Return Value
Type: Int32
The number of recorded messages.
See Also
Reference
GH_Archive Class
MessageCount Overload
GH_IO.Serialization Namespace