Grasshopper API
GH_Compression.Compress Method
 Compress an array of bytes using the Deflate algorithm.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static byte[] Compress(
	byte[] data
)
Public Shared Function Compress (
	data As Byte()
) As Byte()
Parameters
data
Type: System.Byte[]
Byte array to compress.
Return Value
Type: Byte[]
An array of compressed bytes.
See Also
Reference
GH_Compression Class
GH_IO.Serialization Namespace