Grasshopper API
GH_IWriter.SetSingle Method (String, Single)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetSingle(
	string item_name,
	float item_value
)
Sub SetSingle (
	item_name As String,
	item_value As Single
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Single
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetSingle Overload
GH_IO.Serialization Namespace