Grasshopper API
GH_Archive.MessageCount Method (Boolean, Boolean, Boolean)
 Gets the number of messages recorded since the most recent IO operation began. Message count can be filtered by message type.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int MessageCount(
	bool includeInfo,
	bool includeWarnings,
	bool includeErrors
)
Public Function MessageCount (
	includeInfo As Boolean,
	includeWarnings As Boolean,
	includeErrors As Boolean
) As Integer
Parameters
includeInfo
Type: System.Boolean
If true, info messages will be included in the count.
includeWarnings
Type: System.Boolean
If true, warnings will be included in the count.
includeErrors
Type: System.Boolean
If true, errors will be included in the count.
Return Value
Type: Int32
The number of recoded messages that pass the type filters.
See Also
Reference
GH_Archive Class
MessageCount Overload
GH_IO.Serialization Namespace