Grasshopper API
GH_IReader.TryGetVersion Method (String, GH_Version)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetVersion(
	string item_name,
	ref GH_Version value
)
Function TryGetVersion (
	item_name As String,
	ByRef value As GH_Version
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Version
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetVersion Overload
GH_IO.Serialization Namespace