Grasshopper API
GH_IWriter.RemoveItem Method (String)
 Remove an unindexed item from this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool RemoveItem(
	string itemName
)
Function RemoveItem (
	itemName As String
) As Boolean
Parameters
itemName
Type: System.String
Name of item.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_IWriter Interface
RemoveItem Overload
GH_IO.Serialization Namespace