Grasshopper API
GH_IWriter.CreateChunk Method (String)
 Create a new child chunk with the specified name but without an index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
GH_IWriter CreateChunk(
	string chunk_name
)
Function CreateChunk (
	chunk_name As String
) As GH_IWriter
Parameters
chunk_name
Type: System.String
Name of new child chunk.
Return Value
Type: GH_IWriter
Exceptions
Exception | Condition
ArgumentException |  Thrown if the name coordinte is already occupied by another chunk.
See Also
Reference
GH_IWriter Interface
CreateChunk Overload
GH_IO.Serialization Namespace