Grasshopper API
GH_Interval2D Constructor (Double, Double, Double, Double)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval2D(
	double nu0,
	double nu1,
	double nv0,
	double nv1
)
Public Sub New (
	nu0 As Double,
	nu1 As Double,
	nv0 As Double,
	nv1 As Double
)
Parameters
nu0
Type: System.Double
Start of interval component in U direction.
nu1
Type: System.Double
End of interval component in U direction.
nv0
Type: System.Double
Start of interval component in V direction.
nv1
Type: System.Double
End of interval component in V direction.
See Also
Reference
GH_Interval2D Structure
GH_Interval2D Overload
GH_IO.Types Namespace