Grasshopper API
GH_Chunk.SetBoolean Method (String, Boolean)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetBoolean(
	string item_name,
	bool item_value
)
Public Sub SetBoolean (
	item_name As String,
	item_value As Boolean
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Boolean
Value of item to add.
Implements
GH_IWriter.SetBoolean(String, Boolean)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetBoolean Overload
GH_IO.Serialization Namespace