Grasshopper API
VersionNumber.CompareTo Method (Object)
 Compares the value of this instance to a specified VersionNumber value and returns an integer that indicates whether this instance is earlier than, the same as, or later than the specified VersionNumber value.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int CompareTo(
	Object value
)
Public Function CompareTo (
	value As Object
) As Integer
Parameters
value
Type: System.Object
 The object to compare to the current instance.
Return Value
Type: Int32
 A signed number indicating the relative values of this instance and the value parameter. Less than zero indicates this instance is earier than value. Zero indicates this instance is the same as value. Greater than zero indicates this instance is later than value.
Implements
IComparable.CompareTo(Object)
See Also
Reference
VersionNumber Structure
CompareTo Overload
GH_IO Namespace