Grasshopper API
GH_Chunk.SetPoint4D Method (String, GH_Point4D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetPoint4D(
	string item_name,
	GH_Point4D item_value
)
Public Sub SetPoint4D (
	item_name As String,
	item_value As GH_Point4D
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: GH_IO.Types.GH_Point4D
Value of item to add.
Implements
GH_IWriter.SetPoint4D(String, GH_Point4D)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetPoint4D Overload
GH_IO.Serialization Namespace