Grasshopper API
GH_Chunk.ChunkExists Method (String)
 Checks whether a chunk with the specified name exists in the litter. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool ChunkExists(
	string name
)
Public Function ChunkExists (
	name As String
) As Boolean
Parameters
name
Type: System.String
Name of chunk to test for.
Return Value
Type: Boolean
True if a chunk with the specified name exists, otherwise false.
Implements
GH_IReader.ChunkExists(String)
See Also
Reference
GH_Chunk Class
ChunkExists Overload
GH_IO.Serialization Namespace