Grasshopper API
GH_Chunk.SetDrawingPointF Method (String, PointF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetDrawingPointF(
	string item_name,
	PointF item_value
)
Public Sub SetDrawingPointF (
	item_name As String,
	item_value As PointF
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Drawing.PointF
Value of item to add.
Implements
GH_IWriter.SetDrawingPointF(String, PointF)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetDrawingPointF Overload
GH_IO.Serialization Namespace