Grasshopper API
GH_Archive.Deserialize_Xml Method
 Deserializes an Xml string.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool Deserialize_Xml(
	string xmlContent
)
Public Function Deserialize_Xml (
	xmlContent As String
) As Boolean
Parameters
xmlContent
Type: System.String
Xml to deserialize.
Return Value
Type: Boolean
True on success, false on failure.
Exceptions
Exception | Condition
XmlException | Thrown if xml_content is not a valid Grasshopper Xml stream.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace