Grasshopper API
GH_IWriter.SetInterval2D Method (String, GH_Interval2D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetInterval2D(
	string item_name,
	GH_Interval2D item_value
)
Sub SetInterval2D (
	item_name As String,
	item_value As GH_Interval2D
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: GH_IO.Types.GH_Interval2D
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetInterval2D Overload
GH_IO.Serialization Namespace