Grasshopper API
GH_IReader.TryGetPoint4D Method (String, GH_Point4D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetPoint4D(
	string item_name,
	ref GH_Point4D value
)
Function TryGetPoint4D (
	item_name As String,
	ByRef value As GH_Point4D
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Point4D
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetPoint4D Overload
GH_IO.Serialization Namespace