Grasshopper API
GH_Chunk.AddMessage Method
 Log a new message with the top-level archive. Messages are collected during read/write operations, and can be displayed to the user upon completion using GH_Archive.ShowMessageLog().
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void AddMessage(
	string m,
	GH_Message_Type t
)
Public Sub AddMessage (
	m As String,
	t As GH_Message_Type
)
Parameters
m
Type: System.String
Message text.
t
Type: GH_IO.Serialization.GH_Message_Type
Message type.
Implements
GH_IChunk.AddMessage(String, GH_Message_Type)
Exceptions
Exception | Condition
ArgumentNullException | Thrown if message text is null or empty.
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace