Grasshopper API
GH_Chunk.SetPoint2D Method (String, Int32, GH_Point2D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetPoint2D(
	string item_name,
	int item_index,
	GH_Point2D item_value
)
Public Sub SetPoint2D (
	item_name As String,
	item_index As Integer,
	item_value As GH_Point2D
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: GH_IO.Types.GH_Point2D
Value of item to add.
Implements
GH_IWriter.SetPoint2D(String, Int32, GH_Point2D)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_Chunk Class
SetPoint2D Overload
GH_IO.Serialization Namespace