Grasshopper API
GH_Item.Write Method (XmlWriter)
 Serialize this item into an Xml stream.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Write(
	XmlWriter writer
)
Public Sub Write (
	writer As XmlWriter
)
Parameters
writer
Type: System.Xml.XmlWriter
Writer to serialize with.
Implements
GH_IXmlSupport.Write(XmlWriter)
Exceptions
Exception | Condition
MemberAccessException | Thrown if !HasName.
MemberAccessException | Thrown if !HasType.
IOException | Thrown if the internal data could not be serialized.
See Also
Reference
GH_Item Class
Write Overload
GH_IO.Types Namespace