Grasshopper API
GH_Chunk.Write Method (XmlWriter)
 Serialize this chunk into an Xml stream.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Write(
	XmlWriter writer
)
Public Sub Write (
	writer As XmlWriter
)
Parameters
writer
Type: System.Xml.XmlWriter
Xml writer used for serialization.
Implements
GH_IXmlSupport.Write(XmlWriter)
Exceptions
Exception | Condition
MemberAccessException | Thrown if
See Also
Reference
GH_Chunk Class
Write Overload
GH_IO.Serialization Namespace