Grasshopper API
GH_ISerializable.Read Method
 This method is called whenever the instance is required to deserialize itself.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool Read(
	GH_IReader reader
)
Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Reader object to deserialize from.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_ISerializable Interface
GH_IO Namespace