Grasshopper API
GH_IWriter.RemoveChunk Method (String, Int32)
 Remove the first chunk with a matching name and index. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool RemoveChunk(
	string chunk_name,
	int chunk_index
)
Function RemoveChunk (
	chunk_name As String,
	chunk_index As Integer
) As Boolean
Parameters
chunk_name
Type: System.String
Name of chunk to remove.
chunk_index
Type: System.Int32
Index of chunk to remove.
Return Value
Type: Boolean
True is chunk was removed, false if no matching chunk could be found.
See Also
Reference
GH_IWriter Interface
RemoveChunk Overload
GH_IO.Serialization Namespace