Grasshopper API
GH_Version Constructor (GH_Version)
 Copy constructor. Duplicate an existing version structure.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Version(
	GH_Version other
)
Public Sub New (
	other As GH_Version
)
Parameters
other
Type: GH_IO.Types.GH_Version
Version to duplicate.
See Also
Reference
GH_Version Structure
GH_Version Overload
GH_IO.Types Namespace