Grasshopper API
GH_Chunk.GetPath Method (String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string[] GetPath(
	string item_name,
	int item_index,
	string basePath
)
Public Function GetPath (
	item_name As String,
	item_index As Integer,
	basePath As String
) As String()
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
basePath
Type: System.String
Base path for relative path resolution.
Return Value
Type: String[]
An array of path strings. If the resolved relative path is different from the stored absolute path, an array of two strings will be returned [absolute, relative].
Implements
GH_IReader.GetPath(String, Int32, String)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name and index does not exist.
See Also
Reference
GH_Chunk Class
GetPath Overload
GH_IO.Serialization Namespace