Grasshopper API
GH_Message Constructor (String)
 Create a new message of type GH_Message_Type.info
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Message(
	string message_content
)
Public Sub New (
	message_content As String
)
Parameters
message_content
Type: System.String
Text content of message.
See Also
Reference
GH_Message Class
GH_Message Overload
GH_IO.Serialization Namespace