Grasshopper API
GH_Plane Constructor (GH_Point3D, GH_Point3D, GH_Point3D)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Plane(
	GH_Point3D nOrigin,
	GH_Point3D nXAxis,
	GH_Point3D nYAxis
)
Public Sub New (
	nOrigin As GH_Point3D,
	nXAxis As GH_Point3D,
	nYAxis As GH_Point3D
)
Parameters
nOrigin
Type: GH_IO.Types.GH_Point3D
Origin of plane.
nXAxis
Type: GH_IO.Types.GH_Point3D
X axis of plane.
nYAxis
Type: GH_IO.Types.GH_Point3D
Y axis of plane.
See Also
Reference
GH_Plane Structure
GH_Plane Overload
GH_IO.Types Namespace