Grasshopper API
GH_Chunk.TryGetPlane Method (String, GH_Plane)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetPlane(
	string item_name,
	ref GH_Plane value
)
Public Function TryGetPlane (
	item_name As String,
	ByRef value As GH_Plane
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Plane
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetPlane(String, GH_Plane)
See Also
Reference
GH_Chunk Class
TryGetPlane Overload
GH_IO.Serialization Namespace