Grasshopper API
VersionNumber.ToVersion Method
 Convert this VersionNumber class to System.Version()
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Version ToVersion()
Public Function ToVersion As Version
Return Value
Type: Version
See Also
Reference
VersionNumber Structure
GH_IO Namespace