Grasshopper API
GH_Chunk.SetBoundingBox Method (String, GH_BoundingBox)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetBoundingBox(
	string item_name,
	GH_BoundingBox item_value
)
Public Sub SetBoundingBox (
	item_name As String,
	item_value As GH_BoundingBox
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: GH_IO.Types.GH_BoundingBox
Value of item to add.
Implements
GH_IWriter.SetBoundingBox(String, GH_BoundingBox)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetBoundingBox Overload
GH_IO.Serialization Namespace