Grasshopper API
GH_BoundingBox Constructor (GH_Point3D, GH_Point3D)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_BoundingBox(
	GH_Point3D nMin,
	GH_Point3D nMax
)
Public Sub New (
	nMin As GH_Point3D,
	nMax As GH_Point3D
)
Parameters
nMin
Type: GH_IO.Types.GH_Point3D
Minimum corner of box.
nMax
Type: GH_IO.Types.GH_Point3D
Maximum corner of box.
See Also
Reference
GH_BoundingBox Structure
GH_BoundingBox Overload
GH_IO.Types Namespace