Grasshopper API
ID.GetHashCode Method
 Gets the hash code.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A number representing the hash code.
See Also
Reference
ID Structure
GH_IO.Serialization Namespace