Grasshopper API
GH_Chunk.SetInt64 Method (String, Int32, Int64)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetInt64(
	string item_name,
	int item_index,
	long item_value
)
Public Sub SetInt64 (
	item_name As String,
	item_index As Integer,
	item_value As Long
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: System.Int64
Value of item to add.
Implements
GH_IWriter.SetInt64(String, Int32, Int64)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_Chunk Class
SetInt64 Overload
GH_IO.Serialization Namespace