Grasshopper API
GH_Chunk.FindChunk Method (String, Int32)
 Finds the first chunk in the list that matches the given name and index. Only chunks with index qualifiers are considered.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_IReader FindChunk(
	string name,
	int index
)
Public Function FindChunk (
	name As String,
	index As Integer
) As GH_IReader
Parameters
name
Type: System.String
Name of chunk to search for.
index
Type: System.Int32
Index of chunk to search for. If less than zero, FindChunk(string chunk_name) is called instead.
Return Value
Type: GH_IReader
The child chunk that matches the given name and index, or null of no matching chunk could be found.
Implements
GH_IReader.FindChunk(String, Int32)
See Also
Reference
GH_Chunk Class
FindChunk Overload
GH_IO.Serialization Namespace