Grasshopper API
GH_IWriter.SetByte Method (String, Byte)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetByte(
	string item_name,
	byte item_value
)
Sub SetByte (
	item_name As String,
	item_value As Byte
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Byte
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetByte Overload
GH_IO.Serialization Namespace