Grasshopper API
GH_Archive.AddMessage Method (String, GH_Message_Type)
 Add a new message to the record.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void AddMessage(
	string messageText,
	GH_Message_Type messageType
)
Public Sub AddMessage (
	messageText As String,
	messageType As GH_Message_Type
)
Parameters
messageText
Type: System.String
Message text.
messageType
Type: GH_IO.Serialization.GH_Message_Type
Message type.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if message text is null or empty.
See Also
Reference
GH_Archive Class
AddMessage Overload
GH_IO.Serialization Namespace