Grasshopper API
GH_Chunk.FindItem Method (String)
 Finds the first item that matches the given name. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Item FindItem(
	string name
)
Public Function FindItem (
	name As String
) As GH_Item
Parameters
name
Type: System.String
Name of item to search for.
Return Value
Type: GH_Item
The item that matches the given name, or null of no matching item could be found.
Implements
GH_IReader.FindItem(String)
See Also
Reference
GH_Chunk Class
FindItem Overload
GH_IO.Serialization Namespace