Grasshopper API
GH_IWriter.SetDrawingSize Method (String, Size)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetDrawingSize(
	string item_name,
	Size item_value
)
Sub SetDrawingSize (
	item_name As String,
	item_value As Size
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Drawing.Size
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetDrawingSize Overload
GH_IO.Serialization Namespace