Grasshopper API
GH_Version.ToString Method
 Default formatter for Version data: M.m.RRRR Revision section is padded with zeroes until it is at least 4 digits long.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string represtation of the Version structure.
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace