Grasshopper API
GH_IReader.ChunkExists Method (String, Int32)
 Checks whether a chunk with the specified name and index exists in the litter. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool ChunkExists(
	string name,
	int index
)
Function ChunkExists (
	name As String,
	index As Integer
) As Boolean
Parameters
name
Type: System.String
Name of chunk to test for.
index
Type: System.Int32
Index of chunk to test for. If less than zero, ChunkExists(string chunk_name) is called instead.
Return Value
Type: Boolean
True if a chunk with the specified name and index exists, otherwise false.
See Also
Reference
GH_IReader Interface
ChunkExists Overload
GH_IO.Serialization Namespace