Grasshopper API
GH_Message Constructor (String, GH_Message_Type)
 Create a new message.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Message(
	string message_content,
	GH_Message_Type message_type
)
Public Sub New (
	message_content As String,
	message_type As GH_Message_Type
)
Parameters
message_content
Type: System.String
Text content of message.
message_type
Type: GH_IO.Serialization.GH_Message_Type
Type of message, GH_Message_Type.unset is not a valid type.
See Also
Reference
GH_Message Class
GH_Message Overload
GH_IO.Serialization Namespace