Grasshopper API
GH_Version.Equals Method
 Performs value equality comparison.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Object to compare with. If obj is a null reference or not a GH_Version instance, false is returned.
Return Value
Type: Boolean
True if obj is a GH_Version instance which is equal to this one.
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace