Grasshopper API
ID Constructor (String, Int32)
 Constructor for IDs.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public ID(
	string name,
	int index
)
Public Sub New (
	name As String,
	index As Integer
)
Parameters
name
Type: System.String
Name of id.
index
Type: System.Int32
Index of id. Valid values are:
-1 = no index
0 to int.MaxValue = valid index
See Also
Reference
ID Structure
ID Overload
GH_IO.Serialization Namespace