Grasshopper API
GH_Chunk.TryGetPoint3D Method (String, Int32, GH_Point3D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetPoint3D(
	string item_name,
	int item_index,
	ref GH_Point3D value
)
Public Function TryGetPoint3D (
	item_name As String,
	item_index As Integer,
	ByRef value As GH_Point3D
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: GH_IO.Types.GH_Point3D
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetPoint3D(String, Int32, GH_Point3D)
See Also
Reference
GH_Chunk Class
TryGetPoint3D Overload
GH_IO.Serialization Namespace