Grasshopper API
VersionNumber.TryParse Method (String, VersionNumber)
 Converts the specified string representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static bool TryParse(
	string s,
	out VersionNumber result
)
Public Shared Function TryParse (
	s As String,
	<OutAttribute> ByRef result As VersionNumber
) As Boolean
Parameters
s
Type: System.String
 A string containing four integers separated by full stops in the format major.minor.yyddd.hhmmb, where yy is year-2000, ddd is the day of the year, hh is the hour, mm is the minute and b identifies the build branch.
result
Type: GH_IO.VersionNumber
 When this method returns, result contains the VersionNumber value equivalent to the version number contained in s, if the conversion succeeded, or VersionNumber.Unset if the conversion failed. The conversion fails if the s parameter is null, is an empty string (""), or does not contain a valid string representation of version number. This parameter is passed uninitialized.
Return Value
Type: Boolean
See Also
Reference
VersionNumber Structure
TryParse Overload
GH_IO Namespace