Grasshopper API
GH_Chunk.TryGetDecimal Method (String, Decimal)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetDecimal(
	string item_name,
	ref decimal value
)
Public Function TryGetDecimal (
	item_name As String,
	ByRef value As Decimal
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Decimal
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetDecimal(String, Decimal)
See Also
Reference
GH_Chunk Class
TryGetDecimal Overload
GH_IO.Serialization Namespace