Grasshopper API
GH_Archive.ReadFromFile Method
 Reads a new archive tree from a file.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool ReadFromFile(
	string fileName
)
Public Function ReadFromFile (
	fileName As String
) As Boolean
Parameters
fileName
Type: System.String
Path of file to parse.
Return Value
Type: Boolean
True on success, false on failure. If the read operation fails, all the member fields of this archive ought to be treated as invalid.
Exceptions
Exception | Condition
FileNotFoundException | Thrown if the file doesn't exist.
IOException | Thrown if the file_name doesn't represent a known file extension.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace