Grasshopper API
GH_Chunk.TryGetVersion Method (String, GH_Version)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetVersion(
	string item_name,
	ref GH_Version value
)
Public Function TryGetVersion (
	item_name As String,
	ByRef value As GH_Version
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Version
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetVersion(String, GH_Version)
See Also
Reference
GH_Chunk Class
TryGetVersion Overload
GH_IO.Serialization Namespace