Grasshopper API
GH_Chunk.TryGetString Method (String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetString(
	string item_name,
	int item_index,
	ref string value
)
Public Function TryGetString (
	item_name As String,
	item_index As Integer,
	ByRef value As String
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: System.String
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetString(String, Int32, String)
See Also
Reference
GH_Chunk Class
TryGetString Overload
GH_IO.Serialization Namespace