Grasshopper API
GH_IReader.TryGetInt32 Method (String, Int32)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetInt32(
	string item_name,
	ref int value
)
Function TryGetInt32 (
	item_name As String,
	ByRef value As Integer
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Int32
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetInt32 Overload
GH_IO.Serialization Namespace