Grasshopper API
GH_Archive.AddMessage Method (GH_Message)
 Add a new message to the record.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void AddMessage(
	GH_Message message
)
Public Sub AddMessage (
	message As GH_Message
)
Parameters
message
Type: GH_IO.Serialization.GH_Message
Message to add
Exceptions
Exception | Condition
ArgumentNullException | Thrown if the message is a null reference.
See Also
Reference
GH_Archive Class
AddMessage Overload
GH_IO.Serialization Namespace