Grasshopper API
GH_ISerializable.Write Method
 This method is called whenever the instance is required to serialize itself.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool Write(
	GH_IWriter writer
)
Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Writer object to serialize with.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_ISerializable Interface
GH_IO Namespace