Grasshopper API
GH_Chunk.SetVersion Method (String, Int32, Int32, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetVersion(
	string item_name,
	int major,
	int minor,
	int revision
)
Public Sub SetVersion (
	item_name As String,
	major As Integer,
	minor As Integer,
	revision As Integer
)
Parameters
item_name
Type: System.String
Name of item to add.
major
Type: System.Int32
Major component of Version structure.
minor
Type: System.Int32
Minor component of Version structure.
revision
Type: System.Int32
Revision component of Version structure.
Implements
GH_IWriter.SetVersion(String, Int32, Int32, Int32)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetVersion Overload
GH_IO.Serialization Namespace