Grasshopper API
GH_Chunk.SetDrawingRectangle Method (String, Rectangle)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetDrawingRectangle(
	string item_name,
	Rectangle item_value
)
Public Sub SetDrawingRectangle (
	item_name As String,
	item_value As Rectangle
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Drawing.Rectangle
Value of item to add.
Implements
GH_IWriter.SetDrawingRectangle(String, Rectangle)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetDrawingRectangle Overload
GH_IO.Serialization Namespace