Grasshopper API
GH_Chunk.CreateChunk Method (String)
 Create a new child chunk with the specified name and without an index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_IWriter CreateChunk(
	string chunk_name
)
Public Function CreateChunk (
	chunk_name As String
) As GH_IWriter
Parameters
chunk_name
Type: System.String
Name of new child.
Return Value
Type: GH_IWriter
The newly created child chunk.
Implements
GH_IWriter.CreateChunk(String)
Exceptions
Exception | Condition
ArgumentException |  Thrown if the name+index coordinte is already occupied by another chunk.
See Also
Reference
GH_Chunk Class
CreateChunk Overload
GH_IO.Serialization Namespace