Grasshopper API
GH_Point3D Constructor
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point3D(
	double nx,
	double ny,
	double nz
)
Public Sub New (
	nx As Double,
	ny As Double,
	nz As Double
)
Parameters
nx
Type: System.Double
X coordinate of point.
ny
Type: System.Double
Y coordinate of point.
nz
Type: System.Double
Z coordinate of point.
See Also
Reference
GH_Point3D Structure
GH_IO.Types Namespace