Grasshopper API
GH_Item Constructor (String, Int32, Int32)
 Construct a new instance of GH_Item with the specified name, index and value.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Item(
	string item_name,
	int item_index,
	int item_data
)
Public Sub New (
	item_name As String,
	item_index As Integer,
	item_data As Integer
)
Parameters
item_name
Type: System.String
Name of new item.
item_index
Type: System.Int32
Index of new item. Any index less than zero will be clamped to -1.
item_data
Type: System.Int32
Value of new item.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if the specified name string is null or empty.
See Also
Reference
GH_Item Class
GH_Item Overload
GH_IO.Types Namespace