Grasshopper API
GH_Item.CreateFrom Method (XmlNode)
 Creates a new instance of GH_Item and sets the fields from an Xml node object.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static GH_Item CreateFrom(
	XmlNode node
)
Public Shared Function CreateFrom (
	node As XmlNode
) As GH_Item
Parameters
node
Type: System.Xml.XmlNode
Xml node object that defines the field data.
Return Value
Type: GH_Item
The constructed and read item.
See Also
Reference
GH_Item Class
CreateFrom Overload
GH_IO.Types Namespace