Grasshopper API
GH_Line Constructor (GH_Point3D, GH_Point3D)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Line(
	GH_Point3D nA,
	GH_Point3D nB
)
Public Sub New (
	nA As GH_Point3D,
	nB As GH_Point3D
)
Parameters
nA
Type: GH_IO.Types.GH_Point3D
Start of line.
nB
Type: GH_IO.Types.GH_Point3D
End of line.
See Also
Reference
GH_Line Structure
GH_Line Overload
GH_IO.Types Namespace