Grasshopper API
VersionNumber Constructor (Int32, Int32, Int32, Int32)
 Initializes a new instance of the VersionNumber structure to the version specified by the version quartet values.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public VersionNumber(
	int majorVersionNumber,
	int minorVersionNumber,
	int versionQuartetYyddd,
	int versionQuartetHhmmb
)
Public Sub New (
	majorVersionNumber As Integer,
	minorVersionNumber As Integer,
	versionQuartetYyddd As Integer,
	versionQuartetHhmmb As Integer
)
Parameters
majorVersionNumber
Type: System.Int32
 The major version number (0 through 63).
minorVersionNumber
Type: System.Int32
 The minor version number (0 through 127)
versionQuartetYyddd
Type: System.Int32
 The third version quartet value is (year - 2000)*1000 + yday, where year is 2000 to 2099 and yday is 1 to the number of days in the specified year.
versionQuartetHhmmb
Type: System.Int32
 The forth version quartet value is (hour*1000 + minute*10 + branch) where hour is 0 to 23, minute is 0 to 59, and branch is 0 to 3.
See Also
Reference
VersionNumber Structure
VersionNumber Overload
GH_IO Namespace