Grasshopper API
GH_Archive.Serialize_Xml Method
 Serializes the data tree into an Xml string.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string Serialize_Xml()
Public Function Serialize_Xml As String
Return Value
Type: String
A string containing the Xml content.
Exceptions
Exception | Condition
MemberAccessException | Thrown if the root of the current archive hasn't been instantiated yet.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace