Grasshopper API
ID.ToString Method
 Gets a string representation for this ID.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ID Structure
GH_IO.Serialization Namespace