Grasshopper API
GH_Chunk.GetDate Method (String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public DateTime GetDate(
	string item_name,
	int item_index
)
Public Function GetDate (
	item_name As String,
	item_index As Integer
) As DateTime
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
Return Value
Type: DateTime
The inner value of the item.
Implements
GH_IReader.GetDate(String, Int32)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name and index does not exist.
See Also
Reference
GH_Chunk Class
GetDate Overload
GH_IO.Serialization Namespace