Grasshopper API
GH_Chunk.GetInterval2D Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval2D GetInterval2D(
	string item_name
)
Public Function GetInterval2D (
	item_name As String
) As GH_Interval2D
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: GH_Interval2D
The inner value of the item.
Implements
GH_IReader.GetInterval2D(String)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_Chunk Class
GetInterval2D Overload
GH_IO.Serialization Namespace