Grasshopper API
GH_IReader.TryGetInterval2D Method (String, GH_Interval2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetInterval2D(
	string item_name,
	ref GH_Interval2D value
)
Function TryGetInterval2D (
	item_name As String,
	ByRef value As GH_Interval2D
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Interval2D
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetInterval2D Overload
GH_IO.Serialization Namespace