Grasshopper API
GH_Chunk.AddComment Method
 Adds a text comment to this chunk. Comments are serialized only if the output flavour is a human readable format. Comments are never deserialized, they are purely for the benefit of the humans reading the file data.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void AddComment(
	string comment_text
)
Public Sub AddComment (
	comment_text As String
)
Parameters
comment_text
Type: System.String
The content of the comment, text might be altered if it contains invalid characters for a chosen format flavour.
Implements
GH_IWriter.AddComment(String)
Exceptions
Exception | Condition
ArgumentNullException | Thrown if the content text is either null or empty.
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace