Grasshopper API
GH_Archive.ClearMessages Method
 Remove all messages from the log.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void ClearMessages()
Public Sub ClearMessages
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace