Grasshopper API
GH_Chunk.Read Method (BinaryReader)
 Read this chunk and all child chunks from a binary stream.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Read(
	BinaryReader reader
)
Public Sub Read (
	reader As BinaryReader
)
Parameters
reader
Type: System.IO.BinaryReader
The Binary reader to use, cannot be null.
Implements
GH_IBinarySupport.Read(BinaryReader)
See Also
Reference
GH_Chunk Class
Read Overload
GH_IO.Serialization Namespace