Grasshopper API
GH_Chunk.Read Method (XmlNode)
 Read this chunk and all child chunks from an Xml node.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Read(
	XmlNode node
)
Public Sub Read (
	node As XmlNode
)
Parameters
node
Type: System.Xml.XmlNode
The Xml node to deserialize from, cannot be null.
Implements
GH_IXmlSupport.Read(XmlNode)
See Also
Reference
GH_Chunk Class
Read Overload
GH_IO.Serialization Namespace