Grasshopper API
GH_IReader.TryGetLine Method (String, GH_Line)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetLine(
	string item_name,
	ref GH_Line value
)
Function TryGetLine (
	item_name As String,
	ByRef value As GH_Line
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Line
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetLine Overload
GH_IO.Serialization Namespace