Grasshopper API
GH_Chunk.SetGuid Method (String, Guid)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetGuid(
	string item_name,
	Guid item_value
)
Public Sub SetGuid (
	item_name As String,
	item_value As Guid
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Guid
Value of item to add.
Implements
GH_IWriter.SetGuid(String, Guid)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetGuid Overload
GH_IO.Serialization Namespace