Grasshopper API
GH_IWriter.SetDrawingPointF Method (String, Int32, PointF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetDrawingPointF(
	string item_name,
	int item_index,
	PointF item_value
)
Sub SetDrawingPointF (
	item_name As String,
	item_index As Integer,
	item_value As PointF
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: System.Drawing.PointF
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_IWriter Interface
SetDrawingPointF Overload
GH_IO.Serialization Namespace