Grasshopper API
GH_IReader.TryGetSingle Method (String, Single)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetSingle(
	string item_name,
	ref float value
)
Function TryGetSingle (
	item_name As String,
	ByRef value As Single
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Single
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetSingle Overload
GH_IO.Serialization Namespace