Grasshopper API
GH_Chunk.TryGetBoolean Method (String, Boolean)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetBoolean(
	string item_name,
	ref bool value
)
Public Function TryGetBoolean (
	item_name As String,
	ByRef value As Boolean
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Boolean
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetBoolean(String, Boolean)
See Also
Reference
GH_Chunk Class
TryGetBoolean Overload
GH_IO.Serialization Namespace