Grasshopper API
GH_Archive.CreateTopLevelNode Method
 Creates and returns a new root node for this archive in the form of a GH_IWriter instance. Typically you do not call this method. If you want to add an object to the archive, use AppendObject() instead.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_IWriter CreateTopLevelNode(
	string rootName
)
Public Function CreateTopLevelNode (
	rootName As String
) As GH_IWriter
Parameters
rootName
Type: System.String
Name of root object.
Return Value
Type: GH_IWriter
The GH_IWriter incarnation of the GH_Chunk that represents the new Node.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace