Grasshopper API
GH_Chunk.SetPlane Method (String, GH_Plane)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetPlane(
	string item_name,
	GH_Plane item_value
)
Public Sub SetPlane (
	item_name As String,
	item_value As GH_Plane
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: GH_IO.Types.GH_Plane
Value of item to add.
Implements
GH_IWriter.SetPlane(String, GH_Plane)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetPlane Overload
GH_IO.Serialization Namespace