Grasshopper API
GH_IWriter.SetDrawingBitmap Method (String, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetDrawingBitmap(
	string item_name,
	Bitmap item_value
)
Sub SetDrawingBitmap (
	item_name As String,
	item_value As Bitmap
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Drawing.Bitmap
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetDrawingBitmap Overload
GH_IO.Serialization Namespace