Grasshopper API
GH_LooseChunk.Serialize_Binary Method
 Serializes the data tree into a byte array.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public byte[] Serialize_Binary()
Public Function Serialize_Binary As Byte()
Return Value
Type: Byte[]
An array of bytes representing the Loose chunk.
Examples
 This sample shows how to create a new loose chunk and serialize some values.
public byte[] CreateBinary(string archive_name, string[] item_names, int[] item_values)
{
  GH_LooseChunk chunk = new GH_LooseChunk(archive_name);
  for (int i = 0; i < item_names.Length; i++)
  {
    chunk.SetInt32(item_names[i], i, item_values[i]);
  }
  return chunk.Serialize_Binary();
}
See Also
Reference
GH_LooseChunk Class
GH_IO.Serialization Namespace