Grasshopper API
GH_Line Constructor (Double, Double, Double, Double, Double, Double)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Line(
	double Ax,
	double Ay,
	double Az,
	double Bx,
	double By,
	double Bz
)
Public Sub New (
	Ax As Double,
	Ay As Double,
	Az As Double,
	Bx As Double,
	By As Double,
	Bz As Double
)
Parameters
Ax
Type: System.Double
X coordinate of start point.
Ay
Type: System.Double
Y coordinate of start point.
Az
Type: System.Double
Z coordinate of start point.
Bx
Type: System.Double
X coordinate of end point.
By
Type: System.Double
Y coordinate of end point.
Bz
Type: System.Double
Z coordinate of end point.
See Also
Reference
GH_Line Structure
GH_Line Overload
GH_IO.Types Namespace