Grasshopper API
GH_Chunk.TryGetDrawingRectangleF Method (String, Int32, RectangleF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetDrawingRectangleF(
	string item_name,
	int item_index,
	ref RectangleF value
)
Public Function TryGetDrawingRectangleF (
	item_name As String,
	item_index As Integer,
	ByRef value As RectangleF
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: System.Drawing.RectangleF
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetDrawingRectangleF(String, Int32, RectangleF)
See Also
Reference
GH_Chunk Class
TryGetDrawingRectangleF Overload
GH_IO.Serialization Namespace