Grasshopper API
GH_Chunk.GetGuid Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Guid GetGuid(
	string item_name
)
Public Function GetGuid (
	item_name As String
) As Guid
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: Guid
The inner value of the item.
Implements
GH_IReader.GetGuid(String)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_Chunk Class
GetGuid Overload
GH_IO.Serialization Namespace