Grasshopper API
GH_IReader.TryGetString Method (String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetString(
	string item_name,
	ref string value
)
Function TryGetString (
	item_name As String,
	ByRef value As String
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.String
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetString Overload
GH_IO.Serialization Namespace