Grasshopper API
GH_Compression.Decompress Method
 Decompress an array of bytes using the Deflate algorithm.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static byte[] Decompress(
	byte[] compressedData
)
Public Shared Function Decompress (
	compressedData As Byte()
) As Byte()
Parameters
compressedData
Type: System.Byte[]
Byte array to decompress.
Return Value
Type: Byte[]
An array of decompressed bytes.
See Also
Reference
GH_Compression Class
GH_IO.Serialization Namespace