Grasshopper API
GH_LooseChunk.Serialize_Xml Method
 Serializes the data tree into an Xml string.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string Serialize_Xml()
Public Function Serialize_Xml As String
Return Value
Type: String
A string containing the Xml content.
Examples
 This sample shows how to create a new loose chunk and serialize some values.
public string CreateXML(string archive_name, string[] item_names, int[] item_values)
{
  GH_LooseChunk chunk = new GH_LooseChunk(archive_name);
  for (int i = 0; i < item_names.Length; i++)
  {
    chunk.SetInt32(item_names[i], i, item_values[i]);
  }
  return chunk.Serialize_Xml();
}
See Also
Reference
GH_LooseChunk Class
GH_IO.Serialization Namespace