Grasshopper API
ID Constructor (String)
 Constuctor for IDs.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public ID(
	string name
)
Public Sub New (
	name As String
)
Parameters
name
Type: System.String
Name of id.
See Also
Reference
ID Structure
ID Overload
GH_IO.Serialization Namespace