Grasshopper API
GH_Archive.ShowMessageLog Method
 Displays the message log viewer. You should typically only display the viewer if the WorstCaseMessageType equals GH_Message_Type.warning or GH_Message_Type.error
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public DialogResult ShowMessageLog()
Public Function ShowMessageLog As DialogResult
Return Value
Type: DialogResult
The closing flag for the displayed log form.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace