Grasshopper API
GH_Chunk.SetDoubleArray Method (String, Double[])
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetDoubleArray(
	string item_name,
	double[] item_value
)
Public Sub SetDoubleArray (
	item_name As String,
	item_value As Double()
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Double[]
Value of item to add.
Implements
GH_IWriter.SetDoubleArray(String, Double[])
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetDoubleArray Overload
GH_IO.Serialization Namespace