Grasshopper API
GH_Chunk.SetString Method (String, Int32, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetString(
	string item_name,
	int item_index,
	string item_value
)
Public Sub SetString (
	item_name As String,
	item_index As Integer,
	item_value As String
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: System.String
Value of item to add.
Implements
GH_IWriter.SetString(String, Int32, String)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_Chunk Class
SetString Overload
GH_IO.Serialization Namespace