Grasshopper API
VersionNumber Constructor (Int32, Int32, DateTime, VersionNumber.Branch)
 Initializes a new instance of the VersionNumber structure to the version specified by the parameters.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public VersionNumber(
	int major,
	int minor,
	DateTime time,
	VersionNumber.Branch buildBranch
)
Public Sub New (
	major As Integer,
	minor As Integer,
	time As DateTime,
	buildBranch As VersionNumber.Branch
)
Parameters
major
Type: System.Int32
 The major version number (0 through 63).
minor
Type: System.Int32
 The minor version number (0 through 127).
time
Type: System.DateTime
 The time is the version time (January 1, 2000 00:00 through December 31 23:59). Seconds are ignored.
buildBranch
Type: GH_IO.VersionNumber.Branch
 The branch used to build the product (developer, trunk, release_candidate, or release).
See Also
Reference
VersionNumber Structure
VersionNumber Overload
GH_IO Namespace