Grasshopper API
GH_Archive.CreateNewRoot Method
 Discards the current data tree and instantiates a new root node. This root node contains some comments, a version value containing the current version of GH_IO.dll and a DateTime value containing the current date and time.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void CreateNewRoot(
	bool forWriting
)
Public Sub CreateNewRoot (
	forWriting As Boolean
)
Parameters
forWriting
Type: System.Boolean
If true, all data fields are reset.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace