Grasshopper API
GH_Chunk Constructor
 Blank constructor. You typically do not need to create your own Chunks. The GH_Archive class will create top-level chunks and existing chunks can create child chunks.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected GH_Chunk()
Protected Sub New
See Also
Reference
GH_Chunk Class
GH_Chunk Overload
GH_IO.Serialization Namespace