Grasshopper API
GH_IChunk.AddMessage Method
 Log a new message with the top-level archive. Messages are collected during read/write operations, and can be displayed to the user upon completion using GH_Archive.ShowMessageLog().
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void AddMessage(
	string m,
	GH_Message_Type t
)
Sub AddMessage (
	m As String,
	t As GH_Message_Type
)
Parameters
m
Type: System.String
Message text.
t
Type: GH_IO.Serialization.GH_Message_Type
Message type.
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace