Grasshopper API
GH_IReader.TryGetDrawingSize Method (String, Size)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetDrawingSize(
	string item_name,
	ref Size value
)
Function TryGetDrawingSize (
	item_name As String,
	ByRef value As Size
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.Size
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetDrawingSize Overload
GH_IO.Serialization Namespace