Grasshopper API
GH_IReader.ChunkExists Method (String)
 Checks whether a chunk with the specified name exists in the litter. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool ChunkExists(
	string name
)
Function ChunkExists (
	name As String
) As Boolean
Parameters
name
Type: System.String
Name of chunk to test for.
Return Value
Type: Boolean
True if a chunk with the specified name exists, otherwise false.
See Also
Reference
GH_IReader Interface
ChunkExists Overload
GH_IO.Serialization Namespace