Grasshopper API
GH_Chunk.SetVersion Method (String, Int32, GH_Version)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetVersion(
	string item_name,
	int item_index,
	GH_Version item_value
)
Public Sub SetVersion (
	item_name As String,
	item_index As Integer,
	item_value As GH_Version
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: GH_IO.Types.GH_Version
Value of item to add.
Implements
GH_IWriter.SetVersion(String, Int32, GH_Version)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_Chunk Class
SetVersion Overload
GH_IO.Serialization Namespace