Grasshopper API
GH_IReader.TryGetPoint4D Method (String, Int32, GH_Point4D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetPoint4D(
	string item_name,
	int item_index,
	ref GH_Point4D value
)
Function TryGetPoint4D (
	item_name As String,
	item_index As Integer,
	ByRef value As GH_Point4D
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: GH_IO.Types.GH_Point4D
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetPoint4D Overload
GH_IO.Serialization Namespace