Grasshopper API
GH_Chunk.SetDrawingBitmap Method (String, Int32, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetDrawingBitmap(
	string item_name,
	int item_index,
	Bitmap item_value
)
Public Sub SetDrawingBitmap (
	item_name As String,
	item_index As Integer,
	item_value As Bitmap
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: System.Drawing.Bitmap
Value of item to add.
Implements
GH_IWriter.SetDrawingBitmap(String, Int32, Bitmap)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetDrawingBitmap Overload
GH_IO.Serialization Namespace