Grasshopper API
GH_Chunk.SetSingle Method (String, Int32, Single)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetSingle(
	string item_name,
	int item_index,
	float item_value
)
Public Sub SetSingle (
	item_name As String,
	item_index As Integer,
	item_value As Single
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: System.Single
Value of item to add.
Implements
GH_IWriter.SetSingle(String, Int32, Single)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_Chunk Class
SetSingle Overload
GH_IO.Serialization Namespace