Grasshopper API
GH_Version.GreaterThanOrEqual Operator
 Compares versions for larger than or equal to relationships.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static bool operator >=(
	GH_Version A,
	GH_Version B
)
Public Shared Operator >= (
	A As GH_Version,
	B As GH_Version
) As Boolean
Parameters
A
Type: GH_IO.Types.GH_Version
Version to compare.
B
Type: GH_IO.Types.GH_Version
Version to compare with.
Return Value
Type: Boolean
True if A is newer than or equal to B.
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace