Grasshopper API
GH_IReader.TryGetDate Method (String, DateTime)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetDate(
	string item_name,
	ref DateTime value
)
Function TryGetDate (
	item_name As String,
	ByRef value As DateTime
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.DateTime
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetDate Overload
GH_IO.Serialization Namespace