Grasshopper API
GH_Chunk.TryGetDrawingPointF Method (String, PointF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetDrawingPointF(
	string item_name,
	ref PointF value
)
Public Function TryGetDrawingPointF (
	item_name As String,
	ByRef value As PointF
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.PointF
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetDrawingPointF(String, PointF)
See Also
Reference
GH_Chunk Class
TryGetDrawingPointF Overload
GH_IO.Serialization Namespace