Grasshopper API
GH_Chunk.GetInterval1D Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval1D GetInterval1D(
	string item_name
)
Public Function GetInterval1D (
	item_name As String
) As GH_Interval1D
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: GH_Interval1D
The inner value of the item.
Implements
GH_IReader.GetInterval1D(String)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_Chunk Class
GetInterval1D Overload
GH_IO.Serialization Namespace