Grasshopper API
GH_IXmlSupport.Write Method
 Called when an object is required to serialize itself.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void Write(
	XmlWriter writer
)
Sub Write (
	writer As XmlWriter
)
Parameters
writer
Type: System.Xml.XmlWriter
Writer object to be used for serialization.
See Also
Reference
GH_IXmlSupport Interface
GH_IO.Serialization Namespace