Grasshopper API
GH_Chunk.ItemExists Method (String)
 Gets the occupancy for a specific item name. Only items without index qualifiers are considered.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool ItemExists(
	string name
)
Public Function ItemExists (
	name As String
) As Boolean
Parameters
name
Type: System.String
Name of item to check for.
Return Value
Type: Boolean
True if an item with a similar name already exists, false if not.
Implements
GH_IReader.ItemExists(String)
See Also
Reference
GH_Chunk Class
ItemExists Overload
GH_IO.Serialization Namespace