Grasshopper API
VersionNumber Constructor (Version)
 Construct VersionNumber based on existing System.Version class.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public VersionNumber(
	Version version
)
Public Sub New (
	version As Version
)
Parameters
version
Type: System.Version
See Also
Reference
VersionNumber Structure
VersionNumber Overload
GH_IO Namespace