Grasshopper API
GH_Chunk.CopyValuesFromChunk Method
 Copy all values and sub-chunks from another chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void CopyValuesFromChunk(
	GH_Chunk other
)
Public Sub CopyValuesFromChunk (
	other As GH_Chunk
)
Parameters
other
Type: GH_IO.Serialization.GH_Chunk
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace