Grasshopper API
GH_IReader.ItemExists Method (String)
 Checks whether an item with the specified name exists. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool ItemExists(
	string name
)
Function ItemExists (
	name As String
) As Boolean
Parameters
name
Type: System.String
Name of item to test for.
Return Value
Type: Boolean
True if an item with the specified name exists, otherwise false.
See Also
Reference
GH_IReader Interface
ItemExists Overload
GH_IO.Serialization Namespace