Grasshopper API
GH_IReader.GetDrawingRectangleF Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
RectangleF GetDrawingRectangleF(
	string item_name
)
Function GetDrawingRectangleF (
	item_name As String
) As RectangleF
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: RectangleF
The inner value of the item.
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_IReader Interface
GetDrawingRectangleF Overload
GH_IO.Serialization Namespace