Grasshopper API
GH_Chunk.RemoveItem Method (String)
 Remove an unindexed item from this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool RemoveItem(
	string itemName
)
Public Function RemoveItem (
	itemName As String
) As Boolean
Parameters
itemName
Type: System.String
Name of item.
Return Value
Type: Boolean
True on success, false on failure.
Implements
GH_IWriter.RemoveItem(String)
See Also
Reference
GH_Chunk Class
RemoveItem Overload
GH_IO.Serialization Namespace