Grasshopper API
GH_Chunk.CopyValuesToChunk Method
 Copy all values and sub-chunks in this chunk to another chunk which does not point to the same archive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Chunk CopyValuesToChunk()
Public Function CopyValuesToChunk As GH_Chunk
Return Value
Type: GH_Chunk
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace