Grasshopper API
GH_IReader.GetInt32 Method (String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
int GetInt32(
	string item_name,
	int item_index
)
Function GetInt32 (
	item_name As String,
	item_index As Integer
) As Integer
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
Return Value
Type: Int32
The inner value of the item.
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name and index does not exist.
See Also
Reference
GH_IReader Interface
GetInt32 Overload
GH_IO.Serialization Namespace