Grasshopper API
GH_LooseChunk.Deserialize_Binary Method
 Deserializes a byte array.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Deserialize_Binary(
	byte[] content
)
Public Sub Deserialize_Binary (
	content As Byte()
)
Parameters
content
Type: System.Byte[]
Byte array to deserialize.
Return Value
Type:
True on success, false on failure.
See Also
Reference
GH_LooseChunk Class
GH_IO.Serialization Namespace