Grasshopper API
GH_Chunk.GetDrawingSizeF Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public SizeF GetDrawingSizeF(
	string item_name
)
Public Function GetDrawingSizeF (
	item_name As String
) As SizeF
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: SizeF
The inner value of the item.
Implements
GH_IReader.GetDrawingSizeF(String)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_Chunk Class
GetDrawingSizeF Overload
GH_IO.Serialization Namespace