Grasshopper API
GH_Version Constructor (Int32, Int32, Int32)
 Default constructor. Create a new version from specified fields.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Version(
	int v_major,
	int v_minor,
	int v_revision
)
Public Sub New (
	v_major As Integer,
	v_minor As Integer,
	v_revision As Integer
)
Parameters
v_major
Type: System.Int32
Major component of version.
v_minor
Type: System.Int32
Minor component of version.
v_revision
Type: System.Int32
Revision component of version.
See Also
Reference
GH_Version Structure
GH_Version Overload
GH_IO.Types Namespace