Grasshopper API
GH_Chunk.TryGetLine Method (String, Int32, GH_Line)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetLine(
	string item_name,
	int item_index,
	ref GH_Line value
)
Public Function TryGetLine (
	item_name As String,
	item_index As Integer,
	ByRef value As GH_Line
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: GH_IO.Types.GH_Line
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetLine(String, Int32, GH_Line)
See Also
Reference
GH_Chunk Class
TryGetLine Overload
GH_IO.Serialization Namespace