Grasshopper API
GH_Item Constructor (String, Decimal)
 Construct a new instance of GH_Item with the specified name and value.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Item(
	string item_name,
	decimal item_data
)
Public Sub New (
	item_name As String,
	item_data As Decimal
)
Parameters
item_name
Type: System.String
Name of new item.
item_data
Type: System.Decimal
Value of new item.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if the specified name string is null or empty.
See Also
Reference
GH_Item Class
GH_Item Overload
GH_IO.Types Namespace