Grasshopper API
GH_ArchiveMessageViewer Constructor
 Constructor.
 Namespace: GH_IO.UserInterface
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_ArchiveMessageViewer()
Public Sub New
See Also
Reference
GH_ArchiveMessageViewer Class
GH_IO.UserInterface Namespace