Grasshopper API
GH_Chunk.Write Method (BinaryWriter)
 Write this chunk and all child chunks to a binary stream.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Write(
	BinaryWriter writer
)
Public Sub Write (
	writer As BinaryWriter
)
Parameters
writer
Type: System.IO.BinaryWriter
The Binary writer to use, cannot be null.
Implements
GH_IBinarySupport.Write(BinaryWriter)
Exceptions
Exception | Condition
MemberAccessException | Thrown if the name of this chunk is either null or empty.
See Also
Reference
GH_Chunk Class
Write Overload
GH_IO.Serialization Namespace