Grasshopper API
GH_IReader.TryGetDrawingColor Method (String, Color)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetDrawingColor(
	string item_name,
	ref Color value
)
Function TryGetDrawingColor (
	item_name As String,
	ByRef value As Color
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.Color
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetDrawingColor Overload
GH_IO.Serialization Namespace