Grasshopper API
GH_Chunk.FindItem Method (String, Int32)
 Finds the first item that matches the given name and index. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Item FindItem(
	string name,
	int index
)
Public Function FindItem (
	name As String,
	index As Integer
) As GH_Item
Parameters
name
Type: System.String
Name of item to search for.
index
Type: System.Int32
Index of item to search for. If less than zero, then FindItem(string name) is called instead.
Return Value
Type: GH_Item
The item that matches the given name and index, or null of no matching item could be found.
Implements
GH_IReader.FindItem(String, Int32)
See Also
Reference
GH_Chunk Class
FindItem Overload
GH_IO.Serialization Namespace