Grasshopper API
GH_IReader.TryGetInterval1D Method (String, Int32, GH_Interval1D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetInterval1D(
	string item_name,
	int item_index,
	ref GH_Interval1D value
)
Function TryGetInterval1D (
	item_name As String,
	item_index As Integer,
	ByRef value As GH_Interval1D
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: GH_IO.Types.GH_Interval1D
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetInterval1D Overload
GH_IO.Serialization Namespace