Grasshopper API
GH_IWriter.SetPlane Method (String, Int32, GH_Plane)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetPlane(
	string item_name,
	int item_index,
	GH_Plane item_value
)
Sub SetPlane (
	item_name As String,
	item_index As Integer,
	item_value As GH_Plane
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: GH_IO.Types.GH_Plane
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_IWriter Interface
SetPlane Overload
GH_IO.Serialization Namespace