Grasshopper API
GH_IWriter.SetLine Method (String, GH_Line)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetLine(
	string item_name,
	GH_Line item_value
)
Sub SetLine (
	item_name As String,
	item_value As GH_Line
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: GH_IO.Types.GH_Line
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetLine Overload
GH_IO.Serialization Namespace