Grasshopper API
GH_Interval2D Constructor (GH_Interval1D, GH_Interval1D)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval2D(
	GH_Interval1D nu,
	GH_Interval1D nv
)
Public Sub New (
	nu As GH_Interval1D,
	nv As GH_Interval1D
)
Parameters
nu
Type: GH_IO.Types.GH_Interval1D
Interval component in U direction.
nv
Type: GH_IO.Types.GH_Interval1D
Interval component in V direction.
See Also
Reference
GH_Interval2D Structure
GH_Interval2D Overload
GH_IO.Types Namespace