Grasshopper API
GH_Chunk.SetDouble Method (String, Int32, Double)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetDouble(
	string item_name,
	int item_index,
	double item_value
)
Public Sub SetDouble (
	item_name As String,
	item_index As Integer,
	item_value As Double
)
Parameters
item_name
Type: System.String
Name of item to add.
item_index
Type: System.Int32
Index of item to add.
item_value
Type: System.Double
Value of item to add.
Implements
GH_IWriter.SetDouble(String, Int32, Double)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name and index already exists.
See Also
Reference
GH_Chunk Class
SetDouble Overload
GH_IO.Serialization Namespace