Grasshopper API
GH_Chunk.ItemExists Method (String, Int32)
 Checks whether an item with the specified name and index exists. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool ItemExists(
	string name,
	int index
)
Public Function ItemExists (
	name As String,
	index As Integer
) As Boolean
Parameters
name
Type: System.String
Name of item to test for.
index
Type: System.Int32
Index of item to test for. If index is less than zero, then ItemExists(string name) is called instead.
Return Value
Type: Boolean
True if an item with the specified name and index exists, otherwise false.
Implements
GH_IReader.ItemExists(String, Int32)
See Also
Reference
GH_Chunk Class
ItemExists Overload
GH_IO.Serialization Namespace