Grasshopper API
GH_IReader.TryGetDrawingRectangleF Method (String, RectangleF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetDrawingRectangleF(
	string item_name,
	ref RectangleF value
)
Function TryGetDrawingRectangleF (
	item_name As String,
	ByRef value As RectangleF
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.RectangleF
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetDrawingRectangleF Overload
GH_IO.Serialization Namespace