Grasshopper API
GH_Chunk.ChunkKeyedCollection.Clear Method
 Removes all chunks from the collection.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace