Grasshopper API
GH_Chunk.RemoveChunk Method (GH_IChunk)
 Remove the specified chunk from the litter.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool RemoveChunk(
	GH_IChunk chunk
)
Public Function RemoveChunk (
	chunk As GH_IChunk
) As Boolean
Parameters
chunk
Type: GH_IO.Serialization.GH_IChunk
Chunk to remove.
Return Value
Type: Boolean
True is chunk was removed, false if chunk is not part of this litter.
Implements
GH_IWriter.RemoveChunk(GH_IChunk)
Exceptions
Exception | Condition
ArgumentNullException | Thrown if chunk is a null reference.
See Also
Reference
GH_Chunk Class
RemoveChunk Overload
GH_IO.Serialization Namespace