Grasshopper API
GH_Chunk.TryGetBoolean Method (String, Int32, Boolean)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetBoolean(
	string item_name,
	int item_index,
	ref bool value
)
Public Function TryGetBoolean (
	item_name As String,
	item_index As Integer,
	ByRef value As Boolean
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: System.Boolean
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetBoolean(String, Int32, Boolean)
See Also
Reference
GH_Chunk Class
TryGetBoolean Overload
GH_IO.Serialization Namespace