Grasshopper API
GH_IReader.GetPath Method (String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
string[] GetPath(
	string item_name,
	string basePath
)
Function GetPath (
	item_name As String,
	basePath As String
) As String()
Parameters
item_name
Type: System.String
Name of item to retrieve.
basePath
Type: System.String
Base path for relative path resolution.
Return Value
Type: String[]
An array of path strings. If the resolved relative path is different from the stored absolute path, two strings will be returned.
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_IReader Interface
GetPath Overload
GH_IO.Serialization Namespace