Grasshopper API
GH_Item.Read Method (XmlNode)
 Deserialize this item from an Xml node.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Read(
	XmlNode node
)
Public Sub Read (
	node As XmlNode
)
Parameters
node
Type: System.Xml.XmlNode
Xml node to serialize from.
Implements
GH_IXmlSupport.Read(XmlNode)
See Also
Reference
GH_Item Class
Read Overload
GH_IO.Types Namespace