Grasshopper API
GH_Chunk.TryGetPoint2D Method (String, GH_Point2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetPoint2D(
	string item_name,
	ref GH_Point2D value
)
Public Function TryGetPoint2D (
	item_name As String,
	ByRef value As GH_Point2D
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Point2D
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetPoint2D(String, GH_Point2D)
See Also
Reference
GH_Chunk Class
TryGetPoint2D Overload
GH_IO.Serialization Namespace