Grasshopper API
GH_IReader.GetDate Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
DateTime GetDate(
	string item_name
)
Function GetDate (
	item_name As String
) As DateTime
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: DateTime
The inner value of the item.
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_IReader Interface
GetDate Overload
GH_IO.Serialization Namespace