Grasshopper API
GH_Chunk.TryGetSingle Method (String, Int32, Single)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetSingle(
	string item_name,
	int item_index,
	ref float value
)
Public Function TryGetSingle (
	item_name As String,
	item_index As Integer,
	ByRef value As Single
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
item_index
Type: System.Int32
Index of item to retrieve.
value
Type: System.Single
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetSingle(String, Int32, Single)
See Also
Reference
GH_Chunk Class
TryGetSingle Overload
GH_IO.Serialization Namespace