Grasshopper API
GH_IXmlSupport.Read Method
 Called when an object is required to deserialize itself.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void Read(
	XmlNode node
)
Sub Read (
	node As XmlNode
)
Parameters
node
Type: System.Xml.XmlNode
Node object to be used for deserialization.
See Also
Reference
GH_IXmlSupport Interface
GH_IO.Serialization Namespace