Grasshopper API
GH_Archive.Deserialize_Binary Method
 Deserializes an array of bytes.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool Deserialize_Binary(
	byte[] data
)
Public Function Deserialize_Binary (
	data As Byte()
) As Boolean
Parameters
data
Type: System.Byte[]
Byte array to deserialize.
Return Value
Type: Boolean
True on success, false on failure.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if data is a null reference.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace