Grasshopper API
GH_LooseChunk.Deserialize_Xml Method
 Deserializes an Xml string.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Deserialize_Xml(
	string xml_content
)
Public Sub Deserialize_Xml (
	xml_content As String
)
Parameters
xml_content
Type: System.String
Xml to deserialize.
Return Value
Type:
True on success, false on failure.
See Also
Reference
GH_LooseChunk Class
GH_IO.Serialization Namespace