Grasshopper API
VersionNumber.TryParse Method (Version, VersionNumber)
 Attempt so convert the System.Version representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static bool TryParse(
	Version v,
	out VersionNumber result
)
Public Shared Function TryParse (
	v As Version,
	<OutAttribute> ByRef result As VersionNumber
) As Boolean
Parameters
v
Type: System.Version
 A version number with quartet values (v.Major, v.Minor, v.Build, v.Revision) that are valid ((0 to 63),(0 to 127), (1 to 99365), (0 to 23593)).
result
Type: GH_IO.VersionNumber
 When this method returns, result contains the VersionNumber value equivalent to the version number contained in v, if the conversion succeeded, or VersionNumber.Unset if the conversion failed. The conversion fails if the v parameter is null, is an empty string (""), or does not contain a valid string representation of version number. This parameter is passed uninitialized.
Return Value
Type: Boolean
See Also
Reference
VersionNumber Structure
TryParse Overload
GH_IO Namespace