Grasshopper API
GH_Item.Read Method (BinaryReader)
 Deserialize this item from a binary stream.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Read(
	BinaryReader reader
)
Public Sub Read (
	reader As BinaryReader
)
Parameters
reader
Type: System.IO.BinaryReader
Reader to deserialize with.
Implements
GH_IBinarySupport.Read(BinaryReader)
See Also
Reference
GH_Item Class
Read Overload
GH_IO.Types Namespace