Grasshopper API
GH_Item.Write Method (BinaryWriter)
 Serialize this item into a binary stream.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Write(
	BinaryWriter writer
)
Public Sub Write (
	writer As BinaryWriter
)
Parameters
writer
Type: System.IO.BinaryWriter
Writer to serialize with.
Implements
GH_IBinarySupport.Write(BinaryWriter)
Exceptions
Exception | Condition
MemberAccessException | Thrown if !HasName.
MemberAccessException | Thrown if !HasType.
IOException | Thrown if the internal data could not be serialized.
See Also
Reference
GH_Item Class
Write Overload
GH_IO.Types Namespace