Grasshopper API
GH_IWriter.SetDrawingPoint Method (String, Point)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetDrawingPoint(
	string item_name,
	Point item_value
)
Sub SetDrawingPoint (
	item_name As String,
	item_value As Point
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Drawing.Point
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetDrawingPoint Overload
GH_IO.Serialization Namespace