Grasshopper API
GH_Chunk.SetInt32 Method (String, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetInt32(
	string item_name,
	int item_value
)
Public Sub SetInt32 (
	item_name As String,
	item_value As Integer
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Int32
Value of item to add.
Implements
GH_IWriter.SetInt32(String, Int32)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetInt32 Overload
GH_IO.Serialization Namespace