Grasshopper API
GH_IWriter.CreateChunk Method (String, Int32)
 Create a new child chunk with the specified name and index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
GH_IWriter CreateChunk(
	string chunk_name,
	int chunk_index
)
Function CreateChunk (
	chunk_name As String,
	chunk_index As Integer
) As GH_IWriter
Parameters
chunk_name
Type: System.String
Name of new child.
chunk_index
Type: System.Int32
Index of new child.
Return Value
Type: GH_IWriter
Exceptions
Exception | Condition
ArgumentException |  Thrown if the name+index coordinte is already occupied by another chunk.
See Also
Reference
GH_IWriter Interface
CreateChunk Overload
GH_IO.Serialization Namespace