Grasshopper API
GH_Version.GetHashCode Method
 Returns the hash code for this instance.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A hash code for the current version object.
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace