Grasshopper API
GH_Chunk.ChunkKeyedCollection.TryGetValue Method
 Try and find the chunk that belongs to a given ID.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetValue(
	ID id,
	out GH_Chunk chunk
)
Public Function TryGetValue (
	id As ID,
	<OutAttribute> ByRef chunk As GH_Chunk
) As Boolean
Parameters
id
Type: GH_IO.Serialization.ID
ID to look for.
chunk
Type: GH_IO.Serialization.GH_Chunk
Chunk result.
Return Value
Type: Boolean
True is a chunk was found, false if otherwise.
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace