Grasshopper API
GH_IReader.FindItem Method (String)
 Finds the first item that matches the given name. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
GH_Item FindItem(
	string name
)
Function FindItem (
	name As String
) As GH_Item
Parameters
name
Type: System.String
Name of item to search for.
Return Value
Type: GH_Item
The item that matches the given name, or null of no matching item could be found.
See Also
Reference
GH_IReader Interface
FindItem Overload
GH_IO.Serialization Namespace