Grasshopper API
GH_Chunk.InstantiateRoot Method
 Construct a new instance of GH_Chunk which acts as a Root node. If you must create a chunk from scratch, use this static method to create one.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static GH_Chunk InstantiateRoot(
	GH_Archive owner
)
Public Shared Function InstantiateRoot (
	owner As GH_Archive
) As GH_Chunk
Parameters
owner
Type: GH_IO.Serialization.GH_Archive
The archive which owns this chunk.
Return Value
Type: GH_Chunk
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the owner is a null reference.
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace