Grasshopper API
GH_Chunk.ChunkKeyedCollection Constructor
 Create a new collection.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public ChunkKeyedCollection()
Public Sub New
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace