Grasshopper API
GH_Point2D Constructor
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point2D(
	double nx,
	double ny
)
Public Sub New (
	nx As Double,
	ny As Double
)
Parameters
nx
Type: System.Double
X coordinate of point.
ny
Type: System.Double
Y coordinate of point.
See Also
Reference
GH_Point2D Structure
GH_IO.Types Namespace