Grasshopper API
GH_BoundingBox Constructor (Double, Double, Double, Double, Double, Double)
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_BoundingBox(
	double Minx,
	double Miny,
	double Minz,
	double Maxx,
	double Maxy,
	double Maxz
)
Public Sub New (
	Minx As Double,
	Miny As Double,
	Minz As Double,
	Maxx As Double,
	Maxy As Double,
	Maxz As Double
)
Parameters
Minx
Type: System.Double
X coordinate of minimum corner.
Miny
Type: System.Double
Y coordinate of minimum corner.
Minz
Type: System.Double
Z coordinate of minimum corner.
Maxx
Type: System.Double
X coordinate of maximum corner.
Maxy
Type: System.Double
Y coordinate of maximum corner.
Maxz
Type: System.Double
Z coordinate of maximum corner.
See Also
Reference
GH_BoundingBox Structure
GH_BoundingBox Overload
GH_IO.Types Namespace