Grasshopper API
GH_Message Constructor
 Fake constructor to avoid new instances being created by a PropertyGrid.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Message()
Public Sub New
See Also
Reference
GH_Message Class
GH_Message Overload
GH_IO.Serialization Namespace