Grasshopper API
GH_Interval1D Constructor
 Constructor.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval1D(
	double na,
	double nb
)
Public Sub New (
	na As Double,
	nb As Double
)
Parameters
na
Type: System.Double
Start of interval.
nb
Type: System.Double
End of interval.
See Also
Reference
GH_Interval1D Structure
GH_IO.Types Namespace