Grasshopper API
GH_IReader.TryGetGuid Method (String, Guid)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetGuid(
	string item_name,
	ref Guid value
)
Function TryGetGuid (
	item_name As String,
	ByRef value As Guid
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Guid
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetGuid Overload
GH_IO.Serialization Namespace