Grasshopper API
GH_IReader.TryGetDrawingSizeF Method (String, SizeF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetDrawingSizeF(
	string item_name,
	ref SizeF value
)
Function TryGetDrawingSizeF (
	item_name As String,
	ByRef value As SizeF
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.SizeF
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetDrawingSizeF Overload
GH_IO.Serialization Namespace