Grasshopper API
GH_Chunk.TryGetDrawingSizeF Method (String, SizeF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetDrawingSizeF(
	string item_name,
	ref SizeF value
)
Public Function TryGetDrawingSizeF (
	item_name As String,
	ByRef value As SizeF
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.SizeF
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetDrawingSizeF(String, SizeF)
See Also
Reference
GH_Chunk Class
TryGetDrawingSizeF Overload
GH_IO.Serialization Namespace