Grasshopper API
GH_Chunk.SetDecimal Method (String, Decimal)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetDecimal(
	string item_name,
	decimal item_value
)
Public Sub SetDecimal (
	item_name As String,
	item_value As Decimal
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.Decimal
Value of item to add.
Implements
GH_IWriter.SetDecimal(String, Decimal)
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_Chunk Class
SetDecimal Overload
GH_IO.Serialization Namespace