Grasshopper API
GH_Chunk.GetBoolean Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool GetBoolean(
	string item_name
)
Public Function GetBoolean (
	item_name As String
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: Boolean
The inner value of the item.
Implements
GH_IReader.GetBoolean(String)
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_Chunk Class
GetBoolean Overload
GH_IO.Serialization Namespace