Grasshopper API
GH_IWriter.SetDate Method (String, DateTime)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
void SetDate(
	string item_name,
	DateTime item_value
)
Sub SetDate (
	item_name As String,
	item_value As DateTime
)
Parameters
item_name
Type: System.String
Name of item to add.
item_value
Type: System.DateTime
Value of item to add.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if another item with the same name already exists.
See Also
Reference
GH_IWriter Interface
SetDate Overload
GH_IO.Serialization Namespace