Grasshopper API
GH_IReader.TryGetByte Method (String, Byte)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool TryGetByte(
	string item_name,
	ref byte value
)
Function TryGetByte (
	item_name As String,
	ByRef value As Byte
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Byte
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
See Also
Reference
GH_IReader Interface
TryGetByte Overload
GH_IO.Serialization Namespace