Grasshopper API
GH_Archive.Serialize_Binary Method
 Serializes the data tree into a Binary byte array.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public byte[] Serialize_Binary()
Public Function Serialize_Binary As Byte()
Return Value
Type: Byte[]
A byte array containing the Binary stream.
Exceptions
Exception | Condition
MemberAccessException | Thrown if the root of the current archive hasn't been instantiated yet.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace