Grasshopper API
GH_Point2D.ToString Method
 Converts this structure to a human-readable string.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string representation of the two-dimenionsional point structure.
See Also
Reference
GH_Point2D Structure
GH_IO.Types Namespace