Grasshopper API
GH_Item.CreateFrom Method (BinaryReader)
 Creates a new instance of GH_Item and sets the fields from a reader object.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static GH_Item CreateFrom(
	BinaryReader reader
)
Public Shared Function CreateFrom (
	reader As BinaryReader
) As GH_Item
Parameters
reader
Type: System.IO.BinaryReader
Reader object that defines the field data.
Return Value
Type: GH_Item
The constructed and read item.
See Also
Reference
GH_Item Class
CreateFrom Overload
GH_IO.Types Namespace