Grasshopper API
GH_IWriter.RemoveChunk Method (GH_IChunk)
 Remove the specified chunk from the litter.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
bool RemoveChunk(
	GH_IChunk chunk
)
Function RemoveChunk (
	chunk As GH_IChunk
) As Boolean
Parameters
chunk
Type: GH_IO.Serialization.GH_IChunk
Chunk to remove.
Return Value
Type: Boolean
True is chunk was removed, false if chunk is not part of this litter.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if chunk is a null reference.
See Also
Reference
GH_IWriter Interface
RemoveChunk Overload
GH_IO.Serialization Namespace