Grasshopper API
GH_IReader.GetInt32 Method (String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
int GetInt32(
	string item_name
)
Function GetInt32 (
	item_name As String
) As Integer
Parameters
item_name
Type: System.String
Name of item to retrieve.
Return Value
Type: Int32
The inner value of the item.
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
NullReferenceException | Thrown if the item with the specified name does not exist.
See Also
Reference
GH_IReader Interface
GetInt32 Overload
GH_IO.Serialization Namespace