Grasshopper API
GH_Archive.WriteToFile Method
 Writes the current tree to a file.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool WriteToFile(
	string fileName,
	bool overwrite,
	bool rememberPath
)
Public Function WriteToFile (
	fileName As String,
	overwrite As Boolean,
	rememberPath As Boolean
) As Boolean
Parameters
fileName
Type: System.String
Path of file to write to. If the extension is not a recognized Grasshopper extension, an exception will be thrown.
overwrite
Type: System.Boolean
True to overwrite file at specified location.
rememberPath
Type: System.Boolean
If True, the MRU path field will be updated to reflect the new path.
Return Value
Type: Boolean
True on succes, false if file already exists and overwrite is set to false.
Exceptions
Exception | Condition
MemberAccessException | Thrown if the root of the current archive hasn't been instantiated yet.
ArgumentNullException | Thrown if file_name is either null or empty.
IOException | Thrown if the file_name doesn't represent a known file extension.
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace