Grasshopper API
GH_Chunk.TryGetDrawingPoint Method (String, Point)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetDrawingPoint(
	string item_name,
	ref Point value
)
Public Function TryGetDrawingPoint (
	item_name As String,
	ByRef value As Point
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: System.Drawing.Point
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetDrawingPoint(String, Point)
See Also
Reference
GH_Chunk Class
TryGetDrawingPoint Overload
GH_IO.Serialization Namespace