Grasshopper API
GH_Chunk.TryGetPoint3D Method (String, GH_Point3D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool TryGetPoint3D(
	string item_name,
	ref GH_Point3D value
)
Public Function TryGetPoint3D (
	item_name As String,
	ByRef value As GH_Point3D
) As Boolean
Parameters
item_name
Type: System.String
Name of item to retrieve.
value
Type: GH_IO.Types.GH_Point3D
Target of assignment.
Return Value
Type: Boolean
True if the value was set.
Implements
GH_IReader.TryGetPoint3D(String, GH_Point3D)
See Also
Reference
GH_Chunk Class
TryGetPoint3D Overload
GH_IO.Serialization Namespace