Grasshopper API
GH_ArchiveMessageViewer.SetArchive Method
 Set a new archive. The messages in this archive will be displayed on the form.
 Namespace: GH_IO.UserInterface
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void SetArchive(
	GH_Archive nArchive
)
Public Sub SetArchive (
	nArchive As GH_Archive
)
Parameters
nArchive
Type: GH_IO.Serialization.GH_Archive
See Also
Reference
GH_ArchiveMessageViewer Class
GH_IO.UserInterface Namespace