Grasshopper API
DisplayColorGradient.CastTo<T> Method (T)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool CastTo<T>(
	out T target
)
Public Overrides Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
DisplayColorGradient Class
CastTo Overload
Grasshopper.Rhinoceros.Display Namespace