Grasshopper API
ObjectDraftingLineWidth.Value.Equals Method (ObjectDraftingLineWidth.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectDraftingLineWidth.Value other
)
Public Function Equals (
	other As ObjectDraftingLineWidth.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace