Grasshopper API
Param_DateTimeFormat.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationDateTimeFormat PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationDateTimeFormat
Parameters
data
Type: System.Object
Return Value
Type: AnnotationDateTimeFormat
See Also
Reference
Param_DateTimeFormat Class
Grasshopper.Rhinoceros.Annotations.Params Namespace