Grasshopper API
ModelRenderEnvironment.Attributes Constructor
Initializes a new instance of the ModelRenderEnvironment.Attributes class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelRenderEnvironment.Attributes Class
Grasshopper.Rhinoceros.Render Namespace