Grasshopper API
GH_InstanceReference.GH_InstanceReferenceProxy.Construct Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_InstanceReference.GH_InstanceReferenceProxy Class
Grasshopper.Kernel.Types Namespace