Grasshopper API
GH_InstanceReference Constructor (Guid)
 Create a new reference to a Rhino instance reference with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReference(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of instance reference object to reference.
See Also
Reference
GH_InstanceReference Class
GH_InstanceReference Overload
Grasshopper.Kernel.Types Namespace