Grasshopper API
GH_Format.FormatInstanceReference Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatInstanceReference(
	GH_InstanceReference data
)
Public Shared Function FormatInstanceReference (
	data As GH_InstanceReference
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_InstanceReference
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace