Grasshopper API
GH_Convert.ToPointCloud_Primary Method
 Performs a direct cast from Rhino.Geometry.PointCloud or GH_PointCloud. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToPointCloud_Primary(
	Object data,
	ref PointCloud rc
)
Public Shared Function ToPointCloud_Primary (
	data As Object,
	ByRef rc As PointCloud
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: PointCloud
Result of conversion
Return Value
Type: Boolean
A PointCloud instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace