Grasshopper API
ModelView.ToViewportInfo Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ViewportInfo ToViewportInfo()
Public Function ToViewportInfo As ViewportInfo
Return Value
Type: ViewportInfo
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace