Grasshopper API
Param_DisplayColorGradient.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override DisplayColorGradient PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As DisplayColorGradient
Parameters
data
Type: System.Object
Return Value
Type: DisplayColorGradient
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace