Grasshopper API
GH_EtoUtil.CenterFormOnScreen Method
 Positions a Form so that it is centered on the current screen. The current screen being defined as the screen containing the cursor.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void CenterFormOnScreen(
	this Window F,
	bool limitToScreen
)
<ExtensionAttribute>
Public Shared Sub CenterFormOnScreen (
	F As Window,
	limitToScreen As Boolean
)
Parameters
F
Type: Window
The Form to adjust
limitToScreen
Type: System.Boolean
If True, the Form won't be allowed to extend beyond the limits of the active screen.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Window. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GH_EtoUtil Class
Grasshopper.GUI Namespace