Grasshopper API
ModelRenderContent.Attributes Constructor (RenderContent)
Initializes a new instance of the ModelRenderContent.Attributes class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected Attributes(
	RenderContent content
)
Protected Sub New (
	content As RenderContent
)
Parameters
content
Type: RenderContent
See Also
Reference
ModelRenderContent.Attributes Class
ModelRenderContent.Attributes Overload
Grasshopper.Rhinoceros.Render Namespace