Grasshopper API
ModelData.CastTo<T> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual bool CastTo<T>(
	out T target
)
Public Overridable Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
Implements
IGH_Goo.CastTo<T>(T)
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace