Grasshopper API
GH_TextEntity Constructor (GH_TextEntity)
 Create a duplicate of another GH_TextEntity. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextEntity(
	GH_TextEntity other
)
Public Sub New (
	other As GH_TextEntity
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_TextEntity
GH_TextEntity to duplicate
See Also
Reference
GH_TextEntity Class
GH_TextEntity Overload
Grasshopper.Kernel.Types Namespace