Grasshopper API
GH_Predicate.CastTo<T> Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool CastTo<T>(
	out T target
)
Public Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
Implements
IGH_Goo.CastTo<T>(T)
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace