Grasshopper API
GH_Centermark Constructor (GH_Centermark)
 Create a duplicate of another GH_Centermark. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Centermark(
	GH_Centermark other
)
Public Sub New (
	other As GH_Centermark
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Centermark
GH_Centermark to duplicate
See Also
Reference
GH_Centermark Class
GH_Centermark Overload
Grasshopper.Kernel.Types Namespace