Grasshopper API
Param_ModelRenderEnvironment Constructor
Initializes a new instance of the Param_ModelRenderEnvironment class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelRenderEnvironment()
Public Sub New
See Also
Reference
Param_ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render.Params Namespace