Grasshopper API
GH_Capsule.CreateTextCapsule Method (RectangleF, RectangleF, GH_Palette, String, Int32, Int32)
 Create a new capsule with content text.
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Capsule CreateTextCapsule(
	RectangleF box,
	RectangleF textbox,
	GH_Palette palette,
	string text,
	int radius,
	int highlight
)
Public Shared Function CreateTextCapsule (
	box As RectangleF,
	textbox As RectangleF,
	palette As GH_Palette,
	text As String,
	radius As Integer,
	highlight As Integer
) As GH_Capsule
Parameters
box
Type: System.Drawing.RectangleF
Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox
Type: System.Drawing.RectangleF
Box into which the text will be drawn.
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
Colour palette to apply.
text
Type: System.String
Text to display inside the capsule.
radius
Type: System.Int32
Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight
Type: System.Int32
Height of the highlight bar. A value of zero or lower disables the highlight.
Return Value
Type: GH_Capsule
A new instance of GH_Capsule. Caller is responsible for disposing of the object.
See Also
Reference
GH_Capsule Class
CreateTextCapsule Overload
Grasshopper.GUI.Canvas Namespace