Grasshopper API
GH_CapsuleRenderEngine.RenderMessage Method
 Render a text message underneath the capsule.
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Rectangle RenderMessage(
	Graphics G,
	string message,
	GH_PaletteStyle style
)
Public Function RenderMessage (
	G As Graphics,
	message As String,
	style As GH_PaletteStyle
) As Rectangle
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
message
Type: System.String
Message to draw.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
Style to use.
Return Value
Type: Rectangle
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace