Grasshopper API
GH_Convert.ToDimension Method
 Convert data into Rhino.Geometry.Dimension.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToDimension(
	Object data,
	ref Dimension rc,
	GH_Conversion conversion_level
)
Public Shared Function ToDimension (
	data As Object,
	ByRef rc As Dimension,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Dimension
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace