Grasshopper API
ModelView Constructor
Initializes a new instance of the ModelView class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView()
Public Sub New
See Also
Reference
ModelView Class
ModelView Overload
Grasshopper.Rhinoceros.Display Namespace