Grasshopper API
ModelViewport Implicit Conversion (RhinoViewport to ModelViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelViewport (
	RhinoViewport viewport
)
Public Shared Widening Operator CType (
	viewport As RhinoViewport
) As ModelViewport
Parameters
viewport
Type: RhinoViewport
Return Value
Type: ModelViewport
See Also
Reference
ModelViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace