Grasshopper API
ModelRenderContent.Attributes.SubClone Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelData.Attributes SubClone()
Protected Overrides Function SubClone As ModelData.Attributes
Return Value
Type: ModelData.Attributes
See Also
Reference
ModelRenderContent.Attributes Class
Grasshopper.Rhinoceros.Render Namespace