Grasshopper API
GH_AngularDimension.DuplicateAngularDimension Method
 Create a duplicate of this angular dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AngularDimension DuplicateAngularDimension()
Public Function DuplicateAngularDimension As GH_AngularDimension
Return Value
Type: GH_AngularDimension
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace