Grasshopper API
ModelRenderEnvironment Implicit Conversion (ColorRGBA to ModelRenderEnvironment)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderEnvironment (
	ColorRGBA rgba
)
Public Shared Widening Operator CType (
	rgba As ColorRGBA
) As ModelRenderEnvironment
Parameters
rgba
Type: ColorRGBA
Return Value
Type: ModelRenderEnvironment
See Also
Reference
ModelRenderEnvironment Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace