Grasshopper API
Param_OrdinateDimension.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_OrdinateDimension> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_OrdinateDimension)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_OrdinateDimension>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_OrdinateDimension Class
Grasshopper.Kernel.Parameters Namespace