Grasshopper API
GH_Convert.ToGHDimension Method
 Convert data into GH_Dimension.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHDimension(
	Object data,
	GH_Conversion conversion_level,
	ref GH_Dimension target
)
Public Shared Function ToGHDimension (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_Dimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_Dimension
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace