Grasshopper API
ModelHatchPattern Implicit Conversion (String to ModelHatchPattern)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelHatchPattern (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelHatchPattern
Parameters
path
Type: System.String
Return Value
Type: ModelHatchPattern
See Also
Reference
ModelHatchPattern Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace