Grasshopper API
Param_ModelAnnotationStyle.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelAnnotationStyle PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelAnnotationStyle
Parameters
data
Type: System.Object
Return Value
Type: ModelAnnotationStyle
See Also
Reference
Param_ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations.Params Namespace