Grasshopper API
ModelHatchLine Constructor (HatchLine)
Initializes a new instance of the ModelHatchLine class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchLine(
	HatchLine hatchLine
)
Public Sub New (
	hatchLine As HatchLine
)
Parameters
hatchLine
Type: HatchLine
See Also
Reference
ModelHatchLine Class
ModelHatchLine Overload
Grasshopper.Rhinoceros.Drafting Namespace