Grasshopper API
GH_Predicate.Format Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Format(
	Object value
)
Public Function Format (
	value As Object
) As String
Parameters
value
Type: System.Object
Return Value
Type: String
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace