Grasshopper API
GH_Format.FormatExtrusion Method (Extrusion)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatExtrusion(
	Extrusion data
)
Public Shared Function FormatExtrusion (
	data As Extrusion
) As String
Parameters
data
Type: Extrusion
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatExtrusion Overload
Grasshopper.Kernel Namespace