Grasshopper API
IGH_ReferencedData.LoadReferencedData Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
bool LoadReferencedData()
Function LoadReferencedData As Boolean
Return Value
Type: Boolean
See Also
Reference
IGH_ReferencedData Interface
Grasshopper.Kernel.Types Namespace