Grasshopper API
ModelInstanceDefinition Implicit Conversion (InstanceDefinition to ModelInstanceDefinition)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelInstanceDefinition (
	InstanceDefinition instanceDefinition
)
Public Shared Widening Operator CType (
	instanceDefinition As InstanceDefinition
) As ModelInstanceDefinition
Parameters
instanceDefinition
Type: InstanceDefinition
Return Value
Type: ModelInstanceDefinition
See Also
Reference
ModelInstanceDefinition Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace