Grasshopper API
GH_TextDot.GH_TextDotProxy.Construct Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_TextDot.GH_TextDotProxy Class
Grasshopper.Kernel.Types Namespace