Grasshopper API
GH_Convert.ToGHCentermark_Primary Method
 Converts similar data into a GH_Centermark instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHCentermark_Primary(
	Object data,
	ref GH_Centermark target
)
Public Shared Function ToGHCentermark_Primary (
	data As Object,
	ByRef target As GH_Centermark
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Centermark
Target instance. If null, a new GH_Centermark will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace