Grasshopper API
AnnotationArrowSettings Implicit Conversion (AnnotationArrowSettings.Attributes to AnnotationArrowSettings)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationArrowSettings (
	AnnotationArrowSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As AnnotationArrowSettings.Attributes
) As AnnotationArrowSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes
Return Value
Type: AnnotationArrowSettings
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace