Grasshopper API
GH_Convert.ToPointCloud_Secondary Method
 Attempts to convert other data types into an Rhino.Geometry.PointCloud. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToPointCloud_Secondary(
	Object data,
	ref PointCloud rc
)
Public Shared Function ToPointCloud_Secondary (
	data As Object,
	ByRef rc As PointCloud
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: PointCloud
Return Value
Type: Boolean
An Rhino.Geometry.PointCloud instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace