Grasshopper API
Param_TextDot.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_TextDot> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_TextDot)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_TextDot>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace