Grasshopper API
ModelMeshingParameters.ToMeshingParameters Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public MeshingParameters ToMeshingParameters(
	RhinoDoc document = null
)
Public Function ToMeshingParameters (
	Optional document As RhinoDoc = Nothing
) As MeshingParameters
Parameters
document (Optional)
Type: RhinoDoc
Return Value
Type: MeshingParameters
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace