Grasshopper API
ModelData.Read Method (GH_IReader, String, Nullable<Color>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void Read(
	GH_IReader reader,
	string name,
	out Color? serializable
)
Protected Friend Shared Sub Read (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As Color?
)
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: System.Nullable<Color>
See Also
Reference
ModelData Class
Read Overload
Grasshopper.Rhinoceros Namespace