Grasshopper API
ObjectRenderMaterial.Value Constructor (ObjectMaterialSource)
Initializes a new instance of the ObjectRenderMaterial.Value class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectMaterialSource source
)
Public Sub New (
	source As ObjectMaterialSource
)
Parameters
source
Type: ObjectMaterialSource
See Also
Reference
ObjectRenderMaterial.Value Structure
ObjectRenderMaterial.Value Overload
Grasshopper.Rhinoceros.Render Namespace