Grasshopper API
AnnotationDimensionSettings.Attributes Constructor
Initializes a new instance of the AnnotationDimensionSettings.Attributes class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace