Grasshopper API
Param_PageSettings Constructor
Initializes a new instance of the Param_PageSettings class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_PageSettings()
Public Sub New
See Also
Reference
Param_PageSettings Class
Grasshopper.Rhinoceros.Display.Params Namespace