Grasshopper API
ObjectDisplayColor.Value.Deconstruct Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Deconstruct(
	out ObjectColorSource source,
	out ModelColor value
)
Public Sub Deconstruct (
	<OutAttribute> ByRef source As ObjectColorSource,
	<OutAttribute> ByRef value As ModelColor
)
Parameters
source
Type: ObjectColorSource
value
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace