Grasshopper API
GH_TextEntity Constructor (TextEntity)
 Create a duplicate of an existing text entity.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextEntity(
	TextEntity textEntity
)
Public Sub New (
	textEntity As TextEntity
)
Parameters
textEntity
Type: TextEntity
text entity to duplicate
See Also
Reference
GH_TextEntity Class
GH_TextEntity Overload
Grasshopper.Kernel.Types Namespace