Grasshopper API
GH_Convert.ToGHLinearDimension_Secondary Method
 Converts similar data into a GH_LinearDimension instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHLinearDimension_Secondary(
	Object data,
	ref GH_LinearDimension target
)
Public Shared Function ToGHLinearDimension_Secondary (
	data As Object,
	ByRef target As GH_LinearDimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_LinearDimension
Target instance. If null, a new GH_LinearDimension will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace