Grasshopper API
ObjectDrafting Implicit Conversion (ObjectDrafting.Attributes to ObjectDrafting)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDrafting (
	ObjectDrafting.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ObjectDrafting.Attributes
) As ObjectDrafting
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes
Return Value
Type: ObjectDrafting
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace