Grasshopper API
ModelPageViewport Constructor
Initializes a new instance of the ModelPageViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelPageViewport()
Public Sub New
See Also
Reference
ModelPageViewport Class
ModelPageViewport Overload
Grasshopper.Rhinoceros.Display Namespace