Grasshopper API
ModelObject.Cast Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelObject Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelObject
Parameters
source
Type: System.Object
Return Value
Type: ModelObject
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace