Grasshopper API
GH_Convert.ToGHLight_Primary Method
 Converts similar data into a GH_Light instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHLight_Primary(
	Object data,
	ref GH_Light target
)
Public Shared Function ToGHLight_Primary (
	data As Object,
	ByRef target As GH_Light
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Light
Target instance. If null, a new GH_Light will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace