Grasshopper API
ModelSpaceViewport.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSpaceViewport.Attributes ToAttributes()
Public Function ToAttributes As ModelSpaceViewport.Attributes
Return Value
Type: ModelSpaceViewport.Attributes
See Also
Reference
ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display Namespace