Grasshopper API
ModelColor.ToArgb Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int ToArgb()
Public Function ToArgb As Integer
Return Value
Type: Int32
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace