Grasshopper API
GH_PersistentGeometryParam<T>.RemoteIdExpired Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal virtual bool RemoteIdExpired(
	RhinoDoc document,
	Guid id,
	GH_RemoteIdChange change
)
Protected Friend Overridable Function RemoteIdExpired (
	document As RhinoDoc,
	id As Guid,
	change As GH_RemoteIdChange
) As Boolean
Parameters
document
Type: RhinoDoc
id
Type: System.Guid
change
Type: GH_RemoteIdChange
Return Value
Type: Boolean
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace