Grasshopper API
ModelData.Cast<A, T> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected static T Cast<A, T>(
	Object source
)
where A : ModelData.Attributes
where T : ModelData
Protected Shared Function Cast(Of A As ModelData.Attributes, T As ModelData) (
	source As Object
) As T
Parameters
source
Type: System.Object
Type Parameters
A
T
Return Value
Type: T
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace