Grasshopper API
ModelAnnotationStyle.Cast Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelAnnotationStyle Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelAnnotationStyle
Parameters
source
Type: System.Object
Return Value
Type: ModelAnnotationStyle
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace