Grasshopper API
ModelRenderEnvironment Implicit Conversion (RenderEnvironment to ModelRenderEnvironment)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderEnvironment (
	RenderEnvironment renderEnvironment
)
Public Shared Widening Operator CType (
	renderEnvironment As RenderEnvironment
) As ModelRenderEnvironment
Parameters
renderEnvironment
Type: RenderEnvironment
Return Value
Type: ModelRenderEnvironment
See Also
Reference
ModelRenderEnvironment Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace