Grasshopper API
ModelLineWidth Constructor (Double)
Initializes a new instance of the ModelLineWidth class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLineWidth(
	double value
)
Public Sub New (
	value As Double
)
Parameters
value
Type: System.Double
See Also
Reference
ModelLineWidth Class
ModelLineWidth Overload
Grasshopper.Rhinoceros.Drafting Namespace