Grasshopper API
AnnotationDimensionSettings Implicit Conversion (AnnotationDimensionSettings.Attributes to AnnotationDimensionSettings)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationDimensionSettings (
	AnnotationDimensionSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As AnnotationDimensionSettings.Attributes
) As AnnotationDimensionSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes
Return Value
Type: AnnotationDimensionSettings
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace