Grasshopper API
ModelObject.Attributes.GetHashCode Method (IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override int GetHashCode(
	IEqualityComparer comparer
)
Protected Overrides Function GetHashCode (
	comparer As IEqualityComparer
) As Integer
Parameters
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Int32
See Also
Reference
ModelObject.Attributes Class
GetHashCode Overload
Grasshopper.Rhinoceros.Model Namespace