Grasshopper API
GH_SubD.ToString Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace