Grasshopper API
Param_ModelUnitSystem.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelUnitSystem value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelUnitSystem
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.ModelUnitSystem
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace