Grasshopper API
Param_ModelContent.Menu_AppendManageCollection Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void Menu_AppendManageCollection(
	ToolStripDropDown menu
)
Protected Overrides Sub Menu_AppendManageCollection (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_ModelContent Class
Grasshopper.Rhinoceros.Params Namespace