Grasshopper API
GH_Hatch.DuplicateHatch Method
 Create a duplicate of this hatch.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Hatch DuplicateHatch()
Public Function DuplicateHatch As GH_Hatch
Return Value
Type: GH_Hatch
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace