Grasshopper API
IGH_DocumentObject.RecordUndoEvent Method (String, IGH_UndoAction)
 Record a specific object change undo event.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
Guid RecordUndoEvent(
	string undoName,
	IGH_UndoAction action
)
Function RecordUndoEvent (
	undoName As String,
	action As IGH_UndoAction
) As Guid
Parameters
undoName
Type: System.String
Name of undo record.
action
Type: Grasshopper.Kernel.Undo.IGH_UndoAction
Undo action to record.
Return Value
Type: Guid
See Also
Reference
IGH_DocumentObject Interface
RecordUndoEvent Overload
Grasshopper.Kernel Namespace