Grasshopper API
ObjectRenderMaterial.Value.GetHashCode Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
See Also
Reference
ObjectRenderMaterial.Value Structure
GetHashCode Overload
Grasshopper.Rhinoceros.Render Namespace