Grasshopper API
ModelData.Attributes.Write Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal virtual bool Write(
	GH_IWriter writer
)
Protected Friend Overridable Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace