Grasshopper API
Param_Leader.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Leader PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_Leader
Parameters
data
Type: System.Object
Return Value
Type: GH_Leader
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace