Grasshopper API
ModelEarthAnchorPoint.Attributes Constructor
Initializes a new instance of the ModelEarthAnchorPoint.Attributes class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace