Grasshopper API
ModelNamedView.Attributes Constructor
Initializes a new instance of the ModelNamedView.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelNamedView.Attributes Class
Grasshopper.Rhinoceros.Display Namespace