Grasshopper API
Param_Light Constructor
Initializes a new instance of the Param_Light class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_Light()
Public Sub New
See Also
Reference
Param_Light Class
Grasshopper.Kernel.Parameters Namespace