Grasshopper API
ModelUnitSystem.Value Constructor (UnitSystem, String, Double)
Initializes a new instance of the ModelUnitSystem.Value class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	UnitSystem unitSystem,
	string name,
	double factor
)
Public Sub New (
	unitSystem As UnitSystem,
	name As String,
	factor As Double
)
Parameters
unitSystem
Type: UnitSystem
name
Type: System.String
factor
Type: System.Double
See Also
Reference
ModelUnitSystem.Value Structure
ModelUnitSystem.Value Overload
Grasshopper.Rhinoceros Namespace