Grasshopper API
GH_Convert.ToGHExtrusion Method
 Convert data into GH_Extrusion.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHExtrusion(
	Object data,
	GH_Conversion conversion_level,
	ref GH_Extrusion target
)
Public Shared Function ToGHExtrusion (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_Extrusion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_Extrusion
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace