Grasshopper API
ModelLayer Implicit Conversion (Layer to ModelLayer)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLayer (
	Layer layer
)
Public Shared Widening Operator CType (
	layer As Layer
) As ModelLayer
Parameters
layer
Type: Layer
Return Value
Type: ModelLayer
See Also
Reference
ModelLayer Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace