Grasshopper API
ObjectDraftingColor.Value Constructor (ObjectPlotColorSource)
Initializes a new instance of the ObjectDraftingColor.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectPlotColorSource source
)
Public Sub New (
	source As ObjectPlotColorSource
)
Parameters
source
Type: ObjectPlotColorSource
See Also
Reference
ObjectDraftingColor.Value Structure
ObjectDraftingColor.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace