Grasshopper API
GH_LinearDimension Constructor
 Default constructor, creates an invalid linear dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_LinearDimension()
Public Sub New
See Also
Reference
GH_LinearDimension Class
GH_LinearDimension Overload
Grasshopper.Kernel.Types Namespace