Grasshopper API
ModelNamedConstructionPlane.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelNamedConstructionPlane.Attributes ToAttributes()
Public Function ToAttributes As ModelNamedConstructionPlane.Attributes
Return Value
Type: ModelNamedConstructionPlane.Attributes
See Also
Reference
ModelNamedConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace