Grasshopper API
AnnotationDateTimeFormat.CastFrom Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool CastFrom(
	Object source
)
Public Overrides Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
AnnotationDateTimeFormat Class
Grasshopper.Rhinoceros.Annotations Namespace