Grasshopper API
GH_Format.FormatPointCloud Method (PointCloud, String)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatPointCloud(
	PointCloud data,
	string prefix = ""
)
Public Shared Function FormatPointCloud (
	data As PointCloud,
	Optional prefix As String = ""
) As String
Parameters
data
Type: PointCloud
prefix (Optional)
Type: System.String
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatPointCloud Overload
Grasshopper.Kernel Namespace