Grasshopper API
ModelTextureSlot Implicit Conversion (ModelTextureSlot.Attributes to ModelTextureSlot)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelTextureSlot (
	ModelTextureSlot.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelTextureSlot.Attributes
) As ModelTextureSlot
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelTextureSlot.Attributes
Return Value
Type: ModelTextureSlot
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace