Grasshopper API
Param_ModelHatchPattern.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelHatchPattern> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelHatchPattern)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelHatchPattern>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting.Params Namespace