Grasshopper API
ModelAnnotationStyle.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle.Attributes ToAttributes()
Public Function ToAttributes As ModelAnnotationStyle.Attributes
Return Value
Type: ModelAnnotationStyle.Attributes
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace