Grasshopper API
ModelStandardViewport Constructor (RhinoViewport)
Initializes a new instance of the ModelStandardViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelStandardViewport(
	RhinoViewport viewport
)
Public Sub New (
	viewport As RhinoViewport
)
Parameters
viewport
Type: RhinoViewport
See Also
Reference
ModelStandardViewport Class
ModelStandardViewport Overload
Grasshopper.Rhinoceros.Display Namespace