Grasshopper API
ModelAnnotationStyle Constructor
Initializes a new instance of the ModelAnnotationStyle class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle()
Public Sub New
See Also
Reference
ModelAnnotationStyle Class
ModelAnnotationStyle Overload
Grasshopper.Rhinoceros.Annotations Namespace