Grasshopper API
Param_ModelRenderMaterial.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelRenderMaterial value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelRenderMaterial
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ModelRenderMaterial
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace