Grasshopper API
ModelContent.Attributes Constructor
Initializes a new instance of the ModelContent.Attributes class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected Attributes()
Protected Sub New
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace