Grasshopper API
ModelValue.Equals Method (ModelValue)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelValue other
)
Public Function Equals (
	other As ModelValue
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelValue
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelValue Class
Equals Overload
Grasshopper.Rhinoceros Namespace