Grasshopper API
ObjectDisplayColor.Value.ToString Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace