Grasshopper API
ClippingArrow.Cast Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ClippingArrow Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ClippingArrow
Parameters
source
Type: System.Object
Return Value
Type: ClippingArrow
See Also
Reference
ClippingArrow Class
Grasshopper.Rhinoceros.Annotations Namespace