Grasshopper API
ModelUnitSystem.Copy Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void Copy(
	RhinoDoc source,
	RhinoDoc target,
	ActiveSpace space
)
Public Shared Sub Copy (
	source As RhinoDoc,
	target As RhinoDoc,
	space As ActiveSpace
)
Parameters
source
Type: RhinoDoc
target
Type: RhinoDoc
space
Type: ActiveSpace
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace