Grasshopper API
IGH_TaskCapableComponent.RequestTaskCancellation Method
 Called by the framework when solving has been interrupted and tasks do not need to complete.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
void RequestTaskCancellation()
Sub RequestTaskCancellation
See Also
Reference
IGH_TaskCapableComponent Interface
Grasshopper.Kernel Namespace