Grasshopper API
Param_ModelStandardViewport.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelStandardViewport PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelStandardViewport
Parameters
data
Type: System.Object
Return Value
Type: ModelStandardViewport
See Also
Reference
Param_ModelStandardViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace