Grasshopper API
ObjectSectionStyle.Value Constructor (ObjectSectionAttributesSource)
Initializes a new instance of the ObjectSectionStyle.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectSectionAttributesSource source
)
Public Sub New (
	source As ObjectSectionAttributesSource
)
Parameters
source
Type: ObjectSectionAttributesSource
See Also
Reference
ObjectSectionStyle.Value Structure
ObjectSectionStyle.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace