Grasshopper API
AnnotationArrowSettings Explicit Conversion (AnnotationArrowSettings to DimensionStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator DimensionStyle (
	AnnotationArrowSettings settings
)
Public Shared Narrowing Operator CType (
	settings As AnnotationArrowSettings
) As DimensionStyle
Parameters
settings
Type: Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings
Return Value
Type: DimensionStyle
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace