Grasshopper API
GH_Convert.ToGHCentermark Method
 Convert data into GH_Centermark.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHCentermark(
	Object data,
	GH_Conversion conversion_level,
	ref GH_Centermark target
)
Public Shared Function ToGHCentermark (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_Centermark
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_Centermark
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace