Grasshopper API
ModelViewport.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelViewport.Attributes ToAttributes()
Public Function ToAttributes As ModelViewport.Attributes
Return Value
Type: ModelViewport.Attributes
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace