Grasshopper API
Param_ModelHatchLine.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelHatchLine> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelHatchLine)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelHatchLine>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting.Params Namespace