Grasshopper API
ModelValue Constructor
Initializes a new instance of the ModelValue class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelValue()
Protected Friend Sub New
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace