Grasshopper API
ModelConstructionPlane Constructor (RhinoView)
Initializes a new instance of the ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane(
	RhinoView view
)
Public Sub New (
	view As RhinoView
)
Parameters
view
Type: RhinoView
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace