Grasshopper API
GH_TextDot Constructor (TextDot)
 Create a duplicate of an existing text dot.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextDot(
	TextDot textDot
)
Public Sub New (
	textDot As TextDot
)
Parameters
textDot
Type: TextDot
text dot to duplicate
See Also
Reference
GH_TextDot Class
GH_TextDot Overload
Grasshopper.Kernel.Types Namespace