Grasshopper API
ModelContent.AsFrozen Method
 Try to obtain a dereferenced snapshot of itself.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContent AsFrozen(
	bool deep = true
)
Public Function AsFrozen (
	Optional deep As Boolean = true
) As ModelContent
Parameters
deep (Optional)
Type: System.Boolean
Determines whether or not referenced content should also be frozen.
Return Value
Type: ModelContent
Itself if it is already dereferenced.
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace