Grasshopper API
ModelLayer.Attributes.ReadData Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override bool ReadData(
	GH_IReader reader
)
Protected Overrides Function ReadData (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace