Grasshopper API
Param_ObjectDraftingColor.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ObjectDraftingColor> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ObjectDraftingColor)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ObjectDraftingColor>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting.Params Namespace