Grasshopper API
GH_PointCloud Constructor (PointCloud)
 Create a duplicate of an existing point-cloud.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PointCloud(
	PointCloud pointCloud
)
Public Sub New (
	pointCloud As PointCloud
)
Parameters
pointCloud
Type: PointCloud
point-cloud to duplicate
See Also
Reference
GH_PointCloud Class
GH_PointCloud Overload
Grasshopper.Kernel.Types Namespace