Grasshopper API
ModelUnitSystem Implicit Conversion (ModelUnitSystem to ModelUnitSystemModelUnitSystem.Value)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelUnitSystem.Value (
	ModelUnitSystem us
)
Public Shared Widening Operator CType (
	us As ModelUnitSystem
) As ModelUnitSystem.Value
Parameters
us
Type: Grasshopper.Rhinoceros.ModelUnitSystem
Return Value
Type: ModelUnitSystem.Value
See Also
Reference
ModelUnitSystem Class
Implicit Overload
Grasshopper.Rhinoceros Namespace