Grasshopper API
Param_ModelContent.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override IGH_ModelContentData PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As IGH_ModelContentData
Parameters
data
Type: System.Object
Return Value
Type: IGH_ModelContentData
See Also
Reference
Param_ModelContent Class
Grasshopper.Rhinoceros.Params Namespace