Grasshopper API
ItemDisplayColor.Value Constructor (ModelColor)
Initializes a new instance of the ItemDisplayColor.Value class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ModelColor color
)
Public Sub New (
	color As ModelColor
)
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ItemDisplayColor.Value Structure
ItemDisplayColor.Value Overload
Grasshopper.Rhinoceros.Display Namespace