Grasshopper API
GH_Hatch.ClearCaches Method
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the hatch is referenced, the local instance of the hatch is erased.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace