Grasshopper API
Param_Light.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_Light> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_Light)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_Light>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Light Class
Grasshopper.Kernel.Parameters Namespace