Grasshopper API
ModelHatchLine.Attributes.Equals Method (ModelHatchLine.Attributes)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelHatchLine.Attributes other
)
Public Function Equals (
	other As ModelHatchLine.Attributes
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Attributes
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelHatchLine.Attributes Structure
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace