Grasshopper API
Param_ModelLineWidth.Menu_CustomMultiValueItem Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ToolStripMenuItem Menu_CustomMultiValueItem()
Protected Overrides Function Menu_CustomMultiValueItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace