Grasshopper API
GH_Light.DuplicateLight Method
 Create a duplicate of this light.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Light DuplicateLight()
Public Function DuplicateLight As GH_Light
Return Value
Type: GH_Light
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace