Grasshopper API
Param_ClippingPlane.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_ClippingPlane> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_ClippingPlane)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_ClippingPlane>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ClippingPlane Class
Grasshopper.Kernel.Parameters Namespace