Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Constructor
Initializes a new instance of the GH_ClippingPlane.GH_ClippingPlaneProxy<T> class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ClippingPlaneProxy(
	T Value
)
Public Sub New (
	Value As T
)
Parameters
Value
Type: T
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace