Grasshopper API
ModelSectionStyle.Attributes Constructor
Initializes a new instance of the ModelSectionStyle.Attributes class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace