Grasshopper API
ModelEarthAnchorPoint Constructor
Initializes a new instance of the ModelEarthAnchorPoint class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelEarthAnchorPoint()
Public Sub New
See Also
Reference
ModelEarthAnchorPoint Class
ModelEarthAnchorPoint Overload
Grasshopper.Rhinoceros.Model Namespace