Grasshopper API
ObjectDraftingColor.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingColor.Value ToAttributes()
Public Function ToAttributes As ObjectDraftingColor.Value
Return Value
Type: ObjectDraftingColor.Value
See Also
Reference
ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting Namespace