Grasshopper API
ModelView Constructor (RhinoViewport)
Initializes a new instance of the ModelView class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView(
	RhinoViewport viewport
)
Public Sub New (
	viewport As RhinoViewport
)
Parameters
viewport
Type: RhinoViewport
See Also
Reference
ModelView Class
ModelView Overload
Grasshopper.Rhinoceros.Display Namespace