Grasshopper API
GH_Format.FormatRadialDimension Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatRadialDimension(
	GH_RadialDimension data
)
Public Shared Function FormatRadialDimension (
	data As GH_RadialDimension
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_RadialDimension
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace