Grasshopper API
GH_PersistentReferenceParam<T>.InstantiateT Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override T InstantiateT()
Protected Overrides Function InstantiateT As T
Return Value
Type: T
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace