Grasshopper API
Param_ModelAttributeKey.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_String> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_String)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_String>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace