Grasshopper API
IGH_RenderAwareData.AppendRenderGeometry Method
 Push this geometry down a render pipeline.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
void AppendRenderGeometry(
	GH_RenderArgs args,
	RenderMaterial material
)
Sub AppendRenderGeometry (
	args As GH_RenderArgs,
	material As RenderMaterial
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
Render pipeline details.
material
Type: RenderMaterial
Material to use if you can't think of one yourself.
See Also
Reference
IGH_RenderAwareData Interface
Grasshopper.Kernel Namespace