Grasshopper API
ObjectDraftingColor.Value Constructor (ModelColor)
Initializes a new instance of the ObjectDraftingColor.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ModelColor color
)
Public Sub New (
	color As ModelColor
)
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ObjectDraftingColor.Value Structure
ObjectDraftingColor.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace