Grasshopper API
GH_ParameterContext Constructor
Initializes a new instance of the GH_ParameterContext class
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ParameterContext(
	string name,
	RhinoDoc rhDoc,
	RunMode runmode
)
Public Sub New (
	name As String,
	rhDoc As RhinoDoc,
	runmode As RunMode
)
Parameters
name
Type: System.String
rhDoc
Type: RhinoDoc
runmode
Type: RunMode
See Also
Reference
GH_ParameterContext Class
Grasshopper.Kernel Namespace