Grasshopper API
ModelContentName.Equals Method (ModelContentName)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelContentName other
)
Public Function Equals (
	other As ModelContentName
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelContentName Structure
Equals Overload
Grasshopper.Rhinoceros Namespace