Grasshopper API
Param_TextDot.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_TextDot InstantiateT()
Protected Overrides Function InstantiateT As GH_TextDot
Return Value
Type: GH_TextDot
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace