Grasshopper API
ModelColor.Equality Operator (ModelColor, ModelColor)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator ==(
	ModelColor left,
	ModelColor right
)
Public Shared Operator = (
	left As ModelColor,
	right As ModelColor
) As Boolean
Parameters
left
Type: Grasshopper.Rhinoceros.ModelColor
right
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: Boolean
See Also
Reference
ModelColor Structure
Equality Overload
Grasshopper.Rhinoceros Namespace