Grasshopper API
Param_ModelAttributeKey.AddedToDocument Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void AddedToDocument(
	GH_Document document
)
Public Overrides Sub AddedToDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace