Grasshopper API
ModelNamedView Implicit Conversion (ModelNamedView.Attributes to ModelNamedView)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelNamedView (
	ModelNamedView.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelNamedView.Attributes
) As ModelNamedView
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelNamedView.Attributes
Return Value
Type: ModelNamedView
See Also
Reference
ModelNamedView Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace