Grasshopper API
ItemDisplayColor Constructor (ItemDisplayColor.Value)
Initializes a new instance of the ItemDisplayColor class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ItemDisplayColor(
	ItemDisplayColor.Value value
)
Public Sub New (
	value As ItemDisplayColor.Value
)
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value
See Also
Reference
ItemDisplayColor Class
ItemDisplayColor Overload
Grasshopper.Rhinoceros.Display Namespace