Grasshopper API
ItemDisplayColor Constructor
Initializes a new instance of the ItemDisplayColor class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ItemDisplayColor()
Public Sub New
See Also
Reference
ItemDisplayColor Class
ItemDisplayColor Overload
Grasshopper.Rhinoceros.Display Namespace