Grasshopper API
ModelTags Implicit Conversion (ModelTags to String)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator string (
	ModelTags value
)
Public Shared Widening Operator CType (
	value As ModelTags
) As String
Parameters
value
Type: Grasshopper.Rhinoceros.ModelTags
Return Value
Type: String
See Also
Reference
ModelTags Structure
Implicit Overload
Grasshopper.Rhinoceros Namespace