Grasshopper API
GH_Predicate.ScriptVariable Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Object ScriptVariable()
Public Function ScriptVariable As Object
Return Value
Type: Object
Implements
IGH_Goo.ScriptVariable()
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace