Grasshopper API
ModelHatchLine.Attributes.ToHatchLine Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public HatchLine ToHatchLine()
Public Function ToHatchLine As HatchLine
Return Value
Type: HatchLine
See Also
Reference
ModelHatchLine.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace