Grasshopper API
ModelLineWidth.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLineWidth Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelLineWidth
Parameters
source
Type: System.Object
Return Value
Type: ModelLineWidth
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace