Grasshopper API
ObjectSectionStyle.Value.GetHashCode Method (IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int GetHashCode(
	IEqualityComparer comparer
)
Public Function GetHashCode (
	comparer As IEqualityComparer
) As Integer
Parameters
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Int32
Implements
IStructuralEquatable.GetHashCode(IEqualityComparer)
See Also
Reference
ObjectSectionStyle.Value Structure
GetHashCode Overload
Grasshopper.Rhinoceros.Drafting Namespace