Grasshopper API
ObjectSectionStyle.Value Implicit Conversion (ModelSectionStyle to ObjectSectionStyleObjectSectionStyle.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectSectionStyle.Value (
	ModelSectionStyle sectionStyle
)
Public Shared Widening Operator CType (
	sectionStyle As ModelSectionStyle
) As ObjectSectionStyle.Value
Parameters
sectionStyle
Type: Grasshopper.Rhinoceros.Drafting.ModelSectionStyle
Return Value
Type: ObjectSectionStyle.Value
See Also
Reference
ObjectSectionStyle.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace