Grasshopper API
GH_Convert.GeometryToObjRef Method
 Create an ObjRef for a referenced IGH_GeometricGoo. Unreferenced IGH_GeometryGoo will return null.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjRef GeometryToObjRef(
	IGH_GeometricGoo in
)
Public Shared Function GeometryToObjRef (
	in As IGH_GeometricGoo
) As ObjRef
Parameters
in
Type: Grasshopper.Kernel.Types.IGH_GeometricGoo
Return Value
Type: ObjRef
 An instance of an ObjRef when the goo is referenced geometry. It is up to the caller to Dispose of the objref when it is no longer needed Null for unreferenced geometry
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace