Grasshopper API
AnnotationDimensionSettings Constructor (AnnotationDimensionSettings.Attributes)
Initializes a new instance of the AnnotationDimensionSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDimensionSettings(
	AnnotationDimensionSettings.Attributes attributes
)
Public Sub New (
	attributes As AnnotationDimensionSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes
See Also
Reference
AnnotationDimensionSettings Class
AnnotationDimensionSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace