Grasshopper API
GH_Format.FormatExtrusion Method (GH_Extrusion)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatExtrusion(
	GH_Extrusion data
)
Public Shared Function FormatExtrusion (
	data As GH_Extrusion
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Extrusion
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatExtrusion Overload
Grasshopper.Kernel Namespace