Grasshopper API
ModelTextureMapping.Attributes Implicit Conversion (String to ModelTextureMappingModelTextureMapping.Attributes)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelTextureMapping.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelTextureMapping.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelTextureMapping.Attributes
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace