Grasshopper API
GH_CapsuleRenderEngine.RenderBoundaryDots Method
 Render a collection of boundary dots along the top edge of the capsule.
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void RenderBoundaryDots(
	Graphics G,
	int count,
	GH_PaletteStyle style
)
Public Sub RenderBoundaryDots (
	G As Graphics,
	count As Integer,
	style As GH_PaletteStyle
)
Parameters
G
Type: System.Drawing.Graphics
count
Type: System.Int32
Number of dots to render.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace