Grasshopper API
ObjectDisplay.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplay.Attributes ToAttributes()
Public Function ToAttributes As ObjectDisplay.Attributes
Return Value
Type: ObjectDisplay.Attributes
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace