Grasshopper API
GH_Convert.ToExtrusion_Secondary Method
 Attempts to convert other data types into a Extrusion. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToExtrusion_Secondary(
	Object data,
	ref Extrusion rc
)
Public Shared Function ToExtrusion_Secondary (
	data As Object,
	ByRef rc As Extrusion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Extrusion
Return Value
Type: Boolean
A Extrusion instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace