Grasshopper API
GH_InstanceReference Constructor (GH_InstanceReference)
 Create a duplicate of another instance reference.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReference(
	GH_InstanceReference other
)
Public Sub New (
	other As GH_InstanceReference
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_InstanceReference
instance reference to duplicate
Remarks
This constructor also copies reference data.
See Also
Reference
GH_InstanceReference Class
GH_InstanceReference Overload
Grasshopper.Kernel.Types Namespace