Grasshopper API
ObjectRender.Attributes.Equals Method (ObjectRender.Attributes)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectRender.Attributes other
)
Public Function Equals (
	other As ObjectRender.Attributes
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Render.ObjectRender.Attributes
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectRender.Attributes Structure
Equals Overload
Grasshopper.Rhinoceros.Render Namespace