Grasshopper API
GH_DetailView.DuplicateDetailView Method
 Create a duplicate of this hatch.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_DetailView DuplicateDetailView()
Public Function DuplicateDetailView As GH_DetailView
Return Value
Type: GH_DetailView
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace