Grasshopper API
Param_OrdinateDimension Constructor
Initializes a new instance of the Param_OrdinateDimension class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_OrdinateDimension()
Public Sub New
See Also
Reference
Param_OrdinateDimension Class
Grasshopper.Kernel.Parameters Namespace