Grasshopper API
AnnotationTextSettings Constructor (DimensionStyle)
Initializes a new instance of the AnnotationTextSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationTextSettings(
	DimensionStyle dimStyle
)
Public Sub New (
	dimStyle As DimensionStyle
)
Parameters
dimStyle
Type: DimensionStyle
See Also
Reference
AnnotationTextSettings Class
AnnotationTextSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace