Grasshopper API
Complex.Division Operator (Complex, Complex)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Complex operator /(
	Complex dividend,
	Complex divisor
)
Public Shared Operator / (
	dividend As Complex,
	divisor As Complex
) As Complex
Parameters
dividend
Type: Grasshopper.Kernel.Types.Complex
divisor
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Division Overload
Grasshopper.Kernel.Types Namespace