Grasshopper API
ModelTextureMapping.Attributes Constructor
Initializes a new instance of the ModelTextureMapping.Attributes class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace