Grasshopper API
ModelContent.Attributes.WriteData Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual bool WriteData(
	GH_IWriter writer
)
Protected Overridable Function WriteData (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace