Grasshopper API
Param_DisplayColorStop.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override DisplayColorStop PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As DisplayColorStop
Parameters
data
Type: System.Object
Return Value
Type: DisplayColorStop
See Also
Reference
Param_DisplayColorStop Class
Grasshopper.Rhinoceros.Display.Params Namespace