Grasshopper API
AnnotationArrowSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrowSettings.Attributes ToAttributes()
Public Function ToAttributes As AnnotationArrowSettings.Attributes
Return Value
Type: AnnotationArrowSettings.Attributes
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace