Grasshopper API
Param_Centermark Constructor
Initializes a new instance of the Param_Centermark class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_Centermark()
Public Sub New
See Also
Reference
Param_Centermark Class
Grasshopper.Kernel.Parameters Namespace