Grasshopper API
ModelData.WriteGeometry<T> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static bool WriteGeometry<T>(
	GH_IWriter writer,
	string name,
	ref T serializable
)
where T : GeometryBase
Protected Friend Shared Function WriteGeometry(Of T As GeometryBase) (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As T
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace