Grasshopper API
GH_PreviewBoundary Constructor
 Create a new preview boundary.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PreviewBoundary(
	PointF[] points
)
Public Sub New (
	points As PointF()
)
Parameters
points
Type: System.Drawing.PointF[]
Points on boundary.
See Also
Reference
GH_PreviewBoundary Class
Grasshopper.Kernel Namespace