Grasshopper API
ModelRenderSun.Attributes Constructor
Initializes a new instance of the ModelRenderSun.Attributes class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace