Grasshopper API
GH_Format.FormatCurve Method (Curve, String, String)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatCurve(
	Curve data,
	string prefix = "",
	string name = "Curve"
)
Public Shared Function FormatCurve (
	data As Curve,
	Optional prefix As String = "",
	Optional name As String = "Curve"
) As String
Parameters
data
Type: Curve
prefix (Optional)
Type: System.String
name (Optional)
Type: System.String
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatCurve Overload
Grasshopper.Kernel Namespace