Grasshopper API
Param_ItemDisplayColor Constructor
Initializes a new instance of the Param_ItemDisplayColor class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ItemDisplayColor()
Public Sub New
See Also
Reference
Param_ItemDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace