Grasshopper API
ModelMeshingParameters Implicit Conversion (MeshingParameters to ModelMeshingParameters)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelMeshingParameters (
	MeshingParameters parameters
)
Public Shared Widening Operator CType (
	parameters As MeshingParameters
) As ModelMeshingParameters
Parameters
parameters
Type: MeshingParameters
Return Value
Type: ModelMeshingParameters
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace