Grasshopper API
GH_ColourPickerBase.SetUiScaling Method
 Namespace: Grasshopper.GUI.Base
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void SetUiScaling(
	float factor
)
Public Sub SetUiScaling (
	factor As Single
)
Parameters
factor
Type: System.Single
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace