Grasshopper API
GH_PointCloud.PointCloudProxy.Construct Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace