Grasshopper API
GH_Format.FormatHatch Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatHatch(
	GH_Hatch data
)
Public Shared Function FormatHatch (
	data As GH_Hatch
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Hatch
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace