Grasshopper API
GH_AsynchFileData.Dispose Method
Releases all resources used by the GH_AsynchFileData
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace