Grasshopper API
Param_AnnotationTextSettings.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationTextSettings PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationTextSettings
Parameters
data
Type: System.Object
Return Value
Type: AnnotationTextSettings
See Also
Reference
Param_AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace