Grasshopper API
ModelData.Attributes.Read Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal virtual bool Read(
	GH_IReader reader
)
Protected Friend Overridable Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace