Grasshopper API
GH_SubD.DestroyPreviewMeshes Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DestroyPreviewMeshes()
Public Sub DestroyPreviewMeshes
Implements
IGH_PreviewMeshData.DestroyPreviewMeshes()
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace