Grasshopper API
GH_DocumentIO.SaveQuiet Method
 Quietly save a file to a given location.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool SaveQuiet(
	string path
)
Public Function SaveQuiet (
	path As String
) As Boolean
Parameters
path
Type: System.String
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace