Grasshopper API
Param_ModelContent.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref IGH_ModelContentData value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As IGH_ModelContentData
) As GH_GetterResult
Parameters
value
Type: IGH_ModelContentData
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelContent Class
Grasshopper.Rhinoceros.Params Namespace