Grasshopper API
GH_InstanceReference Constructor (InstanceReferenceGeometry)
 Create a new reference to a Rhino instance reference with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReference(
	InstanceReferenceGeometry iref
)
Public Sub New (
	iref As InstanceReferenceGeometry
)
Parameters
iref
Type: InstanceReferenceGeometry
instance reference object to reference.
See Also
Reference
GH_InstanceReference Class
GH_InstanceReference Overload
Grasshopper.Kernel.Types Namespace