Grasshopper API
GH_RenderArgs Constructor (RhinoDoc, ViewportInfo, RenderPrimitiveList, Guid, RenderMaterial, RenderMaterial)
Note: This API is now obsolete.
 Create new render arguments.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute]
public GH_RenderArgs(
	RhinoDoc doc,
	ViewportInfo vp,
	RenderPrimitiveList geometry,
	Guid id,
	RenderMaterial matNormal,
	RenderMaterial matSelected
)
<ObsoleteAttribute>
Public Sub New (
	doc As RhinoDoc,
	vp As ViewportInfo,
	geometry As RenderPrimitiveList,
	id As Guid,
	matNormal As RenderMaterial,
	matSelected As RenderMaterial
)
Parameters
doc
Type: RhinoDoc
Rhino document.
vp
Type: ViewportInfo
Viewport.
geometry
Type: RenderPrimitiveList
Geometry list.
id
Type: System.Guid
Render plugin id.
matNormal
Type: RenderMaterial
Material for unselected objects.
matSelected
Type: RenderMaterial
Material for selected objects.
See Also
Reference
GH_RenderArgs Class
GH_RenderArgs Overload
Grasshopper.Kernel Namespace