Grasshopper API
Param_DisplayColorStop.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref DisplayColorStop value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As DisplayColorStop
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.DisplayColorStop
Return Value
Type: GH_GetterResult
See Also
Reference
Param_DisplayColorStop Class
Grasshopper.Rhinoceros.Display.Params Namespace