Grasshopper API
GH_Convert.ToSubD_Primary Method
 Performs a direct cast from OnSubD or GH_SubD. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToSubD_Primary(
	Object data,
	ref SubD rc
)
Public Shared Function ToSubD_Primary (
	data As Object,
	ByRef rc As SubD
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: SubD
Return Value
Type: Boolean
An OnSubD instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace