Grasshopper API
Param_ModelView.Read Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Read(
	GH_IReader reader
)
Public Overrides Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace