Grasshopper API
Param_ModelHatchPattern.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelHatchPattern PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelHatchPattern
Parameters
data
Type: System.Object
Return Value
Type: ModelHatchPattern
See Also
Reference
Param_ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting.Params Namespace