Grasshopper API
ModelRenderMaterial Implicit Conversion (String to ModelRenderMaterial)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderMaterial (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelRenderMaterial
Parameters
path
Type: System.String
Return Value
Type: ModelRenderMaterial
See Also
Reference
ModelRenderMaterial Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace