Grasshopper API
Param_Light.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Light PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_Light
Parameters
data
Type: System.Object
Return Value
Type: GH_Light
See Also
Reference
Param_Light Class
Grasshopper.Kernel.Parameters Namespace