Grasshopper API
ModelRenderMaterial Implicit Conversion (ModelRenderMaterial.Attributes to ModelRenderMaterial)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderMaterial (
	ModelRenderMaterial.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelRenderMaterial.Attributes
) As ModelRenderMaterial
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderMaterial.Attributes
Return Value
Type: ModelRenderMaterial
See Also
Reference
ModelRenderMaterial Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace