Grasshopper API
ModelSectionStyle.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle.Attributes ToAttributes()
Public Function ToAttributes As ModelSectionStyle.Attributes
Return Value
Type: ModelSectionStyle.Attributes
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace