Grasshopper API
Param_ObjectDraftingLineWidth Constructor
Initializes a new instance of the Param_ObjectDraftingLineWidth class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectDraftingLineWidth()
Public Sub New
See Also
Reference
Param_ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace