Grasshopper API
ModelViewport Constructor
Initializes a new instance of the ModelViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelViewport()
Protected Friend Sub New
See Also
Reference
ModelViewport Class
ModelViewport Overload
Grasshopper.Rhinoceros.Display Namespace