Grasshopper API
ModelInstanceDefinition Constructor (Guid)
Initializes a new instance of the ModelInstanceDefinition class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelInstanceDefinition Class
ModelInstanceDefinition Overload
Grasshopper.Rhinoceros.Model Namespace