Grasshopper API
ModelUnitSystem.Value Constructor (ActiveSpace, String)
Initializes a new instance of the ModelUnitSystem.Value class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ActiveSpace activeSpace,
	string name = null
)
Public Sub New (
	activeSpace As ActiveSpace,
	Optional name As String = Nothing
)
Parameters
activeSpace
Type: ActiveSpace
name (Optional)
Type: System.String
See Also
Reference
ModelUnitSystem.Value Structure
ModelUnitSystem.Value Overload
Grasshopper.Rhinoceros Namespace