Grasshopper API
ModelStandardViewport Constructor (Guid)
Initializes a new instance of the ModelStandardViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelStandardViewport(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelStandardViewport Class
ModelStandardViewport Overload
Grasshopper.Rhinoceros.Display Namespace