Grasshopper API
ModelTags.Inequality Operator
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator !=(
	ModelTags left,
	ModelTags right
)
Public Shared Operator <> (
	left As ModelTags,
	right As ModelTags
) As Boolean
Parameters
left
Type: Grasshopper.Rhinoceros.ModelTags
right
Type: Grasshopper.Rhinoceros.ModelTags
Return Value
Type: Boolean
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace