Grasshopper API
ModelRenderMaterial.Attributes.ToString Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ModelRenderMaterial.Attributes Class
Grasshopper.Rhinoceros.Render Namespace