Grasshopper API
GH_GDLParser.ParseGDL Method
 Convert a GDL text into an actual document.
 Namespace: Grasshopper.Kernel.GDL
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Document ParseGDL(
	string[] lines,
	out string[] messages
)
Public Shared Function ParseGDL (
	lines As String(),
	<OutAttribute> ByRef messages As String()
) As GH_Document
Parameters
lines
Type: System.String[]
Lines to parse.
messages
Type: System.String[]
Messages encountered.
Return Value
Type: GH_Document
A document on success or null on failure.
See Also
Reference
GH_GDLParser Class
Grasshopper.Kernel.GDL Namespace