Grasshopper API
ModelAnnotationStyle Constructor (Guid)
Initializes a new instance of the ModelAnnotationStyle class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelAnnotationStyle Class
ModelAnnotationStyle Overload
Grasshopper.Rhinoceros.Annotations Namespace