Grasshopper API
Param_ModelConstructionPlane.InstantiateT Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelConstructionPlane InstantiateT()
Protected Overrides Function InstantiateT As ModelConstructionPlane
Return Value
Type: ModelConstructionPlane
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace