Grasshopper API
AnnotationArrow Implicit Conversion (DimensionStyle.ArrowType to AnnotationArrow)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationArrow (
	ArrowType arrowType
)
Public Shared Widening Operator CType (
	arrowType As ArrowType
) As AnnotationArrow
Parameters
arrowType
Type: ArrowType
Return Value
Type: AnnotationArrow
See Also
Reference
AnnotationArrow Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace