Grasshopper API
GH_ClippingPlane Constructor
 Default constructor, creates an invalid clipping plane.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ClippingPlane()
Public Sub New
See Also
Reference
GH_ClippingPlane Class
GH_ClippingPlane Overload
Grasshopper.Kernel.Types Namespace