Grasshopper API
ModelEarthAnchorPoint.Attributes.ToModelData Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ModelData ToModelData()
Public Overrides Function ToModelData As ModelData
Return Value
Type: ModelData
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace