Grasshopper API
IGH_ContextualParameter.AutoAssignContextualData Method
 Use the in-build getter UI to assign data to the parameter.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
bool AutoAssignContextualData(
	GH_ParameterContext context
)
Function AutoAssignContextualData (
	context As GH_ParameterContext
) As Boolean
Parameters
context
Type: Grasshopper.Kernel.GH_ParameterContext
Return Value
Type: Boolean
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace