Grasshopper API
GH_Predicate.Invoke Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Invoke(
	Object value
)
Public Function Invoke (
	value As Object
) As Boolean
Parameters
value
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace