Grasshopper API
GH_Convert.ToGHClippingPlane_Primary Method
 Converts similar data into a GH_ClippingPlane instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHClippingPlane_Primary(
	Object data,
	ref GH_ClippingPlane target
)
Public Shared Function ToGHClippingPlane_Primary (
	data As Object,
	ByRef target As GH_ClippingPlane
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_ClippingPlane
Target instance. If null, a new GH_ClippingPlane will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace