Grasshopper API
Param_LinearDimension.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_LinearDimension value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_LinearDimension
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_LinearDimension
Return Value
Type: GH_GetterResult
See Also
Reference
Param_LinearDimension Class
Grasshopper.Kernel.Parameters Namespace