Grasshopper API
ObjectSectionStyle.Value.Equals Method (Object, IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	Object other,
	IEqualityComparer comparer
)
Public Function Equals (
	other As Object,
	comparer As IEqualityComparer
) As Boolean
Parameters
other
Type: System.Object
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Boolean
Implements
IStructuralEquatable.Equals(Object, IEqualityComparer)
See Also
Reference
ObjectSectionStyle.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace