Grasshopper API
ModelTags.GetEnumerator Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IEnumerator<string> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of String)
Return Value
Type: IEnumerator<String>
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace