Grasshopper API
DisplayColorStop Constructor (DisplayColorStop)
Initializes a new instance of the DisplayColorStop class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorStop(
	DisplayColorStop other
)
Public Sub New (
	other As DisplayColorStop
)
Parameters
other
Type: Grasshopper.Rhinoceros.Display.DisplayColorStop
See Also
Reference
DisplayColorStop Class
DisplayColorStop Overload
Grasshopper.Rhinoceros.Display Namespace