Grasshopper API
Param_LinearDimension.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_LinearDimension InstantiateT()
Protected Overrides Function InstantiateT As GH_LinearDimension
Return Value
Type: GH_LinearDimension
See Also
Reference
Param_LinearDimension Class
Grasshopper.Kernel.Parameters Namespace