Grasshopper API
ModelHatchLine.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelHatchLine Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelHatchLine
Parameters
source
Type: System.Object
Return Value
Type: ModelHatchLine
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace