Grasshopper API
GH_Predicate.EmitProxy Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IGH_GooProxy EmitProxy()
Public Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
Implements
IGH_Goo.EmitProxy()
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace