Grasshopper API
ModelObject.GetBoundingBox Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox GetBoundingBox(
	Transform xform
)
Public Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Transform
Return Value
Type: BoundingBox
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace