Grasshopper API
GH_InstanceReference.ToString Method
 Format the instance reference using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace