Grasshopper API
Param_AnnotationUnitsSettings.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationUnitsSettings PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationUnitsSettings
Parameters
data
Type: System.Object
Return Value
Type: AnnotationUnitsSettings
See Also
Reference
Param_AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace