Grasshopper API
GH_Convert.GetPlaneFromDocument Method
 Harvest the object frame plane from a Rhino document.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool GetPlaneFromDocument(
	RhinoDoc doc,
	Guid id,
	out Plane pln
)
Public Shared Function GetPlaneFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef pln As Plane
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of plane object.
pln
Type: Plane
Plane result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace