Grasshopper API
GH_Hatch Constructor (Hatch, ModelHatchPattern)
 Create a duplicate of an existing hatch.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Hatch(
	Hatch hatch,
	ModelHatchPattern pattern
)
Public Sub New (
	hatch As Hatch,
	pattern As ModelHatchPattern
)
Parameters
hatch
Type: Hatch
Hatch to duplicate
pattern
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchPattern
See Also
Reference
GH_Hatch Class
GH_Hatch Overload
Grasshopper.Kernel.Types Namespace