Grasshopper API
AnnotationToleranceSettings.Attributes Constructor
Initializes a new instance of the AnnotationToleranceSettings.Attributes class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace