Grasshopper API
ModelData.ReadGeometry<T> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static bool ReadGeometry<T>(
	GH_IReader reader,
	string name,
	out T serializable
)
where T : GeometryBase
Protected Friend Shared Function ReadGeometry(Of T As GeometryBase) (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As T
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace