Grasshopper API
GH_FontServer.NewFont Method (FontFamily, Single, FontStyle)
 Safe font constructor.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Font NewFont(
	FontFamily family,
	float size,
	FontStyle style
)
Public Shared Function NewFont (
	family As FontFamily,
	size As Single,
	style As FontStyle
) As Font
Parameters
family
Type: System.Drawing.FontFamily
Font family.
size
Type: System.Single
Size (in points).
style
Type: System.Drawing.FontStyle
Style (if available).
Return Value
Type: Font
 A font, or null if family is null. A null family means the machine could not supply one at all; returning null degrades text rather than sinking the shared constructor, which is how the LINUX branches have always behaved and what the measuring methods below already expect.
See Also
Reference
GH_FontServer Class
NewFont Overload
Grasshopper.Kernel Namespace