Grasshopper API
ModelUserText.RemoveRange Method (IEnumerable<String>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText RemoveRange(
	IEnumerable<string> keys
)
Public Function RemoveRange (
	keys As IEnumerable(Of String)
) As ModelUserText
Parameters
keys
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
RemoveRange Overload
Grasshopper.Rhinoceros Namespace