Grasshopper API
GH_DocumentIO.ShowOverwriteDialog Method (String, DateTime, DateTime)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int ShowOverwriteDialog(
	string filename,
	DateTime lastSave,
	DateTime fileOnDisk
)
Public Shared Function ShowOverwriteDialog (
	filename As String,
	lastSave As DateTime,
	fileOnDisk As DateTime
) As Integer
Parameters
filename
Type: System.String
lastSave
Type: System.DateTime
fileOnDisk
Type: System.DateTime
Return Value
Type: Int32
See Also
Reference
GH_DocumentIO Class
ShowOverwriteDialog Overload
Grasshopper.Kernel Namespace