Grasshopper API
Param_ModelStandardViewport Constructor
Initializes a new instance of the Param_ModelStandardViewport class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelStandardViewport()
Public Sub New
See Also
Reference
Param_ModelStandardViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace