Grasshopper API
GH_Predicate.Negate Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Predicate Negate()
Public Function Negate As GH_Predicate
Return Value
Type: GH_Predicate
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace