Grasshopper API
ModelUserText.BitwiseAnd Operator (ModelUserText, IEnumerable<String>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUserText operator &(
	ModelUserText left,
	IEnumerable<string> right
)
Public Shared Operator And (
	left As ModelUserText,
	right As IEnumerable(Of String)
) As ModelUserText
Parameters
left
Type: Grasshopper.Rhinoceros.ModelUserText
right
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
BitwiseAnd Overload
Grasshopper.Rhinoceros Namespace