Grasshopper API
Param_ModelTextureMapping Constructor
Initializes a new instance of the Param_ModelTextureMapping class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelTextureMapping()
Public Sub New
See Also
Reference
Param_ModelTextureMapping Class
Grasshopper.Rhinoceros.Render.Params Namespace