Grasshopper API
ModelSpaceViewport Constructor (ModelSpaceViewport.Attributes, Guid)
Initializes a new instance of the ModelSpaceViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelSpaceViewport(
	ModelSpaceViewport.Attributes attributes,
	Guid id
)
Protected Friend Sub New (
	attributes As ModelSpaceViewport.Attributes,
	id As Guid
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelSpaceViewport.Attributes
id
Type: System.Guid
See Also
Reference
ModelSpaceViewport Class
ModelSpaceViewport Overload
Grasshopper.Rhinoceros.Display Namespace