Grasshopper API
GH_Convert.ToSafeRhinoCommonObject Method
 Convert RhinoCommon types that are dangerous to use out of context (BrepFace, BrepEdge, etc.) into safe types (Brep, Curve, etc.).
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Object ToSafeRhinoCommonObject(
	Object data
)
Public Shared Function ToSafeRhinoCommonObject (
	data As Object
) As Object
Parameters
data
Type: System.Object
Data to convert.
Return Value
Type: Object
Safe data.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace