Grasshopper API
EtoExtensions.ToEto Method (Control)
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Control ToEto(
	this Control control
)
<ExtensionAttribute>
Public Shared Function ToEto (
	control As Control
) As Control
Parameters
control
Type: System.Windows.Forms.Control
Return Value
Type: Control
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Control. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EtoExtensions Class
ToEto Overload
Grasshopper Namespace