Grasshopper API
ModelRenderEnvironment Constructor (Guid)
Initializes a new instance of the ModelRenderEnvironment class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderEnvironment(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelRenderEnvironment Class
ModelRenderEnvironment Overload
Grasshopper.Rhinoceros.Render Namespace