Grasshopper API
GH_RhinoScriptInterface.RunHeadless Method
 Namespace: Grasshopper.Plugin
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void RunHeadless()
Public Sub RunHeadless
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace