Grasshopper API
Param_ObjectDisplayMode.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelDisplayMode PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelDisplayMode
Parameters
data
Type: System.Object
Return Value
Type: ModelDisplayMode
See Also
Reference
Param_ObjectDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace