Grasshopper API
GH_AngularDimension Constructor (AngularDimension, ModelAnnotationStyle)
 Create a duplicate of an existing angular dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AngularDimension(
	AngularDimension dimension,
	ModelAnnotationStyle style
)
Public Sub New (
	dimension As AngularDimension,
	style As ModelAnnotationStyle
)
Parameters
dimension
Type: AngularDimension
Angular dimension to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_AngularDimension Class
GH_AngularDimension Overload
Grasshopper.Kernel.Types Namespace