Grasshopper API
ModelView.ToString Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Implements
IGH_Goo.ToString()
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace