Grasshopper API
GH_RhinoScriptInterface.LoadedPluginNames Method
 Gets an array of the names and versions (if known) of all loaded plugins.
 Namespace: Grasshopper.Plugin
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string[] LoadedPluginNames()
Public Function LoadedPluginNames As String()
Return Value
Type: String[]
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace