Grasshopper API
EtoExtensions.ToEto Method (Form)
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Window ToEto(
	this Form control
)
<ExtensionAttribute>
Public Shared Function ToEto (
	control As Form
) As Window
Parameters
control
Type: System.Windows.Forms.Form
Return Value
Type: Window
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Form. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EtoExtensions Class
ToEto Overload
Grasshopper Namespace