Grasshopper API
GH_ComponentServer.CreateComponentPalette Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Bitmap CreateComponentPalette(
	GH_ComponentPaletteStyle style
)
Public Function CreateComponentPalette (
	style As GH_ComponentPaletteStyle
) As Bitmap
Parameters
style
Type: Grasshopper.Kernel.GH_ComponentPaletteStyle
Return Value
Type: Bitmap
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace