Grasshopper API
ModelRenderEnvironment Constructor (RenderEnvironment)
Initializes a new instance of the ModelRenderEnvironment class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderEnvironment(
	RenderEnvironment renderEnvironment
)
Public Sub New (
	renderEnvironment As RenderEnvironment
)
Parameters
renderEnvironment
Type: RenderEnvironment
See Also
Reference
ModelRenderEnvironment Class
ModelRenderEnvironment Overload
Grasshopper.Rhinoceros.Render Namespace