Grasshopper API
AnnotationDateTimeFormat Constructor (GH_String)
Initializes a new instance of the AnnotationDateTimeFormat class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDateTimeFormat(
	GH_String value
)
Public Sub New (
	value As GH_String
)
Parameters
value
Type: Grasshopper.Kernel.Types.GH_String
See Also
Reference
AnnotationDateTimeFormat Class
AnnotationDateTimeFormat Overload
Grasshopper.Rhinoceros.Annotations Namespace