Grasshopper API
GH_Extrusion.GH_ExtrusionProxy.Construct Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace