Grasshopper API
ModelRenderTexture Implicit Conversion (ModelRenderTexture.Attributes to ModelRenderTexture)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderTexture (
	ModelRenderTexture.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelRenderTexture.Attributes
) As ModelRenderTexture
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderTexture.Attributes
Return Value
Type: ModelRenderTexture
See Also
Reference
ModelRenderTexture Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace