Grasshopper API
GH_LinearDimension Constructor (Guid)
 Create a new referenced linear dimension that references a Rhino dimension with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_LinearDimension(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of dimension object to reference.
See Also
Reference
GH_LinearDimension Class
GH_LinearDimension Overload
Grasshopper.Kernel.Types Namespace