Grasshopper API
GH_ScriptVariant Explicit Conversion (GH_ScriptVariant to DateTime)
 Namespace: Grasshopper.Kernel.Expressions
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator DateTime (
	GH_ScriptVariant in
)
Public Shared Narrowing Operator CType (
	in As GH_ScriptVariant
) As DateTime
Parameters
in
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: DateTime
See Also
Reference
GH_ScriptVariant Class
Explicit Overload
Grasshopper.Kernel.Expressions Namespace