Grasshopper API
ModelContentName Implicit Conversion (ModelContentName to String)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator string (
	ModelContentName value
)
Public Shared Widening Operator CType (
	value As ModelContentName
) As String
Parameters
value
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: String
See Also
Reference
ModelContentName Structure
Implicit Overload
Grasshopper.Rhinoceros Namespace