Grasshopper API
ModelContentName.Split Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string[] Split()
Public Function Split As String()
Return Value
Type: String[]
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace