Grasshopper API
GH_SubD.DuplicateSubD Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_SubD DuplicateSubD()
Public Function DuplicateSubD As GH_SubD
Return Value
Type: GH_SubD
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace