Grasshopper API
ModelViewport Constructor (ModelViewport.Attributes)
Initializes a new instance of the ModelViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelViewport(
	ModelViewport.Attributes attributes
)
Protected Friend Sub New (
	attributes As ModelViewport.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
See Also
Reference
ModelViewport Class
ModelViewport Overload
Grasshopper.Rhinoceros.Display Namespace