Grasshopper API
ModelSectionStyle Constructor (Guid)
Initializes a new instance of the ModelSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelSectionStyle Class
ModelSectionStyle Overload
Grasshopper.Rhinoceros.Drafting Namespace