Grasshopper API
GH_Predicate.Cast Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Predicate Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As GH_Predicate
Parameters
source
Type: System.Object
Return Value
Type: GH_Predicate
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace