Grasshopper API
ModelTextureMapping.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelTextureMapping Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelTextureMapping
Parameters
source
Type: System.Object
Return Value
Type: ModelTextureMapping
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace