Grasshopper API
ModelLineWidth.CastTo<T> Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool CastTo<T>(
	out T target
)
Public Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
Implements
IGH_Goo.CastTo<T>(T)
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace