Grasshopper API
GH_Format.FormatDetailViewValidity Method
 If the detail view is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatDetailViewValidity(
	DetailView val,
	string identifier = "Detail View"
)
Public Shared Function FormatDetailViewValidity (
	val As DetailView,
	Optional identifier As String = "Detail View"
) As String
Parameters
val
Type: DetailView
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the detail view is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace