Grasshopper API
ModelRenderSkylight Implicit Conversion (ModelRenderSkylight.Attributes to ModelRenderSkylight)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderSkylight (
	ModelRenderSkylight.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelRenderSkylight.Attributes
) As ModelRenderSkylight
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderSkylight.Attributes
Return Value
Type: ModelRenderSkylight
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace