Grasshopper API
ObjectDraftingColor.Value.Deconstruct Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Deconstruct(
	out ObjectPlotColorSource source,
	out ModelColor value
)
Public Sub Deconstruct (
	<OutAttribute> ByRef source As ObjectPlotColorSource,
	<OutAttribute> ByRef value As ModelColor
)
Parameters
source
Type: ObjectPlotColorSource
value
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace