Grasshopper API
GH_ClippingPlane Constructor (Guid)
 Create a new referenced clipping plane that references a clipping plane in a Rhino document with a specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ClippingPlane(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of clipping plane to reference.
See Also
Reference
GH_ClippingPlane Class
GH_ClippingPlane Overload
Grasshopper.Kernel.Types Namespace