Grasshopper API
ObjectDrafting Constructor
Initializes a new instance of the ObjectDrafting class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDrafting()
Public Sub New
See Also
Reference
ObjectDrafting Class
ObjectDrafting Overload
Grasshopper.Rhinoceros.Drafting Namespace