Grasshopper API
DisplayColorGradient.DuplicateColourGradient Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorGradient DuplicateColourGradient()
Public Function DuplicateColourGradient As DisplayColorGradient
Return Value
Type: DisplayColorGradient
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace