Grasshopper API
ModelContentParam<T>.Menu_AppendConnectRecipients Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal override void Menu_AppendConnectRecipients(
	ToolStripDropDown menu
)
Protected Friend Overrides Sub Menu_AppendConnectRecipients (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace