Grasshopper API
Param_ObjectDraftingColor.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ObjectDraftingColor value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ObjectDraftingColor
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting.Params Namespace