Grasshopper API
ObjectRenderMaterial.Value.ToString Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace