Grasshopper API
Param_ModelHatchPattern.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelHatchPattern value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelHatchPattern
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchPattern
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting.Params Namespace