Grasshopper API
Param_AnnotationTextSettings Constructor
Initializes a new instance of the Param_AnnotationTextSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_AnnotationTextSettings()
Public Sub New
See Also
Reference
Param_AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace