Grasshopper API
ModelRenderTexture Constructor (RenderTexture)
Initializes a new instance of the ModelRenderTexture class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderTexture(
	RenderTexture renderTexture
)
Public Sub New (
	renderTexture As RenderTexture
)
Parameters
renderTexture
Type: RenderTexture
See Also
Reference
ModelRenderTexture Class
ModelRenderTexture Overload
Grasshopper.Rhinoceros.Render Namespace