Grasshopper API
Param_ModelDisplayMode.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelDisplayMode value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelDisplayMode
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ModelDisplayMode
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace