Grasshopper API
ModelUnitSystem.Value.ToNonCustomUnitSystem Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public UnitSystem ToNonCustomUnitSystem(
	out double factor
)
Public Function ToNonCustomUnitSystem (
	<OutAttribute> ByRef factor As Double
) As UnitSystem
Parameters
factor
Type: System.Double
Return Value
Type: UnitSystem
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace