Grasshopper API
DisplayColorStop.Duplicate Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_Goo Duplicate()
Public Overrides Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
See Also
Reference
DisplayColorStop Class
Grasshopper.Rhinoceros.Display Namespace