Grasshopper API
GH_Convert.ToGHRadialDimension Method
 Convert data into GH_RadialDimension.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHRadialDimension(
	Object data,
	GH_Conversion conversion_level,
	ref GH_RadialDimension target
)
Public Shared Function ToGHRadialDimension (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_RadialDimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_RadialDimension
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace