Grasshopper API
Param_ModelSectionStyle Constructor
Initializes a new instance of the Param_ModelSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelSectionStyle()
Public Sub New
See Also
Reference
Param_ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting.Params Namespace