Grasshopper API
ModelTextureMapping Implicit Conversion (TextureMapping to ModelTextureMapping)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelTextureMapping (
	TextureMapping textureMapping
)
Public Shared Widening Operator CType (
	textureMapping As TextureMapping
) As ModelTextureMapping
Parameters
textureMapping
Type: TextureMapping
Return Value
Type: ModelTextureMapping
See Also
Reference
ModelTextureMapping Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace