Grasshopper API
AnnotationUnitsSettings Constructor (DimensionStyle)
Initializes a new instance of the AnnotationUnitsSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationUnitsSettings(
	DimensionStyle dimStyle
)
Public Sub New (
	dimStyle As DimensionStyle
)
Parameters
dimStyle
Type: DimensionStyle
See Also
Reference
AnnotationUnitsSettings Class
AnnotationUnitsSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace