Grasshopper API
GH_DetailView Constructor (Guid)
 Create a new referenced detail view that references a Rhino detail view with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_DetailView(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of detail view object to reference.
See Also
Reference
GH_DetailView Class
GH_DetailView Overload
Grasshopper.Kernel.Types Namespace