Grasshopper API
ModelContent.RenderItem Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual bool RenderItem(
	Graphics graphics,
	RectangleF area,
	int alpha
)
Protected Overridable Function RenderItem (
	graphics As Graphics,
	area As RectangleF,
	alpha As Integer
) As Boolean
Parameters
graphics
Type: System.Drawing.Graphics
area
Type: System.Drawing.RectangleF
alpha
Type: System.Int32
Return Value
Type: Boolean
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace