Grasshopper API
ModelEarthAnchorPoint.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelEarthAnchorPoint.Attributes ToAttributes()
Public Function ToAttributes As ModelEarthAnchorPoint.Attributes
Return Value
Type: ModelEarthAnchorPoint.Attributes
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace