Grasshopper API
GH_Convert.ToExtrusion Method
 Convert data into Rhino.Geometry.Brep.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToExtrusion(
	Object data,
	ref Extrusion rc,
	GH_Conversion conversion_level
)
Public Shared Function ToExtrusion (
	data As Object,
	ByRef rc As Extrusion,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Extrusion
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace