Grasshopper API
ObjectDraftingLinetype Constructor (ObjectDraftingLinetype.Value)
Initializes a new instance of the ObjectDraftingLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLinetype(
	ObjectDraftingLinetype.Value value
)
Public Sub New (
	value As ObjectDraftingLinetype.Value
)
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value
See Also
Reference
ObjectDraftingLinetype Class
ObjectDraftingLinetype Overload
Grasshopper.Rhinoceros.Drafting Namespace