Grasshopper API
ModelRenderMaterial Constructor (ModelRenderMaterial.Attributes)
Initializes a new instance of the ModelRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial(
	ModelRenderMaterial.Attributes attributes
)
Public Sub New (
	attributes As ModelRenderMaterial.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderMaterial.Attributes
See Also
Reference
ModelRenderMaterial Class
ModelRenderMaterial Overload
Grasshopper.Rhinoceros.Render Namespace