Grasshopper API
ClippingDrawingSettings.Attributes Constructor
Initializes a new instance of the ClippingDrawingSettings.Attributes class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ClippingDrawingSettings.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace