Grasshopper API
AnnotationTextSettings Constructor (AnnotationTextSettings.Attributes)
Initializes a new instance of the AnnotationTextSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationTextSettings(
	AnnotationTextSettings.Attributes attributes
)
Public Sub New (
	attributes As AnnotationTextSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes
See Also
Reference
AnnotationTextSettings Class
AnnotationTextSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace