Grasshopper API
ModelLayer.Cast Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLayer Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelLayer
Parameters
source
Type: System.Object
Return Value
Type: ModelLayer
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace