Grasshopper API
ObjectDisplayColor.Value.CompareTo Method (ObjectDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ObjectDisplayColor.Value other
)
Public Function CompareTo (
	other As ObjectDisplayColor.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ObjectDisplayColor.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Display Namespace