Grasshopper API
Param_AnnotationLeaderSettings.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationLeaderSettings PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationLeaderSettings
Parameters
data
Type: System.Object
Return Value
Type: AnnotationLeaderSettings
See Also
Reference
Param_AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace