Grasshopper API
GH_Convert.ToPointCloud Method
 Convert data into Rhino.Geometry.PointCloud.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToPointCloud(
	Object data,
	ref PointCloud rc,
	GH_Conversion conversion_level
)
Public Shared Function ToPointCloud (
	data As Object,
	ByRef rc As PointCloud,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: PointCloud
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace