Grasshopper API
ModelNamedView Implicit Conversion (ViewInfo to ModelNamedView)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelNamedView (
	ViewInfo viewportInfo
)
Public Shared Widening Operator CType (
	viewportInfo As ViewInfo
) As ModelNamedView
Parameters
viewportInfo
Type: ViewInfo
Return Value
Type: ModelNamedView
See Also
Reference
ModelNamedView Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace