Grasshopper API
GH_Extrusion.GH_ExtrusionProxy.FromString Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool FromString(
	string in
)
Public Overrides Function FromString (
	in As String
) As Boolean
Parameters
in
Type: System.String
Return Value
Type: Boolean
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace