Grasshopper API
ModelSpaceViewport Implicit Conversion (RhinoViewport to ModelSpaceViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelSpaceViewport (
	RhinoViewport viewport
)
Public Shared Widening Operator CType (
	viewport As RhinoViewport
) As ModelSpaceViewport
Parameters
viewport
Type: RhinoViewport
Return Value
Type: ModelSpaceViewport
See Also
Reference
ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display Namespace