Grasshopper API
ModelData.TooltipString Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual string TooltipString()
Public Overridable Function TooltipString As String
Return Value
Type: String
Implements
IGH_Goo.ToString()
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace