Grasshopper API
ModelRenderSun.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToDetails()
Public Overrides Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace