Grasshopper API
GH_Convert.ToClippingPlane_Secondary Method
 Attempts to convert other data types into an Rhino.Geometry.ClippingPlaneSurface. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToClippingPlane_Secondary(
	Object data,
	ref ClippingPlaneSurface rc
)
Public Shared Function ToClippingPlane_Secondary (
	data As Object,
	ByRef rc As ClippingPlaneSurface
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: ClippingPlaneSurface
Return Value
Type: Boolean
An Rhino.Geometry.ClippingPlaneSurface instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace