Grasshopper API
Param_MatchText.Menu_CustomMultiValueItem Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ToolStripMenuItem Menu_CustomMultiValueItem()
Protected Overrides Function Menu_CustomMultiValueItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace