Grasshopper API
Param_DisplayColorGradient Constructor
Initializes a new instance of the Param_DisplayColorGradient class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_DisplayColorGradient()
Public Sub New
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace