Grasshopper API
Param_ModelLineWidth Constructor
Initializes a new instance of the Param_ModelLineWidth class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelLineWidth()
Public Sub New
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace