Grasshopper API
GH_Extrusion.AppendRenderGeometry Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void AppendRenderGeometry(
	GH_RenderArgs args,
	RenderMaterial materialHint
)
Public Sub AppendRenderGeometry (
	args As GH_RenderArgs,
	materialHint As RenderMaterial
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
materialHint
Type: RenderMaterial
Implements
IGH_RenderAwareData.AppendRenderGeometry(GH_RenderArgs, RenderMaterial)
See Also
Reference
GH_Extrusion Class
Grasshopper.Kernel.Types Namespace