Grasshopper API
ModelDetailViewport Constructor (ModelDetailViewport.Attributes)
Initializes a new instance of the ModelDetailViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDetailViewport(
	ModelDetailViewport.Attributes attributes
)
Public Sub New (
	attributes As ModelDetailViewport.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelDetailViewport.Attributes
See Also
Reference
ModelDetailViewport Class
ModelDetailViewport Overload
Grasshopper.Rhinoceros.Display Namespace