Grasshopper API
ModelData.Write Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual bool Write(
	GH_IWriter writer
)
Protected Overridable Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace