Grasshopper API
Param_ModelObject.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelObject PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelObject
Parameters
data
Type: System.Object
Return Value
Type: ModelObject
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace