Grasshopper API
ObjectDraftingLineWidth.Value Implicit Conversion (ObjectDraftingLineWidth.Value to ObjectPlotWeightSource)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectPlotWeightSource (
	ObjectDraftingLineWidth.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDraftingLineWidth.Value
) As ObjectPlotWeightSource
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value
Return Value
Type: ObjectPlotWeightSource
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace