Grasshopper API
AnnotationLeaderSettings Constructor (AnnotationLeaderSettings.Attributes)
Initializes a new instance of the AnnotationLeaderSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationLeaderSettings(
	AnnotationLeaderSettings.Attributes attributes
)
Public Sub New (
	attributes As AnnotationLeaderSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes
See Also
Reference
AnnotationLeaderSettings Class
AnnotationLeaderSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace