Grasshopper API
Param_ModelConstructionPlane.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelConstructionPlane value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelConstructionPlane
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ModelConstructionPlane
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace