Grasshopper API
GH_GraphicsUtil.RenderColourIcon Method (Graphics, Rectangle, Color)
Note: This API is now obsolete.
 Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute("Use RenderColourIcon(Graphics, Rectangle, Color, Single) instead.")]
public static void RenderColourIcon(
	Graphics g,
	Rectangle rec,
	Color colour
)
<ObsoleteAttribute("Use RenderColourIcon(Graphics, Rectangle, Color, Single) instead.")>
Public Shared Sub RenderColourIcon (
	g As Graphics,
	rec As Rectangle,
	colour As Color
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
rec
Type: System.Drawing.Rectangle
Rectangle describing icon dimensions.
colour
Type: System.Drawing.Color
Colour for icon.
See Also
Reference
GH_GraphicsUtil Class
RenderColourIcon Overload
Grasshopper.GUI Namespace