Grasshopper API
ObjectDraftingColor Constructor
Initializes a new instance of the ObjectDraftingColor class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingColor()
Public Sub New
See Also
Reference
ObjectDraftingColor Class
ObjectDraftingColor Overload
Grasshopper.Rhinoceros.Drafting Namespace