Grasshopper API
GH_ScriptVariant.OnesComplement Operator
 Namespace: Grasshopper.Kernel.Expressions
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_ScriptVariant operator ~(
	GH_ScriptVariant A
)
Public Shared Operator ~ (
	A As GH_ScriptVariant
) As GH_ScriptVariant
Parameters
A
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: GH_ScriptVariant
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace