Grasshopper API
ModelData.WriteChunk<T> Method (GH_IWriter, String, Nullable<T>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void WriteChunk<T>(
	GH_IWriter writer,
	string name,
	in T? serializable
)
where T : struct, new(), GH_ISerializable
Protected Friend Shared Sub WriteChunk(Of T As {Structure, New, GH_ISerializable}) (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As T?
)
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: System.Nullable<T>
Type Parameters
T
See Also
Reference
ModelData Class
WriteChunk Overload
Grasshopper.Rhinoceros Namespace