Grasshopper API
GH_Dimension Constructor (Dimension)
 Create a duplicate of an existing dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_Dimension(
	Dimension dimension
)
Protected Sub New (
	dimension As Dimension
)
Parameters
dimension
Type: Dimension
Dimension to duplicate
See Also
Reference
GH_Dimension Class
GH_Dimension Overload
Grasshopper.Kernel.Types Namespace