Grasshopper API
GH_DetailView.DuplicateGeometry Method
 Create a duplicate of this hatch.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_GeometricGoo DuplicateGeometry()
Public Overrides Function DuplicateGeometry As IGH_GeometricGoo
Return Value
Type: IGH_GeometricGoo
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace