Grasshopper API
Param_ModelUnitSystem.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelUnitSystem PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelUnitSystem
Parameters
data
Type: System.Object
Return Value
Type: ModelUnitSystem
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace