Grasshopper API
Param_ModelStandardViewport.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelStandardViewport value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelStandardViewport
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ModelStandardViewport
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelStandardViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace