Grasshopper API
GH_Dimension.GH_DimensionProxy.Construct Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_Dimension.GH_DimensionProxy Class
Grasshopper.Kernel.Types Namespace