Grasshopper API
AnnotationLeaderSettings Constructor (DimensionStyle)
Initializes a new instance of the AnnotationLeaderSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationLeaderSettings(
	DimensionStyle dimStyle
)
Public Sub New (
	dimStyle As DimensionStyle
)
Parameters
dimStyle
Type: DimensionStyle
See Also
Reference
AnnotationLeaderSettings Class
AnnotationLeaderSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace