Grasshopper API
ModelUserText.TryGetValue Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool TryGetValue(
	string key,
	out string value
)
Public Function TryGetValue (
	key As String,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
key
Type: System.String
value
Type: System.String
Return Value
Type: Boolean
Implements
IReadOnlyDictionary<TKey, TValue>.TryGetValue(TKey, TValue)
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace