Grasshopper API
ObjectDraftingLineWidth.Value Implicit Conversion (ObjectDraftingLineWidth.Value to Double)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator double (
	ObjectDraftingLineWidth.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDraftingLineWidth.Value
) As Double
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value
Return Value
Type: Double
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace