Grasshopper API
Param_ObjectDisplayMode Constructor
Initializes a new instance of the Param_ObjectDisplayMode class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectDisplayMode()
Public Sub New
See Also
Reference
Param_ObjectDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace