Grasshopper API
ModelRenderMaterial.Attributes.ToModelData Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ModelData ToModelData()
Public Overrides Function ToModelData As ModelData
Return Value
Type: ModelData
See Also
Reference
ModelRenderMaterial.Attributes Class
Grasshopper.Rhinoceros.Render Namespace