Grasshopper API
ModelColor.Inequality Operator (Color, ModelColor)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator !=(
	Color left,
	ModelColor right
)
Public Shared Operator <> (
	left As Color,
	right As ModelColor
) As Boolean
Parameters
left
Type: System.Drawing.Color
right
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: Boolean
See Also
Reference
ModelColor Structure
Inequality Overload
Grasshopper.Rhinoceros Namespace