Grasshopper API
GH_AnnotationBase.CreateDisplay Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationBase CreateDisplay(
	AnnotationBase annotation
)
Public Shared Function CreateDisplay (
	annotation As AnnotationBase
) As AnnotationBase
Parameters
annotation
Type: AnnotationBase
Return Value
Type: AnnotationBase
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace