Grasshopper API
ModelUnitSystem.Value.Inequality Operator
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator !=(
	ModelUnitSystem.Value left,
	ModelUnitSystem.Value right
)
Public Shared Operator <> (
	left As ModelUnitSystem.Value,
	right As ModelUnitSystem.Value
) As Boolean
Parameters
left
Type: Grasshopper.Rhinoceros.ModelUnitSystem.Value
right
Type: Grasshopper.Rhinoceros.ModelUnitSystem.Value
Return Value
Type: Boolean
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace