Grasshopper API
GH_AngularDimension Constructor (AngularDimension)
 Create a duplicate of an existing angular dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AngularDimension(
	AngularDimension dimension
)
Public Sub New (
	dimension As AngularDimension
)
Parameters
dimension
Type: AngularDimension
Angular dimension to duplicate
See Also
Reference
GH_AngularDimension Class
GH_AngularDimension Overload
Grasshopper.Kernel.Types Namespace