Grasshopper API
DisplayColorGradient Constructor (ColorGradient)
Initializes a new instance of the DisplayColorGradient class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorGradient(
	ColorGradient colour
)
Public Sub New (
	colour As ColorGradient
)
Parameters
colour
Type: ColorGradient
See Also
Reference
DisplayColorGradient Class
DisplayColorGradient Overload
Grasshopper.Rhinoceros.Display Namespace