Grasshopper API
Param_ModelMeshingParameters Constructor
Initializes a new instance of the Param_ModelMeshingParameters class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelMeshingParameters()
Public Sub New
See Also
Reference
Param_ModelMeshingParameters Class
Grasshopper.Rhinoceros.Params Namespace