Grasshopper API
GH_Format.FormatDetailView Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatDetailView(
	GH_DetailView data
)
Public Shared Function FormatDetailView (
	data As GH_DetailView
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_DetailView
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace