Grasshopper API
ModelUserText.UpdateRange Method (IEnumerable<String>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText UpdateRange(
	IEnumerable<string> keys
)
Public Function UpdateRange (
	keys As IEnumerable(Of String)
) As ModelUserText
Parameters
keys
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
UpdateRange Overload
Grasshopper.Rhinoceros Namespace