Grasshopper API
ObjectDisplay.Attributes.Equals Method (ObjectDisplay.Attributes)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectDisplay.Attributes other
)
Public Function Equals (
	other As ObjectDisplay.Attributes
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ObjectDisplay.Attributes
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectDisplay.Attributes Structure
Equals Overload
Grasshopper.Rhinoceros.Display Namespace