Grasshopper API
ModelDisplayMode Constructor (ModelDisplayMode.Attributes)
Initializes a new instance of the ModelDisplayMode class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode(
	ModelDisplayMode.Attributes attributes
)
Public Sub New (
	attributes As ModelDisplayMode.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelDisplayMode.Attributes
See Also
Reference
ModelDisplayMode Class
ModelDisplayMode Overload
Grasshopper.Rhinoceros.Display Namespace