Grasshopper API
DisplayColorStop Constructor
 Blank constructor
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorStop()
Public Sub New
See Also
Reference
DisplayColorStop Class
DisplayColorStop Overload
Grasshopper.Rhinoceros.Display Namespace