Grasshopper API
ModelDisplayMode.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode.Attributes ToAttributes()
Public Function ToAttributes As ModelDisplayMode.Attributes
Return Value
Type: ModelDisplayMode.Attributes
See Also
Reference
ModelDisplayMode Class
Grasshopper.Rhinoceros.Display Namespace