Grasshopper API
Param_ModelUnitSystem Constructor
Initializes a new instance of the Param_ModelUnitSystem class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelUnitSystem()
Public Sub New
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace