Grasshopper API
GH_Hatch Constructor
 Default constructor, creates an invalid hatch.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Hatch()
Public Sub New
See Also
Reference
GH_Hatch Class
GH_Hatch Overload
Grasshopper.Kernel.Types Namespace