Grasshopper API
Param_Predicate.AppendAdditionalMenuItems Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void AppendAdditionalMenuItems(
	ToolStripDropDown menu
)
Public Overrides Sub AppendAdditionalMenuItems (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_Predicate Class
Grasshopper.Kernel.Parameters Namespace