Grasshopper API
GH_TaskCapableComponent<T>.AppendAdditionalMenuItems Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void AppendAdditionalMenuItems(
	ToolStripDropDown menu
)
Public Overrides Sub AppendAdditionalMenuItems (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace