Grasshopper API
GH_TextDot.ScriptVariable Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Object ScriptVariable()
Public Overrides Function ScriptVariable As Object
Return Value
Type: Object
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace