Grasshopper API
GH_Format.FormatPointCloud Method (PointCloud)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatPointCloud(
	PointCloud data
)
Public Shared Function FormatPointCloud (
	data As PointCloud
) As String
Parameters
data
Type: PointCloud
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatPointCloud Overload
Grasshopper.Kernel Namespace