Grasshopper API
Utility.SetDefaultTolerances Method
 Utility function to set absolute and angle tolerance fields.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void SetDefaultTolerances(
	double absoluteTolerance,
	double angleToleranceDegrees
)
Public Shared Sub SetDefaultTolerances (
	absoluteTolerance As Double,
	angleToleranceDegrees As Double
)
Parameters
absoluteTolerance
Type: System.Double
Value to set model absolute tolerance
angleToleranceDegrees
Type: System.Double
Value to set model angle tolerance in degrees
See Also
Reference
Utility Class
Grasshopper Namespace