Grasshopper API
GH_Predicate.Duplicate Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IGH_Goo Duplicate()
Public Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
Implements
IGH_Goo.Duplicate()
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace