Grasshopper API
ObjectDraftingLineWidth.Value Constructor (Double)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	double value
)
Public Sub New (
	value As Double
)
Parameters
value
Type: System.Double
See Also
Reference
ObjectDraftingLineWidth.Value Structure
ObjectDraftingLineWidth.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace