Grasshopper API
ModelRenderEnvironment Constructor
Initializes a new instance of the ModelRenderEnvironment class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderEnvironment()
Public Sub New
See Also
Reference
ModelRenderEnvironment Class
ModelRenderEnvironment Overload
Grasshopper.Rhinoceros.Render Namespace