Grasshopper API
ObjectDisplayColor.Value.Equals Method (ObjectDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectDisplayColor.Value other
)
Public Function Equals (
	other As ObjectDisplayColor.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectDisplayColor.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Display Namespace