Grasshopper API
ModelData.ToDetails Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ToDetails()
Public Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace