Grasshopper API
ObjectVisibility Implicit Conversion (ObjectVisibility.Attributes to ObjectVisibility)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectVisibility (
	ObjectVisibility.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ObjectVisibility.Attributes
) As ObjectVisibility
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ObjectVisibility.Attributes
Return Value
Type: ObjectVisibility
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace