Grasshopper API
ModelUserText Constructor
Initializes a new instance of the ModelUserText class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText(
	IEnumerable<KeyValuePair<string, string>> source
)
Public Sub New (
	source As IEnumerable(Of KeyValuePair(Of String, String))
)
Parameters
source
Type: System.Collections.Generic.IEnumerable<KeyValuePair<String, String>>
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace