Grasshopper API
ModelDetailViewport.Attributes.ToModelData Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ModelData ToModelData()
Public Overrides Function ToModelData As ModelData
Return Value
Type: ModelData
See Also
Reference
ModelDetailViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace