Grasshopper API
ModelComponentContent Constructor (ModelComponentContent.Attributes, Guid)
Initializes a new instance of the ModelComponentContent class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelComponentContent(
	ModelComponentContent.Attributes attributes,
	Guid id
)
Protected Friend Sub New (
	attributes As ModelComponentContent.Attributes,
	id As Guid
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.ModelComponentContent.Attributes
id
Type: System.Guid
See Also
Reference
ModelComponentContent Class
ModelComponentContent Overload
Grasshopper.Rhinoceros Namespace