Grasshopper API
ModelFont Implicit Conversion (String to ModelFont)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelFont (
	string familyName
)
Public Shared Widening Operator CType (
	familyName As String
) As ModelFont
Parameters
familyName
Type: System.String
Return Value
Type: ModelFont
See Also
Reference
ModelFont Class
Implicit Overload
Grasshopper.Rhinoceros Namespace