Grasshopper API
ObjectRender Implicit Conversion (ObjectRender.Attributes to ObjectRender)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectRender (
	ObjectRender.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ObjectRender.Attributes
) As ObjectRender
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ObjectRender.Attributes
Return Value
Type: ObjectRender
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace