Grasshopper API
ModelData Constructor
Initializes a new instance of the ModelData class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelData(
	ModelData.Attributes attributes
)
Protected Friend Sub New (
	attributes As ModelData.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.ModelData.Attributes
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace