Grasshopper API
GH_ClippingPlane.ClearCaches Method
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the clipping plane is referenced, the local instance of the clipping plane is erased.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace