Grasshopper API
ItemDisplayColor.Value.Equals Method (ItemDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ItemDisplayColor.Value other
)
Public Function Equals (
	other As ItemDisplayColor.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ItemDisplayColor.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Display Namespace