Grasshopper API
ModelRenderMaterial Constructor
Initializes a new instance of the ModelRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial()
Public Sub New
See Also
Reference
ModelRenderMaterial Class
ModelRenderMaterial Overload
Grasshopper.Rhinoceros.Render Namespace