Grasshopper API
GH_PointCloud.DuplicatePointCloud Method
 Create a duplicate of this curve.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PointCloud DuplicatePointCloud()
Public Function DuplicatePointCloud As GH_PointCloud
Return Value
Type: GH_PointCloud
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace