Grasshopper API
ModelColor.Equality Operator (ModelColor, Color)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator ==(
	ModelColor left,
	Color right
)
Public Shared Operator = (
	left As ModelColor,
	right As Color
) As Boolean
Parameters
left
Type: Grasshopper.Rhinoceros.ModelColor
right
Type: System.Drawing.Color
Return Value
Type: Boolean
See Also
Reference
ModelColor Structure
Equality Overload
Grasshopper.Rhinoceros Namespace