Grasshopper API
ModelRenderMaterial Constructor (Guid)
Initializes a new instance of the ModelRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelRenderMaterial Class
ModelRenderMaterial Overload
Grasshopper.Rhinoceros.Render Namespace