Grasshopper API
Param_ObjectDisplayMode.Menu_AppendPromptOne Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void Menu_AppendPromptOne(
	ToolStripDropDown menu
)
Protected Overrides Sub Menu_AppendPromptOne (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_ObjectDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace