Grasshopper API
GH_Format.FormatAnnotationValidity Method
 If the annotation is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatAnnotationValidity(
	AnnotationBase val,
	string identifier = "Annotation"
)
Public Shared Function FormatAnnotationValidity (
	val As AnnotationBase,
	Optional identifier As String = "Annotation"
) As String
Parameters
val
Type: AnnotationBase
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the annotation is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace