Grasshopper API
Param_ModelLineWidth.InstantiateT Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelLineWidth InstantiateT()
Protected Overrides Function InstantiateT As ModelLineWidth
Return Value
Type: ModelLineWidth
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace