Grasshopper API
GH_Light.ClearCaches Method
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the light is referenced, the local instance of the light is erased.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace