Grasshopper API
AnnotationArrowSettings.Attributes Constructor
Initializes a new instance of the AnnotationArrowSettings.Attributes class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace