Grasshopper API
GH_TextEntity.ToString Method
 Format the text entity using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_TextEntity Class
Grasshopper.Kernel.Types Namespace