Grasshopper API
ModelDetailViewport Implicit Conversion (ModelDetailViewport.Attributes to ModelDetailViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelDetailViewport (
	ModelDetailViewport.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelDetailViewport.Attributes
) As ModelDetailViewport
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelDetailViewport.Attributes
Return Value
Type: ModelDetailViewport
See Also
Reference
ModelDetailViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace