Grasshopper API
AnnotationLeaderSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationLeaderSettings.Attributes ToAttributes()
Public Function ToAttributes As AnnotationLeaderSettings.Attributes
Return Value
Type: AnnotationLeaderSettings.Attributes
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace