Grasshopper API
Param_ModelPageViewport.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelPageViewport> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelPageViewport)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelPageViewport>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelPageViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace