Grasshopper API
Param_ModelView.BakeGeometry Method (RhinoDoc, ObjectAttributes, List<Guid>)
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void BakeGeometry(
	RhinoDoc doc,
	ObjectAttributes att,
	List<Guid> obj_ids
)
Public Sub BakeGeometry (
	doc As RhinoDoc,
	att As ObjectAttributes,
	obj_ids As List(Of Guid)
)
Parameters
doc
Type: RhinoDoc
att
Type: ObjectAttributes
obj_ids
Type: System.Collections.Generic.List<Guid>
Implements
IGH_BakeAwareObject.BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
See Also
Reference
Param_ModelView Class
BakeGeometry Overload
Grasshopper.Rhinoceros.Display.Params Namespace