Grasshopper API
GH_ScriptVariant Implicit Conversion (Boolean to GH_ScriptVariant)
 Namespace: Grasshopper.Kernel.Expressions
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator GH_ScriptVariant (
	bool in
)
Public Shared Widening Operator CType (
	in As Boolean
) As GH_ScriptVariant
Parameters
in
Type: System.Boolean
Return Value
Type: GH_ScriptVariant
See Also
Reference
GH_ScriptVariant Class
Implicit Overload
Grasshopper.Kernel.Expressions Namespace