Grasshopper API
ObjectDraftingColor Implicit Conversion (ObjectDraftingColor.Value to ObjectDraftingColor)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingColor (
	ObjectDraftingColor.Value data
)
Public Shared Widening Operator CType (
	data As ObjectDraftingColor.Value
) As ObjectDraftingColor
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value
Return Value
Type: ObjectDraftingColor
See Also
Reference
ObjectDraftingColor Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace