Grasshopper API
GH_Param<T>.ConnectNewObject Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal bool ConnectNewObject(
	IGH_DocumentObject obj
)
Protected Friend Function ConnectNewObject (
	obj As IGH_DocumentObject
) As Boolean
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Return Value
Type: Boolean
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace