Grasshopper API
ModelUnitSystem.Value Constructor (UnitSystem, String)
Initializes a new instance of the ModelUnitSystem.Value class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	UnitSystem unitSystem,
	string name = null
)
Public Sub New (
	unitSystem As UnitSystem,
	Optional name As String = Nothing
)
Parameters
unitSystem
Type: UnitSystem
name (Optional)
Type: System.String
See Also
Reference
ModelUnitSystem.Value Structure
ModelUnitSystem.Value Overload
Grasshopper.Rhinoceros Namespace