Grasshopper API
Param_RadialDimension.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_RadialDimension value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_RadialDimension
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_RadialDimension
Return Value
Type: GH_GetterResult
See Also
Reference
Param_RadialDimension Class
Grasshopper.Kernel.Parameters Namespace