Grasshopper API
AnnotationArrow Constructor (AnnotationArrow.Attributes)
Initializes a new instance of the AnnotationArrow class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrow(
	AnnotationArrow.Attributes attributes
)
Public Sub New (
	attributes As AnnotationArrow.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationArrow.Attributes
See Also
Reference
AnnotationArrow Class
AnnotationArrow Overload
Grasshopper.Rhinoceros.Annotations Namespace