Grasshopper API
ObjectDraftingColor.Value Constructor (ObjectPlotColorSource, ModelColor)
Initializes a new instance of the ObjectDraftingColor.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectPlotColorSource source,
	ModelColor color
)
Public Sub New (
	source As ObjectPlotColorSource,
	color As ModelColor
)
Parameters
source
Type: ObjectPlotColorSource
color
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ObjectDraftingColor.Value Structure
ObjectDraftingColor.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace