Grasshopper API
ModelUserText.BitwiseAnd Operator (ModelUserText, IEnumerable<KeyValuePair<String, String>>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUserText operator &(
	ModelUserText left,
	IEnumerable<KeyValuePair<string, string>> right
)
Public Shared Operator And (
	left As ModelUserText,
	right As IEnumerable(Of KeyValuePair(Of String, String))
) As ModelUserText
Parameters
left
Type: Grasshopper.Rhinoceros.ModelUserText
right
Type: System.Collections.Generic.IEnumerable<KeyValuePair<String, String>>
Return Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
BitwiseAnd Overload
Grasshopper.Rhinoceros Namespace