Grasshopper API
Param_MatchText.AppendAdditionalMenuItems Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void AppendAdditionalMenuItems(
	ToolStripDropDown menu
)
Public Overrides Sub AppendAdditionalMenuItems (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace