Grasshopper API
ModelData.Write<T> Method (GH_IWriter, String, IReadOnlyList<T>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected static void Write<T>(
	GH_IWriter writer,
	string name,
	in IReadOnlyList<T> serializables
)
where T : GH_ISerializable
Protected Shared Sub Write(Of T As GH_ISerializable) (
	writer As GH_IWriter,
	name As String,
	ByRef serializables As IReadOnlyList(Of T)
)
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializables
Type: System.Collections.Generic.IReadOnlyList<T>
Type Parameters
T
See Also
Reference
ModelData Class
Write Overload
Grasshopper.Rhinoceros Namespace