Grasshopper API
Param_ModelFont.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelFont value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelFont
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.ModelFont
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelFont Class
Grasshopper.Rhinoceros.Params Namespace