Grasshopper API
ModelTextureMapping.DrawViewportMeshes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportMeshes(
	GH_PreviewMeshArgs args
)
Public Sub DrawViewportMeshes (
	args As GH_PreviewMeshArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewMeshArgs
Implements
IGH_PreviewData.DrawViewportMeshes(GH_PreviewMeshArgs)
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace