Grasshopper API
ModelObject.ClearCaches Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected void ClearCaches()
Protected Sub ClearCaches
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace