Grasshopper API
GH_Light Constructor (Light)
 Create a duplicate of an existing light.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Light(
	Light light
)
Public Sub New (
	light As Light
)
Parameters
light
Type: Light
Light to duplicate
See Also
Reference
GH_Light Class
GH_Light Overload
Grasshopper.Kernel.Types Namespace