Grasshopper API
ModelContent Constructor
Initializes a new instance of the ModelContent class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelContent(
	ModelContent.Attributes attributes
)
Protected Friend Sub New (
	attributes As ModelContent.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.ModelContent.Attributes
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace