Grasshopper API
AnnotationUnitsSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationUnitsSettings.Attributes ToAttributes()
Public Function ToAttributes As AnnotationUnitsSettings.Attributes
Return Value
Type: AnnotationUnitsSettings.Attributes
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace