Grasshopper API
AnnotationUnitsSettings Implicit Conversion (AnnotationUnitsSettings.Attributes to AnnotationUnitsSettings)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationUnitsSettings (
	AnnotationUnitsSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As AnnotationUnitsSettings.Attributes
) As AnnotationUnitsSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes
Return Value
Type: AnnotationUnitsSettings
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace