Grasshopper API
Param_ModelConstructionPlane.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelConstructionPlane> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelConstructionPlane)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelConstructionPlane>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace