Grasshopper API
AnnotationDimensionSettings Constructor (DimensionStyle)
Initializes a new instance of the AnnotationDimensionSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDimensionSettings(
	DimensionStyle dimStyle
)
Public Sub New (
	dimStyle As DimensionStyle
)
Parameters
dimStyle
Type: DimensionStyle
See Also
Reference
AnnotationDimensionSettings Class
AnnotationDimensionSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace