Grasshopper API
Param_ModelFont Constructor
Initializes a new instance of the Param_ModelFont class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelFont()
Public Sub New
See Also
Reference
Param_ModelFont Class
Grasshopper.Rhinoceros.Params Namespace