Grasshopper API
ModelRenderEnvironment Implicit Conversion (ModelRenderEnvironment.Attributes to ModelRenderEnvironment)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderEnvironment (
	ModelRenderEnvironment.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelRenderEnvironment.Attributes
) As ModelRenderEnvironment
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderEnvironment.Attributes
Return Value
Type: ModelRenderEnvironment
See Also
Reference
ModelRenderEnvironment Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace