Grasshopper API
Param_AnnotationArrowSettings.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationArrowSettings PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationArrowSettings
Parameters
data
Type: System.Object
Return Value
Type: AnnotationArrowSettings
See Also
Reference
Param_AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace