Grasshopper API
ObjectRender Constructor
Initializes a new instance of the ObjectRender class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRender()
Public Sub New
See Also
Reference
ObjectRender Class
ObjectRender Overload
Grasshopper.Rhinoceros.Render Namespace