Grasshopper API
ModelLayer Constructor (Guid)
Initializes a new instance of the ModelLayer class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLayer(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelLayer Class
ModelLayer Overload
Grasshopper.Rhinoceros.Model Namespace