Grasshopper API
ModelFont Constructor (String)
Initializes a new instance of the ModelFont class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelFont(
	string familyName
)
Public Sub New (
	familyName As String
)
Parameters
familyName
Type: System.String
See Also
Reference
ModelFont Class
ModelFont Overload
Grasshopper.Rhinoceros Namespace