Grasshopper API
Param_DisplayColorGradient.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<DisplayColorGradient> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of DisplayColorGradient)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<DisplayColorGradient>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace