Grasshopper API
Param_EarthAnchorPoint.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelEarthAnchorPoint PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelEarthAnchorPoint
Parameters
data
Type: System.Object
Return Value
Type: ModelEarthAnchorPoint
See Also
Reference
Param_EarthAnchorPoint Class
Grasshopper.Rhinoceros.Model.Params Namespace