Grasshopper API
ModelLayer Constructor (Layer)
Initializes a new instance of the ModelLayer class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLayer(
	Layer layer
)
Public Sub New (
	layer As Layer
)
Parameters
layer
Type: Layer
See Also
Reference
ModelLayer Class
ModelLayer Overload
Grasshopper.Rhinoceros.Model Namespace