Grasshopper API
GH_Centermark.ToString Method
 Format the centermark using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Centermark Class
Grasshopper.Kernel.Types Namespace