Grasshopper API
GH_Predicate Constructor
Initializes a new instance of the GH_Predicate class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Predicate(
	Predicate<Object> predicate,
	string description
)
Public Sub New (
	predicate As Predicate(Of Object),
	description As String
)
Parameters
predicate
Type: System.Predicate<Object>
description
Type: System.String
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace