Grasshopper API
ModelLinetype Constructor (ModelLinetype.Attributes)
Initializes a new instance of the ModelLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype(
	ModelLinetype.Attributes attributes
)
Public Sub New (
	attributes As ModelLinetype.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes
See Also
Reference
ModelLinetype Class
ModelLinetype Overload
Grasshopper.Rhinoceros.Drafting Namespace