Grasshopper API
ChildSlotNameComparer.Compare Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int Compare(
	RenderContent x,
	RenderContent y
)
Public Function Compare (
	x As RenderContent,
	y As RenderContent
) As Integer
Parameters
x
Type: RenderContent
y
Type: RenderContent
Return Value
Type: Int32
Implements
IComparer<T>.Compare(T, T)
See Also
Reference
ChildSlotNameComparer Class
Grasshopper.Rhinoceros.Render Namespace