Grasshopper API
Param_ModelAttributeKey.InstantiateT Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_String InstantiateT()
Protected Overrides Function InstantiateT As GH_String
Return Value
Type: GH_String
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace