Grasshopper API
ObjectSectionStyle Implicit Conversion (ObjectSectionStyle.Value to ObjectSectionStyle)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectSectionStyle (
	ObjectSectionStyle.Value data
)
Public Shared Widening Operator CType (
	data As ObjectSectionStyle.Value
) As ObjectSectionStyle
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value
Return Value
Type: ObjectSectionStyle
See Also
Reference
ObjectSectionStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace