Grasshopper API
GH_Document.DestroyPreviewCaches Method
 Wipe all caches for Viewport Preview logic.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DestroyPreviewCaches()
Public Sub DestroyPreviewCaches
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace