Grasshopper API
ModelAnnotationStyle Constructor (DimensionStyle)
Initializes a new instance of the ModelAnnotationStyle class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle(
	DimensionStyle dimStyle
)
Public Sub New (
	dimStyle As DimensionStyle
)
Parameters
dimStyle
Type: DimensionStyle
See Also
Reference
ModelAnnotationStyle Class
ModelAnnotationStyle Overload
Grasshopper.Rhinoceros.Annotations Namespace