Grasshopper API
Instances.RedrawAll Method
 Forces a redraw of both the active canvas and the Rhino viewports on the active document.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void RedrawAll()
Public Shared Sub RedrawAll
See Also
Reference
Instances Class
Grasshopper Namespace