Grasshopper API
GH_RhinoScriptInterface.LoadedPluginGuids Method
 Gets an array of the IDs of all loaded plugins.
 Namespace: Grasshopper.Plugin
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Guid[] LoadedPluginGuids()
Public Function LoadedPluginGuids As Guid()
Return Value
Type: Guid[]
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace