Grasshopper API
ObjectRenderMaterial Constructor
Initializes a new instance of the ObjectRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRenderMaterial()
Public Sub New
See Also
Reference
ObjectRenderMaterial Class
ObjectRenderMaterial Overload
Grasshopper.Rhinoceros.Render Namespace