Grasshopper API
GH_TextDot.GetBoundingBox Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override BoundingBox GetBoundingBox(
	Transform xform
)
Public Overrides Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Transform
Return Value
Type: BoundingBox
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace