Grasshopper API
ClippingArrow Implicit Conversion (ClippingArrow.Attributes to ClippingArrow)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ClippingArrow (
	ClippingArrow.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ClippingArrow.Attributes
) As ClippingArrow
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.ClippingArrow.Attributes
Return Value
Type: ClippingArrow
See Also
Reference
ClippingArrow Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace