Grasshopper API
ObjectDrafting.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDrafting Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectDrafting
Parameters
source
Type: System.Object
Return Value
Type: ObjectDrafting
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace