Grasshopper API
GH_InstanceReference.ClearCaches Method
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the instance reference is referenced, the local instance of the instance reference is erased.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace