Grasshopper API
ModelNamedView.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelNamedView Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelNamedView
Parameters
data
Type: System.Object
Return Value
Type: ModelNamedView
See Also
Reference
ModelNamedView Class
Grasshopper.Rhinoceros.Display Namespace