Grasshopper API
ItemDisplayColor.Value Implicit Conversion (ModelColor to ItemDisplayColorItemDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ItemDisplayColor.Value (
	ModelColor color
)
Public Shared Widening Operator CType (
	color As ModelColor
) As ItemDisplayColor.Value
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: ItemDisplayColor.Value
See Also
Reference
ItemDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace