Grasshopper API
ModelInstanceDefinition.Cast Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelInstanceDefinition Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelInstanceDefinition
Parameters
source
Type: System.Object
Return Value
Type: ModelInstanceDefinition
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace