Grasshopper API
GH_Format.FormatSubD Method (GH_SubD)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatSubD(
	GH_SubD data
)
Public Shared Function FormatSubD (
	data As GH_SubD
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_SubD
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatSubD Overload
Grasshopper.Kernel Namespace