Grasshopper API
Complex.Division Operator (Double, Complex)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Complex operator /(
	double dividend,
	Complex divisor
)
Public Shared Operator / (
	dividend As Double,
	divisor As Complex
) As Complex
Parameters
dividend
Type: System.Double
divisor
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Division Overload
Grasshopper.Kernel.Types Namespace