Grasshopper API
ModelLayer.Attributes Constructor
Initializes a new instance of the ModelLayer.Attributes class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace