Grasshopper API
ModelFont Constructor (Font)
Initializes a new instance of the ModelFont class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelFont(
	Font font
)
Public Sub New (
	font As Font
)
Parameters
font
Type: Font
See Also
Reference
ModelFont Class
ModelFont Overload
Grasshopper.Rhinoceros Namespace