Grasshopper API
GH_Convert.ToDimension_Primary Method
 Performs a direct cast from Rhino.Geometry.Dimension or GH_Dimension. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToDimension_Primary(
	Object data,
	ref Dimension rc
)
Public Shared Function ToDimension_Primary (
	data As Object,
	ByRef rc As Dimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Dimension
Result of conversion
Return Value
Type: Boolean
A Dimension instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace