Grasshopper API
GH_Convert.GetExtrusionFromDocument Method
 Harvest an extrusion object from a Rhino document.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool GetExtrusionFromDocument(
	RhinoDoc doc,
	Guid id,
	out Extrusion extrusion
)
Public Shared Function GetExtrusionFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef extrusion As Extrusion
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of brep object.
extrusion
Type: Extrusion
Extrusion result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace