Grasshopper API
GH_AnnotationBase.ClearCaches Method
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the annotation is referenced, the local instance of the annotation is erased.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace