Grasshopper API
ModelUnitSystem.Value.CompareTo Method (ModelUnitSystem.Value)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ModelUnitSystem.Value other
)
Public Function CompareTo (
	other As ModelUnitSystem.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.ModelUnitSystem.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ModelUnitSystem.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros Namespace