Grasshopper API
AnnotationToleranceSettings Constructor (AnnotationToleranceSettings.Attributes)
Initializes a new instance of the AnnotationToleranceSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationToleranceSettings(
	AnnotationToleranceSettings.Attributes attributes
)
Public Sub New (
	attributes As AnnotationToleranceSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.Attributes
See Also
Reference
AnnotationToleranceSettings Class
AnnotationToleranceSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace