Grasshopper API
ModelTextureMapping Implicit Conversion (ModelTextureMapping.Attributes to ModelTextureMapping)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelTextureMapping (
	ModelTextureMapping.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelTextureMapping.Attributes
) As ModelTextureMapping
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes
Return Value
Type: ModelTextureMapping
See Also
Reference
ModelTextureMapping Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace