Grasshopper API
Param_ObjectDrafting.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectDrafting PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectDrafting
Parameters
data
Type: System.Object
Return Value
Type: ObjectDrafting
See Also
Reference
Param_ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting.Params Namespace