Grasshopper API
Param_ModelRenderEnvironment.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelRenderEnvironment PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelRenderEnvironment
Parameters
data
Type: System.Object
Return Value
Type: ModelRenderEnvironment
See Also
Reference
Param_ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render.Params Namespace