Grasshopper API
ObjectDraftingColor.Value.CompareTo Method (ObjectDraftingColor.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ObjectDraftingColor.Value other
)
Public Function CompareTo (
	other As ObjectDraftingColor.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ObjectDraftingColor.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Drafting Namespace