Grasshopper API
GH_UndoServer Constructor
Initializes a new instance of the GH_UndoServer class
 Namespace: Grasshopper.Kernel.Undo
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_UndoServer(
	GH_Document owner
)
Public Sub New (
	owner As GH_Document
)
Parameters
owner
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace