Grasshopper API
ModelContent.Read Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override bool Read(
	GH_IReader reader
)
Protected Overrides Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
Implements
GH_ISerializable.Read(GH_IReader)
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace