Grasshopper API
ModelRenderTexture Constructor (ModelRenderTexture.Attributes)
Initializes a new instance of the ModelRenderTexture class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderTexture(
	ModelRenderTexture.Attributes attributes
)
Public Sub New (
	attributes As ModelRenderTexture.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderTexture.Attributes
See Also
Reference
ModelRenderTexture Class
ModelRenderTexture Overload
Grasshopper.Rhinoceros.Render Namespace