Grasshopper API
AnnotationDateTimeFormat.Equals Method (AnnotationDateTimeFormat)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	AnnotationDateTimeFormat other
)
Public Function Equals (
	other As AnnotationDateTimeFormat
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Annotations.AnnotationDateTimeFormat
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
AnnotationDateTimeFormat Class
Equals Overload
Grasshopper.Rhinoceros.Annotations Namespace