Grasshopper API
ModelSectionStyle Constructor
Initializes a new instance of the ModelSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle()
Public Sub New
See Also
Reference
ModelSectionStyle Class
ModelSectionStyle Overload
Grasshopper.Rhinoceros.Drafting Namespace