Grasshopper API
ModelTextureMapping.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureMapping.Attributes ToAttributes()
Public Function ToAttributes As ModelTextureMapping.Attributes
Return Value
Type: ModelTextureMapping.Attributes
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace