Grasshopper API
Utility.DocumentAngleTolerance Method
 Returns the Angle Tolerance in degrees for the model document
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static double DocumentAngleTolerance()
Public Shared Function DocumentAngleTolerance As Double
Return Value
Type: Double
See Also
Reference
Utility Class
Grasshopper Namespace