Grasshopper API
ObjectDraftingLinetype.Value Constructor (ObjectLinetypeSource)
Initializes a new instance of the ObjectDraftingLinetype.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectLinetypeSource source
)
Public Sub New (
	source As ObjectLinetypeSource
)
Parameters
source
Type: ObjectLinetypeSource
See Also
Reference
ObjectDraftingLinetype.Value Structure
ObjectDraftingLinetype.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace