Grasshopper API
ModelDisplayMode.Attributes.ToString Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ModelDisplayMode.Attributes Class
Grasshopper.Rhinoceros.Display Namespace