Grasshopper API
AnnotationToleranceSettings Implicit Conversion (AnnotationToleranceSettings.Attributes to AnnotationToleranceSettings)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationToleranceSettings (
	AnnotationToleranceSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As AnnotationToleranceSettings.Attributes
) As AnnotationToleranceSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.Attributes
Return Value
Type: AnnotationToleranceSettings
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace