Grasshopper API
ObjectDisplay Constructor (ObjectDisplay.Attributes)
Initializes a new instance of the ObjectDisplay class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplay(
	ObjectDisplay.Attributes attributes
)
Public Sub New (
	attributes As ObjectDisplay.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ObjectDisplay.Attributes
See Also
Reference
ObjectDisplay Class
ObjectDisplay Overload
Grasshopper.Rhinoceros.Display Namespace