Grasshopper API
GH_Hatch.ToString Method
 Format the hatch using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace