Grasshopper API
ObjectSectionStyle.Value.Deconstruct Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Deconstruct(
	out ObjectSectionAttributesSource source,
	out ModelSectionStyle value
)
Public Sub Deconstruct (
	<OutAttribute> ByRef source As ObjectSectionAttributesSource,
	<OutAttribute> ByRef value As ModelSectionStyle
)
Parameters
source
Type: ObjectSectionAttributesSource
value
Type: Grasshopper.Rhinoceros.Drafting.ModelSectionStyle
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace