Grasshopper API
ModelPageViewport Constructor (Guid)
Initializes a new instance of the ModelPageViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelPageViewport(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelPageViewport Class
ModelPageViewport Overload
Grasshopper.Rhinoceros.Display Namespace