Grasshopper API
ModelSectionStyle Implicit Conversion (SectionStyle to ModelSectionStyle)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelSectionStyle (
	SectionStyle sectionStyle
)
Public Shared Widening Operator CType (
	sectionStyle As SectionStyle
) As ModelSectionStyle
Parameters
sectionStyle
Type: SectionStyle
Return Value
Type: ModelSectionStyle
See Also
Reference
ModelSectionStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace