Grasshopper API
Param_ModelRenderMaterial.Menu_CustomMultiValueItem Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ToolStripMenuItem Menu_CustomMultiValueItem()
Protected Overrides Function Menu_CustomMultiValueItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
Param_ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace