Grasshopper API
GH_AngularDimension Constructor
 Default constructor, creates an invalid angular dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AngularDimension()
Public Sub New
See Also
Reference
GH_AngularDimension Class
GH_AngularDimension Overload
Grasshopper.Kernel.Types Namespace