Grasshopper API
ModelContent.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContent.Attributes ToAttributes()
Public Function ToAttributes As ModelContent.Attributes
Return Value
Type: ModelContent.Attributes
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace