Grasshopper API
ObjectSectionStyle.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectSectionStyle Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectSectionStyle
Parameters
source
Type: System.Object
Return Value
Type: ObjectSectionStyle
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace