Grasshopper API
GH_TextDot.DuplicateTextDot Method
 Create a duplicate of this text dot.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextDot DuplicateTextDot()
Public Function DuplicateTextDot As GH_TextDot
Return Value
Type: GH_TextDot
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace