Grasshopper API
ModelConstructionPlane Constructor (Plane)
Initializes a new instance of the ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane(
	Plane plane
)
Public Sub New (
	plane As Plane
)
Parameters
plane
Type: Plane
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace