Grasshopper API
GH_Format.FormatCentermark Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatCentermark(
	GH_Centermark data
)
Public Shared Function FormatCentermark (
	data As GH_Centermark
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Centermark
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace