Grasshopper API
GH_Convert.ToTextDot Method
 Convert data into Rhino.Geometry.TextDot.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToTextDot(
	Object data,
	ref TextDot rc,
	GH_Conversion conversion_level
)
Public Shared Function ToTextDot (
	data As Object,
	ByRef rc As TextDot,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: TextDot
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace