Grasshopper API
GH_DocumentObject.SetValue Method (String, Double)
 Set a named value. This value will be serialized with the component.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected void SetValue(
	string valueName,
	double value
)
Protected Sub SetValue (
	valueName As String,
	value As Double
)
Parameters
valueName
Type: System.String
Name of value.
value
Type: System.Double
Value itself.
See Also
Reference
GH_DocumentObject Class
SetValue Overload
Grasshopper.Kernel Namespace