Grasshopper API
GH_Hatch Constructor (Guid)
 Create a new referenced hatch that references a Rhino hatch with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Hatch(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of hatch object to reference.
See Also
Reference
GH_Hatch Class
GH_Hatch Overload
Grasshopper.Kernel.Types Namespace