Grasshopper API
Param_ModelLayer Constructor
Initializes a new instance of the Param_ModelLayer class
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelLayer()
Public Sub New
See Also
Reference
Param_ModelLayer Class
Grasshopper.Rhinoceros.Model.Params Namespace