Grasshopper API
GH_PersistentReferenceParam<T>.ClearData Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearData()
Public Overrides Sub ClearData
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace