Grasshopper API
Param_ModelTextureSlot Constructor
Initializes a new instance of the Param_ModelTextureSlot class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelTextureSlot()
Public Sub New
See Also
Reference
Param_ModelTextureSlot Class
Grasshopper.Rhinoceros.Render.Params Namespace