Grasshopper API
GH_RadialDimension Constructor (GH_RadialDimension)
 Create a duplicate of another GH_RadialDimension. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_RadialDimension(
	GH_RadialDimension other
)
Public Sub New (
	other As GH_RadialDimension
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_RadialDimension
GH_RadialDimension to duplicate
See Also
Reference
GH_RadialDimension Class
GH_RadialDimension Overload
Grasshopper.Kernel.Types Namespace