Grasshopper API
EtoExtensions.ToEto Method (Point)
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Point ToEto(
	this Point point
)
<ExtensionAttribute>
Public Shared Function ToEto (
	point As Point
) As Point
Parameters
point
Type: System.Drawing.Point
Return Value
Type: Point
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Point. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EtoExtensions Class
ToEto Overload
Grasshopper Namespace