Grasshopper API
GH_PointCloud Constructor (GH_PointCloud)
 Create a duplicate of another GH_PointCloud. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PointCloud(
	GH_PointCloud other
)
Public Sub New (
	other As GH_PointCloud
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_PointCloud
Curve to duplicate
See Also
Reference
GH_PointCloud Class
GH_PointCloud Overload
Grasshopper.Kernel.Types Namespace