Grasshopper API
Param_ModelObject.Menu_AppendPromptMore Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void Menu_AppendPromptMore(
	ToolStripDropDown menu
)
Protected Overrides Sub Menu_AppendPromptMore (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace