Grasshopper API
ItemDisplayColor.Value Implicit Conversion (ItemDisplayColor.Value to ModelColor)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelColor (
	ItemDisplayColor.Value value
)
Public Shared Widening Operator CType (
	value As ItemDisplayColor.Value
) As ModelColor
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value
Return Value
Type: ModelColor
See Also
Reference
ItemDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace