Grasshopper API
Param_ObjectRenderMaterial Constructor
Initializes a new instance of the Param_ObjectRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectRenderMaterial()
Public Sub New
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace