Grasshopper API
ObjectDisplayColor.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDisplayColor Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectDisplayColor
Parameters
source
Type: System.Object
Return Value
Type: ObjectDisplayColor
See Also
Reference
ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace