Grasshopper API
Param_ModelLinetype Constructor
Initializes a new instance of the Param_ModelLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelLinetype()
Public Sub New
See Also
Reference
Param_ModelLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace