Grasshopper API
GH_PersistentGeometryParam<T>.PublishRcpItem Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IRcpItem PublishRcpItem()
Public Function PublishRcpItem As IRcpItem
Return Value
Type: IRcpItem
Implements
IRcpAwareObject.PublishRcpItem()
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace