Grasshopper API
Param_ObjectDisplayColor.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ObjectDisplayColor> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ObjectDisplayColor)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ObjectDisplayColor>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace