Grasshopper API
ModelDisplayMode Constructor (DisplayModeDescription)
Initializes a new instance of the ModelDisplayMode class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode(
	DisplayModeDescription displayMode
)
Public Sub New (
	displayMode As DisplayModeDescription
)
Parameters
displayMode
Type: DisplayModeDescription
See Also
Reference
ModelDisplayMode Class
ModelDisplayMode Overload
Grasshopper.Rhinoceros.Display Namespace