Grasshopper API
GH_Param<T>.Menu_AppendConnectWires Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal void Menu_AppendConnectWires(
	ToolStripDropDown menu
)
Protected Friend Sub Menu_AppendConnectWires (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace