Grasshopper API
GH_RadialDimension Constructor (RadialDimension)
 Create a duplicate of an existing radial dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_RadialDimension(
	RadialDimension dimension
)
Public Sub New (
	dimension As RadialDimension
)
Parameters
dimension
Type: RadialDimension
Radial dimension to duplicate
See Also
Reference
GH_RadialDimension Class
GH_RadialDimension Overload
Grasshopper.Kernel.Types Namespace