Grasshopper API
GH_Centermark.DuplicateCentermark Method
 Create a duplicate of this centermark.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Centermark DuplicateCentermark()
Public Function DuplicateCentermark As GH_Centermark
Return Value
Type: GH_Centermark
See Also
Reference
GH_Centermark Class
Grasshopper.Kernel.Types Namespace