Grasshopper API
GH_Convert.ToGHLight Method
 Convert data into GH_Light.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHLight(
	Object data,
	GH_Conversion conversion_level,
	ref GH_Light target
)
Public Shared Function ToGHLight (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_Light
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_Light
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace