Grasshopper API
ModelLineWidth.Write Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Write(
	GH_IWriter writer
)
Public Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace