Grasshopper API
ModelDisplayMode.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelDisplayMode Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelDisplayMode
Parameters
source
Type: System.Object
Return Value
Type: ModelDisplayMode
See Also
Reference
ModelDisplayMode Class
Grasshopper.Rhinoceros.Display Namespace