Grasshopper API
GH_Format.FormatHatchValidity Method
 If the hatch is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatHatchValidity(
	Hatch val,
	string identifier = "Hatch"
)
Public Shared Function FormatHatchValidity (
	val As Hatch,
	Optional identifier As String = "Hatch"
) As String
Parameters
val
Type: Hatch
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the hatch is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace