Grasshopper API
ObjectSectionStyle.Value Constructor (ObjectSectionAttributesSource, ModelSectionStyle)
Initializes a new instance of the ObjectSectionStyle.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectSectionAttributesSource source,
	ModelSectionStyle value
)
Public Sub New (
	source As ObjectSectionAttributesSource,
	value As ModelSectionStyle
)
Parameters
source
Type: ObjectSectionAttributesSource
value
Type: Grasshopper.Rhinoceros.Drafting.ModelSectionStyle
See Also
Reference
ObjectSectionStyle.Value Structure
ObjectSectionStyle.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace