Grasshopper API
Param_ObjectDraftingColor.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectDraftingColor PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectDraftingColor
Parameters
data
Type: System.Object
Return Value
Type: ObjectDraftingColor
See Also
Reference
Param_ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting.Params Namespace