Grasshopper API
ModelPageViewport Implicit Conversion (RhinoViewport to ModelPageViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelPageViewport (
	RhinoViewport viewport
)
Public Shared Widening Operator CType (
	viewport As RhinoViewport
) As ModelPageViewport
Parameters
viewport
Type: RhinoViewport
Return Value
Type: ModelPageViewport
See Also
Reference
ModelPageViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace