Grasshopper API
Param_ModelRenderSun.DrawViewportMeshes Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportMeshes(
	IGH_PreviewArgs args
)
Public Sub DrawViewportMeshes (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Implements
IGH_PreviewObject.DrawViewportMeshes(IGH_PreviewArgs)
See Also
Reference
Param_ModelRenderSun Class
Grasshopper.Rhinoceros.Render.Params Namespace