Grasshopper API
ModelConstructionPlane Constructor
Initializes a new instance of the ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane()
Public Sub New
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace