Grasshopper API
Param_ObjectDraftingLineWidth.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ObjectDraftingLineWidth value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ObjectDraftingLineWidth
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace