Grasshopper API
GH_Format.FormatLeader Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatLeader(
	GH_Leader data
)
Public Shared Function FormatLeader (
	data As GH_Leader
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Leader
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace