Grasshopper API
GH_ComponentParamServer.NullParamAttributes Constructor
Initializes a new instance of the GH_ComponentParamServer.NullParamAttributes class
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public NullParamAttributes(
	IGH_Param param
)
Public Sub New (
	param As IGH_Param
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
See Also
Reference
GH_ComponentParamServer.NullParamAttributes Class
Grasshopper.Kernel Namespace