Grasshopper API
ModelView Constructor (RhinoView)
Initializes a new instance of the ModelView class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView(
	RhinoView view
)
Public Sub New (
	view As RhinoView
)
Parameters
view
Type: RhinoView
See Also
Reference
ModelView Class
ModelView Overload
Grasshopper.Rhinoceros.Display Namespace