Grasshopper API
GH_Light Constructor
 Default constructor, creates an new light
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Light()
Public Sub New
See Also
Reference
GH_Light Class
GH_Light Overload
Grasshopper.Kernel.Types Namespace