Grasshopper API
ModelTextureSlot Constructor (ModelTextureSlot.Attributes)
Initializes a new instance of the ModelTextureSlot class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureSlot(
	ModelTextureSlot.Attributes attributes
)
Public Sub New (
	attributes As ModelTextureSlot.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelTextureSlot.Attributes
See Also
Reference
ModelTextureSlot Class
ModelTextureSlot Overload
Grasshopper.Rhinoceros.Render Namespace