Grasshopper API
Param_TextDot Constructor
Initializes a new instance of the Param_TextDot class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_TextDot()
Public Sub New
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace