Grasshopper API
GH_TextDot.ClearCaches Method
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the text dot is referenced, the local instance of the text dot is erased.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace