Grasshopper API
ObjectSectionStyle.Value Implicit Conversion (ObjectSectionAttributesSource to ObjectSectionStyleObjectSectionStyle.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectSectionStyle.Value (
	ObjectSectionAttributesSource source
)
Public Shared Widening Operator CType (
	source As ObjectSectionAttributesSource
) As ObjectSectionStyle.Value
Parameters
source
Type: ObjectSectionAttributesSource
Return Value
Type: ObjectSectionStyle.Value
See Also
Reference
ObjectSectionStyle.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace