Grasshopper API
ModelFont Implicit Conversion (Font to ModelFont)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelFont (
	Font font
)
Public Shared Widening Operator CType (
	font As Font
) As ModelFont
Parameters
font
Type: Font
Return Value
Type: ModelFont
See Also
Reference
ModelFont Class
Implicit Overload
Grasshopper.Rhinoceros Namespace