Grasshopper API
GH_Centermark Constructor (Centermark, ModelAnnotationStyle)
 Create a duplicate of an existing centermark.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Centermark(
	Centermark centermark,
	ModelAnnotationStyle style
)
Public Sub New (
	centermark As Centermark,
	style As ModelAnnotationStyle
)
Parameters
centermark
Type: Centermark
Centermark to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_Centermark Class
GH_Centermark Overload
Grasshopper.Kernel.Types Namespace