Grasshopper API
ModelTags.Equals Method (ModelTags)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelTags other
)
Public Function Equals (
	other As ModelTags
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelTags
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelTags Structure
Equals Overload
Grasshopper.Rhinoceros Namespace