Grasshopper API
ModelSectionStyle.Attributes Implicit Conversion (String to ModelSectionStyleModelSectionStyle.Attributes)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelSectionStyle.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelSectionStyle.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelSectionStyle.Attributes
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace