Grasshopper API
Param_ModelDisplayMode.Menu_CustomMultiValueItem Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ToolStripMenuItem Menu_CustomMultiValueItem()
Protected Overrides Function Menu_CustomMultiValueItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
Param_ModelDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace