Grasshopper API
ModelData.Attributes Constructor
Initializes a new instance of the ModelData.Attributes class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected Attributes()
Protected Sub New
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace