Grasshopper API
Param_InstanceReference.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_InstanceReference InstantiateT()
Protected Overrides Function InstantiateT As GH_InstanceReference
Return Value
Type: GH_InstanceReference
See Also
Reference
Param_InstanceReference Class
Grasshopper.Kernel.Parameters Namespace