Grasshopper API
GH_AnnotationBase Constructor
 Default constructor, creates an invalid annotation.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_AnnotationBase()
Protected Sub New
See Also
Reference
GH_AnnotationBase Class
GH_AnnotationBase Overload
Grasshopper.Kernel.Types Namespace