Grasshopper API
ModelRenderTexture.Attributes Implicit Conversion (String to ModelRenderTextureModelRenderTexture.Attributes)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderTexture.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelRenderTexture.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelRenderTexture.Attributes
See Also
Reference
ModelRenderTexture.Attributes Class
Grasshopper.Rhinoceros.Render Namespace