Grasshopper API
GH_Format.FormatDimension Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatDimension(
	GH_Dimension data
)
Public Shared Function FormatDimension (
	data As GH_Dimension
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Dimension
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace