Grasshopper API
GH_OrdinateDimension Constructor (OrdinateDimension, ModelAnnotationStyle)
 Create a duplicate of an existing ordinate dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_OrdinateDimension(
	OrdinateDimension dimension,
	ModelAnnotationStyle style
)
Public Sub New (
	dimension As OrdinateDimension,
	style As ModelAnnotationStyle
)
Parameters
dimension
Type: OrdinateDimension
Ordinate dimension to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_OrdinateDimension Class
GH_OrdinateDimension Overload
Grasshopper.Kernel.Types Namespace