Grasshopper API
GH_PersistentGeometryParam<T>.Read Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Read(
	GH_IReader reader
)
Public Overrides Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace