Grasshopper API
ModelSectionStyle Constructor (SectionStyle)
Initializes a new instance of the ModelSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle(
	SectionStyle sectionStyle
)
Public Sub New (
	sectionStyle As SectionStyle
)
Parameters
sectionStyle
Type: SectionStyle
See Also
Reference
ModelSectionStyle Class
ModelSectionStyle Overload
Grasshopper.Rhinoceros.Drafting Namespace