Grasshopper API
ModelContentName.Division Operator
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelContentName operator /(
	ModelContentName left,
	ModelContentName right
)
Public Shared Operator / (
	left As ModelContentName,
	right As ModelContentName
) As ModelContentName
Parameters
left
Type: Grasshopper.Rhinoceros.ModelContentName
right
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: ModelContentName
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace