Grasshopper API
ModelView Constructor (ViewportInfo)
Initializes a new instance of the ModelView class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView(
	ViewportInfo viewportInfo
)
Public Sub New (
	viewportInfo As ViewportInfo
)
Parameters
viewportInfo
Type: ViewportInfo
See Also
Reference
ModelView Class
ModelView Overload
Grasshopper.Rhinoceros.Display Namespace