Grasshopper API
GH_DocumentObject.RecordUndoEvent Method (String)
 Record a generic object change undo event.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Guid RecordUndoEvent(
	string undoName
)
Public Function RecordUndoEvent (
	undoName As String
) As Guid
Parameters
undoName
Type: System.String
Name of undo record.
Return Value
Type: Guid
The ID of the newly added record or Guid.Empty on failure.
Implements
IGH_DocumentObject.RecordUndoEvent(String)
See Also
Reference
GH_DocumentObject Class
RecordUndoEvent Overload
Grasshopper.Kernel Namespace