Grasshopper API
ObjectRenderMaterial.Value.Equals Method (ObjectRenderMaterial.Value)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectRenderMaterial.Value other
)
Public Function Equals (
	other As ObjectRenderMaterial.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectRenderMaterial.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Render Namespace