Grasshopper API
ModelContentName.Combine Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelContentName Combine(
	params ModelContentName[] paths
)
Public Shared Function Combine (
	ParamArray paths As ModelContentName()
) As ModelContentName
Parameters
paths
Type: Grasshopper.Rhinoceros.ModelContentName[]
Return Value
Type: ModelContentName
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace