Grasshopper API
ModelUnitSystem.Value.Equals Method (ModelUnitSystem.Value)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelUnitSystem.Value other
)
Public Function Equals (
	other As ModelUnitSystem.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelUnitSystem.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelUnitSystem.Value Structure
Equals Overload
Grasshopper.Rhinoceros Namespace