Grasshopper API
GH_Extrusion Constructor (Extrusion)
Initializes a new instance of the GH_Extrusion class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Extrusion(
	Extrusion extrusion
)
Public Sub New (
	extrusion As Extrusion
)
Parameters
extrusion
Type: Extrusion
See Also
Reference
GH_Extrusion Class
GH_Extrusion Overload
Grasshopper.Kernel.Types Namespace