Grasshopper API
Utility.DocumentTolerance Method
 Returns the Absolute Tolerance of the model document
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static double DocumentTolerance()
Public Shared Function DocumentTolerance As Double
Return Value
Type: Double
See Also
Reference
Utility Class
Grasshopper Namespace