Grasshopper API
ModelObject Constructor
Initializes a new instance of the ModelObject class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelObject()
Public Sub New
See Also
Reference
ModelObject Class
ModelObject Overload
Grasshopper.Rhinoceros.Model Namespace