Grasshopper API
GH_Lexer Constructor (String)
 Create a new mask from a textual string.
 Namespace: Grasshopper.Kernel.Data
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Lexer(
	string mask
)
Public Sub New (
	mask As String
)
Parameters
mask
Type: System.String
Mask string.
See Also
Reference
GH_Lexer Class
GH_Lexer Overload
Grasshopper.Kernel.Data Namespace