Grasshopper API
GH_SubD Constructor (GH_SubD)
Initializes a new instance of the GH_SubD class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_SubD(
	GH_SubD other
)
Public Sub New (
	other As GH_SubD
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_SubD
See Also
Reference
GH_SubD Class
GH_SubD Overload
Grasshopper.Kernel.Types Namespace