Grasshopper API
Param_AnnotationArrow.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref AnnotationArrow value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As AnnotationArrow
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Annotations.AnnotationArrow
Return Value
Type: GH_GetterResult
See Also
Reference
Param_AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations.Params Namespace