Grasshopper API
ObjectDisplayColor.Value Implicit Conversion (ModelColor to ObjectDisplayColorObjectDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDisplayColor.Value (
	ModelColor color
)
Public Shared Widening Operator CType (
	color As ModelColor
) As ObjectDisplayColor.Value
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: ObjectDisplayColor.Value
See Also
Reference
ObjectDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace