Grasshopper API
AnnotationUnitsSettings.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationUnitsSettings.Attributes From(
	DimensionStyle dimStyle
)
Public Shared Function From (
	dimStyle As DimensionStyle
) As AnnotationUnitsSettings.Attributes
Parameters
dimStyle
Type: DimensionStyle
Return Value
Type: AnnotationUnitsSettings.Attributes
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace