Grasshopper API
Param_MatchText.RemoveEffects Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void RemoveEffects()
Public Overrides Sub RemoveEffects
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace