Grasshopper API
ModelStandardViewport.Attributes Constructor
Initializes a new instance of the ModelStandardViewport.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelStandardViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace