Grasshopper API
ModelContentParam<T>.RemoteIdExpired Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual bool RemoteIdExpired(
	RhinoDoc document,
	Guid id,
	GH_RemoteIdChange change
)
Protected Overridable Function RemoteIdExpired (
	document As RhinoDoc,
	id As Guid,
	change As GH_RemoteIdChange
) As Boolean
Parameters
document
Type: RhinoDoc
id
Type: System.Guid
change
Type: GH_RemoteIdChange
Return Value
Type: Boolean
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace