Grasshopper API
GH_PersistentReferenceParam<T>.OnVolatileDataCollected Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void OnVolatileDataCollected()
Protected Overrides Sub OnVolatileDataCollected
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace