Grasshopper API
ItemDisplayColor.Value.Equals Method (Object)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
Parameters
other
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
ItemDisplayColor.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Display Namespace