Grasshopper API
ObjectSectionStyle Implicit Conversion (ObjectSectionStyle to ObjectSectionStyleObjectSectionStyle.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectSectionStyle.Value (
	ObjectSectionStyle data
)
Public Shared Widening Operator CType (
	data As ObjectSectionStyle
) As ObjectSectionStyle.Value
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle
Return Value
Type: ObjectSectionStyle.Value
See Also
Reference
ObjectSectionStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace