Grasshopper API
Param_ModelLayer.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelLayer value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelLayer
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Model.ModelLayer
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelLayer Class
Grasshopper.Rhinoceros.Model.Params Namespace