Grasshopper API
Instances.Interop Method
 Gets the Grasshopper 1.0 interop object, i.e. an instance of GrasshopperPlugin.GrasshopperInterop as exposed via the GetInteropObject() method on the Grasshopper 1.0 plugin object.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Object Interop()
Public Shared Function Interop As Object
Return Value
Type: Object
See Also
Reference
Instances Class
Grasshopper Namespace