Grasshopper API
ModelHatchPattern.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern.Attributes ToAttributes()
Public Function ToAttributes As ModelHatchPattern.Attributes
Return Value
Type: ModelHatchPattern.Attributes
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace