Grasshopper API
Param_ModelInstanceDefinition.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelInstanceDefinition value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelInstanceDefinition
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Model.ModelInstanceDefinition
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model.Params Namespace