Grasshopper API
GH_Convert.ToGHPointCloud_Primary Method
 Converts similar data into a GH_PointCloud instance. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHPointCloud_Primary(
	Object data,
	ref GH_PointCloud target
)
Public Shared Function ToGHPointCloud_Primary (
	data As Object,
	ByRef target As GH_PointCloud
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_PointCloud
Target instance. If null, a new GH_PointCloud will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace