Grasshopper API
ModelData.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelData.Attributes ToAttributes()
Public Function ToAttributes As ModelData.Attributes
Return Value
Type: ModelData.Attributes
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace