Grasshopper API
AnnotationToleranceSettings Constructor (DimensionStyle)
Initializes a new instance of the AnnotationToleranceSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationToleranceSettings(
	DimensionStyle dimStyle
)
Public Sub New (
	dimStyle As DimensionStyle
)
Parameters
dimStyle
Type: DimensionStyle
See Also
Reference
AnnotationToleranceSettings Class
AnnotationToleranceSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace