Grasshopper API
ObjectDraftingColor.Value Implicit Conversion (ObjectDraftingColor.Value to ModelColor)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelColor (
	ObjectDraftingColor.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDraftingColor.Value
) As ModelColor
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value
Return Value
Type: ModelColor
See Also
Reference
ObjectDraftingColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace