Grasshopper API
ObjectRender.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ToDetails()
Public Function ToDetails As String
Return Value
Type: String
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace