Grasshopper API
AnnotationTextSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationTextSettings.Attributes ToAttributes()
Public Function ToAttributes As AnnotationTextSettings.Attributes
Return Value
Type: AnnotationTextSettings.Attributes
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace