Grasshopper API
ModelData.Write Method (GH_IWriter, String, Nullable<Vector3d>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void Write(
	GH_IWriter writer,
	string name,
	ref Vector3d? serializable
)
Protected Friend Shared Sub Write (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As Vector3d?
)
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: System.Nullable<Vector3d>
See Also
Reference
ModelData Class
Write Overload
Grasshopper.Rhinoceros Namespace