Grasshopper API
ClippingDrawingSettings Implicit Conversion (ClippingDrawingSettings.Attributes to ClippingDrawingSettings)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ClippingDrawingSettings (
	ClippingDrawingSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ClippingDrawingSettings.Attributes
) As ClippingDrawingSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes
Return Value
Type: ClippingDrawingSettings
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace