Grasshopper API
ModelViewport Constructor (ModelViewport.Attributes, Guid)
Initializes a new instance of the ModelViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelViewport(
	ModelViewport.Attributes attributes,
	Guid id
)
Protected Friend Sub New (
	attributes As ModelViewport.Attributes,
	id As Guid
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
id
Type: System.Guid
See Also
Reference
ModelViewport Class
ModelViewport Overload
Grasshopper.Rhinoceros.Display Namespace