Grasshopper API
GH_Material Constructor (DisplayMaterial)
 Create a new Material.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Material(
	DisplayMaterial material
)
Public Sub New (
	material As DisplayMaterial
)
Parameters
material
Type: DisplayMaterial
Material to use (an internal copy will be made).
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace