Grasshopper API
Param_InstanceReference Constructor
Initializes a new instance of the Param_InstanceReference class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_InstanceReference()
Public Sub New
See Also
Reference
Param_InstanceReference Class
Grasshopper.Kernel.Parameters Namespace