Grasshopper API
Param_ClippingPlane.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_ClippingPlane value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_ClippingPlane
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_ClippingPlane
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ClippingPlane Class
Grasshopper.Kernel.Parameters Namespace