Grasshopper API
GH_Gradient.MouseUp Method
 Terminate grip drag.
 Namespace: Grasshopper.GUI.Gradient
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool MouseUp(
	RectangleF dest,
	PointF pt,
	bool deselect
)
Public Function MouseUp (
	dest As RectangleF,
	pt As PointF,
	deselect As Boolean
) As Boolean
Parameters
dest
Type: System.Drawing.RectangleF
Destination rectangle of gradient
pt
Type: System.Drawing.PointF
Mouse location in destination coordinates
deselect
Type: System.Boolean
Return Value
Type: Boolean
Implements
IGradient.MouseUp(RectangleF, PointF, Boolean)
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace