Grasshopper API
GH_OrdinateDimension Constructor (OrdinateDimension)
 Create a duplicate of an existing ordinate dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_OrdinateDimension(
	OrdinateDimension dimension
)
Public Sub New (
	dimension As OrdinateDimension
)
Parameters
dimension
Type: OrdinateDimension
Ordinate dimension to duplicate
See Also
Reference
GH_OrdinateDimension Class
GH_OrdinateDimension Overload
Grasshopper.Kernel.Types Namespace