Grasshopper API
ModelData.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual string ToDetails()
Public Overridable Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace