Grasshopper API
ObjectDrafting.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ToDetails()
Public Function ToDetails As String
Return Value
Type: String
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace