Grasshopper API
ModelUnitSystem.Value Constructor (ModelUnitSystem.Value, String, Nullable<Double>)
Initializes a new instance of the ModelUnitSystem.Value class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ModelUnitSystem.Value other,
	string name = null,
	double? factor = null
)
Public Sub New (
	other As ModelUnitSystem.Value,
	Optional name As String = Nothing,
	Optional factor As Double? = Nothing
)
Parameters
other
Type: Grasshopper.Rhinoceros.ModelUnitSystem.Value
name (Optional)
Type: System.String
factor (Optional)
Type: System.Nullable<Double>
See Also
Reference
ModelUnitSystem.Value Structure
ModelUnitSystem.Value Overload
Grasshopper.Rhinoceros Namespace