Grasshopper API
GH_Format.FormatAngularDimension Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatAngularDimension(
	GH_AngularDimension data
)
Public Shared Function FormatAngularDimension (
	data As GH_AngularDimension
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_AngularDimension
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace