Grasshopper API
GH_InstanceReference Constructor (Transform)
 Create a transformed empty instance reference.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReference(
	Transform xform
)
Public Sub New (
	xform As Transform
)
Parameters
xform
Type: Transform
instance reference to duplicate
See Also
Reference
GH_InstanceReference Class
GH_InstanceReference Overload
Grasshopper.Kernel.Types Namespace