Grasshopper API
ModelRenderSun Constructor
Initializes a new instance of the ModelRenderSun class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderSun()
Public Sub New
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace