Grasshopper API
Param_ObjectDraftingColor Constructor
Initializes a new instance of the Param_ObjectDraftingColor class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectDraftingColor()
Public Sub New
See Also
Reference
Param_ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting.Params Namespace