Grasshopper API
ModelTags.Contains Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Contains(
	string value
)
Public Function Contains (
	value As String
) As Boolean
Parameters
value
Type: System.String
Return Value
Type: Boolean
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace