Grasshopper API
Param_ModelUnitSystem.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelUnitSystem> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelUnitSystem)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelUnitSystem>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace