Grasshopper API
GH_Convert.ToGHOrdinateDimension Method
 Convert data into GH_OrdinateDimension.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHOrdinateDimension(
	Object data,
	GH_Conversion conversion_level,
	ref GH_OrdinateDimension target
)
Public Shared Function ToGHOrdinateDimension (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_OrdinateDimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_OrdinateDimension
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace