Grasshopper API
ObjectDraftingLinetype Implicit Conversion (ObjectDraftingLinetype.Value to ObjectDraftingLinetype)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLinetype (
	ObjectDraftingLinetype.Value data
)
Public Shared Widening Operator CType (
	data As ObjectDraftingLinetype.Value
) As ObjectDraftingLinetype
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value
Return Value
Type: ObjectDraftingLinetype
See Also
Reference
ObjectDraftingLinetype Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace