Grasshopper API
ModelInstanceDefinition Constructor (InstanceDefinition)
Initializes a new instance of the ModelInstanceDefinition class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition(
	InstanceDefinition block
)
Public Sub New (
	block As InstanceDefinition
)
Parameters
block
Type: InstanceDefinition
See Also
Reference
ModelInstanceDefinition Class
ModelInstanceDefinition Overload
Grasshopper.Rhinoceros.Model Namespace