Grasshopper API
ModelHatchLine Implicit Conversion (ModelHatchLine.Attributes to ModelHatchLine)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelHatchLine (
	ModelHatchLine.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelHatchLine.Attributes
) As ModelHatchLine
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Attributes
Return Value
Type: ModelHatchLine
See Also
Reference
ModelHatchLine Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace