Grasshopper API
Param_ObjectVisibility.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectVisibility PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectVisibility
Parameters
data
Type: System.Object
Return Value
Type: ObjectVisibility
See Also
Reference
Param_ObjectVisibility Class
Grasshopper.Rhinoceros.Display.Params Namespace