Grasshopper API
ObjectDisplayColor Constructor
Initializes a new instance of the ObjectDisplayColor class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplayColor()
Public Sub New
See Also
Reference
ObjectDisplayColor Class
ObjectDisplayColor Overload
Grasshopper.Rhinoceros.Display Namespace