Grasshopper API
Param_ObjectDisplayMode.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelDisplayMode> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelDisplayMode)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelDisplayMode>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace