Grasshopper API
Param_ObjectDraftingLineWidth.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectDraftingLineWidth PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectDraftingLineWidth
Parameters
data
Type: System.Object
Return Value
Type: ObjectDraftingLineWidth
See Also
Reference
Param_ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace