Grasshopper API
Param_ObjectDisplay.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectDisplay PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectDisplay
Parameters
data
Type: System.Object
Return Value
Type: ObjectDisplay
See Also
Reference
Param_ObjectDisplay Class
Grasshopper.Rhinoceros.Display.Params Namespace