Grasshopper API
PageSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public PageSettings.Attributes ToAttributes()
Public Function ToAttributes As PageSettings.Attributes
Return Value
Type: PageSettings.Attributes
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace