Grasshopper API
ModelData.Attributes.ToModelData Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract ModelData ToModelData()
Public MustOverride Function ToModelData As ModelData
Return Value
Type: ModelData
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace