Grasshopper API
GH_InstanceReference Constructor (InstanceReferenceGeometry, ModelInstanceDefinition)
 Create a new instance reference with the specified instance-reference-geometry and instance-definition.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReference(
	InstanceReferenceGeometry iref,
	ModelInstanceDefinition idef
)
Public Sub New (
	iref As InstanceReferenceGeometry,
	idef As ModelInstanceDefinition
)
Parameters
iref
Type: InstanceReferenceGeometry
instance reference geometry to reference.
idef
Type: Grasshopper.Rhinoceros.Model.ModelInstanceDefinition
instance definition to reference.
See Also
Reference
GH_InstanceReference Class
GH_InstanceReference Overload
Grasshopper.Kernel.Types Namespace