Grasshopper API
GH_Leader.DuplicateLeader Method
 Create a duplicate of this leader.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Leader DuplicateLeader()
Public Function DuplicateLeader As GH_Leader
Return Value
Type: GH_Leader
See Also
Reference
GH_Leader Class
Grasshopper.Kernel.Types Namespace