Grasshopper API
AnnotationDimensionSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDimensionSettings.Attributes ToAttributes()
Public Function ToAttributes As AnnotationDimensionSettings.Attributes
Return Value
Type: AnnotationDimensionSettings.Attributes
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace