Grasshopper API
ObjectDraftingLinetype.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingLinetype Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectDraftingLinetype
Parameters
source
Type: System.Object
Return Value
Type: ObjectDraftingLinetype
See Also
Reference
ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace