Grasshopper API
GH_UpgradeUtil.MigrateRecipients Method (IEnumerable<IGH_Param>, IGH_Param)
 Utility method for bulk assigning a bunch of sources.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int MigrateRecipients(
	IEnumerable<IGH_Param> recipients,
	IGH_Param target
)
Public Shared Function MigrateRecipients (
	recipients As IEnumerable(Of IGH_Param),
	target As IGH_Param
) As Integer
Parameters
recipients
Type: System.Collections.Generic.IEnumerable<IGH_Param>
target
Type: Grasshopper.Kernel.IGH_Param
Return Value
Type: Int32
See Also
Reference
GH_UpgradeUtil Class
MigrateRecipients Overload
Grasshopper.Kernel Namespace