Grasshopper API
GH_Material.MaterialBestGuess Method
 Gets the best guess RenderMaterial for this shader.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RenderMaterial MaterialBestGuess()
Public Function MaterialBestGuess As RenderMaterial
Return Value
Type: RenderMaterial
Material which best describes this shader.
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace