Grasshopper API
ModelLinetype.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLinetype Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelLinetype
Parameters
source
Type: System.Object
Return Value
Type: ModelLinetype
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace