Grasshopper API
ModelValue.Write Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal abstract bool Write(
	GH_IWriter writer
)
Protected Friend MustOverride Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace