Grasshopper API
GH_ClippingPlane Constructor (ClippingPlaneSurface)
 Create a duplicate of an existing clipping plane.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ClippingPlane(
	ClippingPlaneSurface clippingPlane
)
Public Sub New (
	clippingPlane As ClippingPlaneSurface
)
Parameters
clippingPlane
Type: ClippingPlaneSurface
clipping plane to duplicate
See Also
Reference
GH_ClippingPlane Class
GH_ClippingPlane Overload
Grasshopper.Kernel.Types Namespace