Grasshopper API
ModelDataParam<T> Constructor
Initializes a new instance of the ModelDataParam<T> class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelDataParam(
	GH_InstanceDescription nTag
)
Protected Sub New (
	nTag As GH_InstanceDescription
)
Parameters
nTag
Type: Grasshopper.Kernel.GH_InstanceDescription
See Also
Reference
ModelDataParam<T> Class
Grasshopper.Rhinoceros.Params Namespace