Grasshopper API
ModelContentName.Equality Operator (ModelContentName, ModelContentName)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator ==(
	ModelContentName left,
	ModelContentName right
)
Public Shared Operator = (
	left As ModelContentName,
	right As ModelContentName
) As Boolean
Parameters
left
Type: Grasshopper.Rhinoceros.ModelContentName
right
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: Boolean
See Also
Reference
ModelContentName Structure
Equality Overload
Grasshopper.Rhinoceros Namespace