Grasshopper API
GH_Format.RhinoUnitName Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string RhinoUnitName()
Public Shared Function RhinoUnitName As String
Return Value
Type: String
See Also
Reference
GH_Format Class
RhinoUnitName Overload
Grasshopper.Kernel Namespace