Grasshopper API
AnnotationArrow.Cast Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationArrow Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As AnnotationArrow
Parameters
source
Type: System.Object
Return Value
Type: AnnotationArrow
See Also
Reference
AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations Namespace