Grasshopper API
ObjectDraftingLineWidth.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingLineWidth Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectDraftingLineWidth
Parameters
source
Type: System.Object
Return Value
Type: ObjectDraftingLineWidth
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace