Grasshopper API
ObjectDraftingLinetype.Value.CompareTo Method (ObjectDraftingLinetype.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ObjectDraftingLinetype.Value other
)
Public Function CompareTo (
	other As ObjectDraftingLinetype.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ObjectDraftingLinetype.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Drafting Namespace