Grasshopper API
GH_TextDot Constructor
 Default constructor, creates an invalid text dot.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextDot()
Public Sub New
See Also
Reference
GH_TextDot Class
GH_TextDot Overload
Grasshopper.Kernel.Types Namespace