Grasshopper API
GH_DocumentObject.ConnectNewObject Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static bool ConnectNewObject(
	IGH_Param source,
	IGH_DocumentObject target,
	GH_ParamKind side
)
Protected Friend Shared Function ConnectNewObject (
	source As IGH_Param,
	target As IGH_DocumentObject,
	side As GH_ParamKind
) As Boolean
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
target
Type: Grasshopper.Kernel.IGH_DocumentObject
side
Type: Grasshopper.Kernel.GH_ParamKind
Return Value
Type: Boolean
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace