Grasshopper API
ModelColor Explicit Conversion (ModelColor to ColorRGBA)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator ColorRGBA (
	ModelColor color
)
Public Shared Narrowing Operator CType (
	color As ModelColor
) As ColorRGBA
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: ColorRGBA
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace