Grasshopper API
AnnotationUnitsSettings Explicit Conversion (AnnotationUnitsSettings to DimensionStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator DimensionStyle (
	AnnotationUnitsSettings settings
)
Public Shared Narrowing Operator CType (
	settings As AnnotationUnitsSettings
) As DimensionStyle
Parameters
settings
Type: Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings
Return Value
Type: DimensionStyle
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace