Grasshopper API
ObjectVisibility Constructor
Initializes a new instance of the ObjectVisibility class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectVisibility()
Public Sub New
See Also
Reference
ObjectVisibility Class
ObjectVisibility Overload
Grasshopper.Rhinoceros.Display Namespace