Grasshopper API
ObjectDraftingLinetype.Value Constructor (ObjectLinetypeSource, ModelLinetype)
Initializes a new instance of the ObjectDraftingLinetype.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectLinetypeSource source,
	ModelLinetype value
)
Public Sub New (
	source As ObjectLinetypeSource,
	value As ModelLinetype
)
Parameters
source
Type: ObjectLinetypeSource
value
Type: Grasshopper.Rhinoceros.Drafting.ModelLinetype
See Also
Reference
ObjectDraftingLinetype.Value Structure
ObjectDraftingLinetype.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace