Grasshopper API
ModelView Constructor (ViewInfo)
Initializes a new instance of the ModelView class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView(
	ViewInfo viewInfo
)
Public Sub New (
	viewInfo As ViewInfo
)
Parameters
viewInfo
Type: ViewInfo
See Also
Reference
ModelView Class
ModelView Overload
Grasshopper.Rhinoceros.Display Namespace