Grasshopper API
GH_TextDot.Transform Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_GeometricGoo Transform(
	Transform xform
)
Public Overrides Function Transform (
	xform As Transform
) As IGH_GeometricGoo
Parameters
xform
Type: Transform
Return Value
Type: IGH_GeometricGoo
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace