Grasshopper API
GH_Extrusion.GetPreviewMeshes Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Mesh[] GetPreviewMeshes()
Public Function GetPreviewMeshes As Mesh()
Return Value
Type: Mesh[]
Implements
IGH_PreviewMeshData.GetPreviewMeshes()
See Also
Reference
GH_Extrusion Class
Grasshopper.Kernel.Types Namespace