Grasshopper API
ModelPageViewport Constructor (RhinoViewport)
Initializes a new instance of the ModelPageViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelPageViewport(
	RhinoViewport viewport
)
Public Sub New (
	viewport As RhinoViewport
)
Parameters
viewport
Type: RhinoViewport
See Also
Reference
ModelPageViewport Class
ModelPageViewport Overload
Grasshopper.Rhinoceros.Display Namespace