Grasshopper API
GH_BakeUtility.BakeObject Method
 Try and bake a single object.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool BakeObject(
	Object obj,
	ObjectAttributes att,
	RhinoDoc doc
)
Public Function BakeObject (
	obj As Object,
	att As ObjectAttributes,
	doc As RhinoDoc
) As Boolean
Parameters
obj
Type: System.Object
Object to bake, must at least implement IGH_BakeAwareData.
att
Type: ObjectAttributes
Object attributes.
doc
Type: RhinoDoc
Return Value
Type: Boolean
True if object was baked.
See Also
Reference
GH_BakeUtility Class
Grasshopper.Kernel Namespace