Grasshopper API
GH_Format.FormatClippingPlaneValidity Method
 If the clipping plane is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatClippingPlaneValidity(
	ClippingPlaneSurface val,
	string identifier = "Clipping Plane"
)
Public Shared Function FormatClippingPlaneValidity (
	val As ClippingPlaneSurface,
	Optional identifier As String = "Clipping Plane"
) As String
Parameters
val
Type: ClippingPlaneSurface
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the clipping plane is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace