Grasshopper API
GH_Format.FormatPointCloudValidity Method
 If the pointcloud is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatPointCloudValidity(
	PointCloud val,
	string identifier = "Point Cloud"
)
Public Shared Function FormatPointCloudValidity (
	val As PointCloud,
	Optional identifier As String = "Point Cloud"
) As String
Parameters
val
Type: PointCloud
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the pointcloud is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace