Grasshopper API
ModelUnitSystem Constructor (ModelUnitSystem.Value)
Initializes a new instance of the ModelUnitSystem class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem(
	ModelUnitSystem.Value attributes
)
Public Sub New (
	attributes As ModelUnitSystem.Value
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.ModelUnitSystem.Value
See Also
Reference
ModelUnitSystem Class
ModelUnitSystem Overload
Grasshopper.Rhinoceros Namespace