Grasshopper API
AnnotationToleranceSettings.Attributes.Write Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal override bool Write(
	GH_IWriter writer
)
Protected Friend Overrides Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace