Grasshopper API
Param_OrdinateDimension.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_OrdinateDimension PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_OrdinateDimension
Parameters
data
Type: System.Object
Return Value
Type: GH_OrdinateDimension
See Also
Reference
Param_OrdinateDimension Class
Grasshopper.Kernel.Parameters Namespace