Grasshopper API
ModelObject.Attributes.IsValidContentName Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal override bool IsValidContentName(
	ModelContentName value
)
Protected Friend Overrides Function IsValidContentName (
	value As ModelContentName
) As Boolean
Parameters
value
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: Boolean
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace