Grasshopper API
GH_AngularDimension Constructor (GH_AngularDimension)
 Create a duplicate of another GH_AngularDimension. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AngularDimension(
	GH_AngularDimension other
)
Public Sub New (
	other As GH_AngularDimension
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_AngularDimension
GH_AngularDimension to duplicate
See Also
Reference
GH_AngularDimension Class
GH_AngularDimension Overload
Grasshopper.Kernel.Types Namespace