Grasshopper API
ObjectDraftingColor.Value Implicit Conversion (ModelColor to ObjectDraftingColorObjectDraftingColor.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingColor.Value (
	ModelColor color
)
Public Shared Widening Operator CType (
	color As ModelColor
) As ObjectDraftingColor.Value
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: ObjectDraftingColor.Value
See Also
Reference
ObjectDraftingColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace