Grasshopper API
ModelData.WriteFont Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool WriteFont(
	GH_IWriter writer,
	string name,
	ref Font serializable
)
Public Shared Function WriteFont (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As Font
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: Font
Return Value
Type: Boolean
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace