Grasshopper API
Param_ModelContent Constructor
Initializes a new instance of the Param_ModelContent class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelContent()
Public Sub New
See Also
Reference
Param_ModelContent Class
Grasshopper.Rhinoceros.Params Namespace