Grasshopper API
Param_ModelMeshingParameters.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelMeshingParameters value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelMeshingParameters
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.ModelMeshingParameters
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelMeshingParameters Class
Grasshopper.Rhinoceros.Params Namespace