Grasshopper API
GH_TextDot.GH_TextDotProxy Constructor
Initializes a new instance of the GH_TextDot.GH_TextDotProxy class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextDotProxy(
	GH_TextDot Value
)
Public Sub New (
	Value As GH_TextDot
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_TextDot
See Also
Reference
GH_TextDot.GH_TextDotProxy Class
Grasshopper.Kernel.Types Namespace