Grasshopper API
ModelRenderTexture Implicit Conversion (String to ModelRenderTexture)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderTexture (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelRenderTexture
Parameters
path
Type: System.String
Return Value
Type: ModelRenderTexture
See Also
Reference
ModelRenderTexture Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace