Grasshopper API
Param_TextEntity.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_TextEntity InstantiateT()
Protected Overrides Function InstantiateT As GH_TextEntity
Return Value
Type: GH_TextEntity
See Also
Reference
Param_TextEntity Class
Grasshopper.Kernel.Parameters Namespace