Grasshopper API
ModelHatchLine.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchLine.Attributes ToAttributes()
Public Function ToAttributes As ModelHatchLine.Attributes
Return Value
Type: ModelHatchLine.Attributes
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace