Grasshopper API
GH_Leader Constructor
 Default constructor, creates an invalid leader.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Leader()
Public Sub New
See Also
Reference
GH_Leader Class
GH_Leader Overload
Grasshopper.Kernel.Types Namespace