Grasshopper API
GH_InstanceReference.Duplicate Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_Goo Duplicate()
Public Overrides Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace