Grasshopper API
ModelContentParam<T> Constructor
Initializes a new instance of the ModelContentParam<T> class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelContentParam(
	GH_InstanceDescription nTag
)
Protected Sub New (
	nTag As GH_InstanceDescription
)
Parameters
nTag
Type: Grasshopper.Kernel.GH_InstanceDescription
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace