Grasshopper API
Param_ModelObject.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelObject value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelObject
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Model.ModelObject
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace