Grasshopper API
GH_LinearDimension Constructor (GH_LinearDimension)
 Create a duplicate of another GH_LinearDimension. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_LinearDimension(
	GH_LinearDimension other
)
Public Sub New (
	other As GH_LinearDimension
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_LinearDimension
GH_LinearDimension to duplicate
See Also
Reference
GH_LinearDimension Class
GH_LinearDimension Overload
Grasshopper.Kernel.Types Namespace