Grasshopper API
GH_Document.RunningAsCommand Method
 When the document is being solved inside the context of an executing Rhino command, this function will return the command instance. Under normal operation of Grasshopper in the traditional sense, this function will return null. The document executes as a command when inside of the grasshopper player or as a compiled grasshopper player based command. The way to run a GH_Document as a command is to call the GH_RhinoScriptInterface.RunAsCommand function
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Command RunningAsCommand()
Public Function RunningAsCommand As Command
Return Value
Type: Command
 executing command when running as a command; otherwise null
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace