Grasshopper API
EtoExtensions.ToSwf Method
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Control ToSwf(
	this Control control,
	bool attach = false
)
<ExtensionAttribute>
Public Shared Function ToSwf (
	control As Control,
	Optional attach As Boolean = false
) As Control
Parameters
control
Type: Control
attach (Optional)
Type: System.Boolean
Return Value
Type: Control
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Control. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EtoExtensions Class
Grasshopper Namespace