Grasshopper API
GH_Dimension Constructor (Dimension, ModelAnnotationStyle)
 Create a duplicate of an existing dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_Dimension(
	Dimension dimension,
	ModelAnnotationStyle style
)
Protected Sub New (
	dimension As Dimension,
	style As ModelAnnotationStyle
)
Parameters
dimension
Type: Dimension
Dimension to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_Dimension Class
GH_Dimension Overload
Grasshopper.Kernel.Types Namespace