Grasshopper API
ObjectDraftingColor.Value Implicit Conversion (ObjectPlotColorSource to ObjectDraftingColorObjectDraftingColor.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingColor.Value (
	ObjectPlotColorSource source
)
Public Shared Widening Operator CType (
	source As ObjectPlotColorSource
) As ObjectDraftingColor.Value
Parameters
source
Type: ObjectPlotColorSource
Return Value
Type: ObjectDraftingColor.Value
See Also
Reference
ObjectDraftingColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace