Grasshopper API
ModelTags Implicit Conversion (String to ModelTags)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelTags (
	string value
)
Public Shared Widening Operator CType (
	value As String
) As ModelTags
Parameters
value
Type: System.String
Return Value
Type: ModelTags
See Also
Reference
ModelTags Structure
Implicit Overload
Grasshopper.Rhinoceros Namespace