Grasshopper API
Param_RadialDimension.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_RadialDimension> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_RadialDimension)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_RadialDimension>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_RadialDimension Class
Grasshopper.Kernel.Parameters Namespace