Grasshopper API
ModelDetailViewport Constructor
Initializes a new instance of the ModelDetailViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDetailViewport()
Public Sub New
See Also
Reference
ModelDetailViewport Class
ModelDetailViewport Overload
Grasshopper.Rhinoceros.Display Namespace