Grasshopper API
Param_ModelView.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelView value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelView
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ModelView
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace