Grasshopper API
GH_Hatch.LoadGeometry Method (RhinoDoc)
 If the hatch is referenced and not yet loaded, attempts to load the hatch.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool LoadGeometry(
	RhinoDoc doc
)
Public Overrides Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Return Value
Type: Boolean
True if the hatch is loaded (or if it was already loaded), False on failure.
See Also
Reference
GH_Hatch Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace