Grasshopper API
IGH_DocumentObject.RecordUndoEvent Method (String)
 Record a generic object change undo event.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
Guid RecordUndoEvent(
	string undoName
)
Function RecordUndoEvent (
	undoName As String
) As Guid
Parameters
undoName
Type: System.String
Name of undo record.
Return Value
Type: Guid
See Also
Reference
IGH_DocumentObject Interface
RecordUndoEvent Overload
Grasshopper.Kernel Namespace