Grasshopper API
ModelObject Constructor (Guid)
Initializes a new instance of the ModelObject class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelObject(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelObject Class
ModelObject Overload
Grasshopper.Rhinoceros.Model Namespace