Grasshopper API
ModelUserText.Equality Operator
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator ==(
	ModelUserText left,
	ModelUserText right
)
Public Shared Operator = (
	left As ModelUserText,
	right As ModelUserText
) As Boolean
Parameters
left
Type: Grasshopper.Rhinoceros.ModelUserText
right
Type: Grasshopper.Rhinoceros.ModelUserText
Return Value
Type: Boolean
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace