Grasshopper API
Param_ModelRenderTexture Constructor
Initializes a new instance of the Param_ModelRenderTexture class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelRenderTexture()
Public Sub New
See Also
Reference
Param_ModelRenderTexture Class
Grasshopper.Rhinoceros.Render.Params Namespace