Grasshopper API
ModelData.Read Method (GH_IReader, String, IReadOnlyList<Byte>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void Read(
	GH_IReader reader,
	string name,
	out IReadOnlyList<byte> serializable
)
Protected Friend Shared Sub Read (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As IReadOnlyList(Of Byte)
)
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: System.Collections.Generic.IReadOnlyList<Byte>
See Also
Reference
ModelData Class
Read Overload
Grasshopper.Rhinoceros Namespace