Grasshopper API
ModelRenderMaterial Implicit Conversion (Material to ModelRenderMaterial)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderMaterial (
	Material material
)
Public Shared Widening Operator CType (
	material As Material
) As ModelRenderMaterial
Parameters
material
Type: Material
Return Value
Type: ModelRenderMaterial
See Also
Reference
ModelRenderMaterial Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace