Grasshopper API
GH_AngularDimension Constructor (Guid)
 Create a new referenced angular dimension that references a Rhino dimension with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AngularDimension(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of dimension object to reference.
See Also
Reference
GH_AngularDimension Class
GH_AngularDimension Overload
Grasshopper.Kernel.Types Namespace