Grasshopper API
GH_Extrusion.GH_ExtrusionProxy Constructor
Initializes a new instance of the GH_Extrusion.GH_ExtrusionProxy class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ExtrusionProxy(
	GH_Extrusion Value
)
Public Sub New (
	Value As GH_Extrusion
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Extrusion
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace