Grasshopper API
Param_AnnotationArrow.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationArrow PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationArrow
Parameters
data
Type: System.Object
Return Value
Type: AnnotationArrow
See Also
Reference
Param_AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations.Params Namespace