Grasshopper API
Param_ModelTextureMapping.DrawViewportWires Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportWires(
	IGH_PreviewArgs args
)
Public Sub DrawViewportWires (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Implements
IGH_PreviewObject.DrawViewportWires(IGH_PreviewArgs)
See Also
Reference
Param_ModelTextureMapping Class
Grasshopper.Rhinoceros.Render.Params Namespace