Grasshopper API
ModelViewport.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelViewport Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelViewport
Parameters
data
Type: System.Object
Return Value
Type: ModelViewport
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace