Grasshopper API
ModelDisplayMode Implicit Conversion (String to ModelDisplayMode)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelDisplayMode (
	string name
)
Public Shared Widening Operator CType (
	name As String
) As ModelDisplayMode
Parameters
name
Type: System.String
Return Value
Type: ModelDisplayMode
See Also
Reference
ModelDisplayMode Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace