Grasshopper API
ItemDisplayColor.Value Constructor (ItemColorSource)
Initializes a new instance of the ItemDisplayColor.Value class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ItemColorSource source
)
Public Sub New (
	source As ItemColorSource
)
Parameters
source
Type: ItemColorSource
See Also
Reference
ItemDisplayColor.Value Structure
ItemDisplayColor.Value Overload
Grasshopper.Rhinoceros.Display Namespace