Grasshopper API
ModelDetailViewport Constructor (RhinoViewport)
Initializes a new instance of the ModelDetailViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDetailViewport(
	RhinoViewport viewport
)
Public Sub New (
	viewport As RhinoViewport
)
Parameters
viewport
Type: RhinoViewport
See Also
Reference
ModelDetailViewport Class
ModelDetailViewport Overload
Grasshopper.Rhinoceros.Display Namespace