Grasshopper API
ModelObject.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelObject.Attributes ToAttributes()
Public Function ToAttributes As ModelObject.Attributes
Return Value
Type: ModelObject.Attributes
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace