Grasshopper API
ModelColor.FromArgb Method (Int32)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelColor FromArgb(
	int argb
)
Public Shared Function FromArgb (
	argb As Integer
) As ModelColor
Parameters
argb
Type: System.Int32
Return Value
Type: ModelColor
See Also
Reference
ModelColor Structure
FromArgb Overload
Grasshopper.Rhinoceros Namespace