Grasshopper API
GH_Param<T>.Menu_AppendConnectRecipients Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal virtual void Menu_AppendConnectRecipients(
	ToolStripDropDown menu
)
Protected Friend Overridable Sub Menu_AppendConnectRecipients (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace