Grasshopper API
GH_RenderArgs Constructor (RhinoDoc, ViewportInfo, RenderPrimitiveList, Guid, Dictionary<Int32, RenderMaterial>)
Note: This API is now obsolete.
 Create new render arguments.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute]
public GH_RenderArgs(
	RhinoDoc doc,
	ViewportInfo vp,
	RenderPrimitiveList geometry,
	Guid id,
	Dictionary<int, RenderMaterial> materialCache
)
<ObsoleteAttribute>
Public Sub New (
	doc As RhinoDoc,
	vp As ViewportInfo,
	geometry As RenderPrimitiveList,
	id As Guid,
	materialCache As Dictionary(Of Integer, RenderMaterial)
)
Parameters
doc
Type: RhinoDoc
Rhino document.
vp
Type: ViewportInfo
Viewport.
geometry
Type: RenderPrimitiveList
Geometry list.
id
Type: System.Guid
Render plugin id.
materialCache
Type: System.Collections.Generic.Dictionary<Int32, RenderMaterial>
Material cache - can be Nothing.
See Also
Reference
GH_RenderArgs Class
GH_RenderArgs Overload
Grasshopper.Kernel Namespace