Grasshopper API
GH_Light.Morph Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_GeometricGoo Morph(
	SpaceMorph xmorph
)
Public Overrides Function Morph (
	xmorph As SpaceMorph
) As IGH_GeometricGoo
Parameters
xmorph
Type: SpaceMorph
Return Value
Type: IGH_GeometricGoo
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace