Grasshopper API
Utility.FixNewlines Method (String, String)
 Make sure all newlines in a string have a specific pattern.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FixNewlines(
	string text,
	string newLinePattern
)
Public Shared Function FixNewlines (
	text As String,
	newLinePattern As String
) As String
Parameters
text
Type: System.String
Text to fix.
newLinePattern
Type: System.String
Newline string to use.
Return Value
Type: String
Fixed string
See Also
Reference
Utility Class
FixNewlines Overload
Grasshopper Namespace