Grasshopper API
GH_SubD.ClearCaches Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace