Grasshopper API
ModelConstructionPlane.Equals Method (ModelConstructionPlane)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelConstructionPlane other
)
Public Function Equals (
	other As ModelConstructionPlane
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ModelConstructionPlane
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelConstructionPlane Class
Equals Overload
Grasshopper.Rhinoceros.Display Namespace