Grasshopper API
GH_ClippingPlane.ToString Method
 Format the clipping plane using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace