Grasshopper API
Param_ModelInstanceDefinition.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelInstanceDefinition> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelInstanceDefinition)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelInstanceDefinition>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model.Params Namespace