Grasshopper API
ModelRenderMaterial.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial.Attributes ToAttributes()
Public Function ToAttributes As ModelRenderMaterial.Attributes
Return Value
Type: ModelRenderMaterial.Attributes
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace