Grasshopper API
GH_AnnotationBase Constructor (GH_AnnotationBase)
 Create a duplicate of another GH_AnnotationBase. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_AnnotationBase(
	GH_AnnotationBase other
)
Protected Sub New (
	other As GH_AnnotationBase
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_AnnotationBase
GH_AnnotationBase to duplicate
See Also
Reference
GH_AnnotationBase Class
GH_AnnotationBase Overload
Grasshopper.Kernel.Types Namespace