Grasshopper API
Param_MatchText.Menu_SingleStringValueKeyDown Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected void Menu_SingleStringValueKeyDown(
	GH_MenuTextBox sender,
	KeyEventArgs e
)
Protected Sub Menu_SingleStringValueKeyDown (
	sender As GH_MenuTextBox,
	e As KeyEventArgs
)
Parameters
sender
Type: Grasshopper.GUI.GH_MenuTextBox
e
Type: System.Windows.Forms.KeyEventArgs
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace