Grasshopper API
Param_ModelHatchPattern Constructor
Initializes a new instance of the Param_ModelHatchPattern class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelHatchPattern()
Public Sub New
See Also
Reference
Param_ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting.Params Namespace