Grasshopper API
AnnotationLeaderSettings Explicit Conversion (AnnotationLeaderSettings to DimensionStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator DimensionStyle (
	AnnotationLeaderSettings settings
)
Public Shared Narrowing Operator CType (
	settings As AnnotationLeaderSettings
) As DimensionStyle
Parameters
settings
Type: Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings
Return Value
Type: DimensionStyle
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace