Grasshopper API
Param_RadialDimension.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_RadialDimension InstantiateT()
Protected Overrides Function InstantiateT As GH_RadialDimension
Return Value
Type: GH_RadialDimension
See Also
Reference
Param_RadialDimension Class
Grasshopper.Kernel.Parameters Namespace