Grasshopper API
ModelRenderContent Constructor (ModelRenderContent.Attributes, Guid)
Initializes a new instance of the ModelRenderContent class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelRenderContent(
	ModelRenderContent.Attributes attributes,
	Guid id
)
Protected Friend Sub New (
	attributes As ModelRenderContent.Attributes,
	id As Guid
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes
id
Type: System.Guid
See Also
Reference
ModelRenderContent Class
ModelRenderContent Overload
Grasshopper.Rhinoceros.Render Namespace