Grasshopper API
GH_Dimension.GH_DimensionProxy Constructor
Initializes a new instance of the GH_Dimension.GH_DimensionProxy class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_DimensionProxy(
	GH_Dimension Value
)
Public Sub New (
	Value As GH_Dimension
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Dimension
See Also
Reference
GH_Dimension.GH_DimensionProxy Class
Grasshopper.Kernel.Types Namespace