Grasshopper API
ModelPageViewport Implicit Conversion (ModelPageViewport.Attributes to ModelPageViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelPageViewport (
	ModelPageViewport.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelPageViewport.Attributes
) As ModelPageViewport
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelPageViewport.Attributes
Return Value
Type: ModelPageViewport
See Also
Reference
ModelPageViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace