Grasshopper API
ModelView.EqualsViewportInfo Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool EqualsViewportInfo(
	ViewportInfo x,
	ViewportInfo y
)
Public Shared Function EqualsViewportInfo (
	x As ViewportInfo,
	y As ViewportInfo
) As Boolean
Parameters
x
Type: ViewportInfo
y
Type: ViewportInfo
Return Value
Type: Boolean
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace