Grasshopper API
ModelHatchPattern Constructor (ModelHatchPattern.Attributes)
Initializes a new instance of the ModelHatchPattern class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern(
	ModelHatchPattern.Attributes attributes
)
Public Sub New (
	attributes As ModelHatchPattern.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Attributes
See Also
Reference
ModelHatchPattern Class
ModelHatchPattern Overload
Grasshopper.Rhinoceros.Drafting Namespace