Grasshopper API
Param_Centermark.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_Centermark> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_Centermark)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_Centermark>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Centermark Class
Grasshopper.Kernel.Parameters Namespace