Grasshopper API
ModelComponentContent.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToDetails()
Public Overrides Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelComponentContent.Attributes Class
Grasshopper.Rhinoceros Namespace