Grasshopper API
ModelComponentContent Constructor (ModelComponentContent.Attributes)
Initializes a new instance of the ModelComponentContent class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelComponentContent(
	ModelComponentContent.Attributes attributes
)
Protected Friend Sub New (
	attributes As ModelComponentContent.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.ModelComponentContent.Attributes
See Also
Reference
ModelComponentContent Class
ModelComponentContent Overload
Grasshopper.Rhinoceros Namespace