Grasshopper API
ModelConstructionPlane Constructor (Plane, String)
Initializes a new instance of the ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane(
	Plane plane,
	string title
)
Public Sub New (
	plane As Plane,
	title As String
)
Parameters
plane
Type: Plane
title
Type: System.String
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace