Grasshopper API
AnnotationToleranceSettings Explicit Conversion (AnnotationToleranceSettings to DimensionStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator DimensionStyle (
	AnnotationToleranceSettings settings
)
Public Shared Narrowing Operator CType (
	settings As AnnotationToleranceSettings
) As DimensionStyle
Parameters
settings
Type: Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings
Return Value
Type: DimensionStyle
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace