Grasshopper API
GH_UpgradeUtil.MigrateSources Method (IEnumerable<IGH_Param>, IGH_Param)
 Utility method for bulk assigning a bunch of sources.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int MigrateSources(
	IEnumerable<IGH_Param> sources,
	IGH_Param target
)
Public Shared Function MigrateSources (
	sources As IEnumerable(Of IGH_Param),
	target As IGH_Param
) As Integer
Parameters
sources
Type: System.Collections.Generic.IEnumerable<IGH_Param>
target
Type: Grasshopper.Kernel.IGH_Param
Return Value
Type: Int32
See Also
Reference
GH_UpgradeUtil Class
MigrateSources Overload
Grasshopper.Kernel Namespace