Grasshopper API
AnnotationTextSettings Implicit Conversion (AnnotationTextSettings.Attributes to AnnotationTextSettings)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationTextSettings (
	AnnotationTextSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As AnnotationTextSettings.Attributes
) As AnnotationTextSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes
Return Value
Type: AnnotationTextSettings
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace