Grasshopper API
ObjectSectionStyle Constructor
Initializes a new instance of the ObjectSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionStyle()
Public Sub New
See Also
Reference
ObjectSectionStyle Class
ObjectSectionStyle Overload
Grasshopper.Rhinoceros.Drafting Namespace