Grasshopper API
GH_SubD.GH_SubDProxy Constructor
Initializes a new instance of the GH_SubD.GH_SubDProxy class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_SubDProxy(
	GH_SubD Value
)
Public Sub New (
	Value As GH_SubD
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_SubD
See Also
Reference
GH_SubD.GH_SubDProxy Class
Grasshopper.Kernel.Types Namespace