Grasshopper API
ObjectDisplay Constructor
Initializes a new instance of the ObjectDisplay class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplay()
Public Sub New
See Also
Reference
ObjectDisplay Class
ObjectDisplay Overload
Grasshopper.Rhinoceros.Display Namespace