Grasshopper API
ObjectRenderMaterial.Value Implicit Conversion (ObjectRenderMaterial.Value to ObjectMaterialSource)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectMaterialSource (
	ObjectRenderMaterial.Value value
)
Public Shared Widening Operator CType (
	value As ObjectRenderMaterial.Value
) As ObjectMaterialSource
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value
Return Value
Type: ObjectMaterialSource
See Also
Reference
ObjectRenderMaterial.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace