Grasshopper API
Param_ClippingPlane.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_ClippingPlane InstantiateT()
Protected Overrides Function InstantiateT As GH_ClippingPlane
Return Value
Type: GH_ClippingPlane
See Also
Reference
Param_ClippingPlane Class
Grasshopper.Kernel.Parameters Namespace