Grasshopper API
Param_ModelView Constructor
Initializes a new instance of the Param_ModelView class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelView()
Public Sub New
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace