Grasshopper API
GH_OrdinateDimension Constructor (Guid)
 Create a new referenced ordinate dimension that references a Rhino dimension with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_OrdinateDimension(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of dimension object to reference.
See Also
Reference
GH_OrdinateDimension Class
GH_OrdinateDimension Overload
Grasshopper.Kernel.Types Namespace