Grasshopper API
IGH_ContextualParameter.AssignContextualData Method
 Assign a collection of values as contextual data.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
void AssignContextualData(
	IEnumerable data
)
Sub AssignContextualData (
	data As IEnumerable
)
Parameters
data
Type: System.Collections.IEnumerable
Data to assign. Should be of expected type.
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace