Grasshopper API
ModelUserText.ContainsKey Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool ContainsKey(
	string key
)
Public Function ContainsKey (
	key As String
) As Boolean
Parameters
key
Type: System.String
Return Value
Type: Boolean
Implements
IReadOnlyDictionary<TKey, TValue>.ContainsKey(TKey)
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace