Grasshopper API
Param_ModelLinetype.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelLinetype PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelLinetype
Parameters
data
Type: System.Object
Return Value
Type: ModelLinetype
See Also
Reference
Param_ModelLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace