Grasshopper API
AnnotationToleranceSettings Constructor
Initializes a new instance of the AnnotationToleranceSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationToleranceSettings()
Public Sub New
See Also
Reference
AnnotationToleranceSettings Class
AnnotationToleranceSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace