Grasshopper API
ModelFont.IsFamilyNameInstalled Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool IsFamilyNameInstalled(
	string familyName
)
Public Shared Function IsFamilyNameInstalled (
	familyName As String
) As Boolean
Parameters
familyName
Type: System.String
Return Value
Type: Boolean
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace