Grasshopper API
ModelData.Write Method (GH_IWriter, String, IReadOnlyList<Point2d>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void Write(
	GH_IWriter writer,
	string name,
	in IReadOnlyList<Point2d> serializable
)
Protected Friend Shared Sub Write (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As IReadOnlyList(Of Point2d)
)
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: System.Collections.Generic.IReadOnlyList<Point2d>
See Also
Reference
ModelData Class
Write Overload
Grasshopper.Rhinoceros Namespace