Grasshopper API
ModelColor.FromArgb Method (Byte, Byte, Byte, Byte)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelColor FromArgb(
	byte a,
	byte r,
	byte g,
	byte b
)
Public Shared Function FromArgb (
	a As Byte,
	r As Byte,
	g As Byte,
	b As Byte
) As ModelColor
Parameters
a
Type: System.Byte
r
Type: System.Byte
g
Type: System.Byte
b
Type: System.Byte
Return Value
Type: ModelColor
See Also
Reference
ModelColor Structure
FromArgb Overload
Grasshopper.Rhinoceros Namespace