Grasshopper API
GH_InstanceReference.EmitProxy Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_GooProxy EmitProxy()
Public Overrides Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
Implements
IGH_Goo.EmitProxy()
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace