Grasshopper API
ModelEarthAnchorPoint Constructor (ModelEarthAnchorPoint.Attributes)
Initializes a new instance of the ModelEarthAnchorPoint class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelEarthAnchorPoint(
	ModelEarthAnchorPoint.Attributes attributes
)
Public Sub New (
	attributes As ModelEarthAnchorPoint.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes
See Also
Reference
ModelEarthAnchorPoint Class
ModelEarthAnchorPoint Overload
Grasshopper.Rhinoceros.Model Namespace