Grasshopper API
Param_AnnotationLeaderSettings Constructor
Initializes a new instance of the Param_AnnotationLeaderSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_AnnotationLeaderSettings()
Public Sub New
See Also
Reference
Param_AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace