Grasshopper API
Param_ModelView.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelView PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelView
Parameters
data
Type: System.Object
Return Value
Type: ModelView
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace