Grasshopper API
ModelLineWidth.ScriptVariable Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Object ScriptVariable()
Public Function ScriptVariable As Object
Return Value
Type: Object
Implements
IGH_Goo.ScriptVariable()
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace