Grasshopper API
ModelContentName.OnesComplement Operator
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelContentName operator ~(
	ModelContentName value
)
Public Shared Operator ~ (
	value As ModelContentName
) As ModelContentName
Parameters
value
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: ModelContentName
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace