Grasshopper API
Param_ModelHatchLine.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelHatchLine value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelHatchLine
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchLine
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting.Params Namespace