Grasshopper API
ItemDisplayColor.Value.Deconstruct Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Deconstruct(
	out ItemColorSource source,
	out ModelColor value
)
Public Sub Deconstruct (
	<OutAttribute> ByRef source As ItemColorSource,
	<OutAttribute> ByRef value As ModelColor
)
Parameters
source
Type: ItemColorSource
value
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace