Grasshopper API
AnnotationArrow Constructor (DimensionStyle.ArrowType)
Initializes a new instance of the AnnotationArrow class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrow(
	ArrowType arrowType
)
Public Sub New (
	arrowType As ArrowType
)
Parameters
arrowType
Type: ArrowType
See Also
Reference
AnnotationArrow Class
AnnotationArrow Overload
Grasshopper.Rhinoceros.Annotations Namespace