Grasshopper API
GH_Document.IsRenderMeshPipelineViewport Method
 Test to see whether a pipeline should have custom render meshes vs. previews.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsRenderMeshPipelineViewport(
	DisplayPipeline pipeline
)
Public Function IsRenderMeshPipelineViewport (
	pipeline As DisplayPipeline
) As Boolean
Parameters
pipeline
Type: DisplayPipeline
Display pipeline.
Return Value
Type: Boolean
True if custom meshes ought to be used rather than previews.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace