Grasshopper API
ModelStandardViewport.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelStandardViewport.Attributes ToAttributes()
Public Function ToAttributes As ModelStandardViewport.Attributes
Return Value
Type: ModelStandardViewport.Attributes
See Also
Reference
ModelStandardViewport Class
Grasshopper.Rhinoceros.Display Namespace