Grasshopper API
ModelData.Equals Method (ModelData)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelData other
)
Public Function Equals (
	other As ModelData
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelData
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelData Class
Equals Overload
Grasshopper.Rhinoceros Namespace