Grasshopper API
ModelSpaceViewport Constructor (ModelSpaceViewport.Attributes)
Initializes a new instance of the ModelSpaceViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelSpaceViewport(
	ModelSpaceViewport.Attributes attributes
)
Protected Friend Sub New (
	attributes As ModelSpaceViewport.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelSpaceViewport.Attributes
See Also
Reference
ModelSpaceViewport Class
ModelSpaceViewport Overload
Grasshopper.Rhinoceros.Display Namespace