Grasshopper API
ObjectDraftingColor.Value Implicit Conversion (ObjectDraftingColor.Value to ObjectPlotColorSource)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectPlotColorSource (
	ObjectDraftingColor.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDraftingColor.Value
) As ObjectPlotColorSource
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value
Return Value
Type: ObjectPlotColorSource
See Also
Reference
ObjectDraftingColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace