Grasshopper API
ModelContent.InternaliseData Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected bool InternaliseData()
Protected Function InternaliseData As Boolean
Return Value
Type: Boolean
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace