Grasshopper API
GH_Format.FormatLinearDimension Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatLinearDimension(
	GH_LinearDimension data
)
Public Shared Function FormatLinearDimension (
	data As GH_LinearDimension
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_LinearDimension
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace