Grasshopper API
GH_ScriptVariant Explicit Conversion (GH_ScriptVariant to Point3d)
 Namespace: Grasshopper.Kernel.Expressions
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator Point3d (
	GH_ScriptVariant in
)
Public Shared Narrowing Operator CType (
	in As GH_ScriptVariant
) As Point3d
Parameters
in
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: Point3d
See Also
Reference
GH_ScriptVariant Class
Explicit Overload
Grasshopper.Kernel.Expressions Namespace