Grasshopper API
ModelTags.ToString Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace