Grasshopper API
GH_AsynchFileData Constructor
 Asynchronous constructor. File properties will be loaded asychronously.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AsynchFileData(
	string filePath,
	bool harvestThumbnail,
	GH_AsynchFileData.FileChangedDelegate callback
)
Public Sub New (
	filePath As String,
	harvestThumbnail As Boolean,
	callback As GH_AsynchFileData.FileChangedDelegate
)
Parameters
filePath
Type: System.String
Location of file
harvestThumbnail
Type: System.Boolean
If true, thumbnail data will be loaded.
callback
Type: Grasshopper.GUI.GH_AsynchFileData.FileChangedDelegate
Callback delegate for file changes.
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace