Grasshopper API
GH_DetailView Constructor (DetailView)
 Create a duplicate of an existing detail view.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_DetailView(
	DetailView detailView
)
Public Sub New (
	detailView As DetailView
)
Parameters
detailView
Type: DetailView
DetailView to duplicate
See Also
Reference
GH_DetailView Class
GH_DetailView Overload
Grasshopper.Kernel.Types Namespace