Grasshopper API
Param_ModelRenderTexture.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelRenderTexture> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelRenderTexture)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelRenderTexture>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelRenderTexture Class
Grasshopper.Rhinoceros.Render.Params Namespace