Grasshopper API
ModelObject Implicit Conversion (RhinoObject to ModelObject)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelObject (
	RhinoObject object
)
Public Shared Widening Operator CType (
	object As RhinoObject
) As ModelObject
Parameters
object
Type: RhinoObject
Return Value
Type: ModelObject
See Also
Reference
ModelObject Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace