Grasshopper API
GH_Predicate.TryCastTo<T> Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool TryCastTo<T>(
	Object source,
	out T target
)
Public Shared Function TryCastTo(Of T) (
	source As Object,
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
source
Type: System.Object
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace