Grasshopper API
ModelColor.CompareTo Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ModelColor other
)
Public Function CompareTo (
	other As ModelColor
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace