Grasshopper API
ModelTextureMapping Constructor (TextureMapping, Int32, Transform)
Initializes a new instance of the ModelTextureMapping class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureMapping(
	TextureMapping textureMapping,
	int channel,
	Transform xform
)
Public Sub New (
	textureMapping As TextureMapping,
	channel As Integer,
	xform As Transform
)
Parameters
textureMapping
Type: TextureMapping
channel
Type: System.Int32
xform
Type: Transform
See Also
Reference
ModelTextureMapping Class
ModelTextureMapping Overload
Grasshopper.Rhinoceros.Render Namespace