Grasshopper API
ObjectDisplay Implicit Conversion (ObjectDisplay.Attributes to ObjectDisplay)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDisplay (
	ObjectDisplay.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ObjectDisplay.Attributes
) As ObjectDisplay
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ObjectDisplay.Attributes
Return Value
Type: ObjectDisplay
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace