Grasshopper API
ModelSectionStyle Constructor (ModelSectionStyle.Attributes)
Initializes a new instance of the ModelSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle(
	ModelSectionStyle.Attributes attributes
)
Public Sub New (
	attributes As ModelSectionStyle.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes
See Also
Reference
ModelSectionStyle Class
ModelSectionStyle Overload
Grasshopper.Rhinoceros.Drafting Namespace