Grasshopper API
Param_ModelObject.DrawViewportMeshes Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportMeshes(
	IGH_PreviewArgs args
)
Public Sub DrawViewportMeshes (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Implements
IGH_PreviewObject.DrawViewportMeshes(IGH_PreviewArgs)
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace