Grasshopper API
DisplayColorGradient Constructor (DisplayColorGradient)
Initializes a new instance of the DisplayColorGradient class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorGradient(
	DisplayColorGradient other
)
Public Sub New (
	other As DisplayColorGradient
)
Parameters
other
Type: Grasshopper.Rhinoceros.Display.DisplayColorGradient
See Also
Reference
DisplayColorGradient Class
DisplayColorGradient Overload
Grasshopper.Rhinoceros.Display Namespace