Grasshopper API
Param_ModelPageViewport.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelPageViewport value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelPageViewport
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ModelPageViewport
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelPageViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace