Grasshopper API
ModelSectionStyle.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelSectionStyle Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelSectionStyle
Parameters
source
Type: System.Object
Return Value
Type: ModelSectionStyle
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace