Grasshopper API
ModelLinetype.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype.Attributes ToAttributes()
Public Function ToAttributes As ModelLinetype.Attributes
Return Value
Type: ModelLinetype.Attributes
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace