Grasshopper API
Param_EarthAnchorPoint.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelEarthAnchorPoint value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelEarthAnchorPoint
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint
Return Value
Type: GH_GetterResult
See Also
Reference
Param_EarthAnchorPoint Class
Grasshopper.Rhinoceros.Model.Params Namespace