Grasshopper API
ModelLayer Implicit Conversion (ModelLayer.Attributes to ModelLayer)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLayer (
	ModelLayer.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelLayer.Attributes
) As ModelLayer
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelLayer.Attributes
Return Value
Type: ModelLayer
See Also
Reference
ModelLayer Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace