Grasshopper API
Param_ModelConstructionPlane.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelConstructionPlane PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelConstructionPlane
Parameters
data
Type: System.Object
Return Value
Type: ModelConstructionPlane
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace