Grasshopper API
Param_ModelDisplayMode Constructor
Initializes a new instance of the Param_ModelDisplayMode class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelDisplayMode()
Public Sub New
See Also
Reference
Param_ModelDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace