Grasshopper API
ModelViewport.Attributes.Equals Method (Object, IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override bool Equals(
	Object other,
	IEqualityComparer comparer
)
Protected Overrides Function Equals (
	other As Object,
	comparer As IEqualityComparer
) As Boolean
Parameters
other
Type: System.Object
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Boolean
See Also
Reference
ModelViewport.Attributes Class
Equals Overload
Grasshopper.Rhinoceros.Display Namespace