Grasshopper API
Param_TextEntity.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_TextEntity> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_TextEntity)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_TextEntity>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_TextEntity Class
Grasshopper.Kernel.Parameters Namespace