Grasshopper API
Param_ModelConstructionPlane Constructor
Initializes a new instance of the Param_ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelConstructionPlane()
Public Sub New
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace