Grasshopper API
ModelValue.Read Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal abstract bool Read(
	GH_IReader reader
)
Protected Friend MustOverride Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
Implements
GH_ISerializable.Read(GH_IReader)
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace