Grasshopper API
Param_ModelObject Constructor
Initializes a new instance of the Param_ModelObject class
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelObject()
Public Sub New
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace