Grasshopper API
ObjectDraftingLineWidth.Value.CompareTo Method (Object)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	Object obj
)
Public Function CompareTo (
	obj As Object
) As Integer
Parameters
obj
Type: System.Object
Return Value
Type: Int32
Implements
IComparable.CompareTo(Object)
See Also
Reference
ObjectDraftingLineWidth.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Drafting Namespace