Grasshopper API
Param_ObjectRenderMaterial.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectRenderMaterial PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectRenderMaterial
Parameters
data
Type: System.Object
Return Value
Type: ObjectRenderMaterial
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace