Grasshopper API
Param_ObjectDrafting Constructor
Initializes a new instance of the Param_ObjectDrafting class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectDrafting()
Public Sub New
See Also
Reference
Param_ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting.Params Namespace