Grasshopper API
ModelTags.Subtraction Operator
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelTags operator -(
	ModelTags left,
	IEnumerable<string> right
)
Public Shared Operator - (
	left As ModelTags,
	right As IEnumerable(Of String)
) As ModelTags
Parameters
left
Type: Grasshopper.Rhinoceros.ModelTags
right
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: ModelTags
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace