Grasshopper API
PageSettings Constructor
Initializes a new instance of the PageSettings class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public PageSettings()
Public Sub New
See Also
Reference
PageSettings Class
PageSettings Overload
Grasshopper.Rhinoceros.Display Namespace