Grasshopper API
GH_Hatch Constructor (Hatch)
 Create a duplicate of an existing hatch.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Hatch(
	Hatch hatch
)
Public Sub New (
	hatch As Hatch
)
Parameters
hatch
Type: Hatch
Hatch to duplicate
See Also
Reference
GH_Hatch Class
GH_Hatch Overload
Grasshopper.Kernel.Types Namespace