Grasshopper API
ModelLineWidth.ToString Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Implements
IGH_Goo.ToString()
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace