Grasshopper API
EtoExtensions.ToEto Method (PointF)
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static PointF ToEto(
	this PointF point
)
<ExtensionAttribute>
Public Shared Function ToEto (
	point As PointF
) As PointF
Parameters
point
Type: System.Drawing.PointF
Return Value
Type: PointF
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type PointF. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EtoExtensions Class
ToEto Overload
Grasshopper Namespace