Grasshopper API
ItemDisplayColor Implicit Conversion (ItemDisplayColor.Value to ItemDisplayColor)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ItemDisplayColor (
	ItemDisplayColor.Value data
)
Public Shared Widening Operator CType (
	data As ItemDisplayColor.Value
) As ItemDisplayColor
Parameters
data
Type: Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value
Return Value
Type: ItemDisplayColor
See Also
Reference
ItemDisplayColor Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace