Grasshopper API
ObjectDraftingLinetype.Value Implicit Conversion (ObjectDraftingLinetype.Value to ModelLinetype)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLinetype (
	ObjectDraftingLinetype.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDraftingLinetype.Value
) As ModelLinetype
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value
Return Value
Type: ModelLinetype
See Also
Reference
ObjectDraftingLinetype.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace