Grasshopper API
GH_Convert.ToGHAngularDimension_Secondary Method
 Converts similar data into a GH_AngularDimension instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHAngularDimension_Secondary(
	Object data,
	ref GH_AngularDimension target
)
Public Shared Function ToGHAngularDimension_Secondary (
	data As Object,
	ByRef target As GH_AngularDimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_AngularDimension
Target instance. If null, a new GH_AngularDimension will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace