Grasshopper API
ModelContent.Attributes.AsFrozen Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal virtual ModelContent.Attributes AsFrozen()
Protected Friend Overridable Function AsFrozen As ModelContent.Attributes
Return Value
Type: ModelContent.Attributes
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace