Grasshopper API
ModelConstructionPlane.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelConstructionPlane Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelConstructionPlane
Parameters
data
Type: System.Object
Return Value
Type: ModelConstructionPlane
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace