Grasshopper API
Param_Leader.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Leader InstantiateT()
Protected Overrides Function InstantiateT As GH_Leader
Return Value
Type: GH_Leader
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace