Grasshopper API
GH_AnnotationBase Constructor (AnnotationBase)
 Create a duplicate of an existing annotation.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_AnnotationBase(
	AnnotationBase annotation
)
Protected Sub New (
	annotation As AnnotationBase
)
Parameters
annotation
Type: AnnotationBase
Annotation to duplicate
See Also
Reference
GH_AnnotationBase Class
GH_AnnotationBase Overload
Grasshopper.Kernel.Types Namespace