Grasshopper API
ObjectDraftingLinetype.Value Implicit Conversion (ObjectDraftingLinetype.Value to ObjectLinetypeSource)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectLinetypeSource (
	ObjectDraftingLinetype.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDraftingLinetype.Value
) As ObjectLinetypeSource
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value
Return Value
Type: ObjectLinetypeSource
See Also
Reference
ObjectDraftingLinetype.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace