Grasshopper API
GH_WindowsControlUtil.FixTextRenderingDefault Method (IEnumerable<Control>)
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void FixTextRenderingDefault(
	IEnumerable<Control> C
)
Public Shared Sub FixTextRenderingDefault (
	C As IEnumerable(Of Control)
)
Parameters
C
Type: System.Collections.Generic.IEnumerable<Control>
See Also
Reference
GH_WindowsControlUtil Class
FixTextRenderingDefault Overload
Grasshopper.GUI Namespace