Grasshopper API
ModelContent.RuntimeId Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal Guid? RuntimeId(
	RhinoDoc document
)
Protected Friend Function RuntimeId (
	document As RhinoDoc
) As Guid?
Parameters
document
Type: RhinoDoc
Return Value
Type: Nullable<Guid>
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace