Grasshopper API
ModelStandardViewport.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToDetails()
Public Overrides Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelStandardViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace