Grasshopper API
ModelRenderSkylight.Attributes Constructor
Initializes a new instance of the ModelRenderSkylight.Attributes class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelRenderSkylight.Attributes Class
Grasshopper.Rhinoceros.Render Namespace