Grasshopper API
Param_Centermark.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_Centermark value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_Centermark
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_Centermark
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Centermark Class
Grasshopper.Kernel.Parameters Namespace