Grasshopper API
ModelRenderContent.Attributes Constructor
Initializes a new instance of the ModelRenderContent.Attributes class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal Attributes()
Protected Friend Sub New
See Also
Reference
ModelRenderContent.Attributes Class
ModelRenderContent.Attributes Overload
Grasshopper.Rhinoceros.Render Namespace