Grasshopper API
ModelUserText.Equals Method (Object)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
ModelUserText Structure
Equals Overload
Grasshopper.Rhinoceros Namespace