Grasshopper API
GH_Material Constructor (String)
 Create a new Material from an RDK xml string.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Material(
	string rdkXml
)
Public Sub New (
	rdkXml As String
)
Parameters
rdkXml
Type: System.String
Xml of RDK material.
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace