Grasshopper API
ModelConstructionPlane.Transform Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IGH_GeometricGoo Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As IGH_GeometricGoo
Parameters
xform
Type: Transform
Return Value
Type: IGH_GeometricGoo
Implements
IGH_GeometricGoo.Transform(Transform)
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace