Grasshopper API
ModelValue.Clone Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual Object Clone()
Protected Overridable Function Clone As Object
Return Value
Type: Object
Implements
ICloneable.Clone()
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace