Grasshopper API
ModelHatchPattern Constructor (HatchPattern)
Initializes a new instance of the ModelHatchPattern class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern(
	HatchPattern pattern
)
Public Sub New (
	pattern As HatchPattern
)
Parameters
pattern
Type: HatchPattern
See Also
Reference
ModelHatchPattern Class
ModelHatchPattern Overload
Grasshopper.Rhinoceros.Drafting Namespace