Grasshopper API
ModelRenderMaterial.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelRenderMaterial Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelRenderMaterial
Parameters
source
Type: System.Object
Return Value
Type: ModelRenderMaterial
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace