Grasshopper API
ModelData.Read Method (GH_IReader, String, String)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void Read(
	GH_IReader reader,
	string name,
	out string serializable
)
Protected Friend Shared Sub Read (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As String
)
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: System.String
See Also
Reference
ModelData Class
Read Overload
Grasshopper.Rhinoceros Namespace