Grasshopper API
Param_ObjectSectionStyle Constructor
Initializes a new instance of the Param_ObjectSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectSectionStyle()
Public Sub New
See Also
Reference
Param_ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting.Params Namespace