Grasshopper API
Param_ModelTextureSlot.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelTextureSlot PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelTextureSlot
Parameters
data
Type: System.Object
Return Value
Type: ModelTextureSlot
See Also
Reference
Param_ModelTextureSlot Class
Grasshopper.Rhinoceros.Render.Params Namespace