Grasshopper API
GH_Param<T>.Render_AppendGeometry Method
Note: This API is now obsolete.
 This function has been emptied because it is Obsolete.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute]
protected void Render_AppendGeometry(
	GH_RenderArgs args
)
<ObsoleteAttribute>
Protected Sub Render_AppendGeometry (
	args As GH_RenderArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace