Grasshopper API
GH_TextDot Constructor (Guid)
 Create a new referenced text dot that references a Rhino text dot with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextDot(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of text dot object to reference.
See Also
Reference
GH_TextDot Class
GH_TextDot Overload
Grasshopper.Kernel.Types Namespace