Grasshopper API
ObjectDraftingLinetype.Value Implicit Conversion (ObjectLinetypeSource to ObjectDraftingLinetypeObjectDraftingLinetype.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLinetype.Value (
	ObjectLinetypeSource source
)
Public Shared Widening Operator CType (
	source As ObjectLinetypeSource
) As ObjectDraftingLinetype.Value
Parameters
source
Type: ObjectLinetypeSource
Return Value
Type: ObjectDraftingLinetype.Value
See Also
Reference
ObjectDraftingLinetype.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace