Grasshopper API
GH_OrdinateDimension Constructor (GH_OrdinateDimension)
 Create a duplicate of another GH_OrdinateDimension. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_OrdinateDimension(
	GH_OrdinateDimension other
)
Public Sub New (
	other As GH_OrdinateDimension
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_OrdinateDimension
GH_OrdinateDimension to duplicate
See Also
Reference
GH_OrdinateDimension Class
GH_OrdinateDimension Overload
Grasshopper.Kernel.Types Namespace