Grasshopper API
ObjectDraftingLinetype.Value Constructor (ModelLinetype)
Initializes a new instance of the ObjectDraftingLinetype.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ModelLinetype value
)
Public Sub New (
	value As ModelLinetype
)
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ModelLinetype
See Also
Reference
ObjectDraftingLinetype.Value Structure
ObjectDraftingLinetype.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace