Grasshopper API
ModelRenderTexture Implicit Conversion (RenderTexture to ModelRenderTexture)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderTexture (
	RenderTexture renderTexture
)
Public Shared Widening Operator CType (
	renderTexture As RenderTexture
) As ModelRenderTexture
Parameters
renderTexture
Type: RenderTexture
Return Value
Type: ModelRenderTexture
See Also
Reference
ModelRenderTexture Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace