Grasshopper API
GH_AnnotationBase Constructor (AnnotationBase, ModelAnnotationStyle)
 Create a duplicate of an existing annotation.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_AnnotationBase(
	AnnotationBase annotation,
	ModelAnnotationStyle style
)
Protected Sub New (
	annotation As AnnotationBase,
	style As ModelAnnotationStyle
)
Parameters
annotation
Type: AnnotationBase
Annotation to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_AnnotationBase Class
GH_AnnotationBase Overload
Grasshopper.Kernel.Types Namespace