Grasshopper API
ModelAnnotationStyle Implicit Conversion (String to ModelAnnotationStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelAnnotationStyle (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelAnnotationStyle
Parameters
path
Type: System.String
Return Value
Type: ModelAnnotationStyle
See Also
Reference
ModelAnnotationStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace