Grasshopper API
ModelDataParam<T>.InstantiateT Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override T InstantiateT()
Protected Overrides Function InstantiateT As T
Return Value
Type: T
See Also
Reference
ModelDataParam<T> Class
Grasshopper.Rhinoceros.Params Namespace