Grasshopper API
Param_ObjectDisplayColor.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectDisplayColor PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectDisplayColor
Parameters
data
Type: System.Object
Return Value
Type: ObjectDisplayColor
See Also
Reference
Param_ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace