Grasshopper API
GH_ClippingPlane.DuplicateClippingPlane Method
 Create a duplicate of this clipping plane.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ClippingPlane DuplicateClippingPlane()
Public Function DuplicateClippingPlane As GH_ClippingPlane
Return Value
Type: GH_ClippingPlane
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace