Grasshopper API
GH_Convert.ToTextEntity_Primary Method
 Performs a direct cast from Rhino.Geometry.TextEntity or GH_TextEntity. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToTextEntity_Primary(
	Object data,
	ref TextEntity rc
)
Public Shared Function ToTextEntity_Primary (
	data As Object,
	ByRef rc As TextEntity
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: TextEntity
Result of conversion
Return Value
Type: Boolean
A TextEntity instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace