Grasshopper API
GH_Material Constructor (RenderMaterial)
 Create a new Material.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Material(
	RenderMaterial material
)
Public Sub New (
	material As RenderMaterial
)
Parameters
material
Type: RenderMaterial
Material to use (an internal copy will be made).
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace