Grasshopper API
Param_Centermark.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Centermark InstantiateT()
Protected Overrides Function InstantiateT As GH_Centermark
Return Value
Type: GH_Centermark
See Also
Reference
Param_Centermark Class
Grasshopper.Kernel.Parameters Namespace