Grasshopper API
ModelContent.Attributes.Write Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal override sealed bool Write(
	GH_IWriter writer
)
Protected Friend Overrides NotOverridable Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace