Grasshopper API
GH_Convert.ToGHHatch_Primary Method
 Converts similar data into a GH_Hatch instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHHatch_Primary(
	Object data,
	ref GH_Hatch target
)
Public Shared Function ToGHHatch_Primary (
	data As Object,
	ByRef target As GH_Hatch
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Hatch
Target instance. If null, a new GH_Hatch will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace