Grasshopper API
ModelObject Constructor (ModelObject.Attributes)
Initializes a new instance of the ModelObject class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelObject(
	ModelObject.Attributes attributes
)
Public Sub New (
	attributes As ModelObject.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelObject.Attributes
See Also
Reference
ModelObject Class
ModelObject Overload
Grasshopper.Rhinoceros.Model Namespace