Grasshopper API
ObjectRenderMaterial.Value.Deconstruct Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Deconstruct(
	out ObjectMaterialSource source,
	out ModelRenderMaterial value
)
Public Sub Deconstruct (
	<OutAttribute> ByRef source As ObjectMaterialSource,
	<OutAttribute> ByRef value As ModelRenderMaterial
)
Parameters
source
Type: ObjectMaterialSource
value
Type: Grasshopper.Rhinoceros.Render.ModelRenderMaterial
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace