Grasshopper API
PageSettings.Attributes Constructor
Initializes a new instance of the PageSettings.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
PageSettings.Attributes Class
Grasshopper.Rhinoceros.Display Namespace