Grasshopper API
ObjectDraftingColor Constructor (ObjectDraftingColor.Value)
Initializes a new instance of the ObjectDraftingColor class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingColor(
	ObjectDraftingColor.Value value
)
Public Sub New (
	value As ObjectDraftingColor.Value
)
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value
See Also
Reference
ObjectDraftingColor Class
ObjectDraftingColor Overload
Grasshopper.Rhinoceros.Drafting Namespace