Grasshopper API
ModelHatchPattern Implicit Conversion (HatchPattern to ModelHatchPattern)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelHatchPattern (
	HatchPattern pattern
)
Public Shared Widening Operator CType (
	pattern As HatchPattern
) As ModelHatchPattern
Parameters
pattern
Type: HatchPattern
Return Value
Type: ModelHatchPattern
See Also
Reference
ModelHatchPattern Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace