Grasshopper API
ModelStandardViewport Implicit Conversion (ModelStandardViewport.Attributes to ModelStandardViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelStandardViewport (
	ModelStandardViewport.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelStandardViewport.Attributes
) As ModelStandardViewport
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelStandardViewport.Attributes
Return Value
Type: ModelStandardViewport
See Also
Reference
ModelStandardViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace