Grasshopper API
GH_Format.FormatTextEntity Method (TextEntity, String)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatTextEntity(
	TextEntity data,
	string prefix = ""
)
Public Shared Function FormatTextEntity (
	data As TextEntity,
	Optional prefix As String = ""
) As String
Parameters
data
Type: TextEntity
prefix (Optional)
Type: System.String
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatTextEntity Overload
Grasshopper.Kernel Namespace