Grasshopper API
ModelContent.Attributes.Equals Method (Object, IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual bool Equals(
	Object other,
	IEqualityComparer comparer
)
Protected Overridable Function Equals (
	other As Object,
	comparer As IEqualityComparer
) As Boolean
Parameters
other
Type: System.Object
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Boolean
Implements
IStructuralEquatable.Equals(Object, IEqualityComparer)
See Also
Reference
ModelContent.Attributes Class
Equals Overload
Grasshopper.Rhinoceros Namespace