Grasshopper API
Param_ModelRenderTexture.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelRenderTexture PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelRenderTexture
Parameters
data
Type: System.Object
Return Value
Type: ModelRenderTexture
See Also
Reference
Param_ModelRenderTexture Class
Grasshopper.Rhinoceros.Render.Params Namespace