Grasshopper API
ModelTextureMapping Constructor (TextureMapping, Int32)
Initializes a new instance of the ModelTextureMapping class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureMapping(
	TextureMapping textureMapping,
	int channel
)
Public Sub New (
	textureMapping As TextureMapping,
	channel As Integer
)
Parameters
textureMapping
Type: TextureMapping
channel
Type: System.Int32
See Also
Reference
ModelTextureMapping Class
ModelTextureMapping Overload
Grasshopper.Rhinoceros.Render Namespace