Grasshopper API
ModelLinetype.Attributes.ToModelData Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ModelData ToModelData()
Public Overrides Function ToModelData As ModelData
Return Value
Type: ModelData
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace