Grasshopper API
GH_RenderArgs.PopModelTransform Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Transform PopModelTransform()
Public Function PopModelTransform As Transform
Return Value
Type: Transform
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace