Grasshopper API
GH_Convert.ToSubD_Secondary Method
 Attempts to convert other data types into a Sub-D. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToSubD_Secondary(
	Object data,
	ref SubD rc
)
Public Shared Function ToSubD_Secondary (
	data As Object,
	ByRef rc As SubD
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: SubD
Return Value
Type: Boolean
A Sub-D instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace