Grasshopper API
GH_InstanceReference.DuplicateInstanceReference Method
 Create a duplicate of this GH_InstanceReference.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReference DuplicateInstanceReference()
Public Function DuplicateInstanceReference As GH_InstanceReference
Return Value
Type: GH_InstanceReference
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace