Grasshopper API
ModelAnnotationStyle.Attributes Constructor
Initializes a new instance of the ModelAnnotationStyle.Attributes class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace