Grasshopper API
GH_Format.FormatString Method
 Replaces the format items in a string with the string representations of corresponding objects in a specified array.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatString(
	string text,
	params Object[] args
)
Public Shared Function FormatString (
	text As String,
	ParamArray args As Object()
) As String
Parameters
text
Type: System.String
A composite format string.
args
Type: System.Object[]
An object array that contains zero or more objects to format.
Return Value
Type: String
A copy of format in which the format items have been replaced by the string representation of the corresponding objects in args.
Remarks
 Formatting is done using invariant-culture formatting information.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace