Grasshopper API
GH_PreviewBoundary.IsVisible Method
 Gets whether a specific object is visible within this boundary.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsVisible(
	IGH_DocumentObject obj
)
Public Function IsVisible (
	obj As IGH_DocumentObject
) As Boolean
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Return Value
Type: Boolean
See Also
Reference
GH_PreviewBoundary Class
Grasshopper.Kernel Namespace