Grasshopper API
ModelSectionStyle Implicit Conversion (String to ModelSectionStyle)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelSectionStyle (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelSectionStyle
Parameters
path
Type: System.String
Return Value
Type: ModelSectionStyle
See Also
Reference
ModelSectionStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace