Grasshopper API
GH_Document.ForcePreview Method
 If true, the document will draw viewport previews regardless of other conditions. Typically a document only previews if it is loaded in the canvas or when it has an RCP.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void ForcePreview(
	bool previewOn
)
Public Sub ForcePreview (
	previewOn As Boolean
)
Parameters
previewOn
Type: System.Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace