Grasshopper API
GH_PointCloud Constructor
 Default constructor, creates an invalid curve.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PointCloud()
Public Sub New
See Also
Reference
GH_PointCloud Class
GH_PointCloud Overload
Grasshopper.Kernel.Types Namespace