Grasshopper API
ModelData.Read<T> Method (GH_IReader, String, IReadOnlyList<T>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected static void Read<T>(
	GH_IReader reader,
	string name,
	out IReadOnlyList<T> serializables
)
where T : GH_ISerializable
Protected Shared Sub Read(Of T As GH_ISerializable) (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializables As IReadOnlyList(Of T)
)
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializables
Type: System.Collections.Generic.IReadOnlyList<T>
Type Parameters
T
See Also
Reference
ModelData Class
Read Overload
Grasshopper.Rhinoceros Namespace