Grasshopper API
GH_Convert.ToDimension_Secondary Method
 Attempts to convert other data types into an Rhino.Geometry.Dimension. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToDimension_Secondary(
	Object data,
	ref Dimension rc
)
Public Shared Function ToDimension_Secondary (
	data As Object,
	ByRef rc As Dimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Dimension
Return Value
Type: Boolean
An Rhino.Geometry.Dimension instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace