Grasshopper API
Param_ObjectRenderMaterial.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ObjectRenderMaterial> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ObjectRenderMaterial)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ObjectRenderMaterial>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace