Grasshopper API
ModelTextureMapping Constructor (TextureMapping)
Initializes a new instance of the ModelTextureMapping class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureMapping(
	TextureMapping textureMapping
)
Public Sub New (
	textureMapping As TextureMapping
)
Parameters
textureMapping
Type: TextureMapping
See Also
Reference
ModelTextureMapping Class
ModelTextureMapping Overload
Grasshopper.Rhinoceros.Render Namespace