Grasshopper API
GH_Format.FormatTextEntity Method (GH_TextEntity)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatTextEntity(
	GH_TextEntity data
)
Public Shared Function FormatTextEntity (
	data As GH_TextEntity
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_TextEntity
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatTextEntity Overload
Grasshopper.Kernel Namespace