Grasshopper API
ModelData.Write<TEnum> Method (GH_IWriter, String, Nullable<TEnum>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void Write<TEnum>(
	GH_IWriter writer,
	string name,
	in TEnum? serializable
)
where TEnum : struct, new(), IComparable, IFormattable, IConvertible
Protected Friend Shared Sub Write(Of TEnum As {Structure, New, IComparable, IFormattable, IConvertible}) (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As TEnum?
)
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: System.Nullable<TEnum>
Type Parameters
TEnum
See Also
Reference
ModelData Class
Write Overload
Grasshopper.Rhinoceros Namespace