Grasshopper API
ModelStandardViewport Constructor (ModelStandardViewport.Attributes)
Initializes a new instance of the ModelStandardViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelStandardViewport(
	ModelStandardViewport.Attributes attributes
)
Public Sub New (
	attributes As ModelStandardViewport.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelStandardViewport.Attributes
See Also
Reference
ModelStandardViewport Class
ModelStandardViewport Overload
Grasshopper.Rhinoceros.Display Namespace