Grasshopper API
ModelTags Constructor
Initializes a new instance of the ModelTags class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTags(
	IEnumerable<string> source
)
Public Sub New (
	source As IEnumerable(Of String)
)
Parameters
source
Type: System.Collections.Generic.IEnumerable<String>
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace