Grasshopper API
Param_AngularDimension.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_AngularDimension InstantiateT()
Protected Overrides Function InstantiateT As GH_AngularDimension
Return Value
Type: GH_AngularDimension
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace