Grasshopper API
Param_Light.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Light InstantiateT()
Protected Overrides Function InstantiateT As GH_Light
Return Value
Type: GH_Light
See Also
Reference
Param_Light Class
Grasshopper.Kernel.Parameters Namespace