Grasshopper API
ClippingArrow Constructor (ClippingArrow.Attributes)
Initializes a new instance of the ClippingArrow class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrow(
	ClippingArrow.Attributes attributes
)
Public Sub New (
	attributes As ClippingArrow.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.ClippingArrow.Attributes
See Also
Reference
ClippingArrow Class
ClippingArrow Overload
Grasshopper.Rhinoceros.Annotations Namespace