Grasshopper API
ClippingDrawingSettings Constructor
Initializes a new instance of the ClippingDrawingSettings class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingDrawingSettings()
Public Sub New
See Also
Reference
ClippingDrawingSettings Class
ClippingDrawingSettings Overload
Grasshopper.Rhinoceros.Drafting Namespace