Grasshopper API
Param_ModelRenderMaterial.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelRenderMaterial PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelRenderMaterial
Parameters
data
Type: System.Object
Return Value
Type: ModelRenderMaterial
See Also
Reference
Param_ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace