Grasshopper API
GH_ClippingPlane.LoadGeometry Method (RhinoDoc)
 If the clipping plane is referenced and not yet loaded, attempts to load the clipping plane.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool LoadGeometry(
	RhinoDoc doc
)
Public Overrides Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Return Value
Type: Boolean
True if the clipping plane is loaded (or if it was already loaded), False on failure.
See Also
Reference
GH_ClippingPlane Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace