Grasshopper API
ModelLinetype Constructor
Initializes a new instance of the ModelLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype()
Public Sub New
See Also
Reference
ModelLinetype Class
ModelLinetype Overload
Grasshopper.Rhinoceros.Drafting Namespace