Grasshopper API
ModelValue.WriteValue<T> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static bool WriteValue<T>(
	GH_IWriter writer,
	in T serializable
)
where T : struct, new(), GH_ISerializable
Protected Friend Shared Function WriteValue(Of T As {Structure, New, GH_ISerializable}) (
	writer As GH_IWriter,
	ByRef serializable As T
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
serializable
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace