Grasshopper API
Param_Hatch Constructor
Initializes a new instance of the Param_Hatch class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_Hatch()
Public Sub New
See Also
Reference
Param_Hatch Class
Grasshopper.Kernel.Parameters Namespace