Grasshopper API
Param_AnnotationArrow.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<AnnotationArrow> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of AnnotationArrow)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<AnnotationArrow>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations.Params Namespace