Grasshopper API
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Constructor
Initializes a new instance of the GH_AnnotationBase.GH_AnnotationBaseProxy<T> class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AnnotationBaseProxy(
	T Value
)
Public Sub New (
	Value As T
)
Parameters
Value
Type: T
See Also
Reference
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Grasshopper.Kernel.Types Namespace