Grasshopper API
Param_DateTimeFormat.Menu_CustomMultiValueItem Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ToolStripMenuItem Menu_CustomMultiValueItem()
Protected Overrides Function Menu_CustomMultiValueItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
Param_DateTimeFormat Class
Grasshopper.Rhinoceros.Annotations.Params Namespace