Grasshopper API
ModelHatchPattern Implicit Conversion (ModelHatchPattern.Attributes to ModelHatchPattern)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelHatchPattern (
	ModelHatchPattern.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelHatchPattern.Attributes
) As ModelHatchPattern
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Attributes
Return Value
Type: ModelHatchPattern
See Also
Reference
ModelHatchPattern Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace