Grasshopper API
GH_Convert.ToHatch Method
 Convert data into Rhino.Geometry.Hatch.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToHatch(
	Object data,
	ref Hatch rc,
	GH_Conversion conversion_level
)
Public Shared Function ToHatch (
	data As Object,
	ByRef rc As Hatch,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Hatch
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace