Grasshopper API
GH_Convert.ToClippingPlane Method
 Convert data into Rhino.Geometry.ClippingPlaneSurface.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToClippingPlane(
	Object data,
	ref ClippingPlaneSurface rc,
	GH_Conversion conversion_level
)
Public Shared Function ToClippingPlane (
	data As Object,
	ByRef rc As ClippingPlaneSurface,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: ClippingPlaneSurface
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace