Grasshopper API
ModelSpaceViewport.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelSpaceViewport Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelSpaceViewport
Parameters
data
Type: System.Object
Return Value
Type: ModelSpaceViewport
See Also
Reference
ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display Namespace