Grasshopper API
GH_Format.FormatInstanceReferenceValidity Method
 If the instance reference is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatInstanceReferenceValidity(
	InstanceReferenceGeometry val,
	string identifier = "Instance Reference"
)
Public Shared Function FormatInstanceReferenceValidity (
	val As InstanceReferenceGeometry,
	Optional identifier As String = "Instance Reference"
) As String
Parameters
val
Type: InstanceReferenceGeometry
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the instance reference is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace