Grasshopper API
Param_AnnotationUnitsSettings Constructor
Initializes a new instance of the Param_AnnotationUnitsSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_AnnotationUnitsSettings()
Public Sub New
See Also
Reference
Param_AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace