Grasshopper API
GH_SubD Constructor (Guid)
Initializes a new instance of the GH_SubD class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_SubD(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
GH_SubD Class
GH_SubD Overload
Grasshopper.Kernel.Types Namespace