Grasshopper API
ClippingDrawingSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingDrawingSettings.Attributes ToAttributes()
Public Function ToAttributes As ClippingDrawingSettings.Attributes
Return Value
Type: ClippingDrawingSettings.Attributes
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace