Grasshopper API
PageSettings Implicit Conversion (PageSettings.Attributes to PageSettings)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator PageSettings (
	PageSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As PageSettings.Attributes
) As PageSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.PageSettings.Attributes
Return Value
Type: PageSettings
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace