Grasshopper API
Param_ModelRenderMaterial Constructor
Initializes a new instance of the Param_ModelRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelRenderMaterial()
Public Sub New
See Also
Reference
Param_ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace