Grasshopper API
Param_TextEntity.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_TextEntity value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_TextEntity
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_TextEntity
Return Value
Type: GH_GetterResult
See Also
Reference
Param_TextEntity Class
Grasshopper.Kernel.Parameters Namespace