Grasshopper API
GH_Document.SetStatusBarEventHelper Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void SetStatusBarEventHelper(
	GH_RuntimeMessage message
)
Public Sub SetStatusBarEventHelper (
	message As GH_RuntimeMessage
)
Parameters
message
Type: Grasshopper.Kernel.GH_RuntimeMessage
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace