Grasshopper API
ObjectDraftingLinetype Constructor
Initializes a new instance of the ObjectDraftingLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLinetype()
Public Sub New
See Also
Reference
ObjectDraftingLinetype Class
ObjectDraftingLinetype Overload
Grasshopper.Rhinoceros.Drafting Namespace