Grasshopper API
ModelRenderSun.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelRenderSun Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelRenderSun
Parameters
source
Type: System.Object
Return Value
Type: ModelRenderSun
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace