Grasshopper API
ModelColor.Equals Method (ModelColor)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelColor other
)
Public Function Equals (
	other As ModelColor
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelColor Structure
Equals Overload
Grasshopper.Rhinoceros Namespace