Grasshopper API
ModelData.Attributes.SubClone Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual ModelData.Attributes SubClone()
Protected Overridable Function SubClone As ModelData.Attributes
Return Value
Type: ModelData.Attributes
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace