Grasshopper API
ModelContent.SubCast<A, T> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static T SubCast<A, T>(
	Object source
)
where A : ModelContent.Attributes
where T : ModelContent
Protected Friend Shared Function SubCast(Of A As ModelContent.Attributes, T As ModelContent) (
	source As Object
) As T
Parameters
source
Type: System.Object
Type Parameters
A
T
Return Value
Type: T
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace