Grasshopper API
ObjectSectionStyle.Value.CompareTo Method (ObjectSectionStyle.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ObjectSectionStyle.Value other
)
Public Function CompareTo (
	other As ObjectSectionStyle.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ObjectSectionStyle.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Drafting Namespace