Grasshopper API
GH_TaskCapableComponent<T>.OnUseTasksClicked Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void OnUseTasksClicked(
	Object sender,
	EventArgs e
)
Public Sub OnUseTasksClicked (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace