Grasshopper API
ModelPageViewport.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelPageViewport Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelPageViewport
Parameters
data
Type: System.Object
Return Value
Type: ModelPageViewport
See Also
Reference
ModelPageViewport Class
Grasshopper.Rhinoceros.Display Namespace