Grasshopper API
ModelRenderContent.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToDetails()
Public Overrides Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelRenderContent.Attributes Class
Grasshopper.Rhinoceros.Render Namespace