Grasshopper API
ObjectSectionStyle.Value Implicit Conversion (ObjectSectionStyle.Value to ObjectSectionAttributesSource)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectSectionAttributesSource (
	ObjectSectionStyle.Value value
)
Public Shared Widening Operator CType (
	value As ObjectSectionStyle.Value
) As ObjectSectionAttributesSource
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value
Return Value
Type: ObjectSectionAttributesSource
See Also
Reference
ObjectSectionStyle.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace