Grasshopper API
Param_ModelContent.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<IGH_ModelContentData> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of IGH_ModelContentData)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<IGH_ModelContentData>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelContent Class
Grasshopper.Rhinoceros.Params Namespace