Grasshopper API
Param_EarthAnchorPoint.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelEarthAnchorPoint> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelEarthAnchorPoint)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelEarthAnchorPoint>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_EarthAnchorPoint Class
Grasshopper.Rhinoceros.Model.Params Namespace