Grasshopper API
ObjectRenderMaterial.Value Constructor (ObjectMaterialSource, ModelRenderMaterial)
Initializes a new instance of the ObjectRenderMaterial.Value class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectMaterialSource source,
	ModelRenderMaterial value
)
Public Sub New (
	source As ObjectMaterialSource,
	value As ModelRenderMaterial
)
Parameters
source
Type: ObjectMaterialSource
value
Type: Grasshopper.Rhinoceros.Render.ModelRenderMaterial
See Also
Reference
ObjectRenderMaterial.Value Structure
ObjectRenderMaterial.Value Overload
Grasshopper.Rhinoceros.Render Namespace