Grasshopper API
ModelData.Read<T> Method (GH_IReader, String, T)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static bool Read<T>(
	GH_IReader reader,
	string name,
	out T serializable
)
where T : ModelData
Protected Friend Shared Function Read(Of T As ModelData) (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As T
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
ModelData Class
Read Overload
Grasshopper.Rhinoceros Namespace