Grasshopper API
ObjectDisplayColor Implicit Conversion (ObjectDisplayColor.Value to ObjectDisplayColor)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDisplayColor (
	ObjectDisplayColor.Value data
)
Public Shared Widening Operator CType (
	data As ObjectDisplayColor.Value
) As ObjectDisplayColor
Parameters
data
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value
Return Value
Type: ObjectDisplayColor
See Also
Reference
ObjectDisplayColor Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace