Grasshopper API
Param_OrdinateDimension.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_OrdinateDimension InstantiateT()
Protected Overrides Function InstantiateT As GH_OrdinateDimension
Return Value
Type: GH_OrdinateDimension
See Also
Reference
Param_OrdinateDimension Class
Grasshopper.Kernel.Parameters Namespace