Grasshopper API
Param_ModelFont.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelFont> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelFont)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelFont>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelFont Class
Grasshopper.Rhinoceros.Params Namespace