Grasshopper API
ModelEarthAnchorPoint Implicit Conversion (ModelEarthAnchorPoint.Attributes to ModelEarthAnchorPoint)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelEarthAnchorPoint (
	ModelEarthAnchorPoint.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelEarthAnchorPoint.Attributes
) As ModelEarthAnchorPoint
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes
Return Value
Type: ModelEarthAnchorPoint
See Also
Reference
ModelEarthAnchorPoint Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace