Grasshopper API
ModelContentName.Equality Operator (ModelContentName, String)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator ==(
	ModelContentName left,
	string right
)
Public Shared Operator = (
	left As ModelContentName,
	right As String
) As Boolean
Parameters
left
Type: Grasshopper.Rhinoceros.ModelContentName
right
Type: System.String
Return Value
Type: Boolean
See Also
Reference
ModelContentName Structure
Equality Overload
Grasshopper.Rhinoceros Namespace