Grasshopper API
GH_TextEntity.DuplicateTextEntity Method
 Create a duplicate of this text entity.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextEntity DuplicateTextEntity()
Public Function DuplicateTextEntity As GH_TextEntity
Return Value
Type: GH_TextEntity
See Also
Reference
GH_TextEntity Class
Grasshopper.Kernel.Types Namespace