Grasshopper API
AnnotationTextSettings.Attributes Constructor
Initializes a new instance of the AnnotationTextSettings.Attributes class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace