Grasshopper API
Param_ModelHatchLine Constructor
Initializes a new instance of the Param_ModelHatchLine class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelHatchLine()
Public Sub New
See Also
Reference
Param_ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting.Params Namespace