Grasshopper API
ModelView.Equals Method (ModelView)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelView other
)
Public Function Equals (
	other As ModelView
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ModelView
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelView Class
Equals Overload
Grasshopper.Rhinoceros.Display Namespace