Grasshopper API
Param_ObjectDisplayColor.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ObjectDisplayColor value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ObjectDisplayColor
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace