Grasshopper API
ModelConstructionPlane.Morph Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IGH_GeometricGoo Morph(
	SpaceMorph xmorph
)
Public Function Morph (
	xmorph As SpaceMorph
) As IGH_GeometricGoo
Parameters
xmorph
Type: SpaceMorph
Return Value
Type: IGH_GeometricGoo
Implements
IGH_GeometricGoo.Morph(SpaceMorph)
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace