Grasshopper API
Param_ModelAnnotationStyle.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelAnnotationStyle value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelAnnotationStyle
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations.Params Namespace