Grasshopper API
Param_ClippingPlane Constructor
Initializes a new instance of the Param_ClippingPlane class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ClippingPlane()
Public Sub New
See Also
Reference
Param_ClippingPlane Class
Grasshopper.Kernel.Parameters Namespace