Grasshopper API
GH_Format.FormatSubD Method (SubD)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatSubD(
	SubD data
)
Public Shared Function FormatSubD (
	data As SubD
) As String
Parameters
data
Type: SubD
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatSubD Overload
Grasshopper.Kernel Namespace