Grasshopper API
ModelHatchPattern.Attributes Implicit Conversion (String to ModelHatchPatternModelHatchPattern.Attributes)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelHatchPattern.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelHatchPattern.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelHatchPattern.Attributes
See Also
Reference
ModelHatchPattern.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace