Grasshopper API
ModelDisplayMode Implicit Conversion (ModelDisplayMode.Attributes to ModelDisplayMode)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelDisplayMode (
	ModelDisplayMode.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelDisplayMode.Attributes
) As ModelDisplayMode
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelDisplayMode.Attributes
Return Value
Type: ModelDisplayMode
See Also
Reference
ModelDisplayMode Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace