Grasshopper API
ObjectRenderMaterial.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectRenderMaterial Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectRenderMaterial
Parameters
source
Type: System.Object
Return Value
Type: ObjectRenderMaterial
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace