Grasshopper API
ObjectDrafting.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDrafting.Attributes ToAttributes()
Public Function ToAttributes As ObjectDrafting.Attributes
Return Value
Type: ObjectDrafting.Attributes
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace