Grasshopper API
ModelUserText.Equals Method (ModelUserText)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelUserText other
)
Public Function Equals (
	other As ModelUserText
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelUserText
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelUserText Structure
Equals Overload
Grasshopper.Rhinoceros Namespace