Grasshopper API
ModelView Constructor (ModelView)
Initializes a new instance of the ModelView class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView(
	ModelView other
)
Public Sub New (
	other As ModelView
)
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ModelView
See Also
Reference
ModelView Class
ModelView Overload
Grasshopper.Rhinoceros.Display Namespace