Grasshopper API
ObjectRender Constructor (ObjectRender.Attributes)
Initializes a new instance of the ObjectRender class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRender(
	ObjectRender.Attributes attributes
)
Public Sub New (
	attributes As ObjectRender.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ObjectRender.Attributes
See Also
Reference
ObjectRender Class
ObjectRender Overload
Grasshopper.Rhinoceros.Render Namespace