Grasshopper API
GH_Format.FormatSubDValidity Method
 If the brep is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatSubDValidity(
	SubD val,
	string identifier = "SubD"
)
Public Shared Function FormatSubDValidity (
	val As SubD,
	Optional identifier As String = "SubD"
) As String
Parameters
val
Type: SubD
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the brep is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace