Grasshopper API
GH_AnnotationBase Constructor (ObjRef)
Initializes a new instance of the GH_AnnotationBase class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_AnnotationBase(
	ObjRef objectReference
)
Protected Sub New (
	objectReference As ObjRef
)
Parameters
objectReference
Type: ObjRef
See Also
Reference
GH_AnnotationBase Class
GH_AnnotationBase Overload
Grasshopper.Kernel.Types Namespace