Grasshopper API
ModelComponentContent.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelComponentContent.Attributes ToAttributes()
Public Function ToAttributes As ModelComponentContent.Attributes
Return Value
Type: ModelComponentContent.Attributes
See Also
Reference
ModelComponentContent Class
Grasshopper.Rhinoceros Namespace