Grasshopper API
Param_Centermark.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Centermark PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_Centermark
Parameters
data
Type: System.Object
Return Value
Type: GH_Centermark
See Also
Reference
Param_Centermark Class
Grasshopper.Kernel.Parameters Namespace