Grasshopper API
GH_Centermark Constructor
 Default constructor, creates an invalid centermark.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Centermark()
Public Sub New
See Also
Reference
GH_Centermark Class
GH_Centermark Overload
Grasshopper.Kernel.Types Namespace