Grasshopper API
ModelStandardViewport Implicit Conversion (RhinoViewport to ModelStandardViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelStandardViewport (
	RhinoViewport viewport
)
Public Shared Widening Operator CType (
	viewport As RhinoViewport
) As ModelStandardViewport
Parameters
viewport
Type: RhinoViewport
Return Value
Type: ModelStandardViewport
See Also
Reference
ModelStandardViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace