Grasshopper API
Complex.UnaryPlus Operator
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Complex operator +(
	Complex summand
)
Public Shared Operator + (
	summand As Complex
) As Complex
Parameters
summand
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace