Grasshopper API
Complex.Subtraction Operator (Complex, Complex)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Complex operator -(
	Complex A,
	Complex B
)
Public Shared Operator - (
	A As Complex,
	B As Complex
) As Complex
Parameters
A
Type: Grasshopper.Kernel.Types.Complex
B
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Subtraction Overload
Grasshopper.Kernel.Types Namespace