Grasshopper API
ItemDisplayColor.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ItemDisplayColor Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ItemDisplayColor
Parameters
source
Type: System.Object
Return Value
Type: ItemDisplayColor
See Also
Reference
ItemDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace