Grasshopper API
ModelLayer Constructor (ModelLayer.Attributes)
Initializes a new instance of the ModelLayer class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLayer(
	ModelLayer.Attributes attributes
)
Public Sub New (
	attributes As ModelLayer.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelLayer.Attributes
See Also
Reference
ModelLayer Class
ModelLayer Overload
Grasshopper.Rhinoceros.Model Namespace