Grasshopper API
Param_Hatch.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Hatch PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_Hatch
Parameters
data
Type: System.Object
Return Value
Type: GH_Hatch
See Also
Reference
Param_Hatch Class
Grasshopper.Kernel.Parameters Namespace