Grasshopper API
Param_ModelFont.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelFont PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelFont
Parameters
data
Type: System.Object
Return Value
Type: ModelFont
See Also
Reference
Param_ModelFont Class
Grasshopper.Rhinoceros.Params Namespace