Grasshopper API
ModelInstanceDefinition.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition.Attributes ToAttributes()
Public Function ToAttributes As ModelInstanceDefinition.Attributes
Return Value
Type: ModelInstanceDefinition.Attributes
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace