Grasshopper API
ModelView Constructor (ViewportInfo, String)
Initializes a new instance of the ModelView class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView(
	ViewportInfo viewportInfo,
	string title
)
Public Sub New (
	viewportInfo As ViewportInfo,
	title As String
)
Parameters
viewportInfo
Type: ViewportInfo
title
Type: System.String
See Also
Reference
ModelView Class
ModelView Overload
Grasshopper.Rhinoceros.Display Namespace