Grasshopper API
ModelContent.Cast Method (Object)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelContent Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelContent
Parameters
source
Type: System.Object
Return Value
Type: ModelContent
See Also
Reference
ModelContent Class
Cast Overload
Grasshopper.Rhinoceros Namespace