Grasshopper API
GH_Centermark Constructor (Centermark)
 Create a duplicate of an existing centermark.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Centermark(
	Centermark centermark
)
Public Sub New (
	centermark As Centermark
)
Parameters
centermark
Type: Centermark
Centermark to duplicate
See Also
Reference
GH_Centermark Class
GH_Centermark Overload
Grasshopper.Kernel.Types Namespace