Grasshopper API
Param_InstanceReference.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_InstanceReference value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_InstanceReference
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_InstanceReference
Return Value
Type: GH_GetterResult
See Also
Reference
Param_InstanceReference Class
Grasshopper.Kernel.Parameters Namespace