Grasshopper API
ObjectDisplayColor Implicit Conversion (ObjectDisplayColor to ObjectDisplayColorObjectDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDisplayColor.Value (
	ObjectDisplayColor data
)
Public Shared Widening Operator CType (
	data As ObjectDisplayColor
) As ObjectDisplayColor.Value
Parameters
data
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor
Return Value
Type: ObjectDisplayColor.Value
See Also
Reference
ObjectDisplayColor Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace