Grasshopper API
ItemDisplayColor.Value Implicit Conversion (ItemColorSource to ItemDisplayColorItemDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ItemDisplayColor.Value (
	ItemColorSource source
)
Public Shared Widening Operator CType (
	source As ItemColorSource
) As ItemDisplayColor.Value
Parameters
source
Type: ItemColorSource
Return Value
Type: ItemDisplayColor.Value
See Also
Reference
ItemDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace