Grasshopper API
ModelConstructionPlane Constructor (ConstructionPlane)
Initializes a new instance of the ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane(
	ConstructionPlane cplane
)
Public Sub New (
	cplane As ConstructionPlane
)
Parameters
cplane
Type: ConstructionPlane
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace