Grasshopper API
GH_PatternMatching.Equals Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool Equals(
	string value,
	string pattern,
	bool ignoreCase,
	CultureInfo culture
)
Public Shared Function Equals (
	value As String,
	pattern As String,
	ignoreCase As Boolean,
	culture As CultureInfo
) As Boolean
Parameters
value
Type: System.String
pattern
Type: System.String
ignoreCase
Type: System.Boolean
culture
Type: System.Globalization.CultureInfo
Return Value
Type: Boolean
See Also
Reference
GH_PatternMatching Class
Grasshopper.Kernel Namespace