Grasshopper API
ModelLinetype Constructor (Guid)
Initializes a new instance of the ModelLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelLinetype Class
ModelLinetype Overload
Grasshopper.Rhinoceros.Drafting Namespace