Grasshopper API
Param_MatchText Constructor
Initializes a new instance of the Param_MatchText class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_MatchText()
Public Sub New
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace