Grasshopper API
ModelRenderMaterial.Attributes Implicit Conversion (String to ModelRenderMaterialModelRenderMaterial.Attributes)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderMaterial.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelRenderMaterial.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelRenderMaterial.Attributes
See Also
Reference
ModelRenderMaterial.Attributes Class
Grasshopper.Rhinoceros.Render Namespace