Grasshopper API
ObjectSectionStyle.Value Constructor (ModelSectionStyle)
Initializes a new instance of the ObjectSectionStyle.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ModelSectionStyle value
)
Public Sub New (
	value As ModelSectionStyle
)
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ModelSectionStyle
See Also
Reference
ObjectSectionStyle.Value Structure
ObjectSectionStyle.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace