Grasshopper API
ObjectRenderMaterial Implicit Conversion (ObjectRenderMaterial.Value to ObjectRenderMaterial)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectRenderMaterial (
	ObjectRenderMaterial.Value data
)
Public Shared Widening Operator CType (
	data As ObjectRenderMaterial.Value
) As ObjectRenderMaterial
Parameters
data
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value
Return Value
Type: ObjectRenderMaterial
See Also
Reference
ObjectRenderMaterial Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace