Grasshopper API
GH_TaskCapableComponent<T>.GetSolveResults Method
 Call this method to await the associated task and retrieve its data.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected bool GetSolveResults(
	IGH_DataAccess access,
	out T data
)
Protected Function GetSolveResults (
	access As IGH_DataAccess,
	<OutAttribute> ByRef data As T
) As Boolean
Parameters
access
Type: Grasshopper.Kernel.IGH_DataAccess
Access object identifying the task.
data
Type: T
Data (if any) will be returned here.
Return Value
Type: Boolean
If true, the data was successfully retrieved and can be assigned to outputs immediately. If false, the data was not found and needs to be calculated by the caller.
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace