Grasshopper API
AnnotationLeaderSettings Constructor
Initializes a new instance of the AnnotationLeaderSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationLeaderSettings()
Public Sub New
See Also
Reference
AnnotationLeaderSettings Class
AnnotationLeaderSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace