Grasshopper API
GH_Format.RhinoUnitSymbol Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string RhinoUnitSymbol()
Public Shared Function RhinoUnitSymbol As String
Return Value
Type: String
See Also
Reference
GH_Format Class
RhinoUnitSymbol Overload
Grasshopper.Kernel Namespace