Grasshopper API
ModelContentName.CompareTo Method (ModelContentName)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ModelContentName other
)
Public Function CompareTo (
	other As ModelContentName
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ModelContentName Structure
CompareTo Overload
Grasshopper.Rhinoceros Namespace