Grasshopper API
AnnotationToleranceSettings.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationToleranceSettings.Attributes ToAttributes()
Public Function ToAttributes As AnnotationToleranceSettings.Attributes
Return Value
Type: AnnotationToleranceSettings.Attributes
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace