Grasshopper API
Param_Predicate.RemoveEffects Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void RemoveEffects()
Public Overrides Sub RemoveEffects
See Also
Reference
Param_Predicate Class
Grasshopper.Kernel.Parameters Namespace