Grasshopper API
Param_ObjectRender Constructor
Initializes a new instance of the Param_ObjectRender class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectRender()
Public Sub New
See Also
Reference
Param_ObjectRender Class
Grasshopper.Rhinoceros.Render.Params Namespace