Grasshopper API
ObjectDraftingColor.Value.Equals Method (ObjectDraftingColor.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectDraftingColor.Value other
)
Public Function Equals (
	other As ObjectDraftingColor.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectDraftingColor.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace