Grasshopper API
GH_Convert.GetClippingPlaneFromDocument Method
 Harvest a clipping plane surface from a Rhino document.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool GetClippingPlaneFromDocument(
	RhinoDoc doc,
	Guid id,
	out Plane pln
)
Public Shared Function GetClippingPlaneFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef pln As Plane
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of clipping plane surface.
pln
Type: Plane
Plane result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace