Grasshopper API
ModelDisplayMode.TooltipString Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TooltipString()
Public Overrides Function TooltipString As String
Return Value
Type: String
See Also
Reference
ModelDisplayMode Class
Grasshopper.Rhinoceros.Display Namespace