Grasshopper API
Param_ModelLineWidth.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelLineWidth> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelLineWidth)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelLineWidth>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace