Grasshopper API
GH_Painter.ConnectionPath Method
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GraphicsPath ConnectionPath(
	PointF pointA,
	PointF pointB,
	GH_WireDirection directionA,
	GH_WireDirection directionB
)
Public Shared Function ConnectionPath (
	pointA As PointF,
	pointB As PointF,
	directionA As GH_WireDirection,
	directionB As GH_WireDirection
) As GraphicsPath
Parameters
pointA
Type: System.Drawing.PointF
pointB
Type: System.Drawing.PointF
directionA
Type: Grasshopper.GUI.Canvas.GH_WireDirection
directionB
Type: Grasshopper.GUI.Canvas.GH_WireDirection
Return Value
Type: GraphicsPath
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace