Grasshopper API
ModelRenderEnvironment.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderEnvironment.Attributes ToAttributes()
Public Function ToAttributes As ModelRenderEnvironment.Attributes
Return Value
Type: ModelRenderEnvironment.Attributes
See Also
Reference
ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render Namespace