Grasshopper API
ObjectDraftingLineWidth.Value Implicit Conversion (Double to ObjectDraftingLineWidthObjectDraftingLineWidth.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLineWidth.Value (
	double color
)
Public Shared Widening Operator CType (
	color As Double
) As ObjectDraftingLineWidth.Value
Parameters
color
Type: System.Double
Return Value
Type: ObjectDraftingLineWidth.Value
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace