Grasshopper API
ObjectDraftingLineWidth.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLineWidth.Value ToAttributes()
Public Function ToAttributes As ObjectDraftingLineWidth.Value
Return Value
Type: ObjectDraftingLineWidth.Value
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace