Grasshopper API
Param_MatchText.Menu_CustomSingleValueItem Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ToolStripMenuItem Menu_CustomSingleValueItem()
Protected Overrides Function Menu_CustomSingleValueItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace