Grasshopper API
ModelRenderEnvironment Implicit Conversion (String to ModelRenderEnvironment)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderEnvironment (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelRenderEnvironment
Parameters
path
Type: System.String
Return Value
Type: ModelRenderEnvironment
See Also
Reference
ModelRenderEnvironment Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace