Grasshopper API
Param_ModelTextureSlot.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelTextureSlot> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelTextureSlot)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelTextureSlot>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelTextureSlot Class
Grasshopper.Rhinoceros.Render.Params Namespace