Grasshopper API
GH_Convert.ToAnnotationBase_Primary Method
 Performs a direct cast from Rhino.Geometry.AnnotationBase or GH_AnnotationBase. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToAnnotationBase_Primary(
	Object data,
	ref AnnotationBase rc
)
Public Shared Function ToAnnotationBase_Primary (
	data As Object,
	ByRef rc As AnnotationBase
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: AnnotationBase
Result of conversion
Return Value
Type: Boolean
A AnnotationBase instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace