Grasshopper API
AnnotationArrowSettings Constructor
Initializes a new instance of the AnnotationArrowSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrowSettings()
Public Sub New
See Also
Reference
AnnotationArrowSettings Class
AnnotationArrowSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace