Grasshopper API
DisplayColorGradient Constructor
 Blank constructor
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorGradient()
Public Sub New
See Also
Reference
DisplayColorGradient Class
DisplayColorGradient Overload
Grasshopper.Rhinoceros.Display Namespace