Grasshopper API
ModelView.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelView Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelView
Parameters
data
Type: System.Object
Return Value
Type: ModelView
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace