Grasshopper API
EtoExtensions.ToSD Method (Size)
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Size ToSD(
	this Size size
)
<ExtensionAttribute>
Public Shared Function ToSD (
	size As Size
) As Size
Parameters
size
Type: Size
Return Value
Type: Size
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Size. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EtoExtensions Class
ToSD Overload
Grasshopper Namespace