Grasshopper API
ModelUnitSystem.Value.AdjustDocumentUnitSystem Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void AdjustDocumentUnitSystem(
	RhinoDoc document,
	ActiveSpace space,
	bool scale = false
)
Public Sub AdjustDocumentUnitSystem (
	document As RhinoDoc,
	space As ActiveSpace,
	Optional scale As Boolean = false
)
Parameters
document
Type: RhinoDoc
space
Type: ActiveSpace
scale (Optional)
Type: System.Boolean
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace