Grasshopper API
Param_DateTimeFormat Constructor
Initializes a new instance of the Param_DateTimeFormat class
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_DateTimeFormat()
Public Sub New
See Also
Reference
Param_DateTimeFormat Class
Grasshopper.Rhinoceros.Annotations.Params Namespace