Grasshopper API
ModelRenderTexture Implicit Conversion (ColorRGBA to ModelRenderTexture)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderTexture (
	ColorRGBA rgba
)
Public Shared Widening Operator CType (
	rgba As ColorRGBA
) As ModelRenderTexture
Parameters
rgba
Type: ColorRGBA
Return Value
Type: ModelRenderTexture
See Also
Reference
ModelRenderTexture Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace