Grasshopper API
Param_ModelSpaceViewport Constructor
Initializes a new instance of the Param_ModelSpaceViewport class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelSpaceViewport()
Public Sub New
See Also
Reference
Param_ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace