Grasshopper API
GH_OrdinateDimension.CastFrom Method
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool CastFrom(
	Object source
)
Public Overrides Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
GH_OrdinateDimension Class
Grasshopper.Kernel.Types Namespace