Grasshopper API
Param_ModelConstructionPlane.BakeGeometry Method (RhinoDoc, List<Guid>)
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void BakeGeometry(
	RhinoDoc doc,
	List<Guid> obj_ids
)
Public Sub BakeGeometry (
	doc As RhinoDoc,
	obj_ids As List(Of Guid)
)
Parameters
doc
Type: RhinoDoc
obj_ids
Type: System.Collections.Generic.List<Guid>
Implements
IGH_BakeAwareObject.BakeGeometry(RhinoDoc, List<Guid>)
See Also
Reference
Param_ModelConstructionPlane Class
BakeGeometry Overload
Grasshopper.Rhinoceros.Display.Params Namespace