Grasshopper API
AnnotationDimensionSettings Constructor
Initializes a new instance of the AnnotationDimensionSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDimensionSettings()
Public Sub New
See Also
Reference
AnnotationDimensionSettings Class
AnnotationDimensionSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace