Grasshopper API
GH_Hatch.GH_HatchProxy.Construct Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace