Grasshopper API
ModelContent.Attributes.ReadData Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual bool ReadData(
	GH_IReader reader
)
Protected Overridable Function ReadData (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace