Grasshopper API
ModelViewport Implicit Conversion (ModelViewport.Attributes to ModelViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelViewport (
	ModelViewport.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelViewport.Attributes
) As ModelViewport
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
Return Value
Type: ModelViewport
See Also
Reference
ModelViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace