Grasshopper API
Param_ObjectDraftingLinetype.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ObjectDraftingLinetype> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ObjectDraftingLinetype)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ObjectDraftingLinetype>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace