Grasshopper API
ChildSlotNameComparer Constructor
Initializes a new instance of the ChildSlotNameComparer class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ChildSlotNameComparer()
Public Sub New
See Also
Reference
ChildSlotNameComparer Class
Grasshopper.Rhinoceros.Render Namespace