Grasshopper API
Param_AnnotationDimensionSettings Constructor
Initializes a new instance of the Param_AnnotationDimensionSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_AnnotationDimensionSettings()
Public Sub New
See Also
Reference
Param_AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace