Grasshopper API
ModelStandardViewport Constructor
Initializes a new instance of the ModelStandardViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelStandardViewport()
Public Sub New
See Also
Reference
ModelStandardViewport Class
ModelStandardViewport Overload
Grasshopper.Rhinoceros.Display Namespace