Grasshopper API
Param_ModelStandardViewport.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelStandardViewport> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelStandardViewport)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelStandardViewport>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelStandardViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace