Grasshopper API
Param_ObjectDraftingLinetype.RegisterRemoteIDs Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void RegisterRemoteIDs(
	GH_GuidTable table
)
Public Overrides Sub RegisterRemoteIDs (
	table As GH_GuidTable
)
Parameters
table
Type: GH_GuidTable
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace