Grasshopper API
ObjectDrafting Constructor (ObjectDrafting.Attributes)
Initializes a new instance of the ObjectDrafting class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDrafting(
	ObjectDrafting.Attributes attributes
)
Public Sub New (
	attributes As ObjectDrafting.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes
See Also
Reference
ObjectDrafting Class
ObjectDrafting Overload
Grasshopper.Rhinoceros.Drafting Namespace