Grasshopper API
ModelViewport.RenderItem Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override bool RenderItem(
	Graphics graphics,
	RectangleF area,
	int alpha
)
Protected Overrides Function RenderItem (
	graphics As Graphics,
	area As RectangleF,
	alpha As Integer
) As Boolean
Parameters
graphics
Type: System.Drawing.Graphics
area
Type: System.Drawing.RectangleF
alpha
Type: System.Int32
Return Value
Type: Boolean
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace