Grasshopper API
ModelTextureSlot Constructor (RenderContent, String)
Initializes a new instance of the ModelTextureSlot class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureSlot(
	RenderContent renderContent,
	string slotName
)
Public Sub New (
	renderContent As RenderContent,
	slotName As String
)
Parameters
renderContent
Type: RenderContent
slotName
Type: System.String
See Also
Reference
ModelTextureSlot Class
ModelTextureSlot Overload
Grasshopper.Rhinoceros.Render Namespace