Grasshopper API
ObjectDisplay.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDisplay Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectDisplay
Parameters
source
Type: System.Object
Return Value
Type: ObjectDisplay
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace