Grasshopper API
ModelFont Constructor
Initializes a new instance of the ModelFont class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelFont()
Public Sub New
See Also
Reference
ModelFont Class
ModelFont Overload
Grasshopper.Rhinoceros Namespace