Grasshopper API
ModelNamedConstructionPlane.Attributes Constructor
Initializes a new instance of the ModelNamedConstructionPlane.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelNamedConstructionPlane.Attributes Class
Grasshopper.Rhinoceros.Display Namespace