Grasshopper API
ModelContentEnablerLoader.PriorityLoad Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_LoadingInstruction PriorityLoad()
Public Overrides Function PriorityLoad As GH_LoadingInstruction
Return Value
Type: GH_LoadingInstruction
See Also
Reference
ModelContentEnablerLoader Class
Grasshopper.Rhinoceros Namespace