Grasshopper API
Param_MatchText.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_String value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_String
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_String
Return Value
Type: GH_GetterResult
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace