Grasshopper API
ModelData.WriteChunk<T> Method (GH_IWriter, String, T)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void WriteChunk<T>(
	GH_IWriter writer,
	string name,
	in T serializable
)
where T : GH_ISerializable
Protected Friend Shared Sub WriteChunk(Of T As GH_ISerializable) (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As T
)
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: T
Type Parameters
T
See Also
Reference
ModelData Class
WriteChunk Overload
Grasshopper.Rhinoceros Namespace