Grasshopper API
ModelLineWidth.CastFrom Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool CastFrom(
	Object source
)
Public Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
Implements
IGH_Goo.CastFrom(Object)
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace