Grasshopper API
GH_Param<T>.Menu_AppendPublish Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal override void Menu_AppendPublish(
	ToolStripDropDown menu
)
Protected Friend Overrides Sub Menu_AppendPublish (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace