Grasshopper API
ModelUnitSystem.Value.ToLengthUnit Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LengthUnit ToLengthUnit()
Public Function ToLengthUnit As LengthUnit
Return Value
Type: LengthUnit
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace