Grasshopper API
ModelEarthAnchorPoint Implicit Conversion (EarthAnchorPoint to ModelEarthAnchorPoint)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelEarthAnchorPoint (
	EarthAnchorPoint anchorPoint
)
Public Shared Widening Operator CType (
	anchorPoint As EarthAnchorPoint
) As ModelEarthAnchorPoint
Parameters
anchorPoint
Type: EarthAnchorPoint
Return Value
Type: ModelEarthAnchorPoint
See Also
Reference
ModelEarthAnchorPoint Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace