Grasshopper API
AnnotationTextSettings.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationTextSettings.Attributes From(
	DimensionStyle dimStyle
)
Public Shared Function From (
	dimStyle As DimensionStyle
) As AnnotationTextSettings.Attributes
Parameters
dimStyle
Type: DimensionStyle
Return Value
Type: AnnotationTextSettings.Attributes
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace