Grasshopper API
ModelUnitSystem.Value.ToUnitSystem Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public UnitSystem ToUnitSystem(
	out double meterPerUnit
)
Public Function ToUnitSystem (
	<OutAttribute> ByRef meterPerUnit As Double
) As UnitSystem
Parameters
meterPerUnit
Type: System.Double
Return Value
Type: UnitSystem
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace