Grasshopper API
GH_Dimension Constructor (ObjRef)
Initializes a new instance of the GH_Dimension class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_Dimension(
	ObjRef objectReference
)
Protected Sub New (
	objectReference As ObjRef
)
Parameters
objectReference
Type: ObjRef
See Also
Reference
GH_Dimension Class
GH_Dimension Overload
Grasshopper.Kernel.Types Namespace