Grasshopper API
Param_ModelLinetype.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelLinetype> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelLinetype)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelLinetype>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace