Grasshopper API
ModelRenderMaterial Implicit Conversion (RenderMaterial to ModelRenderMaterial)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderMaterial (
	RenderMaterial renderMaterial
)
Public Shared Widening Operator CType (
	renderMaterial As RenderMaterial
) As ModelRenderMaterial
Parameters
renderMaterial
Type: RenderMaterial
Return Value
Type: ModelRenderMaterial
See Also
Reference
ModelRenderMaterial Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace