Grasshopper API
Param_MatchText.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_String> value
)
Protected Overrides Function Prompt_Plural (
	ByRef value As List(Of GH_String)
) As GH_GetterResult
Parameters
value
Type: System.Collections.Generic.List<GH_String>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace