Grasshopper API
GH_ComponentAttributes.IsPickRegion Method (PointF)
 Namespace: Grasshopper.Kernel.Attributes
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsPickRegion(
	PointF point
)
Public Overrides Function IsPickRegion (
	point As PointF
) As Boolean
Parameters
point
Type: System.Drawing.PointF
Return Value
Type: Boolean
See Also
Reference
GH_ComponentAttributes Class
IsPickRegion Overload
Grasshopper.Kernel.Attributes Namespace