Grasshopper API
Param_ObjectDraftingLinetype.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectDraftingLinetype PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectDraftingLinetype
Parameters
data
Type: System.Object
Return Value
Type: ObjectDraftingLinetype
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace