Grasshopper API
Param_ModelInstanceDefinition.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelInstanceDefinition PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelInstanceDefinition
Parameters
data
Type: System.Object
Return Value
Type: ModelInstanceDefinition
See Also
Reference
Param_ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model.Params Namespace