Grasshopper API
ModelDisplayMode Constructor
Initializes a new instance of the ModelDisplayMode class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode()
Public Sub New
See Also
Reference
ModelDisplayMode Class
ModelDisplayMode Overload
Grasshopper.Rhinoceros.Display Namespace