Grasshopper API
GH_Convert.ToHatch_Secondary Method
 Attempts to convert other data types into an Rhino.Geometry.Hatch. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToHatch_Secondary(
	Object data,
	ref Hatch rc
)
Public Shared Function ToHatch_Secondary (
	data As Object,
	ByRef rc As Hatch
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Hatch
Return Value
Type: Boolean
An Rhino.Geometry.Hatch instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace