Grasshopper API
ModelContentParam<T>.SelectedContent Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected IEnumerable<T> SelectedContent(
	IEnumerable<T> items
)
Protected Function SelectedContent (
	items As IEnumerable(Of T)
) As IEnumerable(Of T)
Parameters
items
Type: System.Collections.Generic.IEnumerable<T>
Return Value
Type: IEnumerable<T>
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace