Grasshopper API
GH_Format.FormatTextEntity Method (TextEntity)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatTextEntity(
	TextEntity data
)
Public Shared Function FormatTextEntity (
	data As TextEntity
) As String
Parameters
data
Type: TextEntity
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatTextEntity Overload
Grasshopper.Kernel Namespace