Grasshopper API
ObjectDisplay.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ToDetails()
Public Function ToDetails As String
Return Value
Type: String
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace