Grasshopper API
ObjectRenderMaterial.Value Implicit Conversion (ModelRenderMaterial to ObjectRenderMaterialObjectRenderMaterial.Value)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectRenderMaterial.Value (
	ModelRenderMaterial color
)
Public Shared Widening Operator CType (
	color As ModelRenderMaterial
) As ObjectRenderMaterial.Value
Parameters
color
Type: Grasshopper.Rhinoceros.Render.ModelRenderMaterial
Return Value
Type: ObjectRenderMaterial.Value
See Also
Reference
ObjectRenderMaterial.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace