Grasshopper API
Param_ObjectRenderMaterial.ClearData Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearData()
Public Overrides Sub ClearData
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace