Grasshopper API
Param_ModelLineWidth.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelLineWidth value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelLineWidth
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ModelLineWidth
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace