Grasshopper API
ModelLineWidth.Duplicate Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IGH_Goo Duplicate()
Public Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
Implements
IGH_Goo.Duplicate()
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace