Grasshopper API
ItemDisplayColor Implicit Conversion (ItemDisplayColor to ItemDisplayColorItemDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ItemDisplayColor.Value (
	ItemDisplayColor data
)
Public Shared Widening Operator CType (
	data As ItemDisplayColor
) As ItemDisplayColor.Value
Parameters
data
Type: Grasshopper.Rhinoceros.Display.ItemDisplayColor
Return Value
Type: ItemDisplayColor.Value
See Also
Reference
ItemDisplayColor Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace