Grasshopper API
ModelContent.Equals Method (ModelContent)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelContent other
)
Public Function Equals (
	other As ModelContent
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelContent
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelContent Class
Equals Overload
Grasshopper.Rhinoceros Namespace