Grasshopper API
ModelData.ReadFont Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected static bool ReadFont(
	GH_IReader reader,
	string name,
	out Font serializable
)
Protected Shared Function ReadFont (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As Font
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: Font
Return Value
Type: Boolean
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace