Grasshopper API
EtoExtensions.ToSD Method (PointF)
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static PointF ToSD(
	this PointF point
)
<ExtensionAttribute>
Public Shared Function ToSD (
	point As PointF
) As PointF
Parameters
point
Type: PointF
Return Value
Type: PointF
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type PointF. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
EtoExtensions Class
ToSD Overload
Grasshopper Namespace