Grasshopper API
ModelContentName Implicit Conversion (String to ModelContentName)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelContentName (
	string value
)
Public Shared Widening Operator CType (
	value As String
) As ModelContentName
Parameters
value
Type: System.String
Return Value
Type: ModelContentName
See Also
Reference
ModelContentName Structure
Implicit Overload
Grasshopper.Rhinoceros Namespace