Grasshopper API
Param_ModelRenderTexture.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelRenderTexture value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelRenderTexture
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ModelRenderTexture
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelRenderTexture Class
Grasshopper.Rhinoceros.Render.Params Namespace