Grasshopper API
GH_Param<T>.Menu_ConnectOutputClicked Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal void Menu_ConnectOutputClicked(
	Object sender,
	EventArgs e
)
Protected Friend Sub Menu_ConnectOutputClicked (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace