Grasshopper API
DisplayColorStop Constructor (ColorStop)
Initializes a new instance of the DisplayColorStop class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorStop(
	ColorStop colour
)
Public Sub New (
	colour As ColorStop
)
Parameters
colour
Type: ColorStop
See Also
Reference
DisplayColorStop Class
DisplayColorStop Overload
Grasshopper.Rhinoceros.Display Namespace