Grasshopper API
GH_Convert.ToTextEntity Method
 Convert data into Rhino.Geometry.TextEntity.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToTextEntity(
	Object data,
	ref TextEntity rc,
	GH_Conversion conversion_level
)
Public Shared Function ToTextEntity (
	data As Object,
	ByRef rc As TextEntity,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: TextEntity
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace