Grasshopper API
ModelRenderEnvironment Constructor (ModelRenderEnvironment.Attributes)
Initializes a new instance of the ModelRenderEnvironment class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderEnvironment(
	ModelRenderEnvironment.Attributes attributes
)
Public Sub New (
	attributes As ModelRenderEnvironment.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderEnvironment.Attributes
See Also
Reference
ModelRenderEnvironment Class
ModelRenderEnvironment Overload
Grasshopper.Rhinoceros.Render Namespace