Grasshopper API
GH_Convert.ToGHExtrusion_Primary Method
 Converts similar data into a GH_Extrusion instance. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHExtrusion_Primary(
	Object data,
	ref GH_Extrusion target
)
Public Shared Function ToGHExtrusion_Primary (
	data As Object,
	ByRef target As GH_Extrusion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Extrusion
Target instance. If null, a new GH_Brep will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace