Grasshopper API
GH_Extrusion.DuplicateExtrusion Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Extrusion DuplicateExtrusion()
Public Function DuplicateExtrusion As GH_Extrusion
Return Value
Type: GH_Extrusion
See Also
Reference
GH_Extrusion Class
Grasshopper.Kernel.Types Namespace