Grasshopper API
Param_ModelMeshingParameters.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelMeshingParameters> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelMeshingParameters)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelMeshingParameters>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelMeshingParameters Class
Grasshopper.Rhinoceros.Params Namespace