Grasshopper API
ItemDisplayColor.Value.CompareTo Method (ItemDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ItemDisplayColor.Value other
)
Public Function CompareTo (
	other As ItemDisplayColor.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ItemDisplayColor.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Display Namespace