Grasshopper API
ModelContent.LoadReferencedData Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual bool LoadReferencedData()
Protected Overridable Function LoadReferencedData As Boolean
Return Value
Type: Boolean
Implements
IGH_ReferencedData.LoadReferencedData()
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace