Grasshopper API
GH_Convert.ToClippingPlane_Primary Method
 Performs a direct cast from Rhino.Geometry.ClippingPlaneSurface or GH_ClippingPlane. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToClippingPlane_Primary(
	Object data,
	ref ClippingPlaneSurface rc
)
Public Shared Function ToClippingPlane_Primary (
	data As Object,
	ByRef rc As ClippingPlaneSurface
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: ClippingPlaneSurface
Result of conversion
Return Value
Type: Boolean
A TextDot instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace