Grasshopper API
GH_ClippingPlane Constructor (GH_ClippingPlane)
 Create a duplicate of another GH_ClippingPlane. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_ClippingPlane(
	GH_ClippingPlane other
)
Public Sub New (
	other As GH_ClippingPlane
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_ClippingPlane
Clipping plane to duplicate
See Also
Reference
GH_ClippingPlane Class
GH_ClippingPlane Overload
Grasshopper.Kernel.Types Namespace