Grasshopper API
ModelTags.CompareTo Method (Object)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	Object obj
)
Public Function CompareTo (
	obj As Object
) As Integer
Parameters
obj
Type: System.Object
Return Value
Type: Int32
Implements
IComparable.CompareTo(Object)
See Also
Reference
ModelTags Structure
CompareTo Overload
Grasshopper.Rhinoceros Namespace