Grasshopper API
ModelInstanceDefinition Constructor (ModelInstanceDefinition.Attributes)
Initializes a new instance of the ModelInstanceDefinition class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition(
	ModelInstanceDefinition.Attributes attributes
)
Public Sub New (
	attributes As ModelInstanceDefinition.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes
See Also
Reference
ModelInstanceDefinition Class
ModelInstanceDefinition Overload
Grasshopper.Rhinoceros.Model Namespace