Grasshopper API
AnnotationToleranceSettings.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationToleranceSettings.Attributes From(
	DimensionStyle dimStyle
)
Public Shared Function From (
	dimStyle As DimensionStyle
) As AnnotationToleranceSettings.Attributes
Parameters
dimStyle
Type: DimensionStyle
Return Value
Type: AnnotationToleranceSettings.Attributes
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace