Grasshopper API
GH_RadialDimension.DuplicateRadialDimension Method
 Create a duplicate of this radial dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_RadialDimension DuplicateRadialDimension()
Public Function DuplicateRadialDimension As GH_RadialDimension
Return Value
Type: GH_RadialDimension
See Also
Reference
GH_RadialDimension Class
Grasshopper.Kernel.Types Namespace