Grasshopper API
ModelRenderTexture.Attributes Constructor
Initializes a new instance of the ModelRenderTexture.Attributes class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelRenderTexture.Attributes Class
Grasshopper.Rhinoceros.Render Namespace