Grasshopper API
ModelUserText.MergeRange Method (IEnumerable<String>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText MergeRange(
	IEnumerable<string> source
)
Public Function MergeRange (
	source As IEnumerable(Of String)
) As ModelUserText
Parameters
source
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
MergeRange Overload
Grasshopper.Rhinoceros Namespace