Grasshopper API
ModelInstanceDefinition.Attributes Implicit Conversion (String to ModelInstanceDefinitionModelInstanceDefinition.Attributes)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelInstanceDefinition.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelInstanceDefinition.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelInstanceDefinition.Attributes
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace