Grasshopper API
GH_TaskCapableComponent<T>.AfterSolveInstance Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void AfterSolveInstance()
Protected Overrides Sub AfterSolveInstance
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace