Grasshopper API
GH_ClippingPlane.LoadGeometry Method
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool LoadGeometry()
Public Overrides Function LoadGeometry As Boolean
Return Value
Type: Boolean
True if the geometry is loaded (or if it was already loaded), False on failure.
See Also
Reference
GH_ClippingPlane Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace