Grasshopper API
GH_Extrusion Constructor (GH_Extrusion)
Initializes a new instance of the GH_Extrusion class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Extrusion(
	GH_Extrusion other
)
Public Sub New (
	other As GH_Extrusion
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Extrusion
See Also
Reference
GH_Extrusion Class
GH_Extrusion Overload
Grasshopper.Kernel.Types Namespace