Grasshopper API
Param_ObjectDraftingLinetype Constructor
Initializes a new instance of the Param_ObjectDraftingLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectDraftingLinetype()
Public Sub New
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace