Grasshopper API
GH_LinearDimension Constructor (LinearDimension, ModelAnnotationStyle)
 Create a duplicate of an existing linear dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_LinearDimension(
	LinearDimension dimension,
	ModelAnnotationStyle style
)
Public Sub New (
	dimension As LinearDimension,
	style As ModelAnnotationStyle
)
Parameters
dimension
Type: LinearDimension
Linear dimension to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_LinearDimension Class
GH_LinearDimension Overload
Grasshopper.Kernel.Types Namespace