Grasshopper API
ModelRenderMaterial Implicit Conversion (ColorRGBA to ModelRenderMaterial)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderMaterial (
	ColorRGBA rgba
)
Public Shared Widening Operator CType (
	rgba As ColorRGBA
) As ModelRenderMaterial
Parameters
rgba
Type: ColorRGBA
Return Value
Type: ModelRenderMaterial
See Also
Reference
ModelRenderMaterial Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace