Grasshopper API
Param_ModelAttributeKey Constructor
Initializes a new instance of the Param_ModelAttributeKey class
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelAttributeKey()
Public Sub New
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace