Grasshopper API
Param_ObjectDisplay Constructor
Initializes a new instance of the Param_ObjectDisplay class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectDisplay()
Public Sub New
See Also
Reference
Param_ObjectDisplay Class
Grasshopper.Rhinoceros.Display.Params Namespace