Grasshopper API
DisplayColorGradient.DrawViewportWires Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportWires(
	GH_PreviewWireArgs args
)
Public Sub DrawViewportWires (
	args As GH_PreviewWireArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewWireArgs
Implements
IGH_PreviewData.DrawViewportWires(GH_PreviewWireArgs)
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace