Grasshopper API
ObjectDraftingColor Implicit Conversion (ObjectDraftingColor to ObjectDraftingColorObjectDraftingColor.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingColor.Value (
	ObjectDraftingColor data
)
Public Shared Widening Operator CType (
	data As ObjectDraftingColor
) As ObjectDraftingColor.Value
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor
Return Value
Type: ObjectDraftingColor.Value
See Also
Reference
ObjectDraftingColor Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace