Grasshopper API
Param_ClippingDrawingSettings Constructor
Initializes a new instance of the Param_ClippingDrawingSettings class
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ClippingDrawingSettings()
Public Sub New
See Also
Reference
Param_ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting.Params Namespace