Grasshopper API
GH_PointCloud Constructor (Guid)
 Create a new referenced curve that references a Rhino curve object with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PointCloud(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of point-cloud object to reference.
See Also
Reference
GH_PointCloud Class
GH_PointCloud Overload
Grasshopper.Kernel.Types Namespace