Grasshopper API
GH_WindowsFormUtil.CenterFormOnEditor Method (Form, Boolean)
 Positions a Form so that it is centered on the active editor. If the editor doesn't exist or is hidden, the form will be centered on the screen instead.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void CenterFormOnEditor(
	Form F,
	bool limitToScreen
)
Public Shared Sub CenterFormOnEditor (
	F As Form,
	limitToScreen As Boolean
)
Parameters
F
Type: System.Windows.Forms.Form
The Form to adjust
limitToScreen
Type: System.Boolean
If True, the Form won't be allowed to extend beyond the limits of the screen containing the cursor.
See Also
Reference
GH_WindowsFormUtil Class
CenterFormOnEditor Overload
Grasshopper.GUI Namespace