Grasshopper API
ModelUnitSystem.Cast Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUnitSystem Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelUnitSystem
Parameters
source
Type: System.Object
Return Value
Type: ModelUnitSystem
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace