Grasshopper API
Param_ModelView.InstantiateT Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelView InstantiateT()
Protected Overrides Function InstantiateT As ModelView
Return Value
Type: ModelView
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace