Grasshopper API
GH_Convert.GetSubDFromDocument Method
 Harvest a sub-d object from a Rhino document.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool GetSubDFromDocument(
	RhinoDoc doc,
	Guid id,
	out SubD subd
)
Public Shared Function GetSubDFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef subd As SubD
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of brep object.
subd
Type: SubD
Sub-D result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace