Grasshopper API
ClippingArrow Constructor (DimensionStyle.ClippingArrowType)
Initializes a new instance of the ClippingArrow class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrow(
	ClippingArrowType arrowType
)
Public Sub New (
	arrowType As ClippingArrowType
)
Parameters
arrowType
Type: ClippingArrowType
See Also
Reference
ClippingArrow Class
ClippingArrow Overload
Grasshopper.Rhinoceros.Annotations Namespace