Grasshopper API
GH_DocumentIO.ShowOverwriteDialog Method (String)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int ShowOverwriteDialog(
	string filename
)
Public Shared Function ShowOverwriteDialog (
	filename As String
) As Integer
Parameters
filename
Type: System.String
Return Value
Type: Int32
See Also
Reference
GH_DocumentIO Class
ShowOverwriteDialog Overload
Grasshopper.Kernel Namespace