Grasshopper API
ModelUnitSystem.TooltipString Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TooltipString()
Public Overrides Function TooltipString As String
Return Value
Type: String
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace