Grasshopper API
AnnotationArrow Implicit Conversion (AnnotationArrow.Attributes to AnnotationArrow)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationArrow (
	AnnotationArrow.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As AnnotationArrow.Attributes
) As AnnotationArrow
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationArrow.Attributes
Return Value
Type: AnnotationArrow
See Also
Reference
AnnotationArrow Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace