Grasshopper API
AnnotationDimensionSettings.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationDimensionSettings.Attributes From(
	DimensionStyle dimStyle
)
Public Shared Function From (
	dimStyle As DimensionStyle
) As AnnotationDimensionSettings.Attributes
Parameters
dimStyle
Type: DimensionStyle
Return Value
Type: AnnotationDimensionSettings.Attributes
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace