Grasshopper API
ModelRenderSun Implicit Conversion (ModelRenderSun.Attributes to ModelRenderSun)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderSun (
	ModelRenderSun.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelRenderSun.Attributes
) As ModelRenderSun
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes
Return Value
Type: ModelRenderSun
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace