Grasshopper API
ModelDetailViewport Constructor (Guid)
Initializes a new instance of the ModelDetailViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDetailViewport(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelDetailViewport Class
ModelDetailViewport Overload
Grasshopper.Rhinoceros.Display Namespace