Grasshopper API
GH_DetailView Constructor (GH_DetailView)
 Create a duplicate of another GH_DetailView. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_DetailView(
	GH_DetailView other
)
Public Sub New (
	other As GH_DetailView
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_DetailView
Detail View to duplicate
See Also
Reference
GH_DetailView Class
GH_DetailView Overload
Grasshopper.Kernel.Types Namespace