Grasshopper API
ModelFont.Cast Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelFont Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelFont
Parameters
data
Type: System.Object
Return Value
Type: ModelFont
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace