Grasshopper API
GH_Light.DrawViewportMeshes Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual void DrawViewportMeshes(
	GH_PreviewMeshArgs args
)
Public Overridable Sub DrawViewportMeshes (
	args As GH_PreviewMeshArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewMeshArgs
Implements
IGH_PreviewData.DrawViewportMeshes(GH_PreviewMeshArgs)
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace