Grasshopper API
Param_ObjectDisplayColor Constructor
Initializes a new instance of the Param_ObjectDisplayColor class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectDisplayColor()
Public Sub New
See Also
Reference
Param_ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace