Grasshopper API
ObjectDraftingLinetype.Value.Equals Method (ObjectDraftingLinetype.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectDraftingLinetype.Value other
)
Public Function Equals (
	other As ObjectDraftingLinetype.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectDraftingLinetype.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace