Grasshopper API
ModelLinetype Implicit Conversion (Linetype to ModelLinetype)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLinetype (
	Linetype linetype
)
Public Shared Widening Operator CType (
	linetype As Linetype
) As ModelLinetype
Parameters
linetype
Type: Linetype
Return Value
Type: ModelLinetype
See Also
Reference
ModelLinetype Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace