Grasshopper API
GH_SubD Constructor
Initializes a new instance of the GH_SubD class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_SubD()
Public Sub New
See Also
Reference
GH_SubD Class
GH_SubD Overload
Grasshopper.Kernel.Types Namespace