Grasshopper API
AnnotationDateTimeFormat.Duplicate Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_Goo Duplicate()
Public Overrides Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
See Also
Reference
AnnotationDateTimeFormat Class
Grasshopper.Rhinoceros.Annotations Namespace