Grasshopper API
GH_ScriptVariant.False Operator
 Namespace: Grasshopper.Kernel.Expressions
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator false(
	GH_ScriptVariant A
)
Public Shared Operator IsFalse (
	A As GH_ScriptVariant
) As Boolean
Parameters
A
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: Boolean
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace