Grasshopper API
GH_OrdinateDimension Constructor
 Default constructor, creates an invalid ordinate dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_OrdinateDimension()
Public Sub New
See Also
Reference
GH_OrdinateDimension Class
GH_OrdinateDimension Overload
Grasshopper.Kernel.Types Namespace