Grasshopper API
ObjectSectionStyle Constructor (ObjectSectionStyle.Value)
Initializes a new instance of the ObjectSectionStyle class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionStyle(
	ObjectSectionStyle.Value value
)
Public Sub New (
	value As ObjectSectionStyle.Value
)
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value
See Also
Reference
ObjectSectionStyle Class
ObjectSectionStyle Overload
Grasshopper.Rhinoceros.Drafting Namespace