Grasshopper API
ModelLayer.Attributes Implicit Conversion (String to ModelLayerModelLayer.Attributes)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLayer.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelLayer.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelLayer.Attributes
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace