Grasshopper API
ModelHatchPattern.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToDetails()
Public Overrides Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelHatchPattern.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace