Grasshopper API
ItemDisplayColor.Value Implicit Conversion (ItemDisplayColor.Value to ItemColorSource)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ItemColorSource (
	ItemDisplayColor.Value value
)
Public Shared Widening Operator CType (
	value As ItemDisplayColor.Value
) As ItemColorSource
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value
Return Value
Type: ItemColorSource
See Also
Reference
ItemDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace