Grasshopper API
ModelDetailViewport Implicit Conversion (RhinoViewport to ModelDetailViewport)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelDetailViewport (
	RhinoViewport viewport
)
Public Shared Widening Operator CType (
	viewport As RhinoViewport
) As ModelDetailViewport
Parameters
viewport
Type: RhinoViewport
Return Value
Type: ModelDetailViewport
See Also
Reference
ModelDetailViewport Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace