Grasshopper API
GH_Hatch Constructor (GH_Hatch)
 Create a duplicate of another GH_Hatch. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Hatch(
	GH_Hatch other
)
Public Sub New (
	other As GH_Hatch
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Hatch
Hatch to duplicate
See Also
Reference
GH_Hatch Class
GH_Hatch Overload
Grasshopper.Kernel.Types Namespace