Grasshopper API
Param_DateTimeFormat.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref AnnotationDateTimeFormat value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As AnnotationDateTimeFormat
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Annotations.AnnotationDateTimeFormat
Return Value
Type: GH_GetterResult
See Also
Reference
Param_DateTimeFormat Class
Grasshopper.Rhinoceros.Annotations.Params Namespace