Grasshopper API
GH_InstanceReference.GH_InstanceReferenceProxy Constructor
Initializes a new instance of the GH_InstanceReference.GH_InstanceReferenceProxy class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReferenceProxy(
	GH_InstanceReference Value
)
Public Sub New (
	Value As GH_InstanceReference
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_InstanceReference
See Also
Reference
GH_InstanceReference.GH_InstanceReferenceProxy Class
Grasshopper.Kernel.Types Namespace