Grasshopper API
ClippingArrow.Attributes Constructor
Initializes a new instance of the ClippingArrow.Attributes class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ClippingArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace