Grasshopper API
GH_Extrusion Constructor (Guid)
Initializes a new instance of the GH_Extrusion class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Extrusion(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
GH_Extrusion Class
GH_Extrusion Overload
Grasshopper.Kernel.Types Namespace