Grasshopper API
ObjectRender.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectRender Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectRender
Parameters
source
Type: System.Object
Return Value
Type: ObjectRender
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace