Grasshopper API
ObjectDraftingLineWidth.Value.CompareTo Method (ObjectDraftingLineWidth.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ObjectDraftingLineWidth.Value other
)
Public Function CompareTo (
	other As ObjectDraftingLineWidth.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ObjectDraftingLineWidth.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Drafting Namespace