Grasshopper API
Complex.UnaryNegation Operator
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Complex operator -(
	Complex subtrahend
)
Public Shared Operator - (
	subtrahend As Complex
) As Complex
Parameters
subtrahend
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace