Grasshopper API
GH_Format.FormatPointCloud Method (GH_PointCloud)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatPointCloud(
	GH_PointCloud data
)
Public Shared Function FormatPointCloud (
	data As GH_PointCloud
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_PointCloud
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatPointCloud Overload
Grasshopper.Kernel Namespace