Grasshopper API
ClippingArrow Implicit Conversion (DimensionStyle.ClippingArrowType to ClippingArrow)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ClippingArrow (
	ClippingArrowType arrowType
)
Public Shared Widening Operator CType (
	arrowType As ClippingArrowType
) As ClippingArrow
Parameters
arrowType
Type: ClippingArrowType
Return Value
Type: ClippingArrow
See Also
Reference
ClippingArrow Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace