Grasshopper API
GH_TaskCapableComponent<T>.Write Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Write(
	GH_IWriter writer
)
Public Overrides Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace