Grasshopper API
Param_DateTimeFormat.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<AnnotationDateTimeFormat> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of AnnotationDateTimeFormat)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<AnnotationDateTimeFormat>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_DateTimeFormat Class
Grasshopper.Rhinoceros.Annotations.Params Namespace