Grasshopper API
ObjectRenderMaterial Implicit Conversion (ObjectRenderMaterial to ObjectRenderMaterialObjectRenderMaterial.Value)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectRenderMaterial.Value (
	ObjectRenderMaterial data
)
Public Shared Widening Operator CType (
	data As ObjectRenderMaterial
) As ObjectRenderMaterial.Value
Parameters
data
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial
Return Value
Type: ObjectRenderMaterial.Value
See Also
Reference
ObjectRenderMaterial Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace