Grasshopper API
ItemDisplayColor.Value Constructor (ItemColorSource, ModelColor)
Initializes a new instance of the ItemDisplayColor.Value class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ItemColorSource source,
	ModelColor color
)
Public Sub New (
	source As ItemColorSource,
	color As ModelColor
)
Parameters
source
Type: ItemColorSource
color
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ItemDisplayColor.Value Structure
ItemDisplayColor.Value Overload
Grasshopper.Rhinoceros.Display Namespace