Grasshopper API
ModelView.CastTo<Q> Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
internal bool CastTo<Q>(
	out Q target
)
Friend Function CastTo(Of Q) (
	<OutAttribute> ByRef target As Q
) As Boolean
Parameters
target
Type: Q
Type Parameters
Q
Return Value
Type: Boolean
Implements
IGH_Goo.CastTo<T>(T)
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace