Grasshopper API
GH_Format.FormatClippingPlane Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatClippingPlane(
	GH_ClippingPlane data
)
Public Shared Function FormatClippingPlane (
	data As GH_ClippingPlane
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_ClippingPlane
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace