Grasshopper API
Param_DisplayColorStop Constructor
Initializes a new instance of the Param_DisplayColorStop class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_DisplayColorStop()
Public Sub New
See Also
Reference
Param_DisplayColorStop Class
Grasshopper.Rhinoceros.Display.Params Namespace