Grasshopper API
ModelLinetype Implicit Conversion (ModelLinetype.Attributes to ModelLinetype)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLinetype (
	ModelLinetype.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelLinetype.Attributes
) As ModelLinetype
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes
Return Value
Type: ModelLinetype
See Also
Reference
ModelLinetype Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace