Grasshopper API
GH_AnnotationBase.SetOverrides Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool SetOverrides(
	DimensionStyle style
)
Public Function SetOverrides (
	style As DimensionStyle
) As Boolean
Parameters
style
Type: DimensionStyle
Return Value
Type: Boolean
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace