Grasshopper API
ModelStandardViewport.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelStandardViewport Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelStandardViewport
Parameters
data
Type: System.Object
Return Value
Type: ModelStandardViewport
See Also
Reference
ModelStandardViewport Class
Grasshopper.Rhinoceros.Display Namespace