Grasshopper API
ModelNamedConstructionPlane Implicit Conversion (ModelNamedConstructionPlane.Attributes to ModelNamedConstructionPlane)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelNamedConstructionPlane (
	ModelNamedConstructionPlane.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelNamedConstructionPlane.Attributes
) As ModelNamedConstructionPlane
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelNamedConstructionPlane.Attributes
Return Value
Type: ModelNamedConstructionPlane
See Also
Reference
ModelNamedConstructionPlane Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace