Grasshopper API
ModelHatchLine Constructor
Initializes a new instance of the ModelHatchLine class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchLine()
Public Sub New
See Also
Reference
ModelHatchLine Class
ModelHatchLine Overload
Grasshopper.Rhinoceros.Drafting Namespace