Grasshopper API
Param_DisplayColorStop.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<DisplayColorStop> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of DisplayColorStop)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<DisplayColorStop>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_DisplayColorStop Class
Grasshopper.Rhinoceros.Display.Params Namespace