Grasshopper API
ModelRenderSkylight.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderSkylight.Attributes ToAttributes()
Public Function ToAttributes As ModelRenderSkylight.Attributes
Return Value
Type: ModelRenderSkylight.Attributes
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace