Grasshopper API
GH_Convert.ToGHTextDot_Primary Method
 Converts similar data into a GH_TextDot instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHTextDot_Primary(
	Object data,
	ref GH_TextDot target
)
Public Shared Function ToGHTextDot_Primary (
	data As Object,
	ByRef target As GH_TextDot
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_TextDot
Target instance. If null, a new GH_TextDot will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace