Grasshopper API
GH_Leader Constructor (Leader)
 Create a duplicate of an existing leader.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Leader(
	Leader leader
)
Public Sub New (
	leader As Leader
)
Parameters
leader
Type: Leader
Leader to duplicate
See Also
Reference
GH_Leader Class
GH_Leader Overload
Grasshopper.Kernel.Types Namespace