Grasshopper API
Utility.DocumentUnits Method
 Returns the unit system for the model document
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string DocumentUnits()
Public Shared Function DocumentUnits As String
Return Value
Type: String
See Also
Reference
Utility Class
Grasshopper Namespace