Grasshopper API
ModelLineWidth.EmitProxy Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IGH_GooProxy EmitProxy()
Public Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
Implements
IGH_Goo.EmitProxy()
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace