Grasshopper API
Param_InstanceReference.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_InstanceReference> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_InstanceReference)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_InstanceReference>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_InstanceReference Class
Grasshopper.Kernel.Parameters Namespace