Grasshopper API
Param_LinearDimension.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_LinearDimension> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_LinearDimension)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_LinearDimension>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_LinearDimension Class
Grasshopper.Kernel.Parameters Namespace