Grasshopper API
AnnotationDateTimeFormat Constructor
Initializes a new instance of the AnnotationDateTimeFormat class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDateTimeFormat()
Public Sub New
See Also
Reference
AnnotationDateTimeFormat Class
AnnotationDateTimeFormat Overload
Grasshopper.Rhinoceros.Annotations Namespace