Grasshopper API
ModelConstructionPlane.GetBoundingBox Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox GetBoundingBox(
	Transform xform
)
Public Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Transform
Return Value
Type: BoundingBox
Implements
IGH_GeometricGoo.GetBoundingBox(Transform)
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace