Grasshopper API
ObjectVisibility Constructor (ObjectVisibility.Attributes)
Initializes a new instance of the ObjectVisibility class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectVisibility(
	ObjectVisibility.Attributes attributes
)
Public Sub New (
	attributes As ObjectVisibility.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ObjectVisibility.Attributes
See Also
Reference
ObjectVisibility Class
ObjectVisibility Overload
Grasshopper.Rhinoceros.Display Namespace