Grasshopper API
ModelHatchPattern Constructor (Guid)
Initializes a new instance of the ModelHatchPattern class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelHatchPattern Class
ModelHatchPattern Overload
Grasshopper.Rhinoceros.Drafting Namespace