Grasshopper API
ModelTextureMapping Constructor (Guid)
Initializes a new instance of the ModelTextureMapping class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureMapping(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelTextureMapping Class
ModelTextureMapping Overload
Grasshopper.Rhinoceros.Render Namespace