Grasshopper API
Param_Hatch.InstantiateT Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_Hatch InstantiateT()
Protected Overrides Function InstantiateT As GH_Hatch
Return Value
Type: GH_Hatch
See Also
Reference
Param_Hatch Class
Grasshopper.Kernel.Parameters Namespace