Grasshopper API
Param_Leader.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_Leader> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_Leader)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_Leader>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace