Grasshopper API
GH_Centermark Constructor (Guid)
 Create a new referenced centermark that references a Rhino centermark with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Centermark(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of centermark object to reference.
See Also
Reference
GH_Centermark Class
GH_Centermark Overload
Grasshopper.Kernel.Types Namespace