Grasshopper API
Param_ModelMeshingParameters.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelMeshingParameters PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelMeshingParameters
Parameters
data
Type: System.Object
Return Value
Type: ModelMeshingParameters
See Also
Reference
Param_ModelMeshingParameters Class
Grasshopper.Rhinoceros.Params Namespace