Grasshopper API
ModelConstructionPlane Constructor (ModelConstructionPlane)
Initializes a new instance of the ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane(
	ModelConstructionPlane other
)
Public Sub New (
	other As ModelConstructionPlane
)
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ModelConstructionPlane
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace