Grasshopper API
Param_TextEntity Constructor
Initializes a new instance of the Param_TextEntity class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_TextEntity()
Public Sub New
See Also
Reference
Param_TextEntity Class
Grasshopper.Kernel.Parameters Namespace