Grasshopper API
GH_Convert.ToGHInstanceReference_Secondary Method
 Converts similar data into a GH_InstanceReference instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHInstanceReference_Secondary(
	Object data,
	ref GH_InstanceReference target
)
Public Shared Function ToGHInstanceReference_Secondary (
	data As Object,
	ByRef target As GH_InstanceReference
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_InstanceReference
Target instance. If null, a new GH_InstanceReference will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace