Grasshopper API
GH_RadialDimension Constructor (RadialDimension, ModelAnnotationStyle)
 Create a duplicate of an existing radial dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_RadialDimension(
	RadialDimension dimension,
	ModelAnnotationStyle style
)
Public Sub New (
	dimension As RadialDimension,
	style As ModelAnnotationStyle
)
Parameters
dimension
Type: RadialDimension
Radial dimension to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_RadialDimension Class
GH_RadialDimension Overload
Grasshopper.Kernel.Types Namespace