Grasshopper API
ObjectDraftingLinetype.Value.Deconstruct Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Deconstruct(
	out ObjectLinetypeSource source,
	out ModelLinetype value
)
Public Sub Deconstruct (
	<OutAttribute> ByRef source As ObjectLinetypeSource,
	<OutAttribute> ByRef value As ModelLinetype
)
Parameters
source
Type: ObjectLinetypeSource
value
Type: Grasshopper.Rhinoceros.Drafting.ModelLinetype
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace