Grasshopper API
GH_Format.FormatOrdinateDimension Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatOrdinateDimension(
	GH_OrdinateDimension data
)
Public Shared Function FormatOrdinateDimension (
	data As GH_OrdinateDimension
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_OrdinateDimension
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace