Grasshopper API
ModelDisplayMode.Attributes Constructor
Initializes a new instance of the ModelDisplayMode.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelDisplayMode.Attributes Class
Grasshopper.Rhinoceros.Display Namespace