Grasshopper API
Param_ObjectDisplayColor.Menu_AppendPromptMore Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void Menu_AppendPromptMore(
	ToolStripDropDown menu
)
Protected Overrides Sub Menu_AppendPromptMore (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace