Grasshopper API
ModelData.Write<T> Method (GH_IWriter, String, T)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static bool Write<T>(
	GH_IWriter writer,
	string name,
	in T serializable
)
where T : ModelData
Protected Friend Shared Function Write(Of T As ModelData) (
	writer As GH_IWriter,
	name As String,
	ByRef serializable As T
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
name
Type: System.String
serializable
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
ModelData Class
Write Overload
Grasshopper.Rhinoceros Namespace