Grasshopper API
GH_TextDot.LoadGeometry Method (RhinoDoc)
 If the text dot is referenced and not yet loaded, attempts to load the text dot.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool LoadGeometry(
	RhinoDoc doc
)
Public Overrides Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Return Value
Type: Boolean
True if the text dot is loaded (or if it was already loaded), False on failure.
See Also
Reference
GH_TextDot Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace