Grasshopper API
ModelContentParam<T>.Menu_AppendPromptMore Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void Menu_AppendPromptMore(
	ToolStripDropDown menu
)
Protected Overrides Sub Menu_AppendPromptMore (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace