Grasshopper API
ModelRenderTexture.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderTexture.Attributes ToAttributes()
Public Function ToAttributes As ModelRenderTexture.Attributes
Return Value
Type: ModelRenderTexture.Attributes
See Also
Reference
ModelRenderTexture Class
Grasshopper.Rhinoceros.Render Namespace