Grasshopper API
GH_Format.RhinoUnitSymbol Method (UnitSystem)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string RhinoUnitSymbol(
	UnitSystem unitSystem
)
Public Shared Function RhinoUnitSymbol (
	unitSystem As UnitSystem
) As String
Parameters
unitSystem
Type: UnitSystem
Return Value
Type: String
See Also
Reference
GH_Format Class
RhinoUnitSymbol Overload
Grasshopper.Kernel Namespace