Grasshopper API
ModelAnnotationStyle.Attributes Implicit Conversion (String to ModelAnnotationStyleModelAnnotationStyle.Attributes)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelAnnotationStyle.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelAnnotationStyle.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelAnnotationStyle.Attributes
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace