Grasshopper API
ModelDisplayMode Constructor (Guid)
Initializes a new instance of the ModelDisplayMode class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelDisplayMode Class
ModelDisplayMode Overload
Grasshopper.Rhinoceros.Display Namespace