Grasshopper API
ModelContentParam<T>.RegisterRemoteIDs Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void RegisterRemoteIDs(
	GH_GuidTable table
)
Public Overrides Sub RegisterRemoteIDs (
	table As GH_GuidTable
)
Parameters
table
Type: GH_GuidTable
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace