Grasshopper API
Param_AngularDimension.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_AngularDimension value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_AngularDimension
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_AngularDimension
Return Value
Type: GH_GetterResult
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace