Grasshopper API
ModelConstructionPlane.ToConstructionPlane Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ConstructionPlane ToConstructionPlane(
	ConstructionPlane cplane = null
)
Public Function ToConstructionPlane (
	Optional cplane As ConstructionPlane = Nothing
) As ConstructionPlane
Parameters
cplane (Optional)
Type: ConstructionPlane
Return Value
Type: ConstructionPlane
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace