Grasshopper API
ModelRenderMaterial Constructor (Material)
Initializes a new instance of the ModelRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial(
	Material material
)
Public Sub New (
	material As Material
)
Parameters
material
Type: Material
See Also
Reference
ModelRenderMaterial Class
ModelRenderMaterial Overload
Grasshopper.Rhinoceros.Render Namespace