Grasshopper API
GH_PointCloud.DuplicateGeometry Method
 Create a duplicate of this curve.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_GeometricGoo DuplicateGeometry()
Public Overrides Function DuplicateGeometry As IGH_GeometricGoo
Return Value
Type: IGH_GeometricGoo
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace