Grasshopper API
GH_RenderArgs.PushModelTransform Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void PushModelTransform(
	Transform transform
)
Public Sub PushModelTransform (
	transform As Transform
)
Parameters
transform
Type: Transform
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace