Grasshopper API
CentralSettings.UserOkayWithBakingInvalidObject Method
 Show the warning for baking invalid objects, or return the default choice if the warning is disabled.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool UserOkayWithBakingInvalidObject(
	string objectType = "object"
)
Public Shared Function UserOkayWithBakingInvalidObject (
	Optional objectType As String = "object"
) As Boolean
Parameters
objectType (Optional)
Type: System.String
Return Value
Type: Boolean
True if object ought to be baked, false if not.
See Also
Reference
CentralSettings Class
Grasshopper Namespace