Grasshopper API
ModelRenderContent Constructor (ModelRenderContent.Attributes)
Initializes a new instance of the ModelRenderContent class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelRenderContent(
	ModelRenderContent.Attributes attributes
)
Protected Friend Sub New (
	attributes As ModelRenderContent.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes
See Also
Reference
ModelRenderContent Class
ModelRenderContent Overload
Grasshopper.Rhinoceros.Render Namespace