Grasshopper API
ModelContent.Attributes.CloneOnWrite<A> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static A CloneOnWrite<A>(
	ref bool cloned,
	ref A attributes
)
where A : ModelContent.Attributes
Protected Friend Shared Function CloneOnWrite(Of A As ModelContent.Attributes) (
	ByRef cloned As Boolean,
	ByRef attributes As A
) As A
Parameters
cloned
Type: System.Boolean
attributes
Type: A
Type Parameters
A
Return Value
Type: A
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace