Grasshopper API
ObjectDisplayColor.Value Implicit Conversion (ObjectDisplayColor.Value to ObjectColorSource)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectColorSource (
	ObjectDisplayColor.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDisplayColor.Value
) As ObjectColorSource
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value
Return Value
Type: ObjectColorSource
See Also
Reference
ObjectDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace