Grasshopper API
ModelContent.FromId Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelContent FromId(
	RhinoDoc document,
	Guid guid
)
Public Shared Function FromId (
	document As RhinoDoc,
	guid As Guid
) As ModelContent
Parameters
document
Type: RhinoDoc
guid
Type: System.Guid
Return Value
Type: ModelContent
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace