Grasshopper API
GH_AnnotationBase.DuplicateAnnotation Method
 Create a duplicate of this annotation.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract GH_AnnotationBase DuplicateAnnotation()
Public MustOverride Function DuplicateAnnotation As GH_AnnotationBase
Return Value
Type: GH_AnnotationBase
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace