Grasshopper API
ModelColor Implicit Conversion (ColorRGBA to ModelColor)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelColor (
	ColorRGBA color
)
Public Shared Widening Operator CType (
	color As ColorRGBA
) As ModelColor
Parameters
color
Type: ColorRGBA
Return Value
Type: ModelColor
See Also
Reference
ModelColor Structure
Implicit Overload
Grasshopper.Rhinoceros Namespace