Grasshopper API
ModelTextureMapping Implicit Conversion (String to ModelTextureMapping)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelTextureMapping (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelTextureMapping
Parameters
path
Type: System.String
Return Value
Type: ModelTextureMapping
See Also
Reference
ModelTextureMapping Class
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace