Grasshopper API
GH_TextEntity Constructor (TextEntity, ModelAnnotationStyle)
 Create a duplicate of an existing text entity.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextEntity(
	TextEntity textEntity,
	ModelAnnotationStyle style
)
Public Sub New (
	textEntity As TextEntity,
	style As ModelAnnotationStyle
)
Parameters
textEntity
Type: TextEntity
text entity to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_TextEntity Class
GH_TextEntity Overload
Grasshopper.Kernel.Types Namespace