Grasshopper API
GH_InstanceReference.DrawViewportMeshes Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportMeshes(
	GH_PreviewMeshArgs args
)
Public Sub DrawViewportMeshes (
	args As GH_PreviewMeshArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewMeshArgs
Implements
IGH_PreviewData.DrawViewportMeshes(GH_PreviewMeshArgs)
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace