Grasshopper API
AnnotationUnitsSettings Constructor (AnnotationUnitsSettings.Attributes)
Initializes a new instance of the AnnotationUnitsSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationUnitsSettings(
	AnnotationUnitsSettings.Attributes attributes
)
Public Sub New (
	attributes As AnnotationUnitsSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes
See Also
Reference
AnnotationUnitsSettings Class
AnnotationUnitsSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace