Grasshopper API
ModelColor Implicit Conversion (Color to ModelColor)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelColor (
	Color color
)
Public Shared Widening Operator CType (
	color As Color
) As ModelColor
Parameters
color
Type: System.Drawing.Color
Return Value
Type: ModelColor
See Also
Reference
ModelColor Structure
Implicit Overload
Grasshopper.Rhinoceros Namespace