Grasshopper API
ModelObject.Attributes Constructor
Initializes a new instance of the ModelObject.Attributes class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace