Grasshopper API
ModelContentParam<T>.BakeGeometry Method (RhinoDoc, ObjectAttributes, List<Guid>)
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void BakeGeometry(
	RhinoDoc doc,
	ObjectAttributes att,
	List<Guid> guids
)
Public Sub BakeGeometry (
	doc As RhinoDoc,
	att As ObjectAttributes,
	guids As List(Of Guid)
)
Parameters
doc
Type: RhinoDoc
att
Type: ObjectAttributes
guids
Type: System.Collections.Generic.List<Guid>
Implements
IGH_BakeAwareObject.BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
See Also
Reference
ModelContentParam<T> Class
BakeGeometry Overload
Grasshopper.Rhinoceros.Params Namespace