Grasshopper API
ModelContent.Attributes.GetHashCode Method (IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual int GetHashCode(
	IEqualityComparer comparer
)
Protected Overridable Function GetHashCode (
	comparer As IEqualityComparer
) As Integer
Parameters
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Int32
Implements
IStructuralEquatable.GetHashCode(IEqualityComparer)
See Also
Reference
ModelContent.Attributes Class
GetHashCode Overload
Grasshopper.Rhinoceros Namespace