Grasshopper API
ModelConstructionPlane Constructor (RhinoViewport)
Initializes a new instance of the ModelConstructionPlane class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane(
	RhinoViewport viewport
)
Public Sub New (
	viewport As RhinoViewport
)
Parameters
viewport
Type: RhinoViewport
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace