Grasshopper API
ModelLineWidth.Read Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Read(
	GH_IReader reader
)
Public Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
Implements
GH_ISerializable.Read(GH_IReader)
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace