Grasshopper API
Param_AngularDimension.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_AngularDimension PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_AngularDimension
Parameters
data
Type: System.Object
Return Value
Type: GH_AngularDimension
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace