Grasshopper API
ModelData.ReadChunk<T> Method (GH_IReader, String, Nullable<T>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void ReadChunk<T>(
	GH_IReader reader,
	string name,
	out T? serializable
)
where T : struct, new(), GH_ISerializable
Protected Friend Shared Sub ReadChunk(Of T As {Structure, New, GH_ISerializable}) (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As T?
)
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: System.Nullable<T>
Type Parameters
T
See Also
Reference
ModelData Class
ReadChunk Overload
Grasshopper.Rhinoceros Namespace