Grasshopper API
ModelAnnotationStyle Implicit Conversion (DimensionStyle to ModelAnnotationStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelAnnotationStyle (
	DimensionStyle style
)
Public Shared Widening Operator CType (
	style As DimensionStyle
) As ModelAnnotationStyle
Parameters
style
Type: DimensionStyle
Return Value
Type: ModelAnnotationStyle
See Also
Reference
ModelAnnotationStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace