Grasshopper API
ModelTextureMapping Constructor
Initializes a new instance of the ModelTextureMapping class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureMapping()
Public Sub New
See Also
Reference
ModelTextureMapping Class
ModelTextureMapping Overload
Grasshopper.Rhinoceros.Render Namespace