Grasshopper API
ObjectDraftingLineWidth Constructor
Initializes a new instance of the ObjectDraftingLineWidth class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLineWidth()
Public Sub New
See Also
Reference
ObjectDraftingLineWidth Class
ObjectDraftingLineWidth Overload
Grasshopper.Rhinoceros.Drafting Namespace