Grasshopper API
ModelTags.RemoveRange Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTags RemoveRange(
	IEnumerable<string> source
)
Public Function RemoveRange (
	source As IEnumerable(Of String)
) As ModelTags
Parameters
source
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: ModelTags
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace