Grasshopper API
ModelRenderSkylight.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelRenderSkylight Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelRenderSkylight
Parameters
source
Type: System.Object
Return Value
Type: ModelRenderSkylight
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace