Grasshopper API
IGH_ContextualParameter2.ClearContextualData Method
 Clear previously assigned collection of values as contextual data
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
void ClearContextualData()
Sub ClearContextualData
See Also
Reference
IGH_ContextualParameter2 Interface
Grasshopper.Kernel Namespace