Grasshopper API
ModelPageViewport Constructor (ModelPageViewport.Attributes)
Initializes a new instance of the ModelPageViewport class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelPageViewport(
	ModelPageViewport.Attributes attributes
)
Public Sub New (
	attributes As ModelPageViewport.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.ModelPageViewport.Attributes
See Also
Reference
ModelPageViewport Class
ModelPageViewport Overload
Grasshopper.Rhinoceros.Display Namespace