Grasshopper API
GH_Painter.ConnectionPathBezier Method
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static BezierF ConnectionPathBezier(
	PointF source,
	PointF target
)
Public Shared Function ConnectionPathBezier (
	source As PointF,
	target As PointF
) As BezierF
Parameters
source
Type: System.Drawing.PointF
target
Type: System.Drawing.PointF
Return Value
Type: BezierF
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace