Grasshopper API
Param_ObjectRender.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ObjectRender PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ObjectRender
Parameters
data
Type: System.Object
Return Value
Type: ObjectRender
See Also
Reference
Param_ObjectRender Class
Grasshopper.Rhinoceros.Render.Params Namespace