Grasshopper API
ModelRenderTexture Constructor (Guid)
Initializes a new instance of the ModelRenderTexture class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderTexture(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
ModelRenderTexture Class
ModelRenderTexture Overload
Grasshopper.Rhinoceros.Render Namespace