Grasshopper API
GH_PatternMatching.IsMatch Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool IsMatch(
	GH_PatternMatching.MatchingMode mode,
	string value,
	string pattern,
	bool ignoreCase,
	CultureInfo culture
)
Public Shared Function IsMatch (
	mode As GH_PatternMatching.MatchingMode,
	value As String,
	pattern As String,
	ignoreCase As Boolean,
	culture As CultureInfo
) As Boolean
Parameters
mode
Type: Grasshopper.Kernel.GH_PatternMatching.MatchingMode
value
Type: System.String
pattern
Type: System.String
ignoreCase
Type: System.Boolean
culture
Type: System.Globalization.CultureInfo
Return Value
Type: Boolean
See Also
Reference
GH_PatternMatching Class
Grasshopper.Kernel Namespace