Grasshopper API
ModelFont.Equals Method (ModelFont)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelFont other
)
Public Function Equals (
	other As ModelFont
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.ModelFont
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelFont Class
Equals Overload
Grasshopper.Rhinoceros Namespace