Grasshopper API
GH_Dimension.EmitProxy Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override IGH_GooProxy EmitProxy()
Public Overrides Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
See Also
Reference
GH_Dimension Class
Grasshopper.Kernel.Types Namespace