Grasshopper API
AnnotationUnitsSettings Constructor
Initializes a new instance of the AnnotationUnitsSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationUnitsSettings()
Public Sub New
See Also
Reference
AnnotationUnitsSettings Class
AnnotationUnitsSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace