Grasshopper API
Param_ModelConstructionPlane.RemoteIdExpired Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal override bool RemoteIdExpired(
	RhinoDoc document,
	Guid id,
	GH_RemoteIdChange change
)
Protected Friend Overrides Function RemoteIdExpired (
	document As RhinoDoc,
	id As Guid,
	change As GH_RemoteIdChange
) As Boolean
Parameters
document
Type: RhinoDoc
id
Type: System.Guid
change
Type: GH_RemoteIdChange
Return Value
Type: Boolean
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace