Grasshopper API
ObjectDraftingLineWidth.Value.Deconstruct Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void Deconstruct(
	out ObjectPlotWeightSource source,
	out double value
)
Public Sub Deconstruct (
	<OutAttribute> ByRef source As ObjectPlotWeightSource,
	<OutAttribute> ByRef value As Double
)
Parameters
source
Type: ObjectPlotWeightSource
value
Type: System.Double
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace