Grasshopper API
ItemDisplayColor.GetHashCode Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
See Also
Reference
ItemDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace