Grasshopper API
ModelUnitSystem Constructor
Initializes a new instance of the ModelUnitSystem class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem()
Public Sub New
See Also
Reference
ModelUnitSystem Class
ModelUnitSystem Overload
Grasshopper.Rhinoceros Namespace