Grasshopper API
ModelAnnotationStyle Implicit Conversion (ModelAnnotationStyle.Attributes to ModelAnnotationStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelAnnotationStyle (
	ModelAnnotationStyle.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelAnnotationStyle.Attributes
) As ModelAnnotationStyle
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes
Return Value
Type: ModelAnnotationStyle
See Also
Reference
ModelAnnotationStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace