Grasshopper API
Param_ObjectRenderMaterial.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ObjectRenderMaterial value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ObjectRenderMaterial
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace