Grasshopper API
ObjectRenderMaterial.Value Implicit Conversion (ObjectMaterialSource to ObjectRenderMaterialObjectRenderMaterial.Value)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectRenderMaterial.Value (
	ObjectMaterialSource source
)
Public Shared Widening Operator CType (
	source As ObjectMaterialSource
) As ObjectRenderMaterial.Value
Parameters
source
Type: ObjectMaterialSource
Return Value
Type: ObjectRenderMaterial.Value
See Also
Reference
ObjectRenderMaterial.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace