Grasshopper API
ModelHatchLine.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelHatchLine.Attributes From(
	HatchLine modelHatchLine
)
Public Shared Function From (
	modelHatchLine As HatchLine
) As ModelHatchLine.Attributes
Parameters
modelHatchLine
Type: HatchLine
Return Value
Type: ModelHatchLine.Attributes
See Also
Reference
ModelHatchLine.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace