Grasshopper API
Param_ModelRenderEnvironment.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelRenderEnvironment> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelRenderEnvironment)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelRenderEnvironment>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render.Params Namespace