Grasshopper API
Param_DisplayColorGradient.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref DisplayColorGradient value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As DisplayColorGradient
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Display.DisplayColorGradient
Return Value
Type: GH_GetterResult
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace