Grasshopper API
ObjectDisplayColor.Value Constructor (ObjectColorSource, ModelColor)
Initializes a new instance of the ObjectDisplayColor.Value class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectColorSource source,
	ModelColor color
)
Public Sub New (
	source As ObjectColorSource,
	color As ModelColor
)
Parameters
source
Type: ObjectColorSource
color
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ObjectDisplayColor.Value Structure
ObjectDisplayColor.Value Overload
Grasshopper.Rhinoceros.Display Namespace