Grasshopper API
GH_MenuTextBox Constructor
 Constructor for TextBox collection.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_MenuTextBox(
	ToolStripDropDown dropDown,
	string text,
	bool lockFocus
)
Public Sub New (
	dropDown As ToolStripDropDown,
	text As String,
	lockFocus As Boolean
)
Parameters
dropDown
Type: System.Windows.Forms.ToolStripDropDown
The menu dropdown into which to embed this textbox control.
text
Type: System.String
The original text to be displayed in the textbox.
lockFocus
Type: System.Boolean
If True, the control will disable the other menu items when it gets focus.
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace