Grasshopper API
ModelTextureSlot Constructor
Initializes a new instance of the ModelTextureSlot class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureSlot()
Public Sub New
See Also
Reference
ModelTextureSlot Class
ModelTextureSlot Overload
Grasshopper.Rhinoceros.Render Namespace