Grasshopper API
GH_UndoServer.MergeRecords Method
 Attempt to merge the N most recent records into one. The name of the merged record will be identical to the name of the oldest record.
 Namespace: Grasshopper.Kernel.Undo
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool MergeRecords(
	int count
)
Public Function MergeRecords (
	count As Integer
) As Boolean
Parameters
count
Type: System.Int32
Number of most recent records to merge.
Return Value
Type: Boolean
True if merge was successful.
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace