Grasshopper API
ModelHatchPattern.Attributes Constructor
Initializes a new instance of the ModelHatchPattern.Attributes class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelHatchPattern.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace