Grasshopper API
Param_ObjectVisibility Constructor
Initializes a new instance of the Param_ObjectVisibility class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ObjectVisibility()
Public Sub New
See Also
Reference
Param_ObjectVisibility Class
Grasshopper.Rhinoceros.Display.Params Namespace