Grasshopper API
Param_TextDot.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_TextDot PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_TextDot
Parameters
data
Type: System.Object
Return Value
Type: GH_TextDot
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace