Grasshopper API
GH_Extrusion.CastFrom Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool CastFrom(
	Object source
)
Public Overrides Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
GH_Extrusion Class
Grasshopper.Kernel.Types Namespace