Grasshopper API
IGH_ReferencedData.UnloadReferencedData Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
void UnloadReferencedData()
Sub UnloadReferencedData
See Also
Reference
IGH_ReferencedData Interface
Grasshopper.Kernel.Types Namespace