Grasshopper API
ModelHatchLine Constructor (ModelHatchLine.Attributes)
Initializes a new instance of the ModelHatchLine class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchLine(
	ModelHatchLine.Attributes attributes
)
Public Sub New (
	attributes As ModelHatchLine.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Attributes
See Also
Reference
ModelHatchLine Class
ModelHatchLine Overload
Grasshopper.Rhinoceros.Drafting Namespace