Grasshopper API
ModelTextureSlot.Attributes.Equals Method (ModelTextureSlot.Attributes)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelTextureSlot.Attributes other
)
Public Function Equals (
	other As ModelTextureSlot.Attributes
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Render.ModelTextureSlot.Attributes
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelTextureSlot.Attributes Structure
Equals Overload
Grasshopper.Rhinoceros.Render Namespace