Grasshopper API
ModelTags.CompareTo Method (ModelTags)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ModelTags other
)
Public Function CompareTo (
	other As ModelTags
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.ModelTags
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ModelTags Structure
CompareTo Overload
Grasshopper.Rhinoceros Namespace