Grasshopper API
GH_Dimension Constructor (GH_Dimension)
 Create a duplicate of another GH_Dimension. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_Dimension(
	GH_Dimension other
)
Protected Sub New (
	other As GH_Dimension
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Dimension
GH_Dimension to duplicate
See Also
Reference
GH_Dimension Class
GH_Dimension Overload
Grasshopper.Kernel.Types Namespace