Grasshopper API
GH_RadialDimension Constructor
 Default constructor, creates an invalid radial dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_RadialDimension()
Public Sub New
See Also
Reference
GH_RadialDimension Class
GH_RadialDimension Overload
Grasshopper.Kernel.Types Namespace