Grasshopper API
GH_TaskCapableComponent<T>.RequestTaskCancellation Method
 Called by the framework when solving has been interrupted and tasks do not need to complete.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void RequestTaskCancellation()
Public Sub RequestTaskCancellation
Implements
IGH_TaskCapableComponent.RequestTaskCancellation()
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace