Grasshopper API
Param_ModelRenderMaterial.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelRenderMaterial> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelRenderMaterial)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelRenderMaterial>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace