Grasshopper API
ObjectDrafting.Attributes.Equals Method (ObjectDrafting.Attributes)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectDrafting.Attributes other
)
Public Function Equals (
	other As ObjectDrafting.Attributes
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectDrafting.Attributes Structure
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace