Grasshopper API
AnnotationTextSettings.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToDetails()
Public Overrides Function ToDetails As String
Return Value
Type: String
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace