Grasshopper API
ObjectDisplayColor.Value Constructor (ModelColor)
Initializes a new instance of the ObjectDisplayColor.Value class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ModelColor color
)
Public Sub New (
	color As ModelColor
)
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
See Also
Reference
ObjectDisplayColor.Value Structure
ObjectDisplayColor.Value Overload
Grasshopper.Rhinoceros.Display Namespace