Grasshopper API
ModelMeshingParameters Constructor
Initializes a new instance of the ModelMeshingParameters class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelMeshingParameters()
Public Sub New
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace