Grasshopper API
GH_PointCloud.PointCloudProxy Constructor
Initializes a new instance of the GH_PointCloud.PointCloudProxy class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public PointCloudProxy(
	GH_PointCloud Value
)
Public Sub New (
	Value As GH_PointCloud
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_PointCloud
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace