Grasshopper API
GH_Convert.ToMesh_Primary Method
 Performs a direct cast from Rhino.Geometry.Mesh or GH_Mesh. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToMesh_Primary(
	Object data,
	ref Mesh rc
)
Public Shared Function ToMesh_Primary (
	data As Object,
	ByRef rc As Mesh
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Mesh
Result of conversion
Return Value
Type: Boolean
A Mesh instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace