Grasshopper API
ObjectSectionStyle.Value Implicit Conversion (ObjectSectionStyle.Value to ModelSectionStyle)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelSectionStyle (
	ObjectSectionStyle.Value value
)
Public Shared Widening Operator CType (
	value As ObjectSectionStyle.Value
) As ModelSectionStyle
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value
Return Value
Type: ModelSectionStyle
See Also
Reference
ObjectSectionStyle.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace