Grasshopper API
ModelLinetype.Attributes Constructor
Initializes a new instance of the ModelLinetype.Attributes class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace