Grasshopper API
GH_Format.TryGetName Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool TryGetName(
	Color color,
	out string name
)
Public Shared Function TryGetName (
	color As Color,
	<OutAttribute> ByRef name As String
) As Boolean
Parameters
color
Type: System.Drawing.Color
name
Type: System.String
Return Value
Type: Boolean
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace