Grasshopper API
GH_Format.FormatLightValidity Method
 If the light is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatLightValidity(
	Light val,
	string identifier = "Light"
)
Public Shared Function FormatLightValidity (
	val As Light,
	Optional identifier As String = "Light"
) As String
Parameters
val
Type: Light
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the light is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace