Grasshopper API
ModelHatchPattern Constructor
Initializes a new instance of the ModelHatchPattern class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern()
Public Sub New
See Also
Reference
ModelHatchPattern Class
ModelHatchPattern Overload
Grasshopper.Rhinoceros.Drafting Namespace