Grasshopper API
PageSettings Constructor (PageSettings.Attributes)
Initializes a new instance of the PageSettings class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public PageSettings(
	PageSettings.Attributes attributes
)
Public Sub New (
	attributes As PageSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Display.PageSettings.Attributes
See Also
Reference
PageSettings Class
PageSettings Overload
Grasshopper.Rhinoceros.Display Namespace