Grasshopper API
ModelDisplayMode Implicit Conversion (DisplayModeDescription to ModelDisplayMode)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelDisplayMode (
	DisplayModeDescription mode
)
Public Shared Widening Operator CType (
	mode As DisplayModeDescription
) As ModelDisplayMode
Parameters
mode
Type: DisplayModeDescription
Return Value
Type: ModelDisplayMode
See Also
Reference
ModelDisplayMode Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace