Grasshopper API
GH_TextDot.ToString Method
 Format the text dot using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace