Grasshopper API
ModelRenderMaterial Constructor (RenderMaterial)
Initializes a new instance of the ModelRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial(
	RenderMaterial renderMaterial
)
Public Sub New (
	renderMaterial As RenderMaterial
)
Parameters
renderMaterial
Type: RenderMaterial
See Also
Reference
ModelRenderMaterial Class
ModelRenderMaterial Overload
Grasshopper.Rhinoceros.Render Namespace