Grasshopper API
AnnotationLeaderSettings.Attributes Constructor
Initializes a new instance of the AnnotationLeaderSettings.Attributes class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
AnnotationLeaderSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace