Grasshopper API
Param_Light.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_Light value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_Light
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_Light
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Light Class
Grasshopper.Kernel.Parameters Namespace