Grasshopper API
AnnotationLeaderSettings Implicit Conversion (AnnotationLeaderSettings.Attributes to AnnotationLeaderSettings)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationLeaderSettings (
	AnnotationLeaderSettings.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As AnnotationLeaderSettings.Attributes
) As AnnotationLeaderSettings
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes
Return Value
Type: AnnotationLeaderSettings
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace