Grasshopper API
Param_AngularDimension Constructor
Initializes a new instance of the Param_AngularDimension class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_AngularDimension()
Public Sub New
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace