Grasshopper API
Param_AngularDimension.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_AngularDimension> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_AngularDimension)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_AngularDimension>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace