Grasshopper API
ObjectRenderMaterial Constructor (ObjectRenderMaterial.Value)
Initializes a new instance of the ObjectRenderMaterial class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRenderMaterial(
	ObjectRenderMaterial.Value value
)
Public Sub New (
	value As ObjectRenderMaterial.Value
)
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value
See Also
Reference
ObjectRenderMaterial Class
ObjectRenderMaterial Overload
Grasshopper.Rhinoceros.Render Namespace