Grasshopper API
Param_Predicate Constructor
Initializes a new instance of the Param_Predicate class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_Predicate()
Public Sub New
See Also
Reference
Param_Predicate Class
Grasshopper.Kernel.Parameters Namespace