Grasshopper API
GH_LinearDimension Constructor (LinearDimension)
 Create a duplicate of an existing linear dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_LinearDimension(
	LinearDimension dimension
)
Public Sub New (
	dimension As LinearDimension
)
Parameters
dimension
Type: LinearDimension
Linear dimension to duplicate
See Also
Reference
GH_LinearDimension Class
GH_LinearDimension Overload
Grasshopper.Kernel.Types Namespace