Grasshopper API
ModelComponentContent.Attributes Constructor
Initializes a new instance of the ModelComponentContent.Attributes class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected Attributes()
Protected Sub New
See Also
Reference
ModelComponentContent.Attributes Class
Grasshopper.Rhinoceros Namespace