Grasshopper API
ModelNamedView.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelNamedView.Attributes ToAttributes()
Public Function ToAttributes As ModelNamedView.Attributes
Return Value
Type: ModelNamedView.Attributes
See Also
Reference
ModelNamedView Class
Grasshopper.Rhinoceros.Display Namespace