Grasshopper API
ModelPageViewport.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelPageViewport.Attributes ToAttributes()
Public Function ToAttributes As ModelPageViewport.Attributes
Return Value
Type: ModelPageViewport.Attributes
See Also
Reference
ModelPageViewport Class
Grasshopper.Rhinoceros.Display Namespace