Grasshopper API
ModelLinetype Constructor (Linetype)
Initializes a new instance of the ModelLinetype class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype(
	Linetype linetype
)
Public Sub New (
	linetype As Linetype
)
Parameters
linetype
Type: Linetype
See Also
Reference
ModelLinetype Class
ModelLinetype Overload
Grasshopper.Rhinoceros.Drafting Namespace