Grasshopper API
GH_TextEntity Constructor (Guid)
 Create a new referenced text entity that references a Rhino text object with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextEntity(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of text entity object to reference.
See Also
Reference
GH_TextEntity Class
GH_TextEntity Overload
Grasshopper.Kernel.Types Namespace