Grasshopper API
ObjectDraftingLineWidth Implicit Conversion (ObjectDraftingLineWidth to ObjectDraftingLineWidthObjectDraftingLineWidth.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLineWidth.Value (
	ObjectDraftingLineWidth data
)
Public Shared Widening Operator CType (
	data As ObjectDraftingLineWidth
) As ObjectDraftingLineWidth.Value
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth
Return Value
Type: ObjectDraftingLineWidth.Value
See Also
Reference
ObjectDraftingLineWidth Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace