Grasshopper API
Param_ModelView.DrawViewportWires Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportWires(
	IGH_PreviewArgs args
)
Public Sub DrawViewportWires (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Implements
IGH_PreviewObject.DrawViewportWires(IGH_PreviewArgs)
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace