Grasshopper API
ModelHatchLine.GetHashCode Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace