Grasshopper API
Param_ModelPageViewport Constructor
Initializes a new instance of the Param_ModelPageViewport class
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelPageViewport()
Public Sub New
See Also
Reference
Param_ModelPageViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace