Grasshopper API
ModelUnitSystem Implicit Conversion (ModelUnitSystem.Value to ModelUnitSystem)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelUnitSystem (
	ModelUnitSystem.Value attributes
)
Public Shared Widening Operator CType (
	attributes As ModelUnitSystem.Value
) As ModelUnitSystem
Parameters
attributes
Type: Grasshopper.Rhinoceros.ModelUnitSystem.Value
Return Value
Type: ModelUnitSystem
See Also
Reference
ModelUnitSystem Class
Implicit Overload
Grasshopper.Rhinoceros Namespace