Grasshopper API
GH_PersistentReferenceParam<T> Constructor
Initializes a new instance of the GH_PersistentReferenceParam<T> class
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_PersistentReferenceParam(
	GH_InstanceDescription nTag
)
Protected Sub New (
	nTag As GH_InstanceDescription
)
Parameters
nTag
Type: Grasshopper.Kernel.GH_InstanceDescription
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace