Grasshopper API
GH_Extrusion.LoadGeometry Method (RhinoDoc)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool LoadGeometry(
	RhinoDoc doc
)
Public Overrides Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Return Value
Type: Boolean
See Also
Reference
GH_Extrusion Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace