Grasshopper API
Param_InstanceReference.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_InstanceReference PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_InstanceReference
Parameters
data
Type: System.Object
Return Value
Type: GH_InstanceReference
See Also
Reference
Param_InstanceReference Class
Grasshopper.Kernel.Parameters Namespace