Grasshopper API
ModelContent.Attributes.IsValidContentName Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal virtual bool IsValidContentName(
	ModelContentName value,
	bool? parent
)
Protected Friend Overridable Function IsValidContentName (
	value As ModelContentName,
	parent As Boolean?
) As Boolean
Parameters
value
Type: Grasshopper.Rhinoceros.ModelContentName
parent
Type: System.Nullable<Boolean>
Return Value
Type: Boolean
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace