Grasshopper API
GH_Convert.ToLight_Secondary Method
 Attempts to convert other data types into an Rhino.Geometry.Light. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToLight_Secondary(
	Object data,
	ref Light rc
)
Public Shared Function ToLight_Secondary (
	data As Object,
	ByRef rc As Light
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Light
Return Value
Type: Boolean
An Rhino.Geometry.Light instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace