Grasshopper API
GH_TextDot Constructor (GH_TextDot)
 Create a duplicate of another GH_TextDot. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextDot(
	GH_TextDot other
)
Public Sub New (
	other As GH_TextDot
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_TextDot
Text dot to duplicate
See Also
Reference
GH_TextDot Class
GH_TextDot Overload
Grasshopper.Kernel.Types Namespace