Grasshopper API
ModelContent.Attributes.Read Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal override sealed bool Read(
	GH_IReader reader
)
Protected Friend Overrides NotOverridable Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace