Grasshopper API
ObjectDisplayColor Constructor (ObjectDisplayColor.Value)
Initializes a new instance of the ObjectDisplayColor class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplayColor(
	ObjectDisplayColor.Value value
)
Public Sub New (
	value As ObjectDisplayColor.Value
)
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value
See Also
Reference
ObjectDisplayColor Class
ObjectDisplayColor Overload
Grasshopper.Rhinoceros.Display Namespace