Grasshopper API
GH_AnnotationBase Constructor (Guid)
 Create a new referenced annotation that references a Rhino dimension with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected GH_AnnotationBase(
	Guid ref_guid
)
Protected Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of dimension object to reference.
See Also
Reference
GH_AnnotationBase Class
GH_AnnotationBase Overload
Grasshopper.Kernel.Types Namespace