Grasshopper API
GH_Convert.ToSubD Method
 Convert data into Rhino.Geometry.SubD.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToSubD(
	Object data,
	ref SubD rc,
	GH_Conversion conversion_level
)
Public Shared Function ToSubD (
	data As Object,
	ByRef rc As SubD,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: SubD
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace