Grasshopper API
DisplayColorStop.DuplicateColorStop Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DisplayColorStop DuplicateColorStop()
Public Function DuplicateColorStop As DisplayColorStop
Return Value
Type: DisplayColorStop
See Also
Reference
DisplayColorStop Class
Grasshopper.Rhinoceros.Display Namespace