Grasshopper API
ModelValue.CastFrom Method
Note: This API is now obsolete.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute("Please use PreferredCast method.")]
protected bool CastFrom(
	Object source
)
<ObsoleteAttribute("Please use PreferredCast method.")>
Protected Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
Implements
IGH_Goo.CastFrom(Object)
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace