Grasshopper API
AnnotationArrow Implicit Conversion (InstanceDefinition to AnnotationArrow)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator AnnotationArrow (
	InstanceDefinition idef
)
Public Shared Widening Operator CType (
	idef As InstanceDefinition
) As AnnotationArrow
Parameters
idef
Type: InstanceDefinition
Return Value
Type: AnnotationArrow
See Also
Reference
AnnotationArrow Class
Implicit Overload
Grasshopper.Rhinoceros.Annotations Namespace