Grasshopper API
ModelTextureSlot.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelTextureSlot Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelTextureSlot
Parameters
source
Type: System.Object
Return Value
Type: ModelTextureSlot
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace