Grasshopper API
ModelInstanceDefinition.Attributes Constructor
Initializes a new instance of the ModelInstanceDefinition.Attributes class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace