Grasshopper API
ModelInstanceDefinition Constructor
Initializes a new instance of the ModelInstanceDefinition class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition()
Public Sub New
See Also
Reference
ModelInstanceDefinition Class
ModelInstanceDefinition Overload
Grasshopper.Rhinoceros.Model Namespace