Grasshopper API
ObjectDraftingLineWidth Implicit Conversion (ObjectDraftingLineWidth.Value to ObjectDraftingLineWidth)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLineWidth (
	ObjectDraftingLineWidth.Value data
)
Public Shared Widening Operator CType (
	data As ObjectDraftingLineWidth.Value
) As ObjectDraftingLineWidth
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value
Return Value
Type: ObjectDraftingLineWidth
See Also
Reference
ObjectDraftingLineWidth Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace