Grasshopper API
ModelColor Implicit Conversion (ModelColor to Color)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator Color (
	ModelColor color
)
Public Shared Widening Operator CType (
	color As ModelColor
) As Color
Parameters
color
Type: Grasshopper.Rhinoceros.ModelColor
Return Value
Type: Color
See Also
Reference
ModelColor Structure
Implicit Overload
Grasshopper.Rhinoceros Namespace