Grasshopper API
GH_Convert.ToGHRadialDimension_Primary Method
 Converts similar data into a GH_RadialDimension instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHRadialDimension_Primary(
	Object data,
	ref GH_RadialDimension target
)
Public Shared Function ToGHRadialDimension_Primary (
	data As Object,
	ByRef target As GH_RadialDimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_RadialDimension
Target instance. If null, a new GH_RadialDimension will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace