Grasshopper API
GH_Convert.ToGHOrdinateDimension_Secondary Method
 Converts similar data into a GH_OrdinateDimension instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHOrdinateDimension_Secondary(
	Object data,
	ref GH_OrdinateDimension target
)
Public Shared Function ToGHOrdinateDimension_Secondary (
	data As Object,
	ByRef target As GH_OrdinateDimension
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_OrdinateDimension
Target instance. If null, a new GH_OrdinateDimension will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace