Grasshopper API
GH_Leader Constructor (GH_Leader)
 Create a duplicate of another GH_Leader. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Leader(
	GH_Leader other
)
Public Sub New (
	other As GH_Leader
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Leader
GH_Leader to duplicate
See Also
Reference
GH_Leader Class
GH_Leader Overload
Grasshopper.Kernel.Types Namespace