Grasshopper API
Param_ModelView.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelView> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelView)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelView>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace