Grasshopper API
Param_ModelAnnotationStyle Constructor
Initializes a new instance of the Param_ModelAnnotationStyle class
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelAnnotationStyle()
Public Sub New
See Also
Reference
Param_ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations.Params Namespace