Grasshopper API
GH_Format.FormatTextDotValidity Method
 If the text dot is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatTextDotValidity(
	TextDot val,
	string identifier = "Text Dot"
)
Public Shared Function FormatTextDotValidity (
	val As TextDot,
	Optional identifier As String = "Text Dot"
) As String
Parameters
val
Type: TextDot
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the text dot is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace