Grasshopper API
Param_AngularDimension.DrawViewportWires Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportWires(
	IGH_PreviewArgs args
)
Public Sub DrawViewportWires (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Implements
IGH_PreviewObject.DrawViewportWires(IGH_PreviewArgs)
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace