Grasshopper API
AnnotationDateTimeFormat Constructor (String)
Initializes a new instance of the AnnotationDateTimeFormat class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDateTimeFormat(
	string value
)
Public Sub New (
	value As String
)
Parameters
value
Type: System.String
See Also
Reference
AnnotationDateTimeFormat Class
AnnotationDateTimeFormat Overload
Grasshopper.Rhinoceros.Annotations Namespace