Grasshopper API
Utility.FixNewlines Method (String)
 Make sure all newlines in a string adhere to the current platform standard.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FixNewlines(
	string text
)
Public Shared Function FixNewlines (
	text As String
) As String
Parameters
text
Type: System.String
Text to fix.
Return Value
Type: String
See Also
Reference
Utility Class
FixNewlines Overload
Grasshopper Namespace