Grasshopper API
Complex.Subtraction Operator (Complex, Double)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Complex operator -(
	Complex A,
	double B
)
Public Shared Operator - (
	A As Complex,
	B As Double
) As Complex
Parameters
A
Type: Grasshopper.Kernel.Types.Complex
B
Type: System.Double
Return Value
Type: Complex
See Also
Reference
Complex Structure
Subtraction Overload
Grasshopper.Kernel.Types Namespace