Grasshopper API
ModelTextureMapping.DrawViewportWires Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DrawViewportWires(
	GH_PreviewWireArgs args
)
Public Sub DrawViewportWires (
	args As GH_PreviewWireArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewWireArgs
Implements
IGH_PreviewData.DrawViewportWires(GH_PreviewWireArgs)
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace