Grasshopper API
Param_Hatch.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_Hatch value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_Hatch
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_Hatch
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Hatch Class
Grasshopper.Kernel.Parameters Namespace