Grasshopper API
GH_Leader.ToString Method
 Format the leader using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Leader Class
Grasshopper.Kernel.Types Namespace