Grasshopper API
ModelColor.ToString Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace