Grasshopper API
ModelRenderEnvironment.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelRenderEnvironment Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelRenderEnvironment
Parameters
source
Type: System.Object
Return Value
Type: ModelRenderEnvironment
See Also
Reference
ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render Namespace