Grasshopper API
ModelObject.Attributes.ToDetails Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToDetails()
Public Overrides Function ToDetails As String
Return Value
Type: String
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace