Grasshopper API
ObjectRender.Attributes.Equals Method (Object)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
Parameters
other
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
ObjectRender.Attributes Structure
Equals Overload
Grasshopper.Rhinoceros.Render Namespace