Grasshopper API
ModelRenderSkylight Constructor
Initializes a new instance of the ModelRenderSkylight class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderSkylight()
Public Sub New
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace