Grasshopper API
GH_SubD Constructor (SubD)
Initializes a new instance of the GH_SubD class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_SubD(
	SubD subd
)
Public Sub New (
	subd As SubD
)
Parameters
subd
Type: SubD
See Also
Reference
GH_SubD Class
GH_SubD Overload
Grasshopper.Kernel.Types Namespace