Grasshopper API
ModelValue.ScriptVariable Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal abstract Object ScriptVariable()
Protected Friend MustOverride Function ScriptVariable As Object
Return Value
Type: Object
Implements
IGH_Goo.ScriptVariable()
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace