Grasshopper API
GH_Convert.ToGHSubD_Secondary Method
 Converts similar data into a GH_SubD instance. Data is not quaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHSubD_Secondary(
	Object data,
	ref GH_SubD target
)
Public Shared Function ToGHSubD_Secondary (
	data As Object,
	ByRef target As GH_SubD
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_SubD
Target instance. If null, a new GH_SubD will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace