Grasshopper API
Param_LinearDimension Constructor
Initializes a new instance of the Param_LinearDimension class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_LinearDimension()
Public Sub New
See Also
Reference
Param_LinearDimension Class
Grasshopper.Kernel.Parameters Namespace