Grasshopper API
Param_ModelLayer.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelLayer> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelLayer)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelLayer>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelLayer Class
Grasshopper.Rhinoceros.Model.Params Namespace