Grasshopper API
GH_OrdinateDimension.DuplicateOrdinateDimension Method
 Create a duplicate of this ordinate dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_OrdinateDimension DuplicateOrdinateDimension()
Public Function DuplicateOrdinateDimension As GH_OrdinateDimension
Return Value
Type: GH_OrdinateDimension
See Also
Reference
GH_OrdinateDimension Class
Grasshopper.Kernel.Types Namespace