Grasshopper API
ObjectDisplayColor.Value Implicit Conversion (ObjectDisplayColor.Value to ModelColor)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelColor (
	ObjectDisplayColor.Value value
)
Public Shared Widening Operator CType (
	value As ObjectDisplayColor.Value
) As ModelColor
Parameters
value
Type: Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value
Return Value
Type: ModelColor
See Also
Reference
ObjectDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace