Grasshopper API
GH_Format.FormatTextDot Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatTextDot(
	GH_TextDot data
)
Public Shared Function FormatTextDot (
	data As GH_TextDot
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_TextDot
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace