Grasshopper API
GH_WindowsFormUtil.CenterFormOnCursor Method (Window, Boolean)
 Positions a Form so that it is centered around the cursor
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void CenterFormOnCursor(
	Window F,
	bool limitToScreen
)
Public Shared Sub CenterFormOnCursor (
	F As Window,
	limitToScreen As Boolean
)
Parameters
F
Type: Window
The Form to adjust
limitToScreen
Type: System.Boolean
If True, the Form won't be allowed to extend beyond the limits of the screen containing the cursor.
See Also
Reference
GH_WindowsFormUtil Class
CenterFormOnCursor Overload
Grasshopper.GUI Namespace