Grasshopper API
Param_ModelRenderEnvironment.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelRenderEnvironment value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelRenderEnvironment
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ModelRenderEnvironment
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render.Params Namespace