Grasshopper API
GH_ComponentServer.FindObjects Method (String[], Int32, IGH_ObjectProxy[], Double[])
 Searches the list of cached object proxies for objects that might be implied by a search term.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int FindObjects(
	string[] terms,
	int maximumResults,
	ref IGH_ObjectProxy[] results,
	ref double[] resultWeights
)
Public Function FindObjects (
	terms As String(),
	maximumResults As Integer,
	ByRef results As IGH_ObjectProxy(),
	ByRef resultWeights As Double()
) As Integer
Parameters
terms
Type: System.String[]
Search terms to use.
maximumResults
Type: System.Int32
Maximum number of allowed hits.
results
Type: Grasshopper.Kernel.IGH_ObjectProxy[]
resultWeights
Type: System.Double[]
Return Value
Type: Int32
A sorted list of search results.
See Also
Reference
GH_ComponentServer Class
FindObjects Overload
Grasshopper.Kernel Namespace