Grasshopper API
GH_Material Constructor (Guid)
 Create a new Material from an RDK material ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Material(
	Guid rdkId
)
Public Sub New (
	rdkId As Guid
)
Parameters
rdkId
Type: System.Guid
ID of RDK material.
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace