Grasshopper API
Param_TextEntity.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_TextEntity PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_TextEntity
Parameters
data
Type: System.Object
Return Value
Type: GH_TextEntity
See Also
Reference
Param_TextEntity Class
Grasshopper.Kernel.Parameters Namespace