Grasshopper API
GH_Centermark.CastTo<T> Method (T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool CastTo<T>(
	out T target
)
Public Overrides Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
GH_Centermark Class
CastTo Overload
Grasshopper.Kernel.Types Namespace