Grasshopper API
ModelTextureSlot.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureSlot.Attributes ToAttributes()
Public Function ToAttributes As ModelTextureSlot.Attributes
Return Value
Type: ModelTextureSlot.Attributes
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace