Grasshopper API
ModelLayer Implicit Conversion (String to ModelLayer)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLayer (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelLayer
Parameters
path
Type: System.String
Return Value
Type: ModelLayer
See Also
Reference
ModelLayer Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace