Grasshopper API
Param_ModelLineWidth.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelLineWidth PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelLineWidth
Parameters
data
Type: System.Object
Return Value
Type: ModelLineWidth
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace