Grasshopper API
Param_ModelRenderSun Constructor
Initializes a new instance of the Param_ModelRenderSun class
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelRenderSun()
Public Sub New
See Also
Reference
Param_ModelRenderSun Class
Grasshopper.Rhinoceros.Render.Params Namespace