Grasshopper API
Param_TextDot.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_TextDot value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_TextDot
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_TextDot
Return Value
Type: GH_GetterResult
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace