Grasshopper API
ModelViewport.Attributes Constructor
Initializes a new instance of the ModelViewport.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace