Grasshopper API
ModelUserText.EnsureRange Method (IEnumerable<String>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText EnsureRange(
	IEnumerable<string> keys
)
Public Function EnsureRange (
	keys As IEnumerable(Of String)
) As ModelUserText
Parameters
keys
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
EnsureRange Overload
Grasshopper.Rhinoceros Namespace