Grasshopper API
ModelTextureMapping Constructor (ModelTextureMapping.Attributes)
Initializes a new instance of the ModelTextureMapping class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTextureMapping(
	ModelTextureMapping.Attributes attributes
)
Public Sub New (
	attributes As ModelTextureMapping.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes
See Also
Reference
ModelTextureMapping Class
ModelTextureMapping Overload
Grasshopper.Rhinoceros.Render Namespace