Grasshopper API
ObjectRender.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRender.Attributes ToAttributes()
Public Function ToAttributes As ObjectRender.Attributes
Return Value
Type: ObjectRender.Attributes
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace