Grasshopper API
ModelUnitSystem.Value Constructor (LengthUnit)
Initializes a new instance of the ModelUnitSystem.Value class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	LengthUnit lengthUnit
)
Public Sub New (
	lengthUnit As LengthUnit
)
Parameters
lengthUnit
Type: LengthUnit
See Also
Reference
ModelUnitSystem.Value Structure
ModelUnitSystem.Value Overload
Grasshopper.Rhinoceros Namespace