Grasshopper API
GH_Plane Constructor (Guid)
Initializes a new instance of the GH_Plane class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Plane(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
GH_Plane Class
GH_Plane Overload
Grasshopper.Kernel.Types Namespace