Grasshopper API
GH_Convert.CreateDateAndTime Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static DateTime CreateDateAndTime(
	DateTime dateTime
)
Public Shared Function CreateDateAndTime (
	dateTime As DateTime
) As DateTime
Parameters
dateTime
Type: System.DateTime
Return Value
Type: DateTime
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace