Grasshopper API
Instances.ReloadMemoryAssemblies Method
 Unload and attempt to reload all plugin assemblies that were loaded via the COFF pipeline.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static List<string> ReloadMemoryAssemblies()
Public Shared Function ReloadMemoryAssemblies As List(Of String)
Return Value
Type: List<String>
Collection of load messages.
See Also
Reference
Instances Class
Grasshopper Namespace