Grasshopper API
AnnotationArrowSettings Constructor (AnnotationArrowSettings.Attributes)
Initializes a new instance of the AnnotationArrowSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrowSettings(
	AnnotationArrowSettings.Attributes attributes
)
Public Sub New (
	attributes As AnnotationArrowSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes
See Also
Reference
AnnotationArrowSettings Class
AnnotationArrowSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace