Grasshopper API
Param_ModelAnnotationStyle.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelAnnotationStyle> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelAnnotationStyle)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelAnnotationStyle>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations.Params Namespace