Grasshopper API
Param_ModelLinetype.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelLinetype value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelLinetype
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ModelLinetype
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace