Grasshopper API
ModelContent.UnloadReferencedData Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual void UnloadReferencedData()
Protected Overridable Sub UnloadReferencedData
Implements
IGH_ReferencedData.UnloadReferencedData()
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace