Grasshopper API
ObjectDraftingLineWidth.Value Constructor (ObjectPlotWeightSource)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectPlotWeightSource source
)
Public Sub New (
	source As ObjectPlotWeightSource
)
Parameters
source
Type: ObjectPlotWeightSource
See Also
Reference
ObjectDraftingLineWidth.Value Structure
ObjectDraftingLineWidth.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace