Grasshopper API
ModelObject Constructor (RhinoObject)
Initializes a new instance of the ModelObject class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelObject(
	RhinoObject rhinoObject
)
Public Sub New (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: RhinoObject
See Also
Reference
ModelObject Class
ModelObject Overload
Grasshopper.Rhinoceros.Model Namespace