Grasshopper API
Param_AnnotationDimensionSettings.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationDimensionSettings PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationDimensionSettings
Parameters
data
Type: System.Object
Return Value
Type: AnnotationDimensionSettings
See Also
Reference
Param_AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace