Grasshopper API
Param_Hatch.Prompt_Plural Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_Hatch> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_Hatch)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_Hatch>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Hatch Class
Grasshopper.Kernel.Parameters Namespace