Grasshopper API
ModelInstanceDefinition Implicit Conversion (String to ModelInstanceDefinition)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelInstanceDefinition (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelInstanceDefinition
Parameters
path
Type: System.String
Return Value
Type: ModelInstanceDefinition
See Also
Reference
ModelInstanceDefinition Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace