Grasshopper API
ModelUserText.RemoveRange Method (IEnumerable<KeyValuePair<String, String>>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText RemoveRange(
	IEnumerable<KeyValuePair<string, string>> source
)
Public Function RemoveRange (
	source As IEnumerable(Of KeyValuePair(Of String, String))
) As ModelUserText
Parameters
source
Type: System.Collections.Generic.IEnumerable<KeyValuePair<String, String>>
Return Value
Type: ModelUserText
See Also
Reference
ModelUserText Structure
RemoveRange Overload
Grasshopper.Rhinoceros Namespace