Grasshopper API
ModelSpaceViewport.Attributes Constructor
Initializes a new instance of the ModelSpaceViewport.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal Attributes()
Protected Friend Sub New
See Also
Reference
ModelSpaceViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace