Grasshopper API
ModelNamedConstructionPlane.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelNamedConstructionPlane Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelNamedConstructionPlane
Parameters
data
Type: System.Object
Return Value
Type: ModelNamedConstructionPlane
See Also
Reference
ModelNamedConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace