Grasshopper API
GH_DetailView Constructor
 Default constructor, creates an invalid detail view.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_DetailView()
Public Sub New
See Also
Reference
GH_DetailView Class
GH_DetailView Overload
Grasshopper.Kernel.Types Namespace