Grasshopper API
Param_InstanceReference.Menu_AppendManageCollection Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void Menu_AppendManageCollection(
	ToolStripDropDown menu
)
Protected Overrides Sub Menu_AppendManageCollection (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_InstanceReference Class
Grasshopper.Kernel.Parameters Namespace