Grasshopper API
Param_LinearDimension.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_LinearDimension PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_LinearDimension
Parameters
data
Type: System.Object
Return Value
Type: GH_LinearDimension
See Also
Reference
Param_LinearDimension Class
Grasshopper.Kernel.Parameters Namespace