Grasshopper API
ModelObject.DestroyPreviewMeshes Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void DestroyPreviewMeshes()
Public Sub DestroyPreviewMeshes
Implements
IGH_PreviewMeshData.DestroyPreviewMeshes()
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace