Grasshopper API
Param_ModelHatchLine.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelHatchLine PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelHatchLine
Parameters
data
Type: System.Object
Return Value
Type: ModelHatchLine
See Also
Reference
Param_ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting.Params Namespace