Grasshopper API
ModelConstructionPlane Constructor (Guid)
 Create a new referenced view that references a RhinoView or NamedView object with the specified ref_guid.
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of viewport object to reference.
See Also
Reference
ModelConstructionPlane Class
ModelConstructionPlane Overload
Grasshopper.Rhinoceros.Display Namespace