Grasshopper API
GH_Convert.ToGHLeader_Primary Method
 Converts similar data into a GH_Leader instance. Data is not guaranteed to be duplicated.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToGHLeader_Primary(
	Object data,
	ref GH_Leader target
)
Public Shared Function ToGHLeader_Primary (
	data As Object,
	ByRef target As GH_Leader
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Leader
Target instance. If null, a new GH_Leader will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace