Grasshopper API
ModelInstanceDefinition Implicit Conversion (ModelInstanceDefinition.Attributes to ModelInstanceDefinition)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelInstanceDefinition (
	ModelInstanceDefinition.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelInstanceDefinition.Attributes
) As ModelInstanceDefinition
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes
Return Value
Type: ModelInstanceDefinition
See Also
Reference
ModelInstanceDefinition Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace