Grasshopper API
AnnotationTextSettings Constructor
Initializes a new instance of the AnnotationTextSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationTextSettings()
Public Sub New
See Also
Reference
AnnotationTextSettings Class
AnnotationTextSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace