Grasshopper API
ModelObject.TooltipString Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TooltipString()
Public Overrides Function TooltipString As String
Return Value
Type: String
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace