Grasshopper API
ClippingArrow.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ClippingArrow.Attributes From(
	ClippingArrowType arrowType
)
Public Shared Function From (
	arrowType As ClippingArrowType
) As ClippingArrow.Attributes
Parameters
arrowType
Type: ClippingArrowType
Return Value
Type: ClippingArrow.Attributes
See Also
Reference
ClippingArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace