Grasshopper API
Param_ObjectDraftingLineWidth.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ObjectDraftingLineWidth> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ObjectDraftingLineWidth)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ObjectDraftingLineWidth>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace