Grasshopper API
Param_ModelLayer.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelLayer PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelLayer
Parameters
data
Type: System.Object
Return Value
Type: ModelLayer
See Also
Reference
Param_ModelLayer Class
Grasshopper.Rhinoceros.Model.Params Namespace