Grasshopper API
Param_ModelAttributeKey.Write Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Write(
	GH_IWriter writer
)
Public Overrides Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace