Grasshopper API
GH_DetailView.ClearCaches Method
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the detail view is referenced, the local instance of the detail view is erased.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace