Grasshopper API
ObjectVisibility.Attributes.Equals Method (ObjectVisibility.Attributes)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectVisibility.Attributes other
)
Public Function Equals (
	other As ObjectVisibility.Attributes
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Display.ObjectVisibility.Attributes
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectVisibility.Attributes Structure
Equals Overload
Grasshopper.Rhinoceros.Display Namespace