Grasshopper API
GH_DetailView.ToString Method
 Format the detail view using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace