Grasshopper API
Param_Leader Constructor
Initializes a new instance of the Param_Leader class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_Leader()
Public Sub New
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace