Grasshopper API
GH_Format.RhinoUnitName Method (UnitSystem)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string RhinoUnitName(
	UnitSystem unitSystem
)
Public Shared Function RhinoUnitName (
	unitSystem As UnitSystem
) As String
Parameters
unitSystem
Type: UnitSystem
Return Value
Type: String
See Also
Reference
GH_Format Class
RhinoUnitName Overload
Grasshopper.Kernel Namespace