Grasshopper API
ModelHatchPattern.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelHatchPattern Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelHatchPattern
Parameters
source
Type: System.Object
Return Value
Type: ModelHatchPattern
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace