Grasshopper API
ObjectRenderMaterial.Value.CompareTo Method (ObjectRenderMaterial.Value)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	ObjectRenderMaterial.Value other
)
Public Function CompareTo (
	other As ObjectRenderMaterial.Value
) As Integer
Parameters
other
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ObjectRenderMaterial.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Render Namespace