Grasshopper API
GH_ComponentParamServer.GetParam Method
 Finds the parameter that matches the specified search mask.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IGH_Param GetParam(
	string name,
	GH_ParameterSide side
)
Public Function GetParam (
	name As String,
	side As GH_ParameterSide
) As IGH_Param
Parameters
name
Type: System.String
Name to search for.
side
Type: Grasshopper.Kernel.GH_ParameterSide
Return Value
Type: IGH_Param
The the parameter, or null if no parameter was found to match
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace