Grasshopper API
ModelPageViewport.Attributes Constructor
Initializes a new instance of the ModelPageViewport.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelPageViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace