Grasshopper API
ModelDisplayMode Implicit Conversion (Guid to ModelDisplayMode)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelDisplayMode (
	Guid id
)
Public Shared Widening Operator CType (
	id As Guid
) As ModelDisplayMode
Parameters
id
Type: System.Guid
Return Value
Type: ModelDisplayMode
See Also
Reference
ModelDisplayMode Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace