Grasshopper API
ObjectRenderMaterial.Value Implicit Conversion (ObjectRenderMaterial.Value to ModelRenderMaterial)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderMaterial (
	ObjectRenderMaterial.Value value
)
Public Shared Widening Operator CType (
	value As ObjectRenderMaterial.Value
) As ModelRenderMaterial
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value
Return Value
Type: ModelRenderMaterial
See Also
Reference
ObjectRenderMaterial.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Render Namespace