Grasshopper API
GH_Format.FormatExtrusionValidity Method
 If the extrusion is invalid, return a string describing why.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string FormatExtrusionValidity(
	Extrusion val,
	string identifier = "Extrusion"
)
Public Shared Function FormatExtrusionValidity (
	val As Extrusion,
	Optional identifier As String = "Extrusion"
) As String
Parameters
val
Type: Extrusion
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the extrusion is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace