Grasshopper API
ObjectDraftingLinetype.Value Implicit Conversion (ModelLinetype to ObjectDraftingLinetypeObjectDraftingLinetype.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLinetype.Value (
	ModelLinetype color
)
Public Shared Widening Operator CType (
	color As ModelLinetype
) As ObjectDraftingLinetype.Value
Parameters
color
Type: Grasshopper.Rhinoceros.Drafting.ModelLinetype
Return Value
Type: ObjectDraftingLinetype.Value
See Also
Reference
ObjectDraftingLinetype.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace