Grasshopper API
ModelLayer.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLayer.Attributes ToAttributes()
Public Function ToAttributes As ModelLayer.Attributes
Return Value
Type: ModelLayer.Attributes
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace