Grasshopper API
ObjectDisplayColor.Value.CompareTo Method (Object)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CompareTo(
	Object other
)
Public Function CompareTo (
	other As Object
) As Integer
Parameters
other
Type: System.Object
Return Value
Type: Int32
Implements
IComparable.CompareTo(Object)
See Also
Reference
ObjectDisplayColor.Value Structure
CompareTo Overload
Grasshopper.Rhinoceros.Display Namespace