Grasshopper API
GH_Document.AutoLayoutComponents Method
 Perform automatic layout on this document.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void AutoLayoutComponents(
	bool limitToSelection
)
Public Sub AutoLayoutComponents (
	limitToSelection As Boolean
)
Parameters
limitToSelection
Type: System.Boolean
If true, only selected objects will be considered.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace