Grasshopper API
ObjectSectionStyle.Value.Equals Method (ObjectSectionStyle.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ObjectSectionStyle.Value other
)
Public Function Equals (
	other As ObjectSectionStyle.Value
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ObjectSectionStyle.Value Structure
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace