Grasshopper API
ModelEarthAnchorPoint.Cast Method
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelEarthAnchorPoint Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelEarthAnchorPoint
Parameters
source
Type: System.Object
Return Value
Type: ModelEarthAnchorPoint
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace