Grasshopper API
GH_InstanceReference Constructor
 Default constructor.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_InstanceReference()
Public Sub New
Remarks
Creates an invalid instance reference
See Also
Reference
GH_InstanceReference Class
GH_InstanceReference Overload
Grasshopper.Kernel.Types Namespace