Grasshopper API
ObjectRenderMaterial.Value Constructor (ModelRenderMaterial)
Initializes a new instance of the ObjectRenderMaterial.Value class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ModelRenderMaterial value
)
Public Sub New (
	value As ModelRenderMaterial
)
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ModelRenderMaterial
See Also
Reference
ObjectRenderMaterial.Value Structure
ObjectRenderMaterial.Value Overload
Grasshopper.Rhinoceros.Render Namespace