Grasshopper API
AnnotationDimensionSettings.Attributes.Equals Method (Object, IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected bool Equals(
	Object other,
	IEqualityComparer comparer
)
Protected Function Equals (
	other As Object,
	comparer As IEqualityComparer
) As Boolean
Parameters
other
Type: System.Object
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Boolean
Implements
IStructuralEquatable.Equals(Object, IEqualityComparer)
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Equals Overload
Grasshopper.Rhinoceros.Annotations Namespace