Grasshopper API
AnnotationLeaderSettings.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationLeaderSettings.Attributes From(
	DimensionStyle dimStyle
)
Public Shared Function From (
	dimStyle As DimensionStyle
) As AnnotationLeaderSettings.Attributes
Parameters
dimStyle
Type: DimensionStyle
Return Value
Type: AnnotationLeaderSettings.Attributes
See Also
Reference
AnnotationLeaderSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace