Grasshopper API
ModelContentName.Equality Operator (String, ModelContentName)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool operator ==(
	string left,
	ModelContentName right
)
Public Shared Operator = (
	left As String,
	right As ModelContentName
) As Boolean
Parameters
left
Type: System.String
right
Type: Grasshopper.Rhinoceros.ModelContentName
Return Value
Type: Boolean
See Also
Reference
ModelContentName Structure
Equality Overload
Grasshopper.Rhinoceros Namespace