Grasshopper API
ObjectDraftingLineWidth.Value Implicit Conversion (ObjectPlotWeightSource to ObjectDraftingLineWidthObjectDraftingLineWidth.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLineWidth.Value (
	ObjectPlotWeightSource source
)
Public Shared Widening Operator CType (
	source As ObjectPlotWeightSource
) As ObjectDraftingLineWidth.Value
Parameters
source
Type: ObjectPlotWeightSource
Return Value
Type: ObjectDraftingLineWidth.Value
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace