Grasshopper API
GH_YakDownloadFormEto Constructor
Initializes a new instance of the GH_YakDownloadFormEto class
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_YakDownloadFormEto(
	IEnumerable<GH_YakDownloadFormEto.MissingObjectItem> items
)
Public Sub New (
	items As IEnumerable(Of GH_YakDownloadFormEto.MissingObjectItem)
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<GH_YakDownloadFormEto.MissingObjectItem>
See Also
Reference
GH_YakDownloadFormEto Class
Grasshopper.GUI Namespace