Grasshopper API
ObjectDisplayColor.Value Constructor (ObjectColorSource)
Initializes a new instance of the ObjectDisplayColor.Value class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectColorSource source
)
Public Sub New (
	source As ObjectColorSource
)
Parameters
source
Type: ObjectColorSource
See Also
Reference
ObjectDisplayColor.Value Structure
ObjectDisplayColor.Value Overload
Grasshopper.Rhinoceros.Display Namespace