Grasshopper API
ModelUserText.GetEnumerator Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IEnumerator<KeyValuePair<string, string>> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of KeyValuePair(Of String, String))
Return Value
Type: IEnumerator<KeyValuePair<String, String>>
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace