Grasshopper API
ModelObject Implicit Conversion (ModelObject.Attributes to ModelObject)
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelObject (
	ModelObject.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelObject.Attributes
) As ModelObject
Parameters
attributes
Type: Grasshopper.Rhinoceros.Model.ModelObject.Attributes
Return Value
Type: ModelObject
See Also
Reference
ModelObject Class
Implicit Overload
Grasshopper.Rhinoceros.Model Namespace