Grasshopper API
GH_Convert.ToLeader Method
 Convert data into Rhino.Geometry.Leader.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToLeader(
	Object data,
	ref Leader rc,
	GH_Conversion conversion_level
)
Public Shared Function ToLeader (
	data As Object,
	ByRef rc As Leader,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Leader
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace