Grasshopper API
Param_ModelObject.Prompt_Plural Method
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<ModelObject> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of ModelObject)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<ModelObject>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace