Grasshopper API
ModelLinetype Implicit Conversion (String to ModelLinetype)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLinetype (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelLinetype
Parameters
path
Type: System.String
Return Value
Type: ModelLinetype
See Also
Reference
ModelLinetype Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace