Grasshopper API
Param_Leader.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_Leader value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_Leader
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_Leader
Return Value
Type: GH_GetterResult
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace