Grasshopper API
GH_Hatch.GH_HatchProxy Constructor
Initializes a new instance of the GH_Hatch.GH_HatchProxy class
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_HatchProxy(
	GH_Hatch Value
)
Public Sub New (
	Value As GH_Hatch
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Hatch
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace