Grasshopper API
ModelRenderTexture.Cast Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelRenderTexture Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelRenderTexture
Parameters
source
Type: System.Object
Return Value
Type: ModelRenderTexture
See Also
Reference
ModelRenderTexture Class
Grasshopper.Rhinoceros.Render Namespace