Grasshopper API
ModelContent.Write Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override bool Write(
	GH_IWriter writer
)
Protected Overrides Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace