Grasshopper API
ModelContent.Cast<A, T> Method (Object)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static T Cast<A, T>(
	Object source
)
where A : new(), ModelContent.Attributes
where T : ModelContent
Protected Friend Shared Function Cast(Of A As {New, ModelContent.Attributes}, T As ModelContent) (
	source As Object
) As T
Parameters
source
Type: System.Object
Type Parameters
A
T
Return Value
Type: T
See Also
Reference
ModelContent Class
Cast Overload
Grasshopper.Rhinoceros Namespace