Grasshopper API
Param_MatchText.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_String PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_String
Parameters
data
Type: System.Object
Return Value
Type: GH_String
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace