Grasshopper API
GH_Extrusion.CastTo<T> Method (T)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool CastTo<T>(
	out T target
)
Public Overrides Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
GH_Extrusion Class
CastTo Overload
Grasshopper.Kernel.Types Namespace