Grasshopper API
ModelRenderEnvironment.Attributes Implicit Conversion (String to ModelRenderEnvironmentModelRenderEnvironment.Attributes)
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelRenderEnvironment.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelRenderEnvironment.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelRenderEnvironment.Attributes
See Also
Reference
ModelRenderEnvironment.Attributes Class
Grasshopper.Rhinoceros.Render Namespace