Grasshopper API
Param_ModelTextureSlot.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ModelTextureSlot value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ModelTextureSlot
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Render.ModelTextureSlot
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ModelTextureSlot Class
Grasshopper.Rhinoceros.Render.Params Namespace