Grasshopper API
GH_ScriptVariant Implicit Conversion (Vector3d to GH_ScriptVariant)
 Namespace: Grasshopper.Kernel.Expressions
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator GH_ScriptVariant (
	Vector3d in
)
Public Shared Widening Operator CType (
	in As Vector3d
) As GH_ScriptVariant
Parameters
in
Type: Vector3d
Return Value
Type: GH_ScriptVariant
See Also
Reference
GH_ScriptVariant Class
Implicit Overload
Grasshopper.Kernel.Expressions Namespace