Grasshopper API
GH_Leader Constructor (Leader, ModelAnnotationStyle)
 Create a duplicate of an existing annotation.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Leader(
	Leader leader,
	ModelAnnotationStyle style
)
Public Sub New (
	leader As Leader,
	style As ModelAnnotationStyle
)
Parameters
leader
Type: Leader
Annotation to duplicate
style
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
Annotation style to use
See Also
Reference
GH_Leader Class
GH_Leader Overload
Grasshopper.Kernel.Types Namespace