Grasshopper API
ObjectDraftingLinetype Implicit Conversion (ObjectDraftingLinetype to ObjectDraftingLinetypeObjectDraftingLinetype.Value)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDraftingLinetype.Value (
	ObjectDraftingLinetype data
)
Public Shared Widening Operator CType (
	data As ObjectDraftingLinetype
) As ObjectDraftingLinetype.Value
Parameters
data
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype
Return Value
Type: ObjectDraftingLinetype.Value
See Also
Reference
ObjectDraftingLinetype Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace