Grasshopper API
Param_RadialDimension.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_RadialDimension PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_RadialDimension
Parameters
data
Type: System.Object
Return Value
Type: GH_RadialDimension
See Also
Reference
Param_RadialDimension Class
Grasshopper.Kernel.Parameters Namespace