Grasshopper API
GH_Light.DrawViewportWires Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual void DrawViewportWires(
	GH_PreviewWireArgs args
)
Public Overridable Sub DrawViewportWires (
	args As GH_PreviewWireArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewWireArgs
Implements
IGH_PreviewData.DrawViewportWires(GH_PreviewWireArgs)
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace