Grasshopper API
ModelLineWidth Constructor
Initializes a new instance of the ModelLineWidth class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLineWidth()
Public Sub New
See Also
Reference
ModelLineWidth Class
ModelLineWidth Overload
Grasshopper.Rhinoceros.Drafting Namespace