Grasshopper API
GH_Convert.ToAnnotationBase Method
 Convert data into Rhino.Geometry.AnnotationBase.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ToAnnotationBase(
	Object data,
	ref AnnotationBase rc,
	GH_Conversion conversion_level
)
Public Shared Function ToAnnotationBase (
	data As Object,
	ByRef rc As AnnotationBase,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: AnnotationBase
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace