Grasshopper API
GH_Light Constructor (GH_Light)
 Create a duplicate of another GH_Light. This constructor also copies reference data.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Light(
	GH_Light other
)
Public Sub New (
	other As GH_Light
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Light
GH_Light to duplicate
See Also
Reference
GH_Light Class
GH_Light Overload
Grasshopper.Kernel.Types Namespace