Grasshopper API
ModelHatchLine.ToString Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace