Grasshopper API
ModelSectionStyle Implicit Conversion (ModelSectionStyle.Attributes to ModelSectionStyle)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelSectionStyle (
	ModelSectionStyle.Attributes attributes
)
Public Shared Widening Operator CType (
	attributes As ModelSectionStyle.Attributes
) As ModelSectionStyle
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes
Return Value
Type: ModelSectionStyle
See Also
Reference
ModelSectionStyle Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace