Grasshopper API
GH_OrdinateDimension.DuplicateAnnotation Method
 Create a duplicate of this annotation.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_AnnotationBase DuplicateAnnotation()
Public Overrides Function DuplicateAnnotation As GH_AnnotationBase
Return Value
Type: GH_AnnotationBase
See Also
Reference
GH_OrdinateDimension Class
Grasshopper.Kernel.Types Namespace