Grasshopper API
AnnotationArrow.Attributes.Equals Method (Object)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
Parameters
other
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
AnnotationArrow.Attributes Class
Equals Overload
Grasshopper.Rhinoceros.Annotations Namespace