Grasshopper API
ModelLineWidth.Equals Method (ModelLineWidth)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Equals(
	ModelLineWidth other
)
Public Function Equals (
	other As ModelLineWidth
) As Boolean
Parameters
other
Type: Grasshopper.Rhinoceros.Drafting.ModelLineWidth
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ModelLineWidth Class
Equals Overload
Grasshopper.Rhinoceros.Drafting Namespace