Grasshopper API
ModelRenderSun.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderSun.Attributes ToAttributes()
Public Function ToAttributes As ModelRenderSun.Attributes
Return Value
Type: ModelRenderSun.Attributes
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace