Grasshopper API
ObjectVisibility.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectVisibility.Attributes ToAttributes()
Public Function ToAttributes As ObjectVisibility.Attributes
Return Value
Type: ObjectVisibility.Attributes
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace