Grasshopper API
ModelAnnotationStyle Constructor (ModelAnnotationStyle.Attributes)
Initializes a new instance of the ModelAnnotationStyle class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle(
	ModelAnnotationStyle.Attributes attributes
)
Public Sub New (
	attributes As ModelAnnotationStyle.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes
See Also
Reference
ModelAnnotationStyle Class
ModelAnnotationStyle Overload
Grasshopper.Rhinoceros.Annotations Namespace