Grasshopper API
Param_AnnotationToleranceSettings.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override AnnotationToleranceSettings PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As AnnotationToleranceSettings
Parameters
data
Type: System.Object
Return Value
Type: AnnotationToleranceSettings
See Also
Reference
Param_AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace