Grasshopper API
ModelDetailViewport.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDetailViewport.Attributes ToAttributes()
Public Function ToAttributes As ModelDetailViewport.Attributes
Return Value
Type: ModelDetailViewport.Attributes
See Also
Reference
ModelDetailViewport Class
Grasshopper.Rhinoceros.Display Namespace