Grasshopper API
AnnotationArrow.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationArrow.Attributes From(
	ArrowType arrowType
)
Public Shared Function From (
	arrowType As ArrowType
) As AnnotationArrow.Attributes
Parameters
arrowType
Type: ArrowType
Return Value
Type: AnnotationArrow.Attributes
See Also
Reference
AnnotationArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace