Grasshopper API
Param_MatchText.MatchText Method
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool MatchText(
	string value,
	string pattern,
	bool ignoreCase,
	CultureInfo culture
)
Public Function MatchText (
	value As String,
	pattern As String,
	ignoreCase As Boolean,
	culture As CultureInfo
) As Boolean
Parameters
value
Type: System.String
pattern
Type: System.String
ignoreCase
Type: System.Boolean
culture
Type: System.Globalization.CultureInfo
Return Value
Type: Boolean
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace