Grasshopper API
GH_BakeUtility Constructor
 Create a new baker.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_BakeUtility(
	GH_Document document
)
Public Sub New (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Grasshopper document, if any.
See Also
Reference
GH_BakeUtility Class
Grasshopper.Kernel Namespace