Grasshopper API
GH_LinearDimension.DuplicateLinearDimension Method
 Create a duplicate of this linear dimension.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_LinearDimension DuplicateLinearDimension()
Public Function DuplicateLinearDimension As GH_LinearDimension
Return Value
Type: GH_LinearDimension
See Also
Reference
GH_LinearDimension Class
Grasshopper.Kernel.Types Namespace