Grasshopper API
AnnotationDimensionSettings Explicit Conversion (AnnotationDimensionSettings to DimensionStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator DimensionStyle (
	AnnotationDimensionSettings setings
)
Public Shared Narrowing Operator CType (
	setings As AnnotationDimensionSettings
) As DimensionStyle
Parameters
setings
Type: Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings
Return Value
Type: DimensionStyle
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace