Grasshopper API
Param_ModelInstanceDefinition Constructor
Initializes a new instance of the Param_ModelInstanceDefinition class
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelInstanceDefinition()
Public Sub New
See Also
Reference
Param_ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model.Params Namespace