Grasshopper API
ModelEarthAnchorPoint Constructor (EarthAnchorPoint)
Initializes a new instance of the ModelEarthAnchorPoint class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelEarthAnchorPoint(
	EarthAnchorPoint anchorPoint
)
Public Sub New (
	anchorPoint As EarthAnchorPoint
)
Parameters
anchorPoint
Type: EarthAnchorPoint
See Also
Reference
ModelEarthAnchorPoint Class
ModelEarthAnchorPoint Overload
Grasshopper.Rhinoceros.Model Namespace