Grasshopper API
Param_OrdinateDimension.Prompt_Singular Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_OrdinateDimension value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_OrdinateDimension
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_OrdinateDimension
Return Value
Type: GH_GetterResult
See Also
Reference
Param_OrdinateDimension Class
Grasshopper.Kernel.Parameters Namespace