Grasshopper API
Param_ObjectDraftingLinetype.Prompt_Singular Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref ObjectDraftingLinetype value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As ObjectDraftingLinetype
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype
Return Value
Type: GH_GetterResult
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace