Grasshopper API
AnnotationUnitsSettings.Attributes.ToModelData Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ModelData ToModelData()
Public Overrides Function ToModelData As ModelData
Return Value
Type: ModelData
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace