Grasshopper API
Param_ObjectRenderMaterial.RegisterRemoteIDs Method
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void RegisterRemoteIDs(
	GH_GuidTable table
)
Public Overrides Sub RegisterRemoteIDs (
	table As GH_GuidTable
)
Parameters
table
Type: GH_GuidTable
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace