Grasshopper API
ObjectDraftingLineWidth.Value Constructor (ObjectPlotWeightSource, Double)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Value(
	ObjectPlotWeightSource source,
	double value
)
Public Sub New (
	source As ObjectPlotWeightSource,
	value As Double
)
Parameters
source
Type: ObjectPlotWeightSource
value
Type: System.Double
See Also
Reference
ObjectDraftingLineWidth.Value Structure
ObjectDraftingLineWidth.Value Overload
Grasshopper.Rhinoceros.Drafting Namespace