Grasshopper API
ObjectVisibility.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectVisibility Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectVisibility
Parameters
source
Type: System.Object
Return Value
Type: ObjectVisibility
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace