Grasshopper API
ModelLayer Constructor
Initializes a new instance of the ModelLayer class
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLayer()
Public Sub New
See Also
Reference
ModelLayer Class
ModelLayer Overload
Grasshopper.Rhinoceros.Model Namespace