Grasshopper API
ModelData.Read<TEnum> Method (GH_IReader, String, Nullable<TEnum>)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static void Read<TEnum>(
	GH_IReader reader,
	string name,
	out TEnum? serializable
)
where TEnum : struct, new(), IComparable, IFormattable, IConvertible
Protected Friend Shared Sub Read(Of TEnum As {Structure, New, IComparable, IFormattable, IConvertible}) (
	reader As GH_IReader,
	name As String,
	<OutAttribute> ByRef serializable As TEnum?
)
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
name
Type: System.String
serializable
Type: System.Nullable<TEnum>
Type Parameters
TEnum
See Also
Reference
ModelData Class
Read Overload
Grasshopper.Rhinoceros Namespace