Grasshopper API
ObjectDraftingLineWidth Constructor (ObjectDraftingLineWidth.Value)
Initializes a new instance of the ObjectDraftingLineWidth class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLineWidth(
	ObjectDraftingLineWidth.Value value
)
Public Sub New (
	value As ObjectDraftingLineWidth.Value
)
Parameters
value
Type: Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value
See Also
Reference
ObjectDraftingLineWidth Class
ObjectDraftingLineWidth Overload
Grasshopper.Rhinoceros.Drafting Namespace