Grasshopper API
ModelDetailViewport.Attributes Constructor
Initializes a new instance of the ModelDetailViewport.Attributes class
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Attributes()
Public Sub New
See Also
Reference
ModelDetailViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace