Grasshopper API
ModelRenderContent.ToAttributes Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderContent.Attributes ToAttributes()
Public Function ToAttributes As ModelRenderContent.Attributes
Return Value
Type: ModelRenderContent.Attributes
See Also
Reference
ModelRenderContent Class
Grasshopper.Rhinoceros.Render Namespace