Grasshopper API
GH_Light.ToString Method
 Format the dimension using default grasshopper formatting logic.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace