Grasshopper API
ModelData.Attributes.Clone Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelData.Attributes Clone()
Public Function Clone As ModelData.Attributes
Return Value
Type: ModelData.Attributes
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace