Grasshopper API
ObjectDisplayColor.Value Implicit Conversion (ObjectColorSource to ObjectDisplayColorObjectDisplayColor.Value)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ObjectDisplayColor.Value (
	ObjectColorSource source
)
Public Shared Widening Operator CType (
	source As ObjectColorSource
) As ObjectDisplayColor.Value
Parameters
source
Type: ObjectColorSource
Return Value
Type: ObjectDisplayColor.Value
See Also
Reference
ObjectDisplayColor.Value Structure
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace