Grasshopper API
ModelLinetype.Attributes Implicit Conversion (String to ModelLinetypeModelLinetype.Attributes)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelLinetype.Attributes (
	string path
)
Public Shared Widening Operator CType (
	path As String
) As ModelLinetype.Attributes
Parameters
path
Type: System.String
Return Value
Type: ModelLinetype.Attributes
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace