Grasshopper API
AnnotationLeaderSettings.GetDimensionStyle Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void GetDimensionStyle(
	ref DimensionStyle baseDimensionStyle = null
)
Public Sub GetDimensionStyle (
	Optional ByRef baseDimensionStyle As DimensionStyle = Nothing
)
Parameters
baseDimensionStyle (Optional)
Type: DimensionStyle
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace