Grasshopper API
GH_Light Constructor (Guid)
 Create a new referenced light that references a Rhino light with the specified ID.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Light(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of light object to reference.
See Also
Reference
GH_Light Class
GH_Light Overload
Grasshopper.Kernel.Types Namespace