Grasshopper API
ModelUnitSystem.Equals Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
Parameters
other
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace