Grasshopper API
Complex.Division Operator (Complex, Double)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Complex operator /(
	Complex dividend,
	double divisor
)
Public Shared Operator / (
	dividend As Complex,
	divisor As Double
) As Complex
Parameters
dividend
Type: Grasshopper.Kernel.Types.Complex
divisor
Type: System.Double
Return Value
Type: Complex
See Also
Reference
Complex Structure
Division Overload
Grasshopper.Kernel.Types Namespace