Grasshopper API
ModelDetailViewport.Cast Method
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelDetailViewport Cast(
	Object data
)
Public Shared Function Cast (
	data As Object
) As ModelDetailViewport
Parameters
data
Type: System.Object
Return Value
Type: ModelDetailViewport
See Also
Reference
ModelDetailViewport Class
Grasshopper.Rhinoceros.Display Namespace