Grasshopper API
AnnotationArrowSettings.Attributes.From Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static AnnotationArrowSettings.Attributes From(
	DimensionStyle dimStyle
)
Public Shared Function From (
	dimStyle As DimensionStyle
) As AnnotationArrowSettings.Attributes
Parameters
dimStyle
Type: DimensionStyle
Return Value
Type: AnnotationArrowSettings.Attributes
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace