Grasshopper API
ClippingDrawingSettings Constructor (ClippingDrawingSettings.Attributes)
Initializes a new instance of the ClippingDrawingSettings class
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingDrawingSettings(
	ClippingDrawingSettings.Attributes attributes
)
Public Sub New (
	attributes As ClippingDrawingSettings.Attributes
)
Parameters
attributes
Type: Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes
See Also
Reference
ClippingDrawingSettings Class
ClippingDrawingSettings Overload
Grasshopper.Rhinoceros.Drafting Namespace