Grasshopper API
ModelUnitSystem Constructor (ActiveSpace, RhinoDoc)
Initializes a new instance of the ModelUnitSystem class
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem(
	ActiveSpace space,
	RhinoDoc document
)
Public Sub New (
	space As ActiveSpace,
	document As RhinoDoc
)
Parameters
space
Type: ActiveSpace
document
Type: RhinoDoc
See Also
Reference
ModelUnitSystem Class
ModelUnitSystem Overload
Grasshopper.Rhinoceros Namespace