Grasshopper API
GH_TextEntity Constructor
 Default constructor, creates an invalid text entity.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_TextEntity()
Public Sub New
See Also
Reference
GH_TextEntity Class
GH_TextEntity Overload
Grasshopper.Kernel.Types Namespace