Grasshopper API
ModelFont.CastFrom Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool CastFrom(
	Object source
)
Public Overrides Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace