Grasshopper API
AnnotationArrowSettings Constructor (DimensionStyle)
Initializes a new instance of the AnnotationArrowSettings class
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrowSettings(
	DimensionStyle dimStyle
)
Public Sub New (
	dimStyle As DimensionStyle
)
Parameters
dimStyle
Type: DimensionStyle
See Also
Reference
AnnotationArrowSettings Class
AnnotationArrowSettings Overload
Grasshopper.Rhinoceros.Annotations Namespace