Grasshopper API
Param_RadialDimension Constructor
Initializes a new instance of the Param_RadialDimension class
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_RadialDimension()
Public Sub New
See Also
Reference
Param_RadialDimension Class
Grasshopper.Kernel.Parameters Namespace