Grasshopper API
Param_ModelPageViewport.PreferredCast Method
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelPageViewport PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As ModelPageViewport
Parameters
data
Type: System.Object
Return Value
Type: ModelPageViewport
See Also
Reference
Param_ModelPageViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace