Grasshopper API
Utility.SetDefaultUnits Method
 Utility function to set model unit fields
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static void SetDefaultUnits(
	string modelUnits
)
Public Shared Sub SetDefaultUnits (
	modelUnits As String
)
Parameters
modelUnits
Type: System.String
Value to set default model units
See Also
Reference
Utility Class
Grasshopper Namespace