Grasshopper API
Param_ClippingPlane.PreferredCast Method
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override GH_ClippingPlane PreferredCast(
	Object data
)
Protected Overrides Function PreferredCast (
	data As Object
) As GH_ClippingPlane
Parameters
data
Type: System.Object
Return Value
Type: GH_ClippingPlane
See Also
Reference
Param_ClippingPlane Class
Grasshopper.Kernel.Parameters Namespace