Grasshopper API
ObjectDraftingColor.Cast Method
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingColor Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ObjectDraftingColor
Parameters
source
Type: System.Object
Return Value
Type: ObjectDraftingColor
See Also
Reference
ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting Namespace