Grasshopper API
GH_MeshingParameters Implicit Conversion (MeshingParameters to GH_MeshingParameters)
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator GH_MeshingParameters (
	MeshingParameters meshingParameters
)
Public Shared Widening Operator CType (
	meshingParameters As MeshingParameters
) As GH_MeshingParameters
Parameters
meshingParameters
Type: MeshingParameters
Return Value
Type: GH_MeshingParameters
See Also
Reference
GH_MeshingParameters Class
Grasshopper.Kernel.Types Namespace