Grasshopper API
Param_ObjectSectionStyle.ClearData Method
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override void ClearData()
Public Overrides Sub ClearData
See Also
Reference
Param_ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting.Params Namespace