Grasshopper API
GH_GeometryGroup.AppendRenderGeometry Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void AppendRenderGeometry(
	GH_RenderArgs args,
	RenderMaterial material
)
Public Sub AppendRenderGeometry (
	args As GH_RenderArgs,
	material As RenderMaterial
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
material
Type: RenderMaterial
Implements
IGH_RenderAwareData.AppendRenderGeometry(GH_RenderArgs, RenderMaterial)
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace