Grasshopper API
ModelMeshingParameters.Cast Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelMeshingParameters Cast(
	Object source
)
Public Shared Function Cast (
	source As Object
) As ModelMeshingParameters
Parameters
source
Type: System.Object
Return Value
Type: ModelMeshingParameters
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace