Grasshopper API
ModelNamedConstructionPlane Implicit Conversion (ConstructionPlane to ModelNamedConstructionPlane)
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelNamedConstructionPlane (
	ConstructionPlane cplane
)
Public Shared Widening Operator CType (
	cplane As ConstructionPlane
) As ModelNamedConstructionPlane
Parameters
cplane
Type: ConstructionPlane
Return Value
Type: ModelNamedConstructionPlane
See Also
Reference
ModelNamedConstructionPlane Class
Implicit Overload
Grasshopper.Rhinoceros.Display Namespace