Grasshopper API
ModelRenderTexture Constructor
Initializes a new instance of the ModelRenderTexture class
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderTexture()
Public Sub New
See Also
Reference
ModelRenderTexture Class
ModelRenderTexture Overload
Grasshopper.Rhinoceros.Render Namespace