Grasshopper API
AnnotationTextSettings Explicit Conversion (AnnotationTextSettings to DimensionStyle)
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static explicit operator DimensionStyle (
	AnnotationTextSettings settings
)
Public Shared Narrowing Operator CType (
	settings As AnnotationTextSettings
) As DimensionStyle
Parameters
settings
Type: Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings
Return Value
Type: DimensionStyle
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace