Grasshopper API
GH_Document.FindWireAt Method
 Find the wire at or near the given coordinate.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool FindWireAt(
	PointF point,
	float radius,
	ref IGH_Param source,
	ref IGH_Param target
)
Public Function FindWireAt (
	point As PointF,
	radius As Single,
	ByRef source As IGH_Param,
	ByRef target As IGH_Param
) As Boolean
Parameters
point
Type: System.Drawing.PointF
Search locus.
radius
Type: System.Single
Search radius.
source
Type: Grasshopper.Kernel.IGH_Param
Source parameter of wire (if found).
target
Type: Grasshopper.Kernel.IGH_Param
Target parameter of wire (if found).
Return Value
Type: Boolean
True if a wire was found.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace