Grasshopper API
ClippingDrawingSettings.Attributes.GetHashCode Method (IEqualityComparer)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected int GetHashCode(
	IEqualityComparer comparer
)
Protected Function GetHashCode (
	comparer As IEqualityComparer
) As Integer
Parameters
comparer
Type: System.Collections.IEqualityComparer
Return Value
Type: Int32
Implements
IStructuralEquatable.GetHashCode(IEqualityComparer)
See Also
Reference
ClippingDrawingSettings.Attributes Class
GetHashCode Overload
Grasshopper.Rhinoceros.Drafting Namespace