Grasshopper API
EtoExtensions.ToEto Method (Bitmap)
Note: This API is now obsolete.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute("Use Rhino.UI.EtoExtensions.ToEto instead")]
public static Bitmap ToEto(
	Bitmap bitmap
)
<ObsoleteAttribute("Use Rhino.UI.EtoExtensions.ToEto instead")>
Public Shared Function ToEto (
	bitmap As Bitmap
) As Bitmap
Parameters
bitmap
Type: System.Drawing.Bitmap
Return Value
Type: Bitmap
See Also
Reference
EtoExtensions Class
ToEto Overload
Grasshopper Namespace