Grasshopper API
GH_AnnotationBase.GetOverrides Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DimensionStyle GetOverrides()
Public Function GetOverrides As DimensionStyle
Return Value
Type: DimensionStyle
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace