Grasshopper API
ModelHatchLine Implicit Conversion (HatchLine to ModelHatchLine)
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static implicit operator ModelHatchLine (
	HatchLine hatchLine
)
Public Shared Widening Operator CType (
	hatchLine As HatchLine
) As ModelHatchLine
Parameters
hatchLine
Type: HatchLine
Return Value
Type: ModelHatchLine
See Also
Reference
ModelHatchLine Class
Implicit Overload
Grasshopper.Rhinoceros.Drafting Namespace