Grasshopper API
AnnotationArrow.Attributes.ToString Method
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
AnnotationArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace