Grasshopper API
ModelRenderContent.DuplicateContent<TContent> Method
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static TContent DuplicateContent<TContent>(
	TContent renderContent,
	out string name,
	out string notes,
	out string tags
)
where TContent : RenderContent
Protected Friend Shared Function DuplicateContent(Of TContent As RenderContent) (
	renderContent As TContent,
	<OutAttribute> ByRef name As String,
	<OutAttribute> ByRef notes As String,
	<OutAttribute> ByRef tags As String
) As TContent
Parameters
renderContent
Type: TContent
name
Type: System.String
notes
Type: System.String
tags
Type: System.String
Type Parameters
TContent
Return Value
Type: TContent
See Also
Reference
ModelRenderContent Class
Grasshopper.Rhinoceros.Render Namespace