Grasshopper API
ModelValue.ReadValue<T> Method
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal static bool ReadValue<T>(
	GH_IReader reader,
	out T serializable
)
where T : struct, new(), GH_ISerializable
Protected Friend Shared Function ReadValue(Of T As {Structure, New, GH_ISerializable}) (
	reader As GH_IReader,
	<OutAttribute> ByRef serializable As T
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
serializable
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace