Grasshopper API
GH_RemoveObjectAction Methods
The GH_RemoveObjectAction type exposes the following members.
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
See Also
Reference
GH_RemoveObjectAction Class
Grasshopper.Kernel.Undo.Actions Namespace