Grasshopper API
GH_Variant Methods
The GH_Variant type exposes the following members.
Methods
Name | Description
Data<T>
 Perform a straight cast of the data inside this Variant.
Duplicate
 Duplicate this Variant. If the type of this Variant is [unknown] the contents are not guaranteed to be duplicated.
Evaluate
 If this variant represents a string, this function will attempt to evaluate that string and replace the data inside this variant.
ToGoo
 Attempt to convert a Variant to a Grasshopper IGH_Goo type.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace