Grasshopper API
GH_Format Methods
The GH_Format type exposes the following members.
Methods
Name | Description
Create(IGH_Content, GH_Style)
Create(String, GH_Style)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_Format Class
Grasshopper.Documentation Namespace