Grasshopper API
ModelDetailViewport Methods
The ModelDetailViewport type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelSpaceViewport.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelDetailViewport Class
Grasshopper.Rhinoceros.Display Namespace