Grasshopper API
GH_UndoRecord Methods
The GH_UndoRecord type exposes the following members.
Methods
Name | Description
AddAction
 Append an undo action to this record. You should only do this prior to calling undo for the first time.
Redo
Undo
Top
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace