Grasshopper API
ModelRenderTexture Methods
The ModelRenderTexture type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelRenderTexture Class
Grasshopper.Rhinoceros.Render Namespace