Grasshopper API
PointCloudProxy Methods
The GH_PointCloud.PointCloudProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace