Grasshopper API
GH_FontPicker Methods
The GH_FontPicker type exposes the following members.
Methods
Name | Description
CreateFontPickerWindow
 Create a new window containing a Font Picker object and OK, Cancel buttons. Picked fonts will be stored in the Tag field of the form.
Dispose |  (Overrides ContainerControl.Dispose(Boolean).)
ShowFontPickerWindow(Font)
 Display the fontpicker in a window.
ShowFontPickerWindow(Font, Form)
 Display the fontpicker in a window.
Top
Extension Methods
Name | Description
ToEto |  (Defined by EtoExtensions.)
Top
See Also
Reference
GH_FontPicker Class
Grasshopper.GUI Namespace