Grasshopper API
GH_Compression Methods
The GH_Compression type exposes the following members.
Methods
Name | Description
Compress
 Compress an array of bytes using the Deflate algorithm.
Decompress
 Decompress an array of bytes using the Deflate algorithm.
Top
See Also
Reference
GH_Compression Class
GH_IO.Serialization Namespace