Grasshopper API
GH_QuickImageEditor Methods
The GH_QuickImageEditor type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace