Grasshopper API
GH_DebugDescriptionWriter Methods
The GH_DebugDescriptionWriter type exposes the following members.
Methods
Name | Description
CloseBlock
 Close the current block and decrease the depth by 1.
CreateBlock
 Begin a new block. This will increase the depth by 1. You must call CloseBlock() if you call this function.
CreateLog
 Get a single string that represents the entire log so far.
WriteLine()
 Write a new blank line to the log.
WriteLine(String)
 Write a new line to the log.
WriteLine(String, Object[])
 Write a new formatted line to the log.
WriteLogToFile
 Write the log to a text file.
Top
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace