Grasshopper API
PageSettings Methods
The PageSettings type exposes the following members.
Methods
Name | Description
ToAttributes
Top
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace