Grasshopper API
GH_TagArtist Methods
The GH_TagArtist type exposes the following members.
Methods
Name | Description
Paint
 This method is called whenever a Canvas channel is painted
Top
See Also
Reference
GH_TagArtist Class
Grasshopper.GUI.Canvas.TagArtists Namespace