Grasshopper API
Param_ObjectDraftingLinetype Methods
The Param_ObjectDraftingLinetype type exposes the following members.
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
Top
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace