Grasshopper API
GH_GlossaryItem Methods
The GH_GlossaryItem type exposes the following members.
Methods
Name | Description
ParseFile
 Parse a *.glossary file and return a glossary entry.
Top
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace