Grasshopper API
GH_PointProxy Methods
The GH_Point.GH_PointProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
SrfRefChanged
Top
See Also
Reference
GH_Point.GH_PointProxy Class
Grasshopper.Kernel.Types Namespace