Grasshopper API
GH_LoadProtectDialog Methods
The GH_LoadProtectDialog type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
SetAssemblyName
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_LoadProtectDialog Class
Grasshopper.GUI Namespace