Grasshopper API
ModelObject Methods
The ModelObject type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
GetBoundingBox
ToAttributes
TooltipString |  (Overrides ModelContent.TooltipString().)
ToString |  (Overrides ModelContent.ToString().)
Top
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace