Grasshopper API
GH_SurfaceProxy Methods
The GH_Surface.GH_SurfaceProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
GH_Surface.GH_SurfaceProxy Class
Grasshopper.Kernel.Types Namespace