Grasshopper API
GH_BrepProxy Methods
The GH_Brep.GH_BrepProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
GH_Brep.GH_BrepProxy Class
Grasshopper.Kernel.Types Namespace