Grasshopper API
GH_Text Methods
The GH_Text type exposes the following members.
Methods
Name | Description
Create
 Create a new instance of GH_Text.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_Text Class
Grasshopper.Documentation Namespace