Grasshopper API
IGH_StateTag Methods
The IGH_StateTag type exposes the following members.
Methods
Name | Description
Render
 Render this tag into a graphics surface.
Top
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace