Grasshopper API
GH_LineParser Methods
The GH_LineParser type exposes the following members.
Methods
Name | Description
ParseLine
 Parse a line of text and convert it to custom data.
Top
See Also
Reference
GH_LineParser Class
Grasshopper.Kernel Namespace