Grasshopper API
GH_Matrix Methods
The GH_Matrix type exposes the following members.
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
CloneMatrix
 Duplicates a Matrix.
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateMatrix
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_Matrix Class
Grasshopper.Kernel.Types Namespace