Grasshopper API
ModelNamedConstructionPlane Methods
The ModelNamedConstructionPlane type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelNamedConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace