Grasshopper API
GH_PersistentReferenceParam<T> Methods
The GH_PersistentReferenceParam<T> generic type exposes the following members.
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
OnVolatileDataCollected |  (Overrides GH_Param<T>.OnVolatileDataCollected().)
Top
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace