Grasshopper API
GH_InstanceReferenceProxy Methods
The GH_InstanceReference.GH_InstanceReferenceProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_InstanceReference.GH_InstanceReferenceProxy Class
Grasshopper.Kernel.Types Namespace