Grasshopper API
GH_Capsule Methods
The GH_Capsule type exposes the following members.
Methods
Name | Description
AddInputGrip(Point)
 Add an input grip to this UI Box.
AddInputGrip(PointF)
 Add an input grip to this UI Box.
AddInputGrip(Single)
 Add an input grip to this UI Box. This is the recommended overload.
AddInputGrip(Single, Single)
 Add an input grip to this UI Box.
AddOutputGrip(Point)
 Add an output grip to this UI Box.
AddOutputGrip(PointF)
 Add an output grip to this UI Box.
AddOutputGrip(Single)
 Add an output grip to this UI Box. This is the recommended overload.
AddOutputGrip(Single, Single)
 Add an output grip to this UI Box.
Contains
 Test a point for capsule containment.
CreateCapsule(Rectangle, GH_Palette)
 Create a new blank capsule with default radius and highlight dimensions.
CreateCapsule(RectangleF, GH_Palette)
 Create a new blank capsule with default radius and highlight dimensions.
CreateCapsule(Rectangle, GH_Palette, Int32, Int32)
 Create a new blank capsule.
CreateCapsule(Rectangle, GH_Palette, Int32[], Int32)
 Create a new blank capsule.
CreateCapsule(RectangleF, GH_Palette, Int32, Int32)
 Create a new blank capsule.
CreateCapsule(RectangleF, GH_Palette, Int32[], Int32)
 Create a new blank capsule.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, GH_Orientation)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, GH_Orientation)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, GH_Orientation, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, GH_Orientation, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, GH_Orientation, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, GH_Orientation, Int32[], Int32)
 Create a new capsule with content text.
Dispose()
Dispose(Boolean)
Render(Graphics, GH_PaletteStyle)
 Have this capsule draw itself onto a Graphics surface with a custom Style override.
Render(Graphics, Color)
 Have this capsule draw itself onto a Graphics surface with a custom colour override.
Render(Graphics, Image, GH_PaletteStyle)
 Have this capsule draw itself onto a Graphics surface with a custom Style override.
Render(Graphics, Image, Color)
 Have this capsule draw itself onto a Graphics surface with a custom colour override.
Render(Graphics, Boolean, Boolean, Boolean)
 Render the capsule onto a graphics context.
Render(Graphics, Image, Boolean, Boolean, Boolean)
 Render the capsule onto a graphics context.
SetJaggedEdges
 Assign left and right jagged edges.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace