Grasshopper API
GH_State Methods
The GH_State type exposes the following members.
Methods
Name | Description
AddStateObject
 Append a new object to the database.
ClearStates
 Removes all items from the state database.
CreateStateFromDocument
 Creates a state database from a document.
Read
RemoveStateObject
 Remove an object from the database.
Write
Top
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace