Grasshopper API
Scale Methods
The Scale type exposes the following members.
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Scale Class
Grasshopper.Kernel.Types.Transforms Namespace