Grasshopper API
Value Methods
The ObjectRenderMaterial.Value type exposes the following members.
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectRenderMaterial.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectRenderMaterial.Value)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetHashCode(IEqualityComparer)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace