Grasshopper API
GH_FileWatcher Methods
Methods
Name | Description
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents, GH_FileWatcher.FileChanged)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents, GH_FileWatcher.FileChangedSimple)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateFileWatcher(String, GH_FileWatcherEvents, GH_FileWatcher.FileChanged)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateFileWatcher(String, GH_FileWatcherEvents, GH_FileWatcher.FileChangedSimple)
 Create a new FileSystem Watcher object aimed at a specific file.
Dispose()
Dispose(Boolean)
SetCustomUIThread(Control)
 If you want to override the default Invoke behaviour, you must set InvokeOnDefaultThread to False and supply either a custom Control or a Form.
SetCustomUIThread(Form)
 If you want to override the default Invoke behaviour, you must set InvokeOnDefaultThread to False and supply either a custom Control or a Form.
Top
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace