Grasshopper API
GH_ResizeBorder Methods
The GH_ResizeBorder type exposes the following members.
Methods
Name | Description
Setup(IGH_Attributes, PointF)
 Set up a new sizing operation.
Setup(IGH_Attributes, PointF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF)
 Set up a new sizing operation.
Setup(IGH_Attributes, PointF, SizeF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF, SizeF, SizeF)
 Set up a new sizing operation.
Solve
 Solve a resizing step.
Top
See Also
Reference
GH_ResizeBorder Class
Grasshopper.GUI.Canvas Namespace