Grasshopper API
Attributes Methods
The ClippingArrow.Attributes type exposes the following members.
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelData.Attributes.ToString().)
Top
See Also
Reference
ClippingArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace