Grasshopper API
Param_RadialDimension Methods
The Param_RadialDimension type exposes the following members.
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
DrawViewportMeshes
DrawViewportWires
HtmlHelp_Source |  (Overrides GH_DocumentObject.HtmlHelp_Source().)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
Top
See Also
Reference
Param_RadialDimension Class
Grasshopper.Kernel.Parameters Namespace