Grasshopper API
DataTree<T> Methods
The DataTree<T> generic type exposes the following members.
Methods
Name | Description
Add(T)
 Add (append) a data item to the last branch in the tree. If no branches exist yet, a new one will be created with [path = {0}]
Add(T, GH_Path)
 Add (append) a data item to the specified branch in the tree. If the branch doesn't exist yet, it will be created.
AddRange(IEnumerable<T>)
 Add (append) a list of data items to the last branch in the tree. If no branch exists yet, a new one will be created.
AddRange(IEnumerable<T>, GH_Path)
 Add (append) a list of data items to the specified branch in the tree. If the branch doesn't exist yet, it will be created.
AllData
 Collects all data in the tree in a single list. Does not alter the topology of this tree.
Branch(GH_Path)
 Gets the list of data which belongs to a given Branch path.
Branch(Int32)
 Gets the list of data which belongs to the branch path at the given index.
Branch(Int32[])
 Gets the list of data which belongs to a given Branch path.
Clear
 Clears the entire tree.
ClearData
 Removes all data from all branches without affecting the tree topology.
EnsurePath(GH_Path)
 Create a new branch with the specified path if it doesn't already exists.
EnsurePath(Int32[])
 Create a new branch with the specified path if it doesn't already exists.
Flatten
 Flattens the entire tree into a single path.
Graft(Boolean)
 Graft all paths in this tree. "Grafting" means appending a new branch for every item in an existing branch.
Graft(GH_Path, Boolean)
 Graft a single path in the tree. "Grafting" means appending a new branch for every item in an existing branch.
Insert
 Insert a data item to the specified branch in the tree. If the branch doesn't exist yet, it will be created.
ItemExists
 Test if the specified path + item index are defined inside the tree.
MergeTree
 Merges two trees together. Data inside similar branches will be merged into single lists and unique paths will be appended. The other tree will not be altered, so beware that data is now shared among both trees.
Path
 Gets the data path at the specified index.
PathExists(GH_Path)
 Test if the specified path is already defined inside the tree.
PathExists(Int32[])
 Test if the specified path is already defined inside the tree.
RemovePath(GH_Path)
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
RemovePath(Int32[])
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
RenumberPaths()
 Renumber all paths in this data tree, using a single incrementing path index.
RenumberPaths(String)
 Renumber all paths in this data tree, using a single incrementing path index.
SimplifyPaths
 Simplify the branches in this tree by removing all identical path entries. The length of the shortest path will be indicative of the similarity search depth. If this tree only contains a single branch, the branch wil be simplified to its last index.
ToString
 Creates a brief description of the tree.
 (Overrides Object.ToString().)
TrimExcess
 Trims the excess allocated memory in all branches
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace