Grasshopper API
GH_FontServer Methods
The GH_FontServer type exposes the following members.
Methods
Name | Description
FontToString
 Convert a font to a string.
MeasureString(String, Font)
 Measure the size of a string
MeasureString(String, Font, SizeF)
 Measure the size of a string
MeasureString(String, Font, Single)
 Measure the size of a string
NewFont(Font, FontStyle)
 Safe font constructor.
NewFont(Font, Single)
 Safe font constructor.
NewFont(FontFamily, Single)
 Safe font constructor.
NewFont(Font, Single, FontStyle)
 Safe font constructor.
NewFont(FontFamily, Single, FontStyle)
 Safe font constructor.
NewFont(String, Single, FontStyle)
 High level function for Font creation. We've ran into loads of trouble in the past with missing Fonts. Never create a font directly via GDI+, always use this method.
StringToFont
 Convert a font description string back into a font.
StringWidth(IEnumerable<String>, Font)
 Measure the maximum width of a collection of strings
StringWidth(String, Font)
 Measure the width of a string in pixels
Top
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace