Grasshopper API
Attributes Methods
The AnnotationArrowSettings.Attributes type exposes the following members.
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace