Grasshopper API
Value Methods
The ModelUnitSystem.Value type exposes the following members.
Methods
Name | Description
AdjustDocumentUnitSystem
CompareTo(Object)
CompareTo(ModelUnitSystem.Value)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ModelUnitSystem.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToLengthUnit
ToNonCustomUnitSystem
ToString |  (Overrides ValueType.ToString().)
ToUnitSystem
Top
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace