Grasshopper API
ModelHatchLine Methods
The ModelHatchLine type exposes the following members.
Methods
Name | Description
Cast
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToHatchLine
ToString |  (Overrides ModelValue.ToString().)
Top
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace