Grasshopper API
GH_Line Methods
The GH_Line type exposes the following members.
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_Line Structure
GH_IO.Types Namespace