Grasshopper API
IGH_SettingFrontend Methods
The IGH_SettingFrontend type exposes the following members.
Methods
Name | Description
SettingsUI
 Create the winforms UI portion for this setting.
Top
See Also
Reference
IGH_SettingFrontend Interface
Grasshopper.GUI Namespace