Grasshopper API
Projection Methods
The Projection type exposes the following members.
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Projection Class
Grasshopper.Kernel.Types.Transforms Namespace