Grasshopper API
GH_PathOffset Methods
The GH_PathOffset type exposes the following members.
Methods
Name | Description
OffsetPath(GH_Path, Int32, GH_Path, Int32)
 Offset a path + index value without wrapping.
OffsetPath(GH_Path, Int32, IGH_Structure, GH_Path, Int32)
 Offset a path + index value with wrapping and bounds checking.
ParseString
ToString
 Format the Path Offset.
 (Overrides Object.ToString().)
Top
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace