Grasshopper API
Param_ModelRenderSun Methods
The Param_ModelRenderSun type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
See Also
Reference
Param_ModelRenderSun Class
Grasshopper.Rhinoceros.Render.Params Namespace