Grasshopper API
IGH_Rule Methods
The IGH_Rule type exposes the following members.
Methods
Name | Description
Apply
 Applies this rule to an integer.
Top
See Also
Reference
IGH_Rule Interface
Grasshopper.Kernel.Data Namespace