Grasshopper API
ModelUserText Methods
The ModelUserText type exposes the following members.
Methods
Name | Description
ContainsKey
EnsureRange(IEnumerable<KeyValuePair<String, String>>)
EnsureRange(IEnumerable<String>)
Equals(ModelUserText)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetEnumerator
GetHashCode |  (Overrides ValueType.GetHashCode().)
MergeRange(IEnumerable<KeyValuePair<String, String>>)
MergeRange(IEnumerable<String>)
RemoveRange(IEnumerable<KeyValuePair<String, String>>)
RemoveRange(IEnumerable<String>)
TryGetValue
UpdateRange(IEnumerable<KeyValuePair<String, String>>)
UpdateRange(IEnumerable<String>)
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace