Grasshopper API
IGH_ZuiAction Methods
The IGH_ZuiAction type exposes the following members.
Methods
Name | Description
Perform
 This method will be called when the action needs to be performed.
Top
See Also
Reference
IGH_ZuiAction Interface
Grasshopper.Kernel Namespace