Grasshopper API
Node3d<T> Methods
The Node3d<T> generic type exposes the following members.
Methods
Name | Description
Add
 Insert another item into the tree. The item should be within the region of this node.
AddRange
 Insert a collection of items into the tree. The items should all be within the region of this node.
AddToRhinoDocument
CollapseNodes
 Collapse the (sub)tree rooted at this node. Collapsing happens when a node only has a single child, in which case the child usurps the position previously held by the parent. Do not collapse a (sub)tree if you still plan to add items later.
FurthestItem(T)
 Find the furtest item.
FurthestItem(Point3d)
 Find the furtest item.
FurthestItem(Double, Double, Double)
 Find the furtest item.
FurthestItem(T, Double, Double)
 Find the furtest item.
FurthestItem(Point3d, Double, Double)
 Find the furtest item.
FurthestItem(Double, Double, Double, Double, Double)
 Find the furtest item.
NearestItem(T)
 Find the nearest item.
NearestItem(Point3d)
 Find the nearest item.
NearestItem(Double, Double, Double)
 Find the nearest item.
NearestItem(T, Double, Double)
 Find the nearest item.
NearestItem(Point3d, Double, Double)
 Find the nearest item.
NearestItem(Double, Double, Double, Validation3d<T>)
 Find the nearest item using custom validation criteria.
NearestItem(Double, Double, Double, Double, Double)
 Find the nearest item.
NearestItems(T, Int32)
 Find the N nearest items.
NearestItems(Double, Double, Double, Int32)
 Find the N nearest items.
NearestItems(T, Int32, Double, Double)
 Find the N nearest items.
NearestItems(Double, Double, Double, Int32, Double, Double)
 Find the N nearest items.
OptimizeTree
 Optimize this tree for fast searches. Do not call this method if you still plan to add items in the future. You can no longer modify this tree once it has been optimized.
Remove(Index3d<T>)
 Remove the item with the given index from the entire tree. It doesn't matter on which node you call this function, it is a tree-wide operation.
Remove(Int32)
 Remove the item with the given index from the entire tree. It doesn't matter on which node you call this function, it is a tree-wide operation.
ShrinkRegions
 Shrink the region for this node and all child nodes. Do not use this method if you intend to add more items later as it creates spatial gaps in the tree structure. You can shrink nodes if you're done adding items and want to start searching the tree.
SubTree
 Gets an iterator for all nodes in this (sub)tree.
TrimExcess
 Trim the excess space on all index lists. You can call this method to reduce memory usage. It will not modify the tree in any functional way.
Top
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace