Grasshopper API
GH_GDLParser Methods
The GH_GDLParser type exposes the following members.
Methods
Name | Description
ParseGDL
 Convert a GDL text into an actual document.
Top
See Also
Reference
GH_GDLParser Class
Grasshopper.Kernel.GDL Namespace