Grasshopper API
GH_AsynchFileData Methods
The GH_AsynchFileData type exposes the following members.
Methods
Name | Description
Dispose
UpdateProperties
 Updates all file properties on the thread on which this method is called.
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace