Grasshopper API
GH_Interval1D Methods
The GH_Interval1D type exposes the following members.
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_Interval1D Structure
GH_IO.Types Namespace