Grasshopper API
GH_SettingsServer Methods
The GH_SettingsServer type exposes the following members.
Methods
Name | Description
Clear
 Destroy all settings.
ConstainsEntry
 Tests to see if a given entry is stored in this settings database.
DeleteValue
EntryNames
 Gets a list of all the entry names in this settings.
EntryType
 Gets the type of a specific entry.
GetValue(String, Boolean)
GetValue(String, Byte)
GetValue(String, DateTime)
GetValue(String, Double)
GetValue(String, Color)
GetValue(String, Point)
GetValue(String, Rectangle)
GetValue(String, Size)
GetValue(String, Int32)
GetValue(String, String)
Read
 Low-level deserializer.
SetValue(String)
SetValue(String, Boolean)
SetValue(String, Byte)
SetValue(String, DateTime)
SetValue(String, Double)
SetValue(String, Color)
SetValue(String, Point)
SetValue(String, Rectangle)
SetValue(String, Size)
SetValue(String, Int32)
SetValue(String, String)
ShowSettingsBrowser
Write
 Low-level serializer.
WritePersistentSettings
 Store all settings in the xml file now. You must call this function if you want the current settings to persist between sessions.
Top
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace