Grasshopper API
IGH_UndoAction Methods
The IGH_UndoAction type exposes the following members.
Methods
Name | Description
Redo
 Redo the action stored in this record.
Undo
 Undo the action stored in this record.
Top
See Also
Reference
IGH_UndoAction Interface
Grasshopper.Kernel.Undo Namespace