Grasshopper API
GH_MeshingParameters Methods
The GH_MeshingParameters type exposes the following members.
Methods
Name | Description
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateMesherSettings
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_MeshingParameters Class
Grasshopper.Kernel.Types Namespace