Grasshopper API
GH_Canvas Methods
The GH_Canvas type exposes the following members.
Methods
Name | Description
AddTagArtist
 Add a Tag Artist instance to this canvas.
AddValidator
 Add a new drop validator to the canvas.
AutoSaveDocument
CanvasOldSchoolMenu
CreateMRUPanels
 Create new MRU panels. This function only does something if there is no document loaded in the canvas.
CreatePreview
 Render this canvas to a thumbnail preview.
DestroyMRUPanels
 Destroy any MRU panels that might be in existence.
Dispose |  (Overrides Control.Dispose(Boolean).)
GenerateHiResImage
 Generate a collection of hi-res images of the document.
GenerateHiResImageTile
 Generate a single tile in a Hi-Res image export.
GetCanvasScreenBuffer
 Get a bitmap that resembles the current state of the canvas.
GetGraphicsObject
 Gets a graphics object for this control. You are not allowed to draw with this object, use it only for visibility testing and such. If you're inside a canvas update, use the Graphics() property instead. You must dispose of the Graphics object returned by this method or resources will be leaked.
HideMRUPanels
 Hide all existing MRU panels by sliding them out of view.
InstantiateNewObject(Guid, PointF, Boolean)
InstantiateNewObject(Guid, String, PointF, Boolean)
Navigate
 Perform a single navigation step.
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides Control.OnPaintBackground(PaintEventArgs).)
OnViewportChanged
 Ensure the canvas and document viewport data are synchronised and raises the ViewportChanged event.
ReevaluateMarkovSuggestions
RemoveAllTagArtists
 Remove all IGH_TagArtists from this canvas. Do not use this method unless you want to screw over everyone else.
RemoveTagArtist(Guid)
 Remove all IGH_TagArtists from this canvas that match a certain ID.
RemoveTagArtist(IGH_TagArtist)
 Remove a specific tag artist from this canvas. If the instance occurs multiple times in the TagArtist list, all instances will be removed.
RemoveValidator
 Remove a drop validator from the canvas.
ScheduleRegen
 Schedule a regen to occur after the specified number of milliseconds have elapsed. If a Regen is called in this time frame, the schedule will be cleared. Only a single schedule can be active at any time, so any call to ScheduleRegen will clear existing schedules.
SetSmartTextRenderingHint
 When this method is called during a redraw, the TextRenderingHint of the associated graphics object will be set to either GH_CrispText or GH_SmoothText depending on zoom level.
ShowComponentSearchBox()
 Display the component Search dialog at the current mouse location. The dialog cannot be shown if ModifiersEnabled=False.
ShowComponentSearchBox(Point)
 Display the component Search dialog at the given coordinate. The dialog cannot be shown if ModifiersEnabled=False.
ShowMRUPanels
 Show any hidden MRU panels by sliding them back into view.
ShowNavigationPane
 Displays the quick-navigation popup pane at the cursor.
ShowSearchDialog
 Display the Find dialog. If a Find dialog is already active for this canvas, nothing will happen.
StartAutoPan
 Start the auto-panning timer.
StopAutoPan
 Stop the auto-panning timer.
UpdateDocumentPreview
 Call this method to update the preview thumbnail for the currently loaded document. If no document is currently loaded, nothing will happen.
Top
Extension Methods
Name | Description
ToEto |  (Defined by EtoExtensions.)
Top
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace