Grasshopper API
GH_Point2D Methods
The GH_Point2D type exposes the following members.
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_Point2D Structure
GH_IO.Types Namespace