Grasshopper API
Attributes Methods
The ObjectRender.Attributes type exposes the following members.
Methods
Name | Description
Equals(ObjectRender.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace