Grasshopper API
GH_MenuTextBox Methods
The GH_MenuTextBox type exposes the following members.
Methods
Name | Description
CloseEntireMenuStructure
 Call this function to close the ENTIRE menu structure.
Top
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace