Grasshopper API
GH_RectangleProxy Methods
The GH_Rectangle.GH_RectangleProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Rectangle.GH_RectangleProxy Class
Grasshopper.Kernel.Types Namespace