Grasshopper API
GH_Author Methods
The GH_Author type exposes the following members.
Methods
Name | Description
Clear
 Erase all fields.
Read
Write
Top
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace