Grasshopper API
ModelEarthAnchorPoint Methods
The ModelEarthAnchorPoint type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
TooltipString |  (Overrides ModelContent.TooltipString().)
ToString |  (Overrides ModelContent.ToString().)
Top
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace