Grasshopper API
IGH_FieldElement Methods
The IGH_FieldElement type exposes the following members.
Methods
Name | Description
Duplicate
 Create an exact copy of this element.
Force
 Compute the force at a given location.
IsCoincident
 Computes whether the point can be considered coincident with the element.
Top
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace