Grasshopper API
Param_ModelInstanceDefinition Methods
The Param_ModelInstanceDefinition type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
See Also
Reference
Param_ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model.Params Namespace