Grasshopper API
GH_VerticalSeparator Methods
The GH_VerticalSeparator type exposes the following members.
Methods
Name | Description
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
Extension Methods
Name | Description
ToEto |  (Defined by EtoExtensions.)
Top
See Also
Reference
GH_VerticalSeparator Class
Grasshopper.GUI Namespace