Grasshopper API
AnnotationTextSettings Methods
The AnnotationTextSettings type exposes the following members.
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace