Grasshopper API
GH_ExternalFileConflictDialog Methods
The GH_ExternalFileConflictDialog type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace