Grasshopper API
IGH_TagArtist Methods
The IGH_TagArtist type exposes the following members.
Methods
Name | Description
Paint
 This method is called whenever a Canvas channel is painted
Top
See Also
Reference
IGH_TagArtist Interface
Grasshopper.GUI.Canvas.TagArtists Namespace