Grasshopper API
ClippingDrawingSettings Methods
The ClippingDrawingSettings type exposes the following members.
Methods
Name | Description
ToAttributes
Top
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace