Grasshopper API
GH_ObjectWrapper Methods
The GH_ObjectWrapper type exposes the following members.
Methods
Name | Description
BakeGeometry
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateObject
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Top
See Also
Reference
GH_ObjectWrapper Class
Grasshopper.Kernel.Types Namespace