Grasshopper API
Param_DisplayColorGradient Methods
The Param_DisplayColorGradient type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace