Grasshopper API
GH_ScriptVariant Methods
The GH_ScriptVariant type exposes the following members.
Methods
Name | Description
ThrowNullOperatorException
ThrowOperatorException(String, GH_ScriptVariantType)
ThrowOperatorException(String, String)
ThrowOperatorException(String, GH_ScriptVariantType, GH_ScriptVariantType)
ThrowOperatorException(String, String, String)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace