Grasshopper API
GH_CanvasWidgetListEventArgs Methods
The GH_CanvasWidgetListEventArgs type exposes the following members.
Methods
Name | Description
AddWidget
 Append a widget to the canvas.
Top
See Also
Reference
GH_CanvasWidgetListEventArgs Class
Grasshopper.GUI.Canvas Namespace