Grasshopper API
GH_IndexRange Methods
The GH_IndexRange type exposes the following members.
Methods
Name | Description
AdjacentTo
 Tests whether this range is adjacent to another.
Contains(GH_IndexRange)
 Tests whether a specified range is entirely contained within this range.
Contains(Int32)
 Tests whether a specified index is defined by this range.
Intersection
 Create the intersection between two ranges.
IntersectsWith
 Tests whether certain indices are described by both this and another range.
Split
 Split a range into two using an integer index.
ToString |  (Overrides ValueType.ToString().)
Union
 Create a range which contains both input ranges.
Top
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace