Grasshopper API
Attributes Methods
The PageSettings.Attributes type exposes the following members.
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelData.Attributes.ToString().)
Top
See Also
Reference
PageSettings.Attributes Class
Grasshopper.Rhinoceros.Display Namespace