Grasshopper API
Value Methods
The ObjectDraftingColor.Value type exposes the following members.
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingColor.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingColor.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace