Grasshopper API
Attributes Methods
The ModelHatchLine.Attributes type exposes the following members.
Methods
Name | Description
Equals(ModelHatchLine.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
From
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToHatchLine
Top
See Also
Reference
ModelHatchLine.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace