Grasshopper API
GH_DigitNumber Methods
The GH_DigitNumber type exposes the following members.
Methods
Name | Description
AssignOffset
 Assign an offset to a given digit and recursively adjust all leftwards offsets if needed.
LimitValue
 Limits the value to the minimum and maximum domain.
Reset
 Reset all parts to zero.
Round
 Round the number by cancelling the offset in the proper direction.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace