Grasshopper API
IGH_InitCodeAware Methods
The IGH_InitCodeAware type exposes the following members.
Methods
Name | Description
SetInitCode
 This method will be called when the user inserts an object via the Canvas Search popup and supplies an "=XXXX" string init code. Do not throw exceptions in this method! Either handle the code correctly or ignore it.
Top
See Also
Reference
IGH_InitCodeAware Interface
Grasshopper.Kernel Namespace