Grasshopper API
GH_PointUtil Methods
The GH_PointUtil type exposes the following members.
Methods
Name | Description
FitPlaneThroughPoints
 Fit a least-squares plane through a collection of points.
ProjectPointsToPlane
 Project a list of points onto the plane. The result will be points in plane-uv coordinates.
PullPointsToPlane
 Pull a list of points onto the plane. The result will be points in 3D world coordinates which are coincident with the given plane.
RemapPointsToPlane
 Remap a list of points onto the plane. This operation equals a ChangeBasisXForm for each point.
Top
See Also
Reference
GH_PointUtil Class
Grasshopper.Kernel.Types Namespace