Grasshopper API
GH_ListUtil Methods
The GH_ListUtil type exposes the following members.
Methods
Name | Description
CountNonNullRefs<T>
 Count all object references in L
CountNullRefs<T>
 Count all null references in L
EnsureNonNullCount<T>
 Tests a list to see if it contains sufficient non-null references.
FirstNonNullItem<T>
 Returns the index of the first non-null item in a list.
RemoveNullRefs<T>
 Remove all null references from a list of items.
Top
See Also
Reference
GH_ListUtil Class
Grasshopper.Kernel Namespace