Grasshopper API
GH_TooltipComponent Methods
The GH_TooltipComponent type exposes the following members.
Methods
Name | Description
Hide
IsTag
 Test whether the current Tooltip tag matches the object.
Top
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace