Grasshopper API
GH_VoronoiWarningForm Methods
The GH_VoronoiWarningForm type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_VoronoiWarningForm Class
Grasshopper.GUI Namespace