Grasshopper API
IGH_PreviewData Methods
The IGH_PreviewData type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
 Implement this function to draw all shaded meshes. If the viewport does not support shading, this function will not be called.
DrawViewportWires
 Implement this function to draw all wire and point previews.
Top
See Also
Reference
IGH_PreviewData Interface
Grasshopper.Kernel Namespace