Grasshopper API
GH_Centermark Methods
The GH_Centermark type exposes the following members.
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateCentermark
 Create a duplicate of this centermark.
ToString
 Format the centermark using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
See Also
Reference
GH_Centermark Class
Grasshopper.Kernel.Types Namespace