Grasshopper API
GH_FontList Methods
The GH_FontList type exposes the following members.
Methods
Name | Description
CreateFont
 Create a font that best approximates the current settings.
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
RecreateFontList
Top
Extension Methods
Name | Description
ToEto |  (Defined by EtoExtensions.)
Top
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace