Grasshopper API
GH_GeometryGroup Methods
The GH_GeometryGroup type exposes the following members.
Methods
Name | Description
AppendRenderGeometry
BakeGeometry
CastFrom
CastTo<T>
ClearCaches
DrawViewportMeshes
DrawViewportWires
Duplicate
DuplicateGeometry
EmitProxy
GetBoundingBox
LoadGeometry()
LoadGeometry(RhinoDoc)
Morph
Read
ScriptVariable
ToString |  (Overrides Object.ToString().)
Transform
Write
Top
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace