Grasshopper API
ModelUnitSystem Methods
The ModelUnitSystem type exposes the following members.
Methods
Name | Description
AdjustDocumentUnitSystem
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Copy
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
TooltipString |  (Overrides ModelValue.TooltipString().)
Top
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace