Grasshopper API
GH_ConnectivityDisparity Methods
The GH_ConnectivityDisparity type exposes the following members.
Methods
Name | Description
ExternalInputs
 Find all external sources for a given id in the subset.
ExternalOutputs
 Find all external recipients for a given id in the subset.
InternalInputs
 Find all internal sources for a given id in the subset.
InternalOutputs
 Find all external recipients for a given id in the subset.
Top
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace