Grasshopper API
Versioning Methods
The Versioning type exposes the following members.
Methods
Name | Description
SyncVersionHistoryData
 Attempts to download the version history information. The downloaded data (if the download works) will eventually be stored at: Grasshopper.Folders.VersionHistoryFile
VersionHistoryData
 Gets the currently most up-to-date version history data.
Top
See Also
Reference
Versioning Class
Grasshopper Namespace