Grasshopper API
GH_ColourPickerBase Methods
The GH_ColourPickerBase type exposes the following members.
Methods
Name | Description
Invalidate
 Raise the Invalidated event.
MouseClick
 Respond to mouse-click events.
MouseDoubleClick
 Respond to mouse-doubleclick events.
MouseDown
 Respond to mouse-down events.
MouseMove
 Respond to mouse-move events.
MouseUp
 Respond to mouse-up events.
OnColorChanged
 Raise the ColorChanged event.
Render
 Render this slider into a Graphics context.
RespondToEnter
RespondToEscape
SetUiScaling
SetupColourPicker(Color, Point4d, GH_ColourSpace)
 Setup all UI elements.
SetupColourPicker(Color, Color, GH_ColourSpace)
 Setup all UI elements.
Top
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace