Grasshopper API
ObjectDisplayColor Methods
The ObjectDisplayColor type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Top
See Also
Reference
ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace