Grasshopper API
GH_IChunk Methods
The GH_IChunk type exposes the following members.
Methods
Name | Description
AddMessage
 Log a new message with the top-level archive. Messages are collected during read/write operations, and can be displayed to the user upon completion using GH_Archive.ShowMessageLog().
Top
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace