Grasshopper API
Param_ModelTextureMapping Methods
The Param_ModelTextureMapping type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
See Also
Reference
Param_ModelTextureMapping Class
Grasshopper.Rhinoceros.Render.Params Namespace