Grasshopper API
GH_SubD Methods
The GH_SubD type exposes the following members.
Methods
Name | Description
AppendRenderGeometry
BakeGeometry
CastFrom |  (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches |  (Overrides GH_GeometricGoo<T>.ClearCaches().)
DestroyPreviewMeshes
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry |  (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateSubD
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
GetPreviewMeshes
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace