Grasshopper API
GH_IndexRuleSet Methods
The GH_IndexRuleSet type exposes the following members.
Methods
Name | Description
AddAnyDigitRule
 Append a rule for any single digit.
AddAnyDigitsRule
 Append a rule for any amount of digits.
AddDigitPatternRule(Int32[])
 Append a rule for filtering digit patterns.
AddDigitPatternRule(Int32, Int32)
 Append a rule for filtering digit patterns. This pattern does not have an upper bound.
AddDigitPatternRule(Int32, Int32, Int32)
 Append a rule for filtering digit patterns.
AddDigitRule
 Append a single digit rule.
AddRangePatternRule
 Append a rule for filtering range patterns.
AddRangeRule
 Append a single range rule.
Evaluate
 Evaluate the index given the local rules.
Top
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace