Grasshopper API
GH_IBinarySupport Methods
The GH_IBinarySupport type exposes the following members.
Methods
Name | Description
Read
 Called when an object is required to deserialize itself.
Write
 Called when an object is required to serialize itself.
Top
See Also
Reference
GH_IBinarySupport Interface
GH_IO.Serialization Namespace