Grasshopper API
ITransform Methods
The ITransform type exposes the following members.
Methods
Name | Description
Duplicate
Reverse
ToMatrix
ToString
Top
See Also
Reference
ITransform Interface
Grasshopper.Kernel.Types.Transforms Namespace