Grasshopper API
Identity Methods
The Identity type exposes the following members.
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Identity Class
Grasshopper.Kernel.Types.Transforms Namespace