Grasshopper API
GH_GeometricGoo<T> Methods
The GH_GeometricGoo<T> generic type exposes the following members.
Methods
Name | Description
CastFrom
 Attempt a cast from generic object.
 (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<Q>(Q)
 Attempt a cast to type T.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all caches. Typically if the geometry is referenced, this will erase the local copy. If your T is a value-type, you must override this function and specifically unset the local value.
Duplicate
 Make a complete duplicate of this instance. No shallow copies.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateGeometry
 Make a complete duplicate of this geometry. No shallow copies.
EmitProxy
 Create a new proxy for this instance. Return Null if this class does not support proxies.
 (Overrides GH_Goo<T>.EmitProxy().)
GetBoundingBox
 Compute an aligned boundingbox.
LoadGeometry()
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
LoadGeometry(RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
Morph
 Morph the object or a deformable representation of the object.
Transform
 Transforms the object or a deformable representation of the object.
Top
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace