Grasshopper API
ModelFont Methods
The ModelFont type exposes the following members.
Methods
Name | Description
Cast
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
Equals(ModelFont)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
IsFamilyNameInstalled
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace