Grasshopper API
GH_ParserOperator Methods
The GH_ParserOperator type exposes the following members.
Methods
Name | Description
CompareTo
Equals |  (Overrides Object.Equals(Object).)
Top
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace