Grasshopper API
GH_EtoUtil Methods
The GH_EtoUtil type exposes the following members.
Methods
Name | Description
CenterFormOnCursor
 Positions a Form so that it is centered around the cursor
CenterFormOnEditor
 Positions a Form so that it is centered on the active editor. If the editor doesn't exist or is hidden, the form will be centered on the screen instead.
CenterFormOnScreen
 Positions a Form so that it is centered on the current screen. The current screen being defined as the screen containing the cursor.
CenterFormOnWindow
 Positions a Form so that it is centered on the supplied window. If the window doesn't exist or is hidden, the form will be centered on the screen instead.
Top
See Also
Reference
GH_EtoUtil Class
Grasshopper.GUI Namespace