Grasshopper API
GH_Transform Methods
The GH_Transform type exposes the following members.
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<Q>(Q) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
ClearCaches
 Erase the compound transformation caches.
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
EmitProxy
 Returns a proxy that represents this transform. Do not call this function unless you're
 (Overrides GH_Goo<T>.EmitProxy().)
GetInverse
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace