Grasshopper API
Rotation Methods
The Rotation type exposes the following members.
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Rotation Class
Grasshopper.Kernel.Types.Transforms Namespace