Grasshopper API
GH_VectorProxy Methods
The GH_Vector.GH_VectorProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
ToString |  (Overrides GH_GooProxy<T>.ToString().)
Top
See Also
Reference
GH_Vector.GH_VectorProxy Class
Grasshopper.Kernel.Types Namespace