Grasshopper API
GH_BoundingBox Methods
The GH_BoundingBox type exposes the following members.
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_BoundingBox Structure
GH_IO.Types Namespace