Grasshopper API
GH_Point Methods
The GH_Point type exposes the following members.
Methods
Name | Description
BakeGeometry
CastFrom
CastTo<T>
ClearCaches
CreateFromCoordinate
 Create a new point geometry instance based on a fixed coordinate
CreateFromCurveDistance
 Create new point geometry instance based on a curve distance parameter
CreateFromCurveRatio
 Create new point geometry instance based on a curve parameter ratio
CreateFromEdgeDistance
 Create new point geometry instance based on a curve distance parameter
CreateFromEdgeRatio
 Create new point geometry instance based on an edge parameter ratio
CreateFromPointObject
 Create a new point geometry instance based on point object ID. Technically this now also accepts Dot object IDs.
CreateFromSurfaceParam
 Create new point geometry instance based on a curve distance parameter
DrawViewportMeshes
DrawViewportWires
Duplicate
DuplicateGeometry
DuplicatePoint
EmitProxy
EnsureReferenceData
 Creates new Reference data if it doesn't already exists
GetBoundingBox
LoadGeometry()
LoadGeometry(RhinoDoc)
Morph
Read
ReferenceCurve()
ReferenceCurve(RhinoObject)
ReferenceIndex()
 Retrieve the index of the point reference data.
ReferenceIndex(Int32)
 Sets the index of the point reference data.
ReferenceParam(Int32)
 Retrieve the indexed param of the point reference data.
ReferenceParam(Int32, Double)
 Sets the index of the point reference data.
ReferencesCurve
 Returns true if this point is based on a curve reference
ReferencesEdge
 Returns True if this point is based on an edge reference
ReferenceSurface
ReferenceType()
 Retrieve the reference type of this point object.
ReferenceType(GH_PointRefType)
 Sets the type of the point reference data.
ScriptVariable
SetReferenceParams
 Sets both param values of the point reference
ShowReferenceDialog()
ShowReferenceDialog(IWin32Window)
ToString |  (Overrides Object.ToString().)
Transform
Write
Top
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace