Grasshopper API
ModelRenderSkylight Methods
The ModelRenderSkylight type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace