Grasshopper API
GH_UpgradeUtil Methods
The GH_UpgradeUtil type exposes the following members.
Methods
Name | Description
MigrateInputParameters(IGH_Component, IGH_Component)
 Migrate all input parameters.
MigrateInputParameters(IGH_Component, IGH_Component, Int32[], Int32[])
 Migrate a bunch of input parameters.
MigrateOutputParameters(IGH_Component, IGH_Component)
 Migrate all output parameters.
MigrateOutputParameters(IGH_Component, IGH_Component, Int32[], Int32[])
 Migrate a bunch of output parameters.
MigrateRecipients(IEnumerable<IGH_Param>, IGH_Param)
 Utility method for bulk assigning a bunch of sources.
MigrateRecipients(IGH_Param, IGH_Param)
 Migrate all recipients from A to B, while maintaining order.
MigrateSources(IEnumerable<IGH_Param>, IGH_Param)
 Utility method for bulk assigning a bunch of sources.
MigrateSources(IGH_Param, IGH_Param)
 Migrate all sources from A to B, while maintaining order.
ReplaceInputParameters
 Move all input parameters from one component to another. Only use this function if the target component can handle the input layout of the source component.
ReplaceOutputParameters
 Move all output parameters from one component to another. Only use this function if the target component can handle the output layout of the source component.
SwapComponents(IGH_Component, IGH_Component)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, Guid)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, IGH_Component, Boolean)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, Guid, Boolean)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
Top
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace