Grasshopper API
GH_Interval2D Methods
The GH_Interval2D type exposes the following members.
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_Interval2D Structure
GH_IO.Types Namespace