Grasshopper API
GH_InstanceDescription Methods
The GH_InstanceDescription type exposes the following members.
Methods
Name | Description
CopyFrom
 Copy all fields (except the instance ID) from another instance description.
NewInstanceGuid()
 Generate a new random instance GUID
NewInstanceGuid(Guid)
 Set the instance ID to be a specific GUID. This is very dangerous, only use this function if you're 6"4' and your first name is David.
Read
 Default deserialization. Only retrieves Name, NickName, Description and InstanceGuid fields. If you want to retrieve additional fields use ReadFull() instead. However, ReadFull() will only work if the archive was written using WriteFull().
ReadFull
 GH_InstanceDescription does not by default serialize all fields. Use this function to read all fields from the archive. This method is compatible with the default Write()/Read() operations.
Write
 Default serialization. Only stores Name, NickName, Description and InstanceGuid fields. If you want to store additional fields use WriteFull() instead.
WriteFull
 GH_InstanceDescription does not by default serialize all fields. Use this function to write all fields to the archive. This method is compatible with the default Write()/Read() operations.
Top
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace