Grasshopper API
GH_PaletteStyle Methods
The GH_PaletteStyle type exposes the following members.
Methods
Name | Description
CreateBrush
 Create a fill brush. At low zoom levels the brush will be solid colour, at medium to high zoom levels the brush will have a gradient.
Top
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace