Grasshopper API
Index3d<T> Methods
The Index3d<T> generic type exposes the following members.
Methods
Name | Description
CompareTo
Top
See Also
Reference
Index3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace