Grasshopper API
GH_AngularDimension Methods
The GH_AngularDimension type exposes the following members.
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
DuplicateAngularDimension
 Create a duplicate of this angular dimension.
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
ToString
 Format the dimension using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace