Grasshopper API
ModelRenderEnvironment Methods
The ModelRenderEnvironment type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render Namespace