Grasshopper API
Attributes Methods
The ObjectDisplay.Attributes type exposes the following members.
Methods
Name | Description
Equals(ObjectDisplay.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
ObjectDisplay.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace