Grasshopper API
ModelMeshingParameters Methods
The ModelMeshingParameters type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToMeshingParameters
Top
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace