Grasshopper API
ModelNamedView Methods
The ModelNamedView type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelNamedView Class
Grasshopper.Rhinoceros.Display Namespace