Grasshopper API
ModelInstanceDefinition Methods
The ModelInstanceDefinition type exposes the following members.
Methods
Name | Description
BakeGeometry
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
GetBoundingBox
ToAttributes
Top
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace