Grasshopper API
Value Methods
The ObjectDisplayColor.Value type exposes the following members.
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDisplayColor.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDisplayColor.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace