Grasshopper API
GH_RuleAnyNumber Methods
The GH_RuleAnyNumber type exposes the following members.
Methods
Name | Description
Apply
Top
See Also
Reference
GH_RuleAnyNumber Class
Grasshopper.Kernel.Data Namespace