Grasshopper API
GH_Field Methods
The GH_Field type exposes the following members.
Methods
Name | Description
CastFrom
CastTo<T>
CurvatureAt
DrawViewportMeshes
DrawViewportWires
Duplicate
EmitProxy
Read
ScriptVariable
SolveStep
 Move a point through the field.
SolveSteps
 Move a point through a succession of steps.
TensorAt
 Compute the field tensor at the given location as contributed by all the field elements.
ToString
Write
Top
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace