Grasshopper API
GH_MouseTracker Methods
The GH_MouseTracker type exposes the following members.
Methods
Name | Description
Deviation()
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history record.
Deviation(DateTime, DateTime)
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history span. It does not measure the largest deviation between any two points in the time span, only the first and any subsequent point.
DropFrames(DateTime)
 Drop all frames older than a given limit.
DropFrames(Double)
 Find the youngest frame that deviates too much from the current locus and drop it and everything preceding it.
DropFrames(Double, Point)
 Find the youngest frame that deviates too much from the given locus and drop it and everything preceding it.
LastFrameWithinDeviation
 Starting from the youngest frame, finds the oldest frame that is still within a maximum deviation of the youngest frame.
Record(Point)
 Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
Record(Point, Object)
 Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace