Grasshopper API
GH_Theme Methods
The GH_Theme type exposes the following members.
Methods
Name | Description
LoadTheme
 Instantiate all palette and gui defaults. This function reads the colour values out of grasshopper_gui.xml settings database if it exists.
Read
SaveTheme
 Store all palette and gui defaults. This function writes the colour values out to grasshopper_gui.xml settings database.
Write
Top
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace