Grasshopper API
GH_DebugLogForm Methods
The GH_DebugLogForm type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_DebugLogForm Class
Grasshopper.GUI Namespace