Grasshopper API
GH_FormShepard Methods
The GH_FormShepard type exposes the following members.
Methods
Name | Description
RegisterForm
 Add a sheep form to the flock. This form will be affected by the location and size of the main form.
UnregisterForm
 Remove a sheep from the flock.
Top
See Also
Reference
GH_FormShepard Class
Grasshopper.GUI Namespace