Grasshopper API
GH_Archive Methods
The GH_Archive type exposes the following members.
Methods
Name | Description
AddMessage(GH_Message)
 Add a new message to the record.
AddMessage(String, GH_Message_Type)
 Add a new message to the record.
AppendObject
 Appends a target object into the root node of this archive tree. If the root doesn't exist yet, it will be created. Existing objects at the root scope will not be affected.
ClearMessages
 Remove all messages from the log.
CreateNewRoot
 Discards the current data tree and instantiates a new root node. This root node contains some comments, a version value containing the current version of GH_IO.dll and a DateTime value containing the current date and time.
CreateTopLevelNode
 Creates and returns a new root node for this archive in the form of a GH_IWriter instance. Typically you do not call this method. If you want to add an object to the archive, use AppendObject() instead.
Deserialize_Binary
 Deserializes an array of bytes.
Deserialize_Xml
 Deserializes an Xml string.
ExtractObject
 Extract a target object from the data tree.
MessageCount()
 Gets the number of messages recorded since the most recent IO operation began.
MessageCount(Boolean, Boolean, Boolean)
 Gets the number of messages recorded since the most recent IO operation began. Message count can be filtered by message type.
OpenFileDialog
 Displays a standard OpenFileDialog with all the fields set to cater for Grasshopper files.
ReadFromFile
 Reads a new archive tree from a file.
SaveFileDialog
 Displays a standard SaveFileDialog with all the fields set to cater for Grasshopper files.
Serialize_Binary
 Serializes the data tree into a Binary byte array.
Serialize_Xml
 Serializes the data tree into an Xml string.
ShowMessageLog
 Displays the message log viewer. You should typically only display the viewer if the WorstCaseMessageType equals GH_Message_Type.warning or GH_Message_Type.error
WriteToFile
 Writes the current tree to a file.
Top
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace