Grasshopper API
GH_TreeFilter Methods
The GH_TreeFilter type exposes the following members.
Methods
Name | Description
FindItemBrackets
 Locate the two parenthesis that delineate the index segment of an Index Rule set.
FindNextLevelChar
 Find the next occurance of a char in a string that is level with the search start index.
FindPathBrackets
 Locate the two curly brackets that delineate the path segment of an Index Rule set.
FindPrevLevelChar
 Find the previous occurance of a char in a string that is level with the search start index.
ParsePattern
 Parses a textual filter and returns an instance of the GH_TreeFilter. If the filter cannot be parsed an exception will be thrown.
SplitStringWithExpressions
 Split a string into segments using level-aware split. This method throws exceptions if the input string is not correctly formatted.
Top
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace