Grasshopper API
ModelSpaceViewport Methods
The ModelSpaceViewport type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelViewport.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display Namespace