Grasshopper API
GH_Link Methods
The GH_Link type exposes the following members.
Methods
Name | Description
CreateExternalLink(String, String)
CreateExternalLink(String, String, String)
CreateGlossaryLink(String)
CreateGlossaryLink(String, String)
CreateSharedLink(String, String)
CreateSharedLink(String, String, String)
CreateTopicLink(String, String)
CreateTopicLink(String, String, String)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace