Grasshopper API
GH_CursorServer Methods
The GH_CursorServer type exposes the following members.
Methods
Name | Description
AttachCursor
 Attach a cursor to a control.
Cursor
 Gets a cursor from the cache.
IsCursor
 Test for the existence of a cursor.
ReferenceCursors
 Reference all the cursor files in a given directory.
ResetCursor
 Reset the cursor of the given control to default.
Top
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace