Grasshopper API
IGH_Goo Methods
The IGH_Goo type exposes the following members.
Methods
Name | Description
CastFrom
 Attempt a cast from generic object
CastTo<T>
 Attempt a cast to type T
Duplicate
 Make a complete duplicate of this instance. No shallow copies.
EmitProxy
 Create a new proxy for this instance. Return Null if this class does not support proxies.
ScriptVariable
 This function will be called when the local IGH_Goo instance disapears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
ToString
 Creates a string description of the current instance value
Top
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace