Grasshopper API
IGH_BakeAwareData Methods
The IGH_BakeAwareData type exposes the following members.
Methods
Name | Description
BakeGeometry
 Bake an object in the given Rhino document.
Top
See Also
Reference
IGH_BakeAwareData Interface
Grasshopper.Kernel Namespace