Grasshopper API
GH_Dimension Methods
The GH_Dimension type exposes the following members.
Methods
Name | Description
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_AnnotationBase.CastTo<T>(T).)
EmitProxy |  (Overrides GH_AnnotationBase.EmitProxy().)
Top
See Also
Reference
GH_Dimension Class
Grasshopper.Kernel.Types Namespace