Grasshopper API
IGH_RenderAwareData Methods
The IGH_RenderAwareData type exposes the following members.
Methods
Name | Description
AppendRenderGeometry
 Push this geometry down a render pipeline.
Top
See Also
Reference
IGH_RenderAwareData Interface
Grasshopper.Kernel Namespace