Grasshopper API
ModelContent Methods
The ModelContent type exposes the following members.
Methods
Name | Description
AsFrozen
 Try to obtain a dereferenced snapshot of itself.
Cast(Object)
Cast<A, T>(Object)
CastTo<T>(T) |  (Overrides ModelData.CastTo<T>(T).)
Equals(ModelContent)
Equals(Object) |  (Overrides ModelData.Equals(Object).)
FromId
GetHashCode |  (Overrides ModelData.GetHashCode().)
InternaliseData
LoadReferencedData
Read |  (Overrides ModelData.Read(GH_IReader).)
RenderItem
RuntimeId
SubCast<A, T>
ToAttributes
TooltipString |  (Overrides ModelData.TooltipString().)
ToString |  (Overrides ModelData.ToString().)
UnloadReferencedData
Write |  (Overrides ModelData.Write(GH_IWriter).)
Top
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace