Grasshopper API
IGH_ContextualParameter Methods
The IGH_ContextualParameter type exposes the following members.
Methods
Name | Description
AssignContextualData
 Assign a collection of values as contextual data.
AutoAssignContextualData
 Use the in-build getter UI to assign data to the parameter.
Top
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace