Grasshopper API
GH_IReader Methods
The GH_IReader type exposes the following members.
Methods
Name | Description
ChunkExists(String)
 Checks whether a chunk with the specified name exists in the litter. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
ChunkExists(String, Int32)
 Checks whether a chunk with the specified name and index exists in the litter. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
FindChunk(String)
 Finds the first chunk in the litter that matches the given name. Only chunks without index qualifiers are considered.
FindChunk(String, Int32)
 Finds the first chunk in the list that matches the given name and index. Only chunks with index qualifiers are considered.
FindItem(String)
 Finds the first item that matches the given name. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
FindItem(String, Int32)
 Finds the first item that matches the given name and index. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
GetBoolean(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetBoolean(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetBoundingBox(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetBoundingBox(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetByte(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetByte(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetByteArray(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetByteArray(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDate(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDate(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDecimal(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDecimal(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDouble(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDouble(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDoubleArray(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDoubleArray(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingBitmap(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingBitmap(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingColor(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingColor(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingPoint(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingPoint(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingPointF(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingPointF(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingRectangle(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingRectangle(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingRectangleF(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingRectangleF(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingSize(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingSize(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingSizeF(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingSizeF(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetGuid(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetGuid(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInt32(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInt32(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInt64(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInt64(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInterval1D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInterval1D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInterval2D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInterval2D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetLine(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetLine(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPath(String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPath(String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPlane(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPlane(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPoint2D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPoint2D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPoint3D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPoint3D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPoint4D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPoint4D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetSingle(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetSingle(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetString(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetString(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetVersion(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetVersion(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
ItemExists(String)
 Checks whether an item with the specified name exists. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
ItemExists(String, Int32)
 Checks whether an item with the specified name and index exists. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
TryGetBoolean(String, Boolean)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetBoolean(String, Int32, Boolean)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetBoundingBox(String, GH_BoundingBox)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetBoundingBox(String, Int32, GH_BoundingBox)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetByte(String, Byte)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetByte(String, Int32, Byte)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDate(String, DateTime)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDate(String, Int32, DateTime)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDecimal(String, Decimal)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDecimal(String, Int32, Decimal)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDouble(String, Double)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDouble(String, Int32, Double)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingColor(String, Color)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingColor(String, Int32, Color)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingPoint(String, Point)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingPoint(String, Int32, Point)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingPointF(String, PointF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingPointF(String, Int32, PointF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingRectangle(String, Rectangle)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingRectangle(String, Int32, Rectangle)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingRectangleF(String, RectangleF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingRectangleF(String, Int32, RectangleF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingSize(String, Size)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingSize(String, Int32, Size)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingSizeF(String, SizeF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingSizeF(String, Int32, SizeF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetGuid(String, Guid)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetGuid(String, Int32, Guid)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInt32(String, Int32)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInt32(String, Int32, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInt64(String, Int64)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInt64(String, Int32, Int64)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInterval1D(String, GH_Interval1D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInterval1D(String, Int32, GH_Interval1D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInterval2D(String, GH_Interval2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInterval2D(String, Int32, GH_Interval2D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetLine(String, GH_Line)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetLine(String, Int32, GH_Line)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPlane(String, GH_Plane)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPlane(String, Int32, GH_Plane)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPoint2D(String, GH_Point2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint2D(String, Int32, GH_Point2D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPoint3D(String, GH_Point3D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint3D(String, Int32, GH_Point3D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPoint4D(String, GH_Point4D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint4D(String, Int32, GH_Point4D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetSingle(String, Single)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetSingle(String, Int32, Single)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetString(String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetString(String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetVersion(String, GH_Version)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetVersion(String, Int32, GH_Version)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace