Grasshopper API
GH_DataModificationAction Methods
The GH_DataModificationAction type exposes the following members.
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
GH_DataModificationAction Class
Grasshopper.Kernel.Undo.Actions Namespace