Grasshopper API
Attributes Methods
The ObjectVisibility.Attributes type exposes the following members.
Methods
Name | Description
Equals(ObjectVisibility.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
ObjectVisibility.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace