Grasshopper API
Value Methods
The ObjectDraftingLineWidth.Value type exposes the following members.
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingLineWidth.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingLineWidth.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace