Grasshopper API
Attributes Methods
The ModelData.Attributes type exposes the following members.
Methods
Name | Description
Clone
Read
SubClone
ToDetails
ToModelData
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
ModelData.Attributes Class
Grasshopper.Rhinoceros Namespace