Grasshopper API
GH_Slider_Obsolete Methods
The GH_Slider_Obsolete type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides ContainerControl.Dispose(Boolean).)
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
OnValueChanged
 Raise the ValueChanged event
SendMessage
Top
Extension Methods
Name | Description
ToEto |  (Defined by EtoExtensions.)
Top
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace