Grasshopper API
GH_NumberSliderSnappingEditor Methods
The GH_NumberSliderSnappingEditor type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_NumberSliderSnappingEditor Class
Grasshopper.GUI Namespace