Grasshopper API
IGH_PreviewMeshData Methods
The IGH_PreviewMeshData type exposes the following members.
Methods
Name | Description
DestroyPreviewMeshes
 Erase all cached preview meshes.
GetPreviewMeshes
 Gets all the preview meshes associated with this data.
Top
See Also
Reference
IGH_PreviewMeshData Interface
Grasshopper.Kernel Namespace