Grasshopper API
GH_Gradient Methods
The GH_Gradient type exposes the following members.
Methods
Name | Description
AddGrip(Double)
 Add a new grip to the gradient. The colour of the grip will be picked so that there is no difference to the gradient, though this is not actually possible when the interpolation mode is not linear.
AddGrip(GH_Grip)
 Add a new grip to the gradient. This method does not raise the GradientChanged event, so you need to do that yourself by calling OnGradientChanged().
AddGrip(Double, Color)
 Add a new single-colour grip.
AddGrip(Double, Color, Color)
 Add a new bi-colour grip.
ColourAt
 Evaluate the colour at a specific parameter.
DeleteGripRegion
 Gets the Delete Grip region rectangle based on a gradient destination rectangle.
DisplayGradientEditor
DisplayGripColourPicker
EarthlyBrown
Forest
GreyScale
Heat
MouseDown
 Begin grip drag operation.
MouseDragAbort
 Abort grip drag.
MouseMove
 Continue grip dragging operation.
MouseUp
 Terminate grip drag.
NearestGrip(Double)
 Find the nearest grip to a parameter.
NearestGrip(Double, GH_GripSide)
 Find the nearest grip to a parameter.
NearestGrip(RectangleF, PointF, Double)
 Find the nearest grip in screen coordinates.
NewGripRegion
 Gets the new Grip region rectangle based on a gradient destination rectangle.
NormalizeGrips
 Normalize all grips. This will scale all grip parameters so that the full gradient extend equals 0~1.
OnGradientChanged
 Raise the GradientChanged event.
OnGradientChangedIntermediate
 Raise the GradientChanged event.
OnSelectionChanged
 Raise the SelectionChanged event.
Read
RemoveGrip(GH_Grip)
 Remove the specified grip.
RemoveGrip(Int32)
 Remove the grip at the specified index.
Render_Background
Render_Gradient
Render_Grips
SoGay
Spectrum
Traffic
Write
Zebra
Top
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace