Grasshopper API
GH_GooProxy<T> Methods
The GH_GooProxy<T> generic type exposes the following members.
Methods
Name | Description
Construct
 Override this method to supply a custom UI during proxy construction.
FormatInstance
 Returns a String description of the current value.
FromString
 If IsParsable(), then attempts to convert the string to a generic type value
MutateString
 Munge a string to remove obvious errors on account of the user.
NumberToString
StringToNumber
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace