Grasshopper API
GH_IndexRanges Methods
The GH_IndexRanges type exposes the following members.
Methods
Name | Description
InsertRange
 Insert an index range into the collection.
Read
RemoveRange
 Remove an index range from the collection.
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
GH_IndexRanges Class
Grasshopper.Kernel.Data Namespace