Grasshopper API
IGH_TaskCapableComponent Methods
The IGH_TaskCapableComponent type exposes the following members.
Methods
Name | Description
RequestTaskCancellation
 Called by the framework when solving has been interrupted and tasks do not need to complete.
Top
See Also
Reference
IGH_TaskCapableComponent Interface
Grasshopper.Kernel Namespace