Grasshopper API
GH_CircleProxy Methods
The GH_Circle.GH_CircleProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Circle.GH_CircleProxy Class
Grasshopper.Kernel.Types Namespace