Grasshopper API
Attributes Methods
The ModelComponentContent.Attributes type exposes the following members.
Methods
Name | Description
Equals(Object, IEqualityComparer) |  (Overrides ModelContent.Attributes.Equals(Object, IEqualityComparer).)
GetHashCode(IEqualityComparer) |  (Overrides ModelContent.Attributes.GetHashCode(IEqualityComparer).)
ReadData |  (Overrides ModelContent.Attributes.ReadData(GH_IReader).)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
WriteData |  (Overrides ModelContent.Attributes.WriteData(GH_IWriter).)
Top
See Also
Reference
ModelComponentContent.Attributes Class
Grasshopper.Rhinoceros Namespace