Grasshopper API
GH_CodeString Methods
The GH_CodeString type exposes the following members.
Methods
Name | Description
Flatten
ParseNewString
Replace
ReplaceToken
Top
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace