Grasshopper API
GH_DocumentEditor Methods
The GH_DocumentEditor type exposes the following members.
Methods
Name | Description
ClearStatusBar
 Clear the Grasshopper status-bar.
CloseForReal
 Really, really close the window.
CollapseForm
 Collapses the form into the title bar area.
DisableUI
 Disable all modifier UI.
Dispose |  (Overrides Form.Dispose(Boolean).)
EnableUI
 Enable all modifier UI.
ExpandForm
 Expands the form if it is currenly collapsed.
FadeIn
 Call this method if the prompt switches back to Grasshopper.
FadeOut
 Call this method if the prompt switches to Rhino.
FixCanvasToolbarState
 Enabled/Disables the appropriate buttons depending on whether there is a document loaded on the canvas.
ScriptAccess_CloseAllDocuments
 Closes all documents in the Document Queue.
ScriptAccess_CloseDocument
 Closes the currently active document and loads the next available document into the canvas. Changes will not be saved.
ScriptAccess_IsDocument
 Returns true if there is an active document.
ScriptAccess_IsDocumentModified
 Gets the modified flag of the currently loaded document.
ScriptAccess_NewDocument
 Creates a new document and loads it into the Canvas.
ScriptAccess_OpenDocument()
 Displays a command line interface for File Open... then loads that file into the Canvas.
ScriptAccess_OpenDocument(String)
 Loads a specific file off the hard disk into the Canvas.
ScriptAccess_SaveDocument
 Saves the document currently loaded in the Canvas. If the document hasn't been saved before then a Save... dialog box will be shown.
ScriptAccess_SaveDocumentAs()
 Saves the currently active document to disk.
ScriptAccess_SaveDocumentAs(String)
 Saves the currently active document to disk.
SetStatusBarEvent
 Set a new message on the Grasshopper status bar.
ToggleForm
 Collapses the form if it's currently expanded or expands the form if it's currently collapsed.
WndProc
 WndProc is overridden in order to allow for title-bar double-click (un)folding.
 (Overrides Form.WndProc(Message).)
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace