Grasshopper API
GH_Lexer Methods
The GH_Lexer type exposes the following members.
Methods
Name | Description
EvaluatePath
 Evaluate the variables in this mask with the provided expression solver.
PerformLexicalReplace<T>(GH_Lexer, GH_Lexer, DataTree<T>, DataTree<T>)
 Lexical Find..Replace operations.
PerformLexicalReplace<T>(GH_Lexer, GH_Lexer, IGH_Structure, GH_Structure<T>)
 Lexical Find..Replace operations.
Top
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace