Grasshopper API
IGH_ContextualParameter2 Methods
The IGH_ContextualParameter2 type exposes the following members.
Methods
Name | Description
ClearContextualData
 Clear previously assigned collection of values as contextual data
Top
See Also
Reference
IGH_ContextualParameter2 Interface
Grasshopper.Kernel Namespace