Grasshopper API
GH_Path Methods
The GH_Path type exposes the following members.
Methods
Name | Description
AppendElement
 Create a new path by appending a new index value to this path.
Compare
 Compare two paths. This function determines the Sorting behaviour of paths.
CompareTo
 Compare this path to another path. This function determines the Sorting behaviour of paths.
CullElement
 Removes the last index value from the path. If the path is already empty, nothing will happen.
CullFirstElement
 Removes the first index value from the path. If the path is already empty, nothing will happen.
Format
 Format a path.
FromString
 Try to deserialize a GH_Path from a String.
GetHashCode
 Specialized Hash code pattern.
 (Overrides Object.GetHashCode().)
Increment(Int32)
 Increment a specific index in this path by one.
Increment(Int32, Int32)
 Increment a specific index in this path by one.
IsAncestor
 Test another path to see if it is an ancestor of this path. For a path to be considered an ancestor, it must share the initial dimensions.
IsCoincident(GH_Path)
 Test to see if this path is coincident with another path.
IsCoincident(Int32[])
 Test to see if this path is coincident with set of integers.
PrependElement
 Create a new path by prepending a new index value to this path.
Read
 Read this path from an archive.
SplitPathLikeString
 Try to split up a path-like formatted string "{A;B;C}(i)" into component parts.
ToString()
 Concatenates the indices in the path.
 (Overrides Object.ToString().)
ToString(Boolean)
 Concatenates the indices in the path.
Write
 Write this path to an archive.
Top
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace