Grasshopper API
ObjectDrafting Methods
The ObjectDrafting type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToDetails
Top
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace