Grasshopper API
Param_ObjectSectionStyle Methods
The Param_ObjectSectionStyle type exposes the following members.
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
Top
See Also
Reference
Param_ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting.Params Namespace