Grasshopper API
ModelHatchPattern Methods
The ModelHatchPattern type exposes the following members.
Methods
Name | Description
Cast
ToAttributes
Top
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace