Grasshopper API
Generic Methods
The Generic type exposes the following members.
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Generic Class
Grasshopper.Kernel.Types.Transforms Namespace