Grasshopper API
IGH_GooProxy Methods
The IGH_GooProxy type exposes the following members.
Methods
Name | Description
Construct
 This method will be called when a new instance of this type is constructed. It allows implementers to supply a customized UI to be shown during construction. This method should never throw exceptions.
FormatInstance
 Returns a String description of the current value.
FromString
 If IsParsable(), then attempts to convert the string to a generic type value
MutateString
 Munge a string to remove obvious errors on account of the user.
Top
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace