Grasshopper API
GH_BakeUtility Methods
The GH_BakeUtility type exposes the following members.
Methods
Name | Description
BakeObject
 Try and bake a single object.
BakeObjects
 Bake a bunch of objects.
Top
See Also
Reference
GH_BakeUtility Class
Grasshopper.Kernel Namespace