Grasshopper API
GH_PersistentParam<T> Methods
The GH_PersistentParam<T> generic type exposes the following members.
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_Param<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
CollectVolatileData_Custom |  (Overrides GH_Param<T>.CollectVolatileData_Custom().)
Menu_AppendDestroyPersistent
Menu_AppendExtractParameter
Menu_AppendInternaliseData
Menu_AppendManageCollection
Menu_AppendPromptMore
Menu_AppendPromptOne
Menu_CreateMultilineTextEditItem
 This function returns a ToolstripMenuItem that embeds a multi-line textbox for editing persistent data. Only call this method if you know that your parameter type supports proxies.
Menu_CustomMultiValueItem
Menu_CustomSingleValueItem
PrepareForPrompt
Prompt_ManageCollection
Prompt_Plural
Prompt_Singular
Read |  (Overrides GH_Param<T>.Read(GH_IReader).)
RecordPersistentDataEvent
 Add an undo record that stores changes to persistent data.
RecoverFromPrompt
SetPersistentData(T)
 Add a single item to the persistent data. This method will record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add more than one piece of data, you should use the appropriate overload for this method.
SetPersistentData(GH_Structure<T>)
 Assign a tree of items to the persistent data. This method will erase any existing data, record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add a tree of data, you should use the appropriate overload for this method.
SetPersistentData(IEnumerable<T>)
 Assign a list of items to the persistent data. This method will erase any existing data, record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add a tree of data, you should use the appropriate overload for this method.
SetPersistentData(Object[])
 Add a collection of values to the persistent data.
Write |  (Overrides GH_Param<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace