Grasshopper API
GH_Plane Methods
The GH_Plane type exposes the following members.
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
DrawPlane(DisplayPipeline, Plane)
 Draw a plane with default colours and default size.
DrawPlane(DisplayPipeline, Plane, Double, Int32)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color, Color)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color, Color, Color)
DrawPlaneIcon
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this plane.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicatePlane
 Create a duplicate of this plane.
EmitProxy
 Returns a proxy that represents this plane. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the plane using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace