Grasshopper API
GH_ConnectivityDiagram Methods
The GH_ConnectivityDiagram type exposes the following members.
Methods
Name | Description
ContainsID
 Test the diagram for a given Node ID.
GetAllInputs
 Get all the Nodes that are part of the specified node input.
GetAllOutputs
 Get all the Nodes that are part of the specified node output.
Top
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace