Grasshopper API
GH_Vector Methods
The GH_Vector type exposes the following members.
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate
 Create a duplicate of this vector.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateVector
 Create a duplicate of this vector.
EmitProxy
 Returns a proxy that represents this vector. Do not call this function unless you're
 (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the vector using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_Vector Class
Grasshopper.Kernel.Types Namespace