Grasshopper API
IGH_TooltipAwareObject Methods
The IGH_TooltipAwareObject type exposes the following members.
Methods
Name | Description
IsTooltipRegion
 Determine whether the specified pixel should result in a tooltip when the cursor hovers over it.
SetupTooltip
 This function is called when a tooltip it about to be displayed.
Top
See Also
Reference
IGH_TooltipAwareObject Interface
Grasshopper.GUI.Canvas Namespace