Grasshopper API
ModelRenderSun Methods
The ModelRenderSun type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace