Grasshopper API
GH_Point4D Methods
The GH_Point4D type exposes the following members.
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_Point4D Structure
GH_IO.Types Namespace