Grasshopper API
AnnotationToleranceSettings Methods
The AnnotationToleranceSettings type exposes the following members.
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace