Grasshopper API
SliderSnapRange Methods
The SliderSnapRange type exposes the following members.
Methods
Name | Description
CanMerge
CompareTo
DistanceTo
 Compute the distance from a value to this snap range.
Merge
SnapValue
 Gets the snapped value of another value.
Top
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace