Grasshopper API
GH_PreviewUtil Methods
The GH_PreviewUtil type exposes the following members.
Methods
Name | Description
AddBox
 Add a box to the temporary Preview lists.
AddBrep
 Add a brep to the temporary Preview lists.
AddCurve
 Add a curve to the temporary Preview lists.
AddLine
 Add a line to the temporary Preview lists.
AddMesh
 Add a mesh to the temporary Preview lists.
AddPlane
 Add a plane to the temporary Preview lists.
AddPoint
 Add a point to the temporary Preview lists.
AddVector
 Add a vector to the temporary Preview lists.
Clear
 Clear all temporary geometry.
Dispose
Redraw
 Forces a redraw the the viewports.
Top
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace