Grasshopper API
IGH_PreviewObject Methods
The IGH_PreviewObject type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
 Implement this function to draw all shaded meshes. If the viewport does not support shading, this function will not be called.
DrawViewportWires
 Implement this function to draw all wire and point geometry previews.
Top
See Also
Reference
IGH_PreviewObject Interface
Grasshopper.Kernel Namespace