Grasshopper API
ModelLayer Methods
The ModelLayer type exposes the following members.
Methods
Name | Description
Cast
ToAttributes
Top
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace