Grasshopper API
Attributes Methods
The ModelRenderContent.Attributes type exposes the following members.
Methods
Name | Description
Equals(Object, IEqualityComparer) |  (Overrides ModelContent.Attributes.Equals(Object, IEqualityComparer).)
GetHashCode(IEqualityComparer) |  (Overrides ModelContent.Attributes.GetHashCode(IEqualityComparer).)
ReadData |  (Overrides ModelContent.Attributes.ReadData(GH_IReader).)
SubClone |  (Overrides ModelData.Attributes.SubClone().)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
WriteData |  (Overrides ModelContent.Attributes.WriteData(GH_IWriter).)
Top
See Also
Reference
ModelRenderContent.Attributes Class
Grasshopper.Rhinoceros.Render Namespace