Grasshopper API
GH_CurveProxy Methods
The GH_Curve.GH_CurveProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
GH_Curve.GH_CurveProxy Class
Grasshopper.Kernel.Types Namespace