Grasshopper API
IGH_FileDropTarget Methods
The IGH_FileDropTarget type exposes the following members.
Methods
Name | Description
AcceptableFile
 Gets a value indicating whether or not the path can be handled by the local object.
HandleDrop
 Handle a file drop.
Top
See Also
Reference
IGH_FileDropTarget Interface
Grasshopper.GUI Namespace