Grasshopper API
GH_ColourCube Methods
The GH_ColourCube type exposes the following members.
Methods
Name | Description
Average(Color, Color)
 Compute the average of two colours.
Average(Color, Color, Color, Color)
 Compute the average of four colours.
Blend
 Inteprolate between two colours.
ColorAtRail
 Get the color at a position along the depth rail.
ColorAtSlice
 Get the color at a position on the slice.
RenderAll
 Call all render methods in the correct order.
RenderBackEdges
 Render the edges of the back face creases.
RenderBackFaces
 Render the fills of the backfaces.
RenderDropShadow
 Render the drop shadow of the cube.
RenderEdgeShadows
 Render the edge shadows of the cube due to GI.
RenderForeEdges
 Render the edges of the fore face creases.
RenderGrip
 Render the slice grip.
RenderPivot
 Render the colour pivot on the current slice.
RenderSilhouetteEdges
 Render the edges of the cube silhouettes.
RenderSlice
 Render the square slice with colour gradients.
RenderSliceDropShadow
 Render the drop shadow onto the slice.
RenderSliceEdgeShadows
 Render the edge shadows of the slice due to GI.
RenderSliceSilhouetteEdges
 Render the silhouette edges of the slice.
Top
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace