Grasshopper API
IGH_IndexRule Methods
The IGH_IndexRule type exposes the following members.
Methods
Name | Description
Evaluate
Top
See Also
Reference
IGH_IndexRule Interface
Grasshopper.Kernel.Data Namespace