Grasshopper API
GH_DragInfo Methods
The GH_DragInfo type exposes the following members.
Methods
Name | Description
Drag
 Call this method to adjust the drag data. Results will be automatically constrained and limited.
Top
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace