Grasshopper API
GH_PersistentDataAction<T> Methods
The GH_PersistentDataAction<T> generic type exposes the following members.
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
GH_PersistentDataAction<T> Class
Grasshopper.Kernel.Undo.Actions Namespace