Grasshopper API
GH_RuleSequence Methods
The GH_RuleSequence type exposes the following members.
Methods
Name | Description
Apply
Top
See Also
Reference
GH_RuleSequence Class
Grasshopper.Kernel.Data Namespace