Grasshopper API
GH_Painter Methods
The GH_Painter type exposes the following members.
Methods
Name | Description
ConnectionPath
ConnectionPathBezier
ConnectionVisible
 Test whether a wire ought to be drawn at all.
DetermineWireType
 Utility method for determining wire display types.
DrawBackground
DrawConnection
DrawMiddleGround
DrawNoDocumentMessage
DrawNULLBuffer
DrawPivots
DrawRecipientLinks(GH_Document)
DrawRecipientLinks(IGH_Param)
DrawStateFlags
GenerateWirePen_Fill
Top
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace