Grasshopper API
Attributes Methods
The AnnotationArrow.Attributes type exposes the following members.
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From(ArrowType)
From(ModelInstanceDefinition)
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelData.Attributes.ToString().)
Top
See Also
Reference
AnnotationArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace