Grasshopper API
IGH_TypeHint Methods
The IGH_TypeHint type exposes the following members.
Methods
Name | Description
Cast
 Apply conversion logic to a specific object. This function should not throw exceptions.
Top
See Also
Reference
IGH_TypeHint Interface
Grasshopper.Kernel.Parameters Namespace