Grasshopper API
GH_Attributes<T> Methods
The GH_Attributes<T> generic type exposes the following members.
Methods
Name | Description
AppendToAttributeTree
 Recursively append these attributes and all child attributes to the attribute list.
ExpireLayout
 Expires the entire layout of the attributes. When overridden, implementer must place a call to the base class ExpireLayout().
InvalidateCanvas
 If the mouse location should cause a canvas invalidation then return true. You only need to override this function if you draw objects that are dependant on cursor positions outside the bounds of the attributes.
IsIconMode
 Utility function for determining Icon display modes. If the supplied mode is ::application, then it will be adjusted to match the current app settings.
IsMenuRegion
 Determines whether a point is available for context menu popups. By default, IsMenuRegion calls IsPickRegion(PointF).
IsPickRegion(PointF)
 Determines whether a point is within the pickable region for this object. By default, any point inside the Bounds is treated as pickable.
IsPickRegion(RectangleF, GH_PickBox)
 Determines whether a rectangle is a valid pick region for this object. By default, the picking rectangle is intersected with the Bounds rectangle.
IsTooltipRegion
 Determines whether a point is available for tooltip popups. By default, IsMenuRegion calls IsTooltipRegion(PointF).
Layout
 Perform dedicated layout logic specific to this particular DocumentObject. This method is called from PerformLayout if the existing layout is stale.
NewInstanceGuid()
 Generate a new instance GUID for the owner object.
NewInstanceGuid(Guid)
 Generate a new instance GUID for the owner object. Do not use this overload unless you're > 1.95m and called David.
PerformLayout
 Recompute the layout for these attributes. This function is automatically called during Drawing operations, so you typically don't have to.
PrepareForRender
 This method will always be called exactly once prior to Render(). This would be a good place to make sure all the necessary GUI data is up and running.
Read
Render
 Override this function to supply custom Render logic.
RenderIncomingWires(GH_Painter, IEnumerable<IGH_Param>, GH_ParamWireDisplay)
 Utility function for derived classes. This method draws all the wires going into the left side of the attributes.
RenderIncomingWires(GH_Painter, IEnumerable<IGH_Param>, IEnumerable<Pen>)
 Utility function for derived classes. This method draws all the wires going into the left side of the attributes.
RenderToCanvas
 Render these attributes into a Canvas control. This function places calls to PrepareForRender() and Render(), you should override those.
RespondToKeyDown
RespondToKeyUp
RespondToMouseDoubleClick
RespondToMouseDown
RespondToMouseMove
RespondToMouseUp
SetupTooltip
 Populates the Grasshopper tooltip with all relevant data. If this function returns True, it is assumed that all possible fields have been filled out and the tooltip is ready for display.
SolvePathBoxPick
 Utility function for testing window selections with freeform Graphics paths.
Write
Top
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace