Grasshopper API
Attributes Methods
The ModelStandardViewport.Attributes type exposes the following members.
Methods
Name | Description
ToDetails |  (Overrides ModelViewport.Attributes.ToDetails().)
ToModelData |  (Overrides ModelViewport.Attributes.ToModelData().)
Top
See Also
Reference
ModelStandardViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace