Grasshopper API
ModelTextureMapping Methods
The ModelTextureMapping type exposes the following members.
Methods
Name | Description
Cast
DrawViewportMeshes
DrawViewportWires
ToAttributes
Top
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace