Grasshopper API
Attributes Methods
The ModelEarthAnchorPoint.Attributes type exposes the following members.
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace