Grasshopper API
GH_HatchProxy Methods
The GH_Hatch.GH_HatchProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace