Grasshopper API
GH_GenericObjectAction Methods
The GH_GenericObjectAction type exposes the following members.
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
See Also
Reference
GH_GenericObjectAction Class
Grasshopper.Kernel.Undo.Actions Namespace