Grasshopper API
Value Methods
The ObjectSectionStyle.Value type exposes the following members.
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectSectionStyle.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectSectionStyle.Value)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetHashCode(IEqualityComparer)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace