Grasshopper API
GH_RuntimeFile Methods
The GH_RuntimeFile type exposes the following members.
Methods
Name | Description
ContainsKey
 Test whether a certain key is present in the File.
IsTag
 Tests whether a string is a predefined Grasshopper Help keyword.
IsTagLine
 Tests whether a line of text starts with a Grasshopper Help keyword.
ParseFile
 Parse a file and return the runtime representation of said file.
Top
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace