Grasshopper API
GH_Paragraph Methods
The GH_Paragraph type exposes the following members.
Methods
Name | Description
Create(String)
Create(String[])
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_Paragraph Class
Grasshopper.Documentation Namespace