Grasshopper API
IGH_InstanceDescription Methods
The IGH_InstanceDescription type exposes the following members.
Methods
Name | Description
NewInstanceGuid()
 Generate a new random instance GUID
NewInstanceGuid(Guid)
 Set the instance ID to be a specific GUID. This is very dangerous, only use this function if you're 6"4' and called David.
Top
See Also
Reference
IGH_InstanceDescription Interface
Grasshopper.Kernel Namespace