Grasshopper API
GH_Item Methods
The GH_Item type exposes the following members.
Methods
Name | Description
CreateFrom(BinaryReader)
 Creates a new instance of GH_Item and sets the fields from a reader object.
CreateFrom(XmlNode)
 Creates a new instance of GH_Item and sets the fields from an Xml node object.
Read(BinaryReader)
 Deserialize this item from a binary stream.
Read(XmlNode)
 Deserialize this item from an Xml node.
ToString
 Converts the struct into a human readable format.
 (Overrides Object.ToString().)
Write(BinaryWriter)
 Serialize this item into a binary stream.
Write(XmlWriter)
 Serialize this item into an Xml stream.
Top
See Also
Reference
GH_Item Class
GH_IO.Types Namespace