Grasshopper API
IGH_ObjectProxy Methods
The IGH_ObjectProxy type exposes the following members.
Methods
Name | Description
CreateInstance
 Create a new instance from the target object.
DuplicateProxy
 Create a duplicate of this proxy.
Top
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace