Grasshopper API
Value Methods
The ItemDisplayColor.Value type exposes the following members.
Methods
Name | Description
CompareTo(Object)
CompareTo(ItemDisplayColor.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ItemDisplayColor.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace