Grasshopper API
GH_IXmlSupport Methods
The GH_IXmlSupport type exposes the following members.
Methods
Name | Description
Read
 Called when an object is required to deserialize itself.
Write
 Called when an object is required to serialize itself.
Top
See Also
Reference
GH_IXmlSupport Interface
GH_IO.Serialization Namespace