Grasshopper API
IGH_ReferencedData Methods
The IGH_ReferencedData type exposes the following members.
Methods
Name | Description
LoadReferencedData
UnloadReferencedData
Top
See Also
Reference
IGH_ReferencedData Interface
Grasshopper.Kernel.Types Namespace