Grasshopper API
Param_ModelAttributeKey Methods
The Param_ModelAttributeKey type exposes the following members.
Methods
Name | Description
AddedToDocument |  (Overrides GH_DocumentObject.AddedToDocument(GH_Document).)
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace