Grasshopper API
GH_UnrecognizedObjectsForm Methods
The GH_UnrecognizedObjectsForm type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_UnrecognizedObjectsForm Class
Grasshopper.GUI Namespace