Grasshopper API
IRcpAwareObject Methods
The IRcpAwareObject type exposes the following members.
Methods
Name | Description
PublishRcpItem
 Emit a new object to be inserted on a Remote Control Panel.
Top
See Also
Reference
IRcpAwareObject Interface
Grasshopper.Kernel Namespace