Grasshopper API
GH_PointRefData Methods
The GH_PointRefData type exposes the following members.
Methods
Name | Description
EvCurve
 Evaluate this reference structure when applied to a curve
EvCurveParam
 Evaluate this reference structure when applied to a curve
EvSurface
 Evaluate this reference structure when applied to the surface
SetCurveDistFromEndParam
SetCurveDistFromStartParam
SetCurveParam
 Set the curve reference parameter based on the value of m_RefType and the curve parameter
SetCurveRatioParam
SetSurfaceParam
 Set the surface reference parameters
Top
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace