Grasshopper API
Attributes Methods
The ModelObject.Attributes type exposes the following members.
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace