Grasshopper API
GH_DocumentObject Methods
The GH_DocumentObject type exposes the following members.
Methods
Name | Description
AddedToDocument
 This method will be called when an object is added to a document. Override this method if you want to handle such events.
AppendMenuItems
 This function is called when a context menu is about to be displayed. Override it to set custom items.
ConnectNewObject
CreateAttributes
 This function creates the stand-alone attributes for this object. If you wish to supply your own Attributes, you must override this function.
DestroyIconCache
 Call this method to erase the existing icon cache. You must call this if you want to change the display icon of an object.
DocumentContextChanged
 This method will be called when the document that owns this object moves into a different context.
ExpirePreview
 Call this function when you suspect that the preview has expired for this object. This will cause the display cache to be eradicated.
ExpireSolution
 Call this function whenever you do something which expires the current solution. This will make sure all caches are erased, all downstream objects are expired and that the event is raised. The default implementation merely places a call to OnSolutionExpired(), override this function in derived classes to make sure you clear local data caches and expire downstream objects.
GetValue(String, Boolean)
 Get a boolean value from the component value table.
GetValue(String, Double)
 Get a double value from the component value table.
GetValue(String, Color)
 Get a color value from the component value table.
GetValue(String, Int32)
 Get an integer value from the component value table.
GetValue(String, String)
 Get a string value from the component value table.
HtmlHelp_Source
 Return a String which contains HTML formatted source for the help topic. If you want to pass a URL that points to a remote page, then prefix the URL with a GOTO: tag, like so: GOTO:http://www.YourWebAddressHere.com
IsolateObject
 Destroy all connections to other objects.
Menu_AppendColourPicker
 Add a colour picker to a menu.
Menu_AppendCustomItem(ToolStripDropDown, Control)
 Utility function for inserting exotic controls into dropdown menus.
Menu_AppendCustomItem(ToolStripDropDown, Control, KeyDownEventHandler)
 Utility function for inserting exotic controls into dropdown menus.
Menu_AppendCustomItem(ToolStripDropDown, Control, KeyDownEventHandler, Boolean, Int32, Boolean)
 Utility function for inserting exotic controls into dropdown menus.
Menu_AppendDigitScrollerItem
 Utility function for inserting a digit scroller into menus.
Menu_AppendItem(ToolStrip, String)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Boolean)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Image)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Boolean, Boolean)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Image, Object)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Image, Boolean, Boolean)
 Utility function for appending generic menu items.
Menu_AppendObjectHelp
 Appends the default object Help menu item.
Menu_AppendObjectName
 Appends the old-fashioned object name menu item. If you also want the Display mode toggle then use Menu_AppendObjectNameEx()
Menu_AppendObjectNameEx
 Appends the default object name + display mode menu item.
Menu_AppendPublish
 Appends the default item for publishing to RCP. This menu will only appear if the current class implement IRcpAwareObject
Menu_AppendSeparator
 Utility function for appending separators to a menu dropdown. If the dropdown is empty or if it already has a separator at the bottom, nothing will happen.
Menu_AppendTextItem(ToolStripDropDown, String, GH_MenuTextBox.KeyDownEventHandler, GH_MenuTextBox.TextChangedEventHandler, Boolean)
 Utility function for inserting text boxes into menus.
Menu_AppendTextItem(ToolStripDropDown, String, GH_MenuTextBox.KeyDownEventHandler, GH_MenuTextBox.TextChangedEventHandler, Boolean, Int32, Boolean)
 Utility function for inserting text boxes into menus.
Menu_MoveItem(ToolStripItem, String[])
 Utility function for moving menu items.
Menu_MoveItem(ToolStripItem, Boolean, String[])
 Utility function for moving menu items.
MovedBetweenDocuments
 This method will be called when an object is moved from one document to another. Override this method if you want to handle such events.
OnAttributesChanged
 Raises the AttributesChanged event on the toplevel object.
OnDisplayExpired
 Raises the DisplayExpired event on the toplevel object.
OnObjectChanged(GH_ObjectChangedEventArgs)
OnObjectChanged(GH_ObjectEventType)
OnObjectChanged(String)
OnObjectChanged(GH_ObjectEventType, Object)
OnObjectChanged(String, Object)
OnPingDocument
 Raise the PingDocument Event on the toplevel object and try to find the document which owns this object.
OnPreviewExpired
 Raises the PreviewExpired event on the toplevel object.
OnSolutionExpired
 Raises the SolutionExpired event on the toplevel object. You probably want to call ExpireSolution() instead of this method directly.
Read |  (Overrides GH_InstanceDescription.Read(GH_IReader).)
RecordUndoEvent(GH_UndoRecord)
 Record an entire undo record.
RecordUndoEvent(String)
 Record a generic object change undo event.
RecordUndoEvent(String, IGH_UndoAction)
 Record a specific object change undo event.
RemovedFromDocument
 This method will be called when an object is removed from a document. Override this method if you want to handle such events.
SetIconOverride
 Set a new custom icon override for this object.
SetValue(String, Boolean)
 Set a named value. This value will be serialized with the component.
SetValue(String, Double)
 Set a named value. This value will be serialized with the component.
SetValue(String, Color)
 Set a named value. This value will be serialized with the component.
SetValue(String, Int32)
 Set a named value. This value will be serialized with the component.
SetValue(String, String)
 Set a named value. This value will be serialized with the component.
TriggerAutoSave()
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(GH_AutoSaveTrigger)
 Triggers the AutoSave function on the owner document with a custom flag.
TriggerAutoSave(Guid)
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(GH_AutoSaveTrigger, Guid)
 Triggers the AutoSave function on the owner document with a custom flag.
ValuesChanged
 Override this method if you want to respond to changes to the value table. The base implementation is empty, so you don't have to call it.
Write |  (Overrides GH_InstanceDescription.Write(GH_IWriter).)
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace