Grasshopper API
IGH_UserPromptAware Methods
The IGH_UserPromptAware type exposes the following members.
Methods
Name | Description
PromptMenuMultipleItems
 Create a menu item that will be inserted into the Parameter context menu for getting multiple values.
PromptMenuSingleItem
 Create a menu item that will be inserted into the Parameter context menu for getting single values.
PromptMultipleItems
 Get multiple items from the user.
PromptSingleItem
 Get a single item from the user.
Top
See Also
Reference
IGH_UserPromptAware Interface
Grasshopper.Kernel Namespace