Grasshopper API
IGH_InstanceGuidDependent Methods
The IGH_InstanceGuidDependent type exposes the following members.
Methods
Name | Description
InstanceGuidsChanged
 This method will be called by the GH_Document that owns this object after it mutates some or all of it's object InstanceIds.
Top
See Also
Reference
IGH_InstanceGuidDependent Interface
Grasshopper.Kernel Namespace