Grasshopper API
GH_GraphicsUtil Methods
The GH_GraphicsUtil type exposes the following members.
Methods
Name | Description
AppendArc(Point3d, Point3d, Vector3d, GraphicsPath)
 Append an arc segment to a GraphicsPath. If the arc cannot be solved, a linear segment is appended instead.
AppendArc(PointF, PointF, SizeF, GraphicsPath)
 Append an arc segment to a GraphicsPath. If the arc cannot be solved, a linear segment is appended instead.
BlendColour(Color, Color)
 Overlays two colours. The Alpha component of the top colour controls the blend.
BlendColour(Color, Color, Double)
 Overlays two colours.
BlendInteger
 Calculates a linear blend between two extremes. Although the inputs are unlimited integers, the output is an integer in the byte range (0-255).
BoxClosestArcPoint
 Find the closest point on or in a box given a test point. Arc extension is implied.
BoxClosestPoint(Point, Rectangle)
 Find the closest point on or in a box given a test point.
BoxClosestPoint(PointF, RectangleF)
 Find the closest point on or in a box given a test point.
BoxFurthestPoint(Point, Rectangle)
 Find the furthest point on or in a box given a test point.
BoxFurthestPoint(PointF, RectangleF)
 Find the furthest point on or in a box given a test point.
BoxViewCone
 Computes the graphicspath that represents the viewcone for a point and a rectangle. If the rectangle contains the point, null is returned.
ColourARGB(Double, Double, Double)
 Create a colour from floating ARGB channels (0.0~1.0). Channels are clipped to valid ranges.
ColourARGB(Int32, Int32, Int32)
 Create a colour from integer RGB channels. Channels are clipped to valid ranges.
ColourARGB(Int32, Int32, Int32, Int32)
 Create a colour from integer ARGB channels. Channels are clipped to valid ranges.
CreateColourIcon
 Create a colour swatch icon.
DentHorizontal(Graphics, Rectangle)
 Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
DentHorizontal(Graphics, Rectangle, Int32, Int32)
 Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
DentVertical(Graphics, Rectangle)
 Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
DentVertical(Graphics, Rectangle, Int32, Int32)
 Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
Distance
 Compute the distance between two points.
DistanceS
 Compute the squared distance between two points.
EtchFadingHorizontal
 Draw an etched line with fading on the extremes.
EtchFadingVertical
 Draw an etched line with fading on the extremes.
EtchHorizontal(Graphics, Single, Single, Single, Int32)
 Draws an etched line segment.
EtchHorizontal(Graphics, Int32, Int32, Int32, Int32, Int32)
 Draws an etched line segment.
EtchVertical(Graphics, Int32, Int32, Int32, Int32)
 Draws an etched line segment.
EtchVertical(Graphics, Single, Single, Single, Int32)
 Draws an etched line segment.
FadeColour
 Fade a colour to transparency by linearly blending a parameter between extremes.
ForegroundColour
 Calculates a suitable foreground color. If the background is lighter than 50%, the foreground will be darker, otherwise the foreground will be lighter.
Grid(Graphics, RectangleF, Int32)
 Draw a default grid.
Grid(Graphics, RectangleF, Int32, Int32)
 Draw a default grid.
Grid(Graphics, RectangleF, Int32, Int32, Color, Color)
 Draw a grid.
HighlightBrush
 Gets a new brush object that can be used to draw the content of hover and focus rectangles. Caller is responsible for disposing the brush.
HighlightPen
 Gets a new pen object that can be used to draw the edges of hover and focus rectangles. Caller is responsible for disposing the pen.
InvertColour
 Computes the inverted colour. Alpha remains the same.
IsPointInEllipse
 Test whether a point is inside or outside an ellipse.
LimitInteger
 Limits the given integer to the 0~255 range.
LimitIntegers
 Limits RGB channels to the 0~255 range,
OffsetColour(Color, Int32)
 Add a fixed value to all the channels in a colour.
OffsetColour(Color, Int32, Int32, Int32)
 Add a fixed value to all the channels in a colour.
RenderBalloonTag(Graphics, String, PointF, RectangleF)
 Draw a default balloon tag in a container.
RenderBalloonTag(Graphics, String, Font, PointF, RectangleF)
 Draw a default balloon tag in a container with a Font override.
RenderBalloonTag(Graphics, String, Font, Color, Color, PointF, Boolean)
 Draw a balloon tag in a container.
RenderBalloonTag(Graphics, String, Font, Color, Color, PointF, RectangleF)
 Draw a balloon tag in a container.
RenderCenteredIcon(Graphics, RectangleF, Image) |  Obsolete.
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
RenderCenteredIcon(Graphics, RectangleF, Image, Double)
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
RenderCenteredIcon(Graphics, RectangleF, Image, Single) |  Obsolete.
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
RenderCenteredText
 Render a bit of text centered on a point.
RenderColourIcon(Graphics, Rectangle, Color) |  Obsolete.
 Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
RenderColourIcon(Graphics, Rectangle, Color, Single)
 Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
RenderFadedImage(Graphics, Image, Rectangle, Double)
 Render an icon into a rectangle with a specific fading factor.
RenderFadedImage(Graphics, Image, Rectangle, Int32)
 Render an icon into a rectangle with a specific fading factor.
RenderHighlightBox(Graphics, Rectangle, Int32)
 Render a typical blueish highlight rectangle
RenderHighlightBox(Graphics, Rectangle, Int32, Boolean, Boolean)
 Render a typical blueish highlight rectangle
RenderHighlightBox(Graphics, Rectangle, Int32, Color, Color)
 Render a typical blueish highlight rectangle
RenderIcon
 Render an icon into a frame. The icon is positioned in the center and will be drawn at its own size multiplied by the system UiScale, provided it doesn't exceed the frame.
RenderObjectOverlay(Graphics, IGH_DocumentObject, RectangleF)
 Render all overlay icons for a specific object. Overlays aren't drawn when the zoom is less than 80%
RenderObjectOverlay(Graphics, IGH_ObjectProxy, RectangleF)
 Render all overlay icons for a specific object. Overlays aren't drawn when the zoom is less than 80%
RenderRoundBar
 Render a cylinder shaped object with round caps.
RenderTag
 Render a text tag into a Graphics surface.
RenderUnscaledIcon(Graphics, Image, Int32, Int32) |  Obsolete.
 Draws an image file at 1:1 scale centered on the given coordinates.
RenderUnscaledIcon(Graphics, Image, Int32, Int32, Double) |  Obsolete.
 Draws an image file at 1:1 scale centered on the given coordinates.
RenderVerticalString
 Render vertical text (rotated 90 degrees counter-clockwise) within a rectangle.
RenderWarningIcon
 Render a typical warning icon into a graphics context. A warning icon is an upright yellow triangle.
ScaleColour
 Multiply the channels of a colour construct with a fixed factor.
ShadowHorizontal(Graphics, Int32, Int32, Int32, Int32, Boolean, Color)
 Draws a horizontal shadow edge.
ShadowHorizontal(Graphics, Int32, Int32, Int32, Int32, Boolean, Int32)
 Draws a horizontal shadow edge.
ShadowHorizontal(Graphics, Single, Single, Single, Single, Boolean, Int32)
 Draws a horizontal shadow edge.
ShadowRectangle(Graphics, Rectangle, Int32, Color)
 Draws shadow edges on the interior of a rectangle.
ShadowRectangle(Graphics, Rectangle, Int32, Int32)
 Draws shadow edges on the interior of a rectangle.
ShadowVertical(Graphics, Int32, Int32, Int32, Int32, Boolean, Color)
 Draws a vertical shadow edge.
ShadowVertical(Graphics, Int32, Int32, Int32, Int32, Boolean, Int32)
 Draws a vertical shadow edge.
ShadowVertical(Graphics, Single, Single, Single, Single, Boolean, Int32)
 Draws a vertical shadow edge.
SolveArc(Point3d, Point3d, Vector3d, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
SolveArc(PointF, PointF, SizeF, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
SolveArc(Double, Double, Double, Double, Double, Double, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
TransparencyMatrix(Double)
 Create an image transparency matrix for a specific blending factor.
TransparencyMatrix(Int32)
 Create an image transparency matrix for a specific blending factor.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace