Grasshopper API
GH_NamedView Methods
The GH_NamedView type exposes the following members.
Methods
Name | Description
LoadFromViewport
 Create a named view from a viewport.
Read
SetToViewport(GH_Canvas)
 Set the named view to the canvas viewport and redraw the canvas.
SetToViewport(GH_Viewport)
 Set the named view to a viewport.
SetToViewport(GH_Canvas, Int32)
 Animates a view transition.
Write
Top
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace