Grasshopper API
IGH_DebugDescription Methods
The IGH_DebugDescription type exposes the following members.
Methods
Name | Description
AppendToDebugLog
 Write important debugging data to a debug writer object.
Top
See Also
Reference
IGH_DebugDescription Interface
Grasshopper.Kernel Namespace