Grasshopper API
Param_ModelObject Methods
The Param_ModelObject type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace