Grasshopper API
ObjectRender Methods
The ObjectRender type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToDetails
Top
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace