Grasshopper API
GH_ComponentAttributes Methods
The GH_ComponentAttributes type exposes the following members.
Methods
Name | Description
AppendToAttributeTree |  (Overrides GH_Attributes<T>.AppendToAttributeTree(List<IGH_Attributes>).)
ExpireLayout |  (Overrides GH_Attributes<T>.ExpireLayout().)
InvalidateCanvas
 The canvas must be invalidated when the mouse is near enough and this component has variable parameters.
 (Overrides GH_Attributes<T>.InvalidateCanvas(GH_Canvas, GH_CanvasMouseEvent).)
IsPickRegion(PointF) |  (Overrides GH_Attributes<T>.IsPickRegion(PointF).)
Layout |  (Overrides GH_Attributes<T>.Layout().)
LayoutBounds
LayoutComponentBox
 Utility layout method for GH_Component style UI.
LayoutInputParams
LayoutOutputParams
Render |  (Overrides GH_Attributes<T>.Render(GH_Canvas, Graphics, GH_CanvasChannel).)
RenderComponentCapsule(GH_Canvas, Graphics)
 Utility function, draws the complete component capsule including all parameter data.
RenderComponentCapsule(GH_Canvas, Graphics, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Utility function, draws the component capsule including all specified elements.
RenderComponentParameters
 Utility method for rendering all component parameters.
RenderVariableParameterUI
RespondToMouseDown |  (Overrides GH_Attributes<T>.RespondToMouseDown(GH_Canvas, GH_CanvasMouseEvent).)
SetupTooltip |  (Overrides GH_Attributes<T>.SetupTooltip(PointF, GH_TooltipDisplayEventArgs).)
Top
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace