Grasshopper API
ModelData Methods
The ModelData type exposes the following members.
Methods
Name | Description
Cast<A, T>
CastTo<T>
Equals(ModelData)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Read
ToAttributes
ToDetails
TooltipString
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace