Grasshopper API
IGH_Structure Methods
The IGH_Structure type exposes the following members.
Methods
Name | Description
AllData
 Gets an enumerator for all the data items in this structure.
Clear
 Clears the entire structure.
ClearData
 Removes all data from all paths without affecting the structure topology.
DataDescription
 Gets a description of the data contained in this structure.
EnsureCapacity
 Ensures that all branches have a certain capacity
ExpandPath
 Expand a path in this structure by appending an element.
Flatten
 Flattens the entire structure into a single path.
Graft(GH_GraftMode)
 Grafts all paths by reallocating all data into child paths.
Graft(GH_GraftMode, GH_Path)
 Grafts a specific path by reallocating all data into child paths. If a grafted path coincides with an existing path, the data item in question will be appended to the existing path.
LongestPathIndex
 Finds the path in this structure with the most dimensions. In case of multiple equally long longest paths, the last one will be returned.
PathExists
 Returns True if the specified path is already defined inside the structure.
PathIndex
 Find the indices that delineate the given path domain.
RemovePath
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
ReplacePath
 Replace an existing path with a different one. If the operation is successfull, then the 'find' path will be deleted. If the 'replace' path is already defined, the items in 'find' will be appended to the existing path.
ShortestPathIndex
 Finds the path in this structure with the least dimensions. In case of multiple equally long longest paths, the first one will be returned.
Simplify
 Simplify the data structure by removing path indices shared by all branches.
TrimExcess
 Trims the excess allocated memory in all branches
Top
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace