Grasshopper API
IGH_VariableParameterComponent Methods
The IGH_VariableParameterComponent type exposes the following members.
Methods
Name | Description
CanInsertParameter
 This function will get called before an attempt is made to insert a parameter. Since this method is potentially called on Canvas redraws, it must be fast.
CanRemoveParameter
 This function will get called before an attempt is made to remove a parameter. Since this method is potentially called on Canvas redraws, it must be fast.
CreateParameter
 This function will be called when a new parameter is about to be inserted. You must provide a valid parameter or insertion will be skipped. You do not, repeat not, need to insert the parameter yourself.
DestroyParameter
 This function will be called when a parameter is about to be removed. You do not need to do anything, but this would be a good time to remove any event handlers that might be attached to the parameter in question.
VariableParameterMaintenance
 This method will be called when a closely related set of variable parameter operations completes. This would be a good time to ensure all Nicknames and parameter properties are correct. This method will also be called upon IO operations such as Open, Paste, Undo and Redo.
Top
See Also
Reference
IGH_VariableParameterComponent Interface
Grasshopper.Kernel Namespace