Grasshopper API
IGH_DocumentObject Methods
The IGH_DocumentObject type exposes the following members.
Methods
Name | Description
AddedToDocument
 This method will be called when an object is added to a document.
AppendMenuItems
 This function is called when a context menu is about to be displayed. Override it to set custom items.
CreateAttributes
 Create new default attributes for this object. You should only call this function when the Attributes() field is null.
DocumentContextChanged
 This method will be called when the document that owns this object moves into a different context.
ExpirePreview
 Call this function when you suspect that the preview has expired for this object. This will cause the display cache to be eradicated.
ExpireSolution
 Call this function whenever you do something which expires the current solution. This will make sure all caches are erased, all downstream objects are expired and that the event is raised. The default implementation merely places a call to OnSolutionExpired(), override this function in derived classes to make sure you clear local data caches and expire downstream objects.
IsolateObject
 Destroy all connections to other objects.
MovedBetweenDocuments
 This method will be called when an object is moved from one document to another.
OnAttributesChanged
 Raises the AttributesChanged event on the toplevel object.
OnDisplayExpired
 Raises the DisplayExpired event on the toplevel object.
OnObjectChanged(GH_ObjectChangedEventArgs)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(GH_ObjectEventType)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(String)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(GH_ObjectEventType, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(String, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnPingDocument
 Raise the PingDocument Event on the toplevel object and try to find the document which owns this object.
OnPreviewExpired
 Raises the PreviewExpired event on the toplevel object.
OnSolutionExpired
 Raises the SolutionExpired event on the toplevel object.
RecordUndoEvent(GH_UndoRecord)
 Record an entire undo record.
RecordUndoEvent(String)
 Record a generic object change undo event.
RecordUndoEvent(String, IGH_UndoAction)
 Record a specific object change undo event.
RemovedFromDocument
 This method will be called when an object is removed from a document.
TriggerAutoSave()
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(GH_AutoSaveTrigger)
 Triggers the AutoSave function on the owner document with a custom flag.
TriggerAutoSave(Guid)
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(GH_AutoSaveTrigger, Guid)
 Triggers the AutoSave function on the owner document with a custom flag.
Top
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace