Grasshopper API
ModelTextureSlot Methods
The ModelTextureSlot type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace