Grasshopper API
Attributes Methods
The ModelDisplayMode.Attributes type exposes the following members.
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
See Also
Reference
ModelDisplayMode.Attributes Class
Grasshopper.Rhinoceros.Display Namespace