Grasshopper API
GH_Animator Methods
The GH_Animator type exposes the following members.
Methods
Name | Description
DecimalAnimator(Decimal, Decimal)
DecimalAnimator(Decimal, Decimal, Int32)
DecimalAnimator(Decimal, Decimal, DateTime, DateTime)
DoubleAnimator(Double, Double)
DoubleAnimator(Double, Double, Int32)
DoubleAnimator(Double, Double, DateTime, DateTime)
IntegerAnimator(Int32, Int32)
IntegerAnimator(Int32, Int32, Int32)
IntegerAnimator(Int32, Int32, DateTime, DateTime)
InterpolateDecimal
 Utility interpolation delegate for System.Decimal values.
InterpolateDouble
 Utility interpolation delegate for System.Double values.
InterpolateInteger
 Utility interpolation delegate for System.Int32 values.
InterpolatePoint
 Utility interpolation delegate for System.Drawing.Point values.
InterpolatePointF
 Utility interpolation delegate for System.Drawing.PointF values.
InterpolateRectangle
 Utility interpolation delegate for System.Drawing.Rectangle values.
InterpolateRectangleF
 Utility interpolation delegate for System.Drawing.RectangleF values.
InterpolateSingle
 Utility interpolation delegate for System.Single values.
PointAnimator(Point, Point)
PointAnimator(Point, Point, Int32)
PointAnimator(Point, Point, DateTime, DateTime)
PointFAnimator(PointF, PointF)
PointFAnimator(PointF, PointF, Int32)
PointFAnimator(PointF, PointF, DateTime, DateTime)
RectangleAnimator(Rectangle, Rectangle)
RectangleAnimator(Rectangle, Rectangle, Int32)
RectangleAnimator(Rectangle, Rectangle, DateTime, DateTime)
RectangleFAnimator(RectangleF, RectangleF)
RectangleFAnimator(RectangleF, RectangleF, Int32)
RectangleFAnimator(RectangleF, RectangleF, DateTime, DateTime)
SingleAnimator(Single, Single)
SingleAnimator(Single, Single, Int32)
SingleAnimator(Single, Single, DateTime, DateTime)
Top
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace