Grasshopper API
ModelViewport Methods
The ModelViewport type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
RenderItem |  (Overrides ModelContent.RenderItem(Graphics, RectangleF, Int32).)
ToAttributes
Top
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace