Grasshopper API
GH_AutoSaveSettings Methods
The GH_AutoSaveSettings type exposes the following members.
Methods
Name | Description
AutosaveFilter
 Tests a given trigger to see if it allows an autosave operation.
Top
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace