Grasshopper API
GH_ResizableAttributes<T> Methods
The GH_ResizableAttributes<T> generic type exposes the following members.
Methods
Name | Description
RespondToMouseDown |  (Overrides GH_Attributes<T>.RespondToMouseDown(GH_Canvas, GH_CanvasMouseEvent).)
RespondToMouseMove |  (Overrides GH_Attributes<T>.RespondToMouseMove(GH_Canvas, GH_CanvasMouseEvent).)
RespondToMouseUp |  (Overrides GH_Attributes<T>.RespondToMouseUp(GH_Canvas, GH_CanvasMouseEvent).)
Top
See Also
Reference
GH_ResizableAttributes<T> Class
Grasshopper.Kernel.Attributes Namespace