Grasshopper API
GH_UserObject Methods
The GH_UserObject type exposes the following members.
Methods
Name | Description
Clear
 Destroy all data except the file path and the ID.
CreateDefaultPath
 Set the Path field for this user object to the default. The default file name is derived from the Description.Name field. This method also ensures the UserObject directory exists.
InstantiateObject
 Instantiate a new IGH_DocumentObject from this User Object.
ReadFromFile
 Force an update of the local data from the file. The Path field must be set for this to work.
SaveToFile
 Save the current User Object state to a file. Any existing file will be overwritten.
SetDataFromObject
 Set the Data field content of ths UserObject from a Document object instance.
Top
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace