Grasshopper API
GH_GHXHarvester Methods
Methods
Name | Description
HarvestBoundingBoxes(GH_Archive)
 Harvest all attribute bounding boxes from a GHX/GH archive.
HarvestBoundingBoxes(GH_IReader)
 Harvest all attribute bounding boxes from a GHX/GH node.
HarvestBoundingBoxes(String)
 Harvest all attribute bounding boxes from a GHX/GH archive.
HarvestPivots(GH_Archive)
 Harvest all attribute pivots from a GHX/GH archive.
HarvestPivots(GH_IReader)
 Harvest all attribute pivots from a GHX/GH node.
HarvestPivots(String)
 Harvest all attribute pivots from a GHX/GH archive.
Top
See Also
Reference
GH_GHXHarvester Class
Grasshopper.Kernel Namespace