Grasshopper API
ModelConstructionPlane Methods
The ModelConstructionPlane type exposes the following members.
Methods
Name | Description
Cast
CastTo<Q>
Equals(ModelConstructionPlane)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetBoundingBox
GetHashCode |  (Overrides Object.GetHashCode().)
Morph
ToConstructionPlane
ToString |  (Overrides Object.ToString().)
Transform
Top
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace