Grasshopper API
GH_StateTagList Methods
The GH_StateTagList type exposes the following members.
Methods
Name | Description
Layout
 Layout the StateTags.
RenderStateTags
 Render all StateTags in this list to the designated Graphics surface.
Top
See Also
Reference
GH_StateTagList Class
Grasshopper.Kernel Namespace