Grasshopper API
GH_ArchiveMessageViewer Methods
The GH_ArchiveMessageViewer type exposes the following members.
Methods
Name | Description
Dispose
 Clean up any resources being used.
 (Overrides Form.Dispose(Boolean).)
SetArchive
 Set a new archive. The messages in this archive will be displayed on the form.
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_ArchiveMessageViewer Class
GH_IO.UserInterface Namespace