Grasshopper API
GH_PlaneProxy Methods
The GH_Plane.GH_PlaneProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Plane.GH_PlaneProxy Class
Grasshopper.Kernel.Types Namespace