Grasshopper API
GH_AddStateAction Methods
The GH_AddStateAction type exposes the following members.
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Read |  (Overrides GH_ArchivedUndoAction.Read(GH_IReader).)
Write |  (Overrides GH_ArchivedUndoAction.Write(GH_IWriter).)
Top
See Also
Reference
GH_AddStateAction Class
Grasshopper.Kernel.Undo.Actions Namespace