Grasshopper API
GH_RotationalTuningData<T> Methods
The GH_RotationalTuningData<T> generic type exposes the following members.
Methods
Name | Description
AddFrame
 Grow the tuning track by one point and compute the angle.
TotalAngle
 Compute the total angle from the first to the last frame.
TotalTurns
 Compute the total number of full turns from the first to the last frame.
Top
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace