Grasshopper API
GH_GeometricGooWrapper Methods
The GH_GeometricGooWrapper type exposes the following members.
Methods
Name | Description
CastFrom
CastTo<T>
ClearCaches
Duplicate
DuplicateGeometry
EmitProxy
GetBoundingBox
LoadGeometry()
LoadGeometry(RhinoDoc)
Morph
Read
ScriptVariable
 This function will be called when the local IGH_Goo instance disapears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
ToString |  (Overrides Object.ToString().)
Transform
Write
Top
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace