Grasshopper API
IGH_Embeddable Methods
The IGH_Embeddable type exposes the following members.
Methods
Name | Description
PrepareForCancel
 This will be called prior to a Cancel operation.
PrepareForCommit
 This will be called prior to a Commit operation.
Top
See Also
Reference
IGH_Embeddable Interface
Grasshopper.GUI Namespace