Grasshopper API
GH_ComponentServer Methods
The GH_ComponentServer type exposes the following members.
Methods
Name | Description
AddAlias
 Add an alias to a target.
AddCategoryIcon
 Add an icon for a tab category. 16x16 images are required.
AddCategoryShortName
 Add an abbreviation for a tab category. 2~4 letter abbreviations are best.
AddCategorySymbolName
 Add a single char category description.
AliasTargets
 Get all the target Component IDs for a given alias.
Clear
 Clear all caches.
ClearStaleUserObjects
 Remove all user objects that no longer point to existing files.
CompareProxies
 Compare two object proxies. Names and exposures are taken into account.
CopyFileToAppropriateFolder
 Copy a GHA or GHUSER file into the appropriate Roaming Application Data folder. Of the file is already in the top-level roaming folder it will not be copied.
CreateComponentPalette
DestroyLoadingUI
 Destroy the loading UI (the banner and the progress bar).
EmitGraph
 Create a new instance of the IGH_Graph that matches the id. If no proxy can be matched to the id, a null reference will be returned.
EmitObject
 Create a new instance of the IGH_DocumentObject that matches the id. If no proxy can be matched to the id, a null reference will be returned.
EmitObjectIcon
 Get the icon that is associated with the given Object ID.
EmitObjectProxy
 Get the proxy that is associated with the given Object ID.
ExternalFiles
 Get lists of all the external files (GHA, GHUSER and GHCLUSTER) that will be loaded by Grasshopper. Note: this does not equal the files that may already have been loaded, just the files that we'll attempt to load if we were asked to load all plugins now. The list contains no duplicate file paths, but it may contain identical files which won't be filtered until actual loading.
FindAssembly
 Gets the assembly that corresponds to the given library ID.
FindAssemblyByObject(Guid)
 Gets the assembly that corresponds to the given library ID.
FindAssemblyByObject(IGH_DocumentObject)
 Gets the assembly that corresponds to the given library ID.
FindObjectByName
 Find an object by name. Obsolete and hidden objects are ignored. Only exact matches are included.
FindObjects(Guid)
 Find all the objects that are part of a certain library.
FindObjects(String[], Int32, IGH_ObjectProxy[], Double[])
 Searches the list of cached object proxies for objects that might be implied by a search term.
FindUpgrader
 Find the upgrader that can convert from the given target.
GetAlias
 Gets the alias display string for a given object.
GetCategoryIcon
 Get the icon for a specific category. If the icon hasn't been defined, this method will return the default icon.
GetCategoryShortName
 Get the abbreviation (short name) for a specific category. If the short name hasn't been defined, this method will return the full name instead.
GetCategorySymbolName
 Get the single char representation for a specific category. If the char hasn't been defined, this method will return the first char of the full name instead.
IsGraphCached
 Tests the graph cache for an existing graph type ID.
IsObjectCached
 Tests the caches for an existing object type ID.
IsUpgrader
 Checks to see if at least one upgrader is defined for a collection of objects.
LoadAliases
 Load the Alias table from the settings directory. Only use this function if you suspect the alias table settings file has changed due to some external process.
NewUserObject
 Create a new UserObject and write it to the Grasshopper User Object folder.
RemoveCachedGraph
 Remove a cache entry from the graph cache. This cannot be undone.
RemoveCachedObject(Guid)
 Remove a cache entry from the object cache. This cannot be undone.
RemoveCachedObject(String)
 Remove the user object (if any) that loads itself from a specified *.ghuser file.
SaveAliases
 Save the alias table to the settings directory. Use this function if you change the alias table while ignoring usual channels.
SetAlias
 Sets the aliases for a given target.
UpdateRibbonUI
 Forces an update of the Ribbon control on the Grasshopper main form.
Top
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace