Grasshopper API
ModelContentName Methods
The ModelContentName type exposes the following members.
Methods
Name | Description
Combine
CompareTo(ModelContentName)
CompareTo(Object)
Equals(ModelContentName)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Split
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace