Grasshopper API
GH_CanvasDropTargetValidator Methods
The GH_CanvasDropTargetValidator type exposes the following members.
Methods
Name | Description
AddedToCanvas |  (Overrides GH_CanvasValidator.AddedToCanvas(GH_Canvas).)
AppliesToDocument |  (Overrides GH_CanvasValidator.AppliesToDocument(Guid).)
CanAcceptObject |  (Overrides GH_CanvasValidator.CanAcceptObject(Guid).)
CanCreateObject |  (Overrides GH_CanvasValidator.CanCreateObject(Guid, PointF).)
CanDeleteObject |  (Overrides GH_CanvasValidator.CanDeleteObject(IGH_DocumentObject).)
CanDragObject |  (Overrides GH_CanvasValidator.CanDragObject(IGH_DocumentObject, PointF).)
CanShowCanvasMenu |  (Overrides GH_CanvasValidator.CanShowCanvasMenu(PointF).)
CanShowComponentSearchBox |  (Overrides GH_CanvasValidator.CanShowComponentSearchBox(PointF).)
RemovedFromCanvas |  (Overrides GH_CanvasValidator.RemovedFromCanvas(GH_Canvas).)
Top
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace