Grasshopper API
ModelContentParam<T> Methods
The ModelContentParam<T> generic type exposes the following members.
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_PersistentParam<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Menu_AppendConnectRecipients |  (Overrides GH_Param<T>.Menu_AppendConnectRecipients(ToolStripDropDown).)
Menu_AppendInternaliseData |  (Overrides GH_PersistentParam<T>.Menu_AppendInternaliseData(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
RemoteIdExpired
SelectedContent
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace