Grasshopper API
GH_DimensionProxy Methods
The GH_Dimension.GH_DimensionProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Dimension.GH_DimensionProxy Class
Grasshopper.Kernel.Types Namespace