Grasshopper API
GH_PersistentGeometryParam<T> Methods
The GH_PersistentGeometryParam<T> generic type exposes the following members.
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_PersistentParam<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
ClearData |  (Overrides GH_Param<T>.ClearData().)
ConversionCallback |  (Overrides GH_Param<T>.ConversionCallback(Object, T).)
EraseGeometryCaches
ExpireSolution |  (Overrides GH_ActiveObject.ExpireSolution(Boolean).)
OnVolatileDataCollected
 This override removes all instances that fail to load their geometry.
 (Overrides GH_Param<T>.OnVolatileDataCollected().)
PublishRcpItem
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
RegisterRemoteIdsDespiteSources
 Call this method if you wish to register remote ids in the volatile data despite having one or more sources. You should only need to do this if you converted non-referenced data into volatile referenced data.
RemoteIdExpired
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace