Grasshopper API
GH_Predicate Methods
The GH_Predicate type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>
Duplicate
EmitProxy
Format
Invoke
Negate
Read
ScriptVariable
ToString |  (Overrides Object.ToString().)
TryCastTo<T>
Write
Top
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace