Grasshopper API
GH_DocumentServer Methods
The GH_DocumentServer type exposes the following members.
Methods
Name | Description
AddDocument(GH_Document)
 Add a new document to the global list. If the document is already registered nothing will happen. This also applies to a different document which points to the same file path
AddDocument(GH_Document, Boolean)
 Add a new document to the global list. If the document is already registered nothing will happen. This also applies to a different document which points to the same file path
AddDocument(String, Boolean)
 Add a new document to the global list. If there already is a document with the given path, it will be made active.
AddNewDocument
 Adds a new document to the global list. If a template file has been set, this document will be based on the template.
Contains
 Gets a value indicating whether or not the given document is inside the list.
GetEnumerator
GetEnumerator_Generic
IndexOf(GH_Document)
 Gets the index of the given document.
IndexOf(String)
 Gets the index of the document that matches the filepath.
IndexOfAutoSave
 Gets the document index that is associated with the specified autosave location.
NextAvailableDocument
 Gets the most important, non-active document.
PromoteDocument
 Push a document to the top of the list, meaning it will be first in line when a new default document needs to be selected.
RemoveAllDocuments
 Remove all documents in the global list.
RemoveDocument
 Removes a specific document from the global list. If the document isn't registered nothing will happen. If the document is owned by an IGH_DocumentOwner, the owner will be informed of the removal.
SafeRemoveDocument
 Remove a document correctly from the server. This method shows user-interface prompts if there is unsaved data and will also save if needed.
Top
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace