Grasshopper API
GH_Goo<T> Methods
The GH_Goo<T> generic type exposes the following members.
Methods
Name | Description
CastFrom
 Attempt a cast from generic data.
CastTo<Q>
 Attempt a cast to type Q.
Duplicate
 Make a complete duplicate of this instance. No shallow copies.
EmitProxy
 Create a new proxy for this instance. Return Null if this class does not support proxies.
Read
 Default behaviour is to return True.
ScriptVariable
 This function will be called when the local IGH_Goo instance disappears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
ToString
 Creates a string description of the current instance value.
 (Overrides Object.ToString().)
Write
 Default behaviour is to return True.
Top
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace