Grasshopper API
Param_ModelTextureSlot Methods
The Param_ModelTextureSlot type exposes the following members.
Methods
Name | Description
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
See Also
Reference
Param_ModelTextureSlot Class
Grasshopper.Rhinoceros.Render.Params Namespace