Grasshopper API
ModelValue Methods
The ModelValue type exposes the following members.
Methods
Name | Description
CastTo<T>
Clone
Read
ReadValue<T>
ScriptVariable
TooltipString
ToString |  (Overrides Object.ToString().)
Write
WriteValue<T>
Top
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace