Grasshopper API
ModelLinetype Methods
The ModelLinetype type exposes the following members.
Methods
Name | Description
Cast
ToAttributes
Top
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace