Grasshopper API
IGH_DataAccess Methods
The IGH_DataAccess type exposes the following members.
Methods
Name | Description
AbortComponentSolution
 Call this method if you wish to stop solving this component.
BlitData<Q>
 Creates a direct copy of an existing data structure. The existing generic instance must of the exact same type as the target parameter.
DisableGapLogic()
 Call this function if you want to disable the gap null logic for the current iteration.
DisableGapLogic(Int32)
 Call this function if you want to disable the gap null logic for a specific output parameter.
GetData<T>(Int32, T)
 Retrieve data from an input parameter during GH_Component.SolveInstance().
GetData<T>(String, T)
 Retrieve data from an input parameter during GH_Component.SolveInstance().
GetDataList<T>(Int32, List<T>)
 Retrieve an entire list of data from an input parameter during GH_Component.SolveInstance().
GetDataList<T>(String, List<T>)
 Retrieve an entire list of data from an input parameter during GH_Component.SolveInstance().
GetDataTree<T>(Int32, GH_Structure<T>)
 Retrieve an entire data tree from an input parameter during GH_Component.SolveInstance().
GetDataTree<T>(String, GH_Structure<T>)
 Retrieve an entire data tree from an input parameter during GH_Component.SolveInstance().
IncrementIteration
 Increments the iteration count by 1.
ParameterTargetIndex
 Get the target index for the specified output parameter.
ParameterTargetPath
 Get the target path for the specified output parameter.
SetData(Int32, Object)
 Stores data in an output parameter during GH_Component.SolveInstance(). Use this function only for setting individual data items. If you want to set lists of data, you *must* call SetDataList() instead.
SetData(String, Object)
 Stores data in an output parameter during GH_Component.SolveInstance().
SetData(Int32, Object, Int32)
 Expert user function. Stores data in an output parameter during GH_Component.SolveInstance(). Use this function only for setting individual data items. If you want to set lists of data, you *must* call SetDataList() instead.
SetDataList(Int32, IEnumerable)
 Stores a list of data in an output parameter during GH_Component.SolveInstance().
SetDataList(String, IEnumerable)
 Stores data in an output parameter during GH_Component.SolveInstance().
SetDataList(Int32, IEnumerable, Int32)
 Expert user function. Stores a list of data in an output parameter during GH_Component.SolveInstance().
SetDataTree(Int32, IGH_DataTree)
 Folds a utility tree representation into this tree.
SetDataTree(Int32, IGH_Structure)
 Folds a utility tree representation into this tree.
Util_CountNonNullRefs<T>
 Count all object references in L
Util_CountNullRefs<T>
 Count all null references in L
Util_EnsureNonNullCount<T>
 Tests a list to see if it contains sufficient non-null references.
Util_FirstNonNullItem<T>
 Returns the index of the first non-null item in a list.
Util_RemoveNullRefs<T>
 Remove all null references from a list of items.
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace