Grasshopper API
GH_TextEntity Methods
The GH_TextEntity type exposes the following members.
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_AnnotationBase.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateTextEntity
 Create a duplicate of this text entity.
ToString
 Format the text entity using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
See Also
Reference
GH_TextEntity Class
Grasshopper.Kernel.Types Namespace