Grasshopper API
Attributes Methods
The ObjectDrafting.Attributes type exposes the following members.
Methods
Name | Description
Equals(ObjectDrafting.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace