Grasshopper API
GH_DigitScrollerBase Methods
The GH_DigitScrollerBase type exposes the following members.
Methods
Name | Description
HandleTextInputAccepted |  (Overrides GH_TextBoxInputBase.HandleTextInputAccepted(String).)
MouseDown
 Respond to mouse-down events.
MouseMove
 Respond to mouse-move events.
MouseUp
 Respond to mouse-up events.
OnInvalidated
 Raise the Invalidated event.
OnValueChanged
 Raise the ValueChanged event.
Render
 Render all UI elements.
SetupScroller
 Set the minimum, maximum and value fields simultaneously.
ShowTextInputBox(Control)
ShowTextInputBox(Control, Boolean)
ShowTextInputBox(Control, Boolean, Matrix)
Top
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace