Grasshopper API
GH_Grip Methods
The GH_Grip type exposes the following members.
Methods
Name | Description
Blend
CompareTo
MutateId
 Create a new grip ID.
Read
Write
Top
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace