Grasshopper API
GH_Animator<T> Methods
The GH_Animator<T> generic type exposes the following members.
Methods
Name | Description
AdjustAnimation(T)
 Adjust the animation.
AdjustAnimation(T, Int32)
 Adjust the animation.
AdjustAnimation(T, DateTime, DateTime)
 Adjust the animation.
CurrentValue
 Gets the current animated value.
Top
See Also
Reference
GH_Animator<T> Class
Grasshopper.GUI Namespace