Grasshopper API
GH_Chunk Methods
The GH_Chunk type exposes the following members.
Methods
Name | Description
AddComment
 Adds a text comment to this chunk. Comments are serialized only if the output flavour is a human readable format. Comments are never deserialized, they are purely for the benefit of the humans reading the file data.
AddMessage
 Log a new message with the top-level archive. Messages are collected during read/write operations, and can be displayed to the user upon completion using GH_Archive.ShowMessageLog().
ChunkExists(String)
 Checks whether a chunk with the specified name exists in the litter. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
ChunkExists(String, Int32)
 Checks whether a chunk with the specified name and index exists in the litter. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
CopyValuesFromChunk
 Copy all values and sub-chunks from another chunk.
CopyValuesToChunk
 Copy all values and sub-chunks in this chunk to another chunk which does not point to the same archive.
CreateChunk(String)
 Create a new child chunk with the specified name and without an index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
CreateChunk(String, Int32)
 Create a new child chunk with the specified name and index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
FindChunk(String)
 Finds the first chunk in the litter that matches the given name. Only chunks without index qualifiers are considered.
FindChunk(String, Int32)
 Finds the first chunk in the list that matches the given name and index. Only chunks with index qualifiers are considered.
FindItem(String)
 Finds the first item that matches the given name. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
FindItem(String, Int32)
 Finds the first item that matches the given name and index. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
GetBoolean(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetBoolean(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetBoundingBox(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetBoundingBox(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetByte(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetByte(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetByteArray(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetByteArray(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDate(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDate(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDecimal(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDecimal(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDouble(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDouble(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDoubleArray(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDoubleArray(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingBitmap(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingBitmap(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingColor(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingColor(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingPoint(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingPoint(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingPointF(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingPointF(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingRectangle(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingRectangle(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingRectangleF(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingRectangleF(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingSize(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingSize(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetDrawingSizeF(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetDrawingSizeF(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetGuid(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetGuid(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInt32(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInt32(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInt64(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInt64(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInterval1D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInterval1D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetInterval2D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInterval2D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetLine(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetLine(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPath(String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPath(String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPlane(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPlane(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPoint2D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPoint2D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPoint3D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPoint3D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetPoint4D(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPoint4D(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetSingle(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetSingle(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetString(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetString(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
GetVersion(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetVersion(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
InstantiateRoot
 Construct a new instance of GH_Chunk which acts as a Root node. If you must create a chunk from scratch, use this static method to create one.
ItemExists(String)
 Gets the occupancy for a specific item name. Only items without index qualifiers are considered.
ItemExists(String, Int32)
 Checks whether an item with the specified name and index exists. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
Read(BinaryReader)
 Read this chunk and all child chunks from a binary stream.
Read(XmlNode)
 Read this chunk and all child chunks from an Xml node.
RemoveChunk(GH_IChunk)
 Remove the specified chunk from the litter.
RemoveChunk(String)
 Remove the first chunk with a matching name. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
RemoveChunk(String, Int32)
 Remove the first chunk with a matching name and index. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
RemoveItem(String)
 Remove an unindexed item from this chunk.
RemoveItem(String, Int32)
 Remove an indexed item from this chunk.
SetBoolean(String, Boolean)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetBoolean(String, Int32, Boolean)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetBoundingBox(String, GH_BoundingBox)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetBoundingBox(String, Int32, GH_BoundingBox)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetByte(String, Byte)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetByte(String, Int32, Byte)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetByteArray(String, Byte[])
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetByteArray(String, Int32, Byte[])
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDate(String, DateTime)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDate(String, Int32, DateTime)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDecimal(String, Decimal)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDecimal(String, Int32, Decimal)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDouble(String, Double)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDouble(String, Int32, Double)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDoubleArray(String, Double[])
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDoubleArray(String, Int32, Double[])
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingBitmap(String, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingBitmap(String, Int32, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingColor(String, Color)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingColor(String, Int32, Color)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingPoint(String, Point)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingPoint(String, Int32, Point)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingPointF(String, PointF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingPointF(String, Int32, PointF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingRectangle(String, Rectangle)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingRectangle(String, Int32, Rectangle)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingRectangleF(String, RectangleF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingRectangleF(String, Int32, RectangleF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingSize(String, Size)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingSize(String, Int32, Size)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingSizeF(String, SizeF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingSizeF(String, Int32, SizeF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetGuid(String, Guid)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetGuid(String, Int32, Guid)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInt32(String, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInt32(String, Int32, Int32)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInt64(String, Int64)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInt64(String, Int32, Int64)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInterval1D(String, GH_Interval1D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInterval1D(String, Int32, GH_Interval1D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInterval2D(String, GH_Interval2D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInterval2D(String, Int32, GH_Interval2D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetLine(String, GH_Line)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetLine(String, Int32, GH_Line)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPath(String, String, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPath(String, Int32, String, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPlane(String, GH_Plane)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPlane(String, Int32, GH_Plane)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPoint2D(String, GH_Point2D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint2D(String, Int32, GH_Point2D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPoint3D(String, GH_Point3D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint3D(String, Int32, GH_Point3D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPoint4D(String, GH_Point4D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint4D(String, Int32, GH_Point4D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetSingle(String, Single)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetSingle(String, Int32, Single)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetString(String, String)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetString(String, Int32, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetVersion(String, GH_Version)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetVersion(String, Int32, GH_Version)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetVersion(String, Int32, Int32, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetVersion(String, Int32, Int32, Int32, Int32)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
TryGetBoolean(String, Boolean)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetBoolean(String, Int32, Boolean)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetBoundingBox(String, GH_BoundingBox)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetBoundingBox(String, Int32, GH_BoundingBox)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetByte(String, Byte)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetByte(String, Int32, Byte)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDate(String, DateTime)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDate(String, Int32, DateTime)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDecimal(String, Decimal)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDecimal(String, Int32, Decimal)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDouble(String, Double)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDouble(String, Int32, Double)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingColor(String, Color)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingColor(String, Int32, Color)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingPoint(String, Point)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingPoint(String, Int32, Point)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingPointF(String, PointF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingPointF(String, Int32, PointF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingRectangle(String, Rectangle)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingRectangle(String, Int32, Rectangle)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingRectangleF(String, RectangleF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingRectangleF(String, Int32, RectangleF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingSize(String, Size)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingSize(String, Int32, Size)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetDrawingSizeF(String, SizeF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingSizeF(String, Int32, SizeF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetGuid(String, Guid)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetGuid(String, Int32, Guid)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInt32(String, Int32)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInt32(String, Int32, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInt64(String, Int64)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInt64(String, Int32, Int64)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInterval1D(String, GH_Interval1D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInterval1D(String, Int32, GH_Interval1D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetInterval2D(String, GH_Interval2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInterval2D(String, Int32, GH_Interval2D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetLine(String, GH_Line)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetLine(String, Int32, GH_Line)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPlane(String, GH_Plane)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPlane(String, Int32, GH_Plane)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPoint2D(String, GH_Point2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint2D(String, Int32, GH_Point2D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPoint3D(String, GH_Point3D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint3D(String, Int32, GH_Point3D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetPoint4D(String, GH_Point4D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint4D(String, Int32, GH_Point4D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetSingle(String, Single)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetSingle(String, Int32, Single)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetString(String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetString(String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
TryGetVersion(String, GH_Version)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetVersion(String, Int32, GH_Version)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Write(BinaryWriter)
 Write this chunk and all child chunks to a binary stream.
Write(XmlWriter)
 Serialize this chunk into an Xml stream.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace