Grasshopper API
GH_LineProxy Methods
The GH_Line.GH_LineProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Line.GH_LineProxy Class
Grasshopper.Kernel.Types Namespace