Grasshopper API
Translation Methods
The Translation type exposes the following members.
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Translation Class
Grasshopper.Kernel.Types.Transforms Namespace