Grasshopper API
GH_RhinoScriptInterface Methods
The GH_RhinoScriptInterface type exposes the following members.
Methods
Name | Description
AssignDataToParameter
 Find a parameter and assign some persistent data.
BakeDataInObject
 Find an object and bake all geometry inside of it.
CloseAllDocuments
 Close all Grasshopper documents.
CloseDocument
 Close the currently active Grasshopper document. If there is not active document, nothing will happen.
DisableBanner
 Disables the display of the Grasshopper banner during Component loading. The banner is typically only shown once during a Grasshopper session, namely when the Editor is first loaded.
DisableSolver
 Disables the Grasshopper Solver. If the Solver is disabled, expired components and parameter will not be recomputed, though any existing solution will remain intact.
EnableBanner
 Enables the display of the Grasshopper banner during Component loading. The banner is typically only shown once during a Grasshopper session, namely when the Editor is first loaded.
EnableSolver
 Enables the Grasshopper Solver. If the Solver is enabled, expired components and parameter will be recomputed.
HideEditor
 Hide the main Grasshopper Editor. If the editor hasn't been loaded or if the Editor is already hidden, nothing will happen.
IsEditorLoaded
 Returns the loaded state of the Grasshopper Main window.
IsEditorVisible
 Returns the visible state of the Grasshopper Main window.
IsSolverEnabled
 Returns the state of the Grasshopper Solver.
LoadEditor
 Load the main Grasshopper Editor. If the editor has already been loaded nothing will happen.
LoadedPluginGuids
 Gets an array of the IDs of all loaded plugins.
LoadedPluginNames
 Gets an array of the names and versions (if known) of all loaded plugins.
OpenDocument
 Open a Grasshopper document. The editor will be loaded if necessary, but it will not be automatically shown.
RunAsCommand |  Obsolete.
RunHeadless
RunInCommandContext
RunSolver
 Runs the solver once, even if the global solver lock is on.
SaveDocument
 Save the currently active Grasshopper document. If the active document has never been saved, a Save... dialog will be shown. If there is no active document, nothing will happen.
SaveDocumentAs
 Save the currently active Grasshopper document in a specific location. If there is no active document, nothing will happen.
SetSliderRangeAndValue
 Find a slider and assign a new value.
SetSliderValue
 Find a slider and assign a new value.
ShowEditor
 Show the main Grasshopper Editor. The editor will be loaded first if needed. If the Editor is already on screen, nothing will happen.
Top
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace