Grasshopper API
GH_TaskCapableComponent<T> Methods
The GH_TaskCapableComponent<T> generic type exposes the following members.
Methods
Name | Description
AfterSolveInstance |  (Overrides GH_Component.AfterSolveInstance().)
AppendAdditionalMenuItems |  (Overrides GH_Component.AppendAdditionalMenuItems(ToolStripDropDown).)
GetSolveResults
 Call this method to await the associated task and retrieve its data.
OnUseTasksClicked
Read |  (Overrides GH_Component.Read(GH_IReader).)
RequestTaskCancellation
 Called by the framework when solving has been interrupted and tasks do not need to complete.
Write |  (Overrides GH_Component.Write(GH_IWriter).)
Top
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace