Grasshopper API
IGH_StateAwareObject Methods
The IGH_StateAwareObject type exposes the following members.
Methods
Name | Description
LoadState
 Override this function to load your state data. DO NOT START A NEW SOLUTION. This will be handled by the state manager.
SaveState
 Override this function to store your state data. You have to return a deserializable string.
Top
See Also
Reference
IGH_StateAwareObject Interface
Grasshopper.Kernel Namespace