Grasshopper API
GH_ObjectUndoAction Methods
The GH_ObjectUndoAction type exposes the following members.
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Object_Redo
Object_Undo
Top
See Also
Reference
GH_ObjectUndoAction Class
Grasshopper.Kernel.Undo Namespace