Grasshopper API
GH_ValueProxy<T> Methods
The GH_ValueProxy<T> generic type exposes the following members.
Methods
Name | Description
Duplicate
Duplicate_T
FromString
 Performs the String->Value parsing. The default implementation always returns False.
MutateString
ToString
 Performs a default ToString operation on the local value. If the value is Nothing, an empty String is returned.
 (Overrides Object.ToString().)
Top
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace