Grasshopper API
ObjectDraftingLineWidth Methods
The ObjectDraftingLineWidth type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
Top
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace