Grasshopper API
GH_DocumentEventServer Methods
The GH_DocumentEventServer type exposes the following members.
Methods
Name | Description
AppendToDebugLog
ClearGuidTable
 Clear the entire ID table.
CreateGuidTable
 Create the entire ID table from scratch.
EnsureGuidTable
 Create the entire ID table if it doesn't exist yet.
Top
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace