Grasshopper API
GH_RuleNumber Methods
The GH_RuleNumber type exposes the following members.
Methods
Name | Description
Apply
Top
See Also
Reference
GH_RuleNumber Class
Grasshopper.Kernel.Data Namespace