Grasshopper API
GH_Curve Methods
The GH_Curve type exposes the following members.
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the curve is referenced, the local instance of the curve is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateCurve
 Create a duplicate of this curve.
DuplicateGeometry
 Create a duplicate of this curve.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy
 Returns a proxy that represents this curve. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the curve is referenced and not yet loaded, attempts to load the curve.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
MakeDeformable
 Converts the local geometry into deformable nurbs curve geometry. This method will not destroy Reference data.
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the curve using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace