Grasshopper API
EtoExtensions Methods
The EtoExtensions type exposes the following members.
Methods
Name | Description
ToEto(Bitmap) |  Obsolete.
ToEto(Color)
ToEto(Control)
ToEto(Font)
ToEto(Form)
ToEto(Point)
ToEto(PointF)
ToEto(Size)
ToEto(SizeF)
ToEtoWindow
ToSD(Color)
ToSD(Font)
ToSD(Point)
ToSD(PointF)
ToSD(Rectangle)
ToSD(Size)
ToSD(SizeF)
ToSwf
ToWin32Window
Top
See Also
Reference
EtoExtensions Class
Grasshopper Namespace