Grasshopper API
GH_Topic Methods
The GH_Topic type exposes the following members.
Methods
Name | Description
ParseFile
 Parse a *.topic file and return a topic entry.
Top
See Also
Reference
GH_Topic Class
Grasshopper.Documentation Namespace