Grasshopper API
IGH_DataTree Methods
The IGH_DataTree type exposes the following members.
Methods
Name | Description
MergeWithParameter
 Utility function for assigning Script Data Trees to parameters.
Top
See Also
Reference
IGH_DataTree Interface
Grasshopper.Kernel.Data Namespace