Grasshopper API
ModelLineWidth Methods
The ModelLineWidth type exposes the following members.
Methods
Name | Description
Cast
CastFrom
CastTo<T>
Duplicate
EmitProxy
Equals(ModelLineWidth)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Read
ScriptVariable
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace