Grasshopper API
Value Methods
The ObjectDraftingLinetype.Value type exposes the following members.
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingLinetype.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingLinetype.Value)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetHashCode(IEqualityComparer)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace