Grasshopper API
GH_AssemblyFolderInfo Methods
The GH_AssemblyFolderInfo type exposes the following members.
Methods
Name | Description
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_AssemblyFolderInfo Structure
Grasshopper.Kernel Namespace