Grasshopper API
GH_SliderBase Methods
The GH_SliderBase type exposes the following members.
Methods
Name | Description
FixDomain
 Fix the limits of the slider. Limits will be rounded according to slider type and accuracy. Also, a minimum range for all types is ensured.
FixValue
 Fix the value of the slider. The value will be rounded according to slider type and accuracy. Also, the value will be clipped to the limits. Before you call this function, ensure the limits are set up correctly.
HandleTextInputAccepted |  (Overrides GH_TextBoxInputBase.HandleTextInputAccepted(String).)
KeyDown
 Respond to a KeyDown event.
MouseDown
 Respond to mouse-down events.
MouseMove
 Respond to mouse-move events.
MouseUp
 Respond to mouse-up events.
OnValueChanged
 Raise the ValueChanged event.
ProcessNumber
 Process a number using the given slider characteristics.
Render
 Render this slider into a Graphics context.
SetSnapRanges
 Assign a collection of snap ranges to this slider.
ShowTextInputBox(Control)
ShowTextInputBox(Control, Boolean)
ShowTextInputBox(Control, Boolean, Matrix)
ShowTextInputBox(Control, Boolean, Matrix, String)
Top
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace