Grasshopper API
ModelRenderMaterial Methods
The ModelRenderMaterial type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace