Grasshopper API
GH_ExternalFile Methods
The GH_ExternalFile type exposes the following members.
Methods
Name | Description
IsIdenticalTo
 Compares two files for content. If the size and the hash or the other file are equal to this one, the files are considered identical.
Top
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace