Grasshopper API
GH_DocDiagramPainter Methods
The GH_DocDiagramPainter type exposes the following members.
Methods
Name | Description
MapPoint(Point)
MapPoint(PointF)
MapRectangle
MapX(Int32)
MapX(Single)
MapY(Int32)
MapY(Single)
PaintDiagram(IEnumerable<IGH_DocumentObject>, Int32, Int32)
 Paint a diagram of a document.
PaintDiagram(IEnumerable<IGH_DocumentObject>, Int32, Int32, Int32)
 Paint a diagram of a document.
UnmapPoint
UnmapRectangle
UnmapX
UnmapY
Top
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace