Grasshopper API
GH_CodeStringSegment Methods
The GH_CodeStringSegment type exposes the following members.
Methods
Name | Description
IsAlpha
Replace
ReplaceToken
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace