Grasshopper API
ObjectSectionStyle Methods
The ObjectSectionStyle type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace