Grasshopper API
Param_AngularDimension Methods
The Param_AngularDimension type exposes the following members.
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
DrawViewportMeshes
DrawViewportWires
Top
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace