Grasshopper API
IGH_DocumentOwner Methods
The IGH_DocumentOwner type exposes the following members.
Methods
Name | Description
DocumentClosed
 This method will be called whenever the owner document was closed.
DocumentModified
 This method will be called whenever the owned document is modified.
OwnerDocument
 If the IGH_DocumentOwner is part of a GH_Document of its own, this function will return that document.
Top
See Also
Reference
IGH_DocumentOwner Interface
Grasshopper.Kernel Namespace