Grasshopper API
Param_ModelConstructionPlane Methods
The Param_ModelConstructionPlane type exposes the following members.
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
DrawViewportMeshes
DrawViewportWires
HtmlHelp_Source |  (Overrides GH_DocumentObject.HtmlHelp_Source().)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Read |  (Overrides GH_PersistentGeometryParam<T>.Read(GH_IReader).)
RemoteIdExpired |  (Overrides GH_PersistentGeometryParam<T>.RemoteIdExpired(RhinoDoc, Guid, GH_RemoteIdChange).)
Write |  (Overrides GH_PersistentGeometryParam<T>.Write(GH_IWriter).)
Top
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace