Grasshopper API
GH_UndoServer Methods
The GH_UndoServer type exposes the following members.
Methods
Name | Description
AppendToDebugLog
Clear
 Clear both undo and redo lists.
ClearRedo
 Clear the undo list.
ClearUndo
 Clear the redo list.
MergeRecords
 Attempt to merge the N most recent records into one. The name of the merged record will be identical to the name of the oldest record.
PerformRedo
 Performs a single Redo step if possible and migrates the record onto the undo stack. This function may throw all kinds of exceptions, if you're calling it from a UI thread, use a Try..Catch block to prevent crashes.
PerformUndo
 Performs a single Undo step when possible and migrates the record onto the redo stack. This function may throw all kinds of exceptions, if you're calling it from a UI thread, use a Try..Catch block to prevent crashes.
PushUndoRecord(GH_UndoRecord)
 Add a new undo record to the undo stack, this function clears the Redo stack.
PushUndoRecord(String, GH_UndoAction)
 Add a new undo record to the undo stack, this function clears the Redo stack.
RemoveRecord
 Remove the record with the specified ID from the undo or redo stack.
Top
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace