Grasshopper API
GH_BoxProxy Methods
The GH_Box.GH_BoxProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Box.GH_BoxProxy Class
Grasshopper.Kernel.Types Namespace