Grasshopper API
Attributes Methods
The ModelRenderSkylight.Attributes type exposes the following members.
Methods
Name | Description
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
ModelRenderSkylight.Attributes Class
Grasshopper.Rhinoceros.Render Namespace