Grasshopper API
GH_GeometricFont Methods
The GH_GeometricFont type exposes the following members.
Methods
Name | Description
Draw0
 Draw the geometric character '0' at the specified location.
Draw1
 Draw the geometric character '1' at the specified location.
Draw2
 Draw the geometric character '2' at the specified location.
Draw3
 Draw the geometric character '3' at the specified location.
Draw4
 Draw the geometric character '4' at the specified location.
Draw5
 Draw the geometric character '5' at the specified location.
Draw6
 Draw the geometric character '6' at the specified location.
Draw7
 Draw the geometric character '7' at the specified location.
Draw8
 Draw the geometric character '8' at the specified location.
Draw9
 Draw the geometric character '9' at the specified location.
DrawBracketClose
 Draw the geometric character '}' at the specified location.
DrawBracketOpen
 Draw the geometric character '{' at the specified location.
DrawDash
 Draw the geometric character '-' at the specified location.
DrawNumber(Graphics, Int32, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, Int64, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, UInt32, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, UInt64, Color, PointF)
 Draw an integer at the specified location.
DrawPath
 Draw an entire path string at a specific location.
DrawSemiColon
 Draw the geometric character ';' at the specified location.
Top
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace