Grasshopper API
AnnotationDateTimeFormat Methods
The AnnotationDateTimeFormat type exposes the following members.
Methods
Name | Description
CastFrom |  (Overrides GH_String.CastFrom(Object).)
Duplicate |  (Overrides GH_String.Duplicate().)
Equals(AnnotationDateTimeFormat)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Top
See Also
Reference
AnnotationDateTimeFormat Class
Grasshopper.Rhinoceros.Annotations Namespace