Grasshopper API
AnnotationArrowSettings Methods
The AnnotationArrowSettings type exposes the following members.
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace