Grasshopper API
Attributes Methods
The ModelTextureSlot.Attributes type exposes the following members.
Methods
Name | Description
Equals(ModelTextureSlot.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ModelTextureSlot.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace