Grasshopper API
GH_Viewport Methods
The GH_Viewport type exposes the following members.
Methods
Name | Description
ApplyProjection
 Apply the current display transformation to a Graphics object.
ComputeProjection
 Forces a recomputation of all cached data.
DollyZoom
 Advanced interface function for mouse 'dolly' zooming.
Duplicate
Focus(IGH_Attributes)
 Look at a specific object.
Focus(List<IGH_Attributes>)
 Look at a set of specific objects.
Focus(Point)
 Look at a specific point.
Focus(PointF)
 Look at a specific point.
IsVisible(PointF, Single)
 Test visibility of a point.
IsVisible(RectangleF, Single)
 Test visibility of a rectangle.
LimitUnit
 Utility function for calculating pixel dimensions in a zoom-aware environment. The desired value is put through the zoom projection and if the resulting size (as displayed on the screen) exceeds the visual limits it is clipped. This function can be used for example to make sure that a certain penwidth never exceeds visual limits (i.e. it doesn't get too thin or too thick on the screen).
Project
 Transform a point from canvas into control coordinate space.
ProjectPoint
 Project a point from canvas coordinates into control coordinates.
ProjectRectangle
 Project a rectangle from canvas coordinates into control coordinates.
ProjectX
 Project a value along constant X from canvas coordinates into control coordinates.
ProjectY
 Project a value along constant Y from canvas coordinates into control coordinates.
Set
SolveUnit
 Utility function for calculating graphics dimensions in a zoom-aware environment. This function can be used for example to compute the linewidth of a pen which always needs to appear as 3 pixels thick on the screen regardless of zoom values.
Unproject
 Transform a point from control into canvas coordinate space.
UnprojectPoint
 Project a point from control coordinates into canvas coordinates.
UnprojectRectangle
 Project a rectangle from control coordinates into canvas coordinates.
UnprojectX
 Project a value along constant X from control coordinates into canvas coordinates.
UnprojectY
 Project a value along constant Y from control coordinates into canvas coordinates.
XFormMatrix
 Gets the display transformation cached by this viewport.
Top
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace