Grasshopper API
ModelDisplayMode Methods
The ModelDisplayMode type exposes the following members.
Methods
Name | Description
Cast
ToAttributes
TooltipString |  (Overrides ModelContent.TooltipString().)
ToString |  (Overrides ModelContent.ToString().)
Top
See Also
Reference
ModelDisplayMode Class
Grasshopper.Rhinoceros.Display Namespace