Grasshopper API
IGH_EventConsumer Methods
The IGH_EventConsumer type exposes the following members.
Methods
Name | Description
IsRelevantEvent
 Whenever a new object event is handled, this function will be called to determine whether it will cause an update.
PartialExpiration
 This method will be called by the GH_CustomEventServer to indicate one or more interesting object events can now be processed.
TotalExpiration
 This method will be called by the GH_CustomEventServer to indicate all interesting object events can now be processed.
Top
See Also
Reference
IGH_EventConsumer Interface
Grasshopper.Kernel Namespace