Grasshopper API
Complex Methods
The Complex type exposes the following members.
Methods
Name | Description
ACos
ASin
ATan
Cos
Cosecant
CoTan
Exponential
GetHashCode |  (Overrides ValueType.GetHashCode().)
Log
Log10
Modulus
ModulusSquared
Power
Root
Secant
Sin
Square
SquareRoot
Tan
Top
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace