Grasshopper API
TreeDelegates Methods
The TreeDelegates type exposes the following members.
Methods
Name | Description
Node2Coordinates
Node3Coordinates
Point2dCoordinates
Point2fCoordinates
Point3dCoordinates
Point3fCoordinates
PointCoordinates
Top
See Also
Reference
TreeDelegates Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace