Grasshopper API
ChunkKeyedCollection Methods
The GH_Chunk.ChunkKeyedCollection type exposes the following members.
Methods
Name | Description
Add
 Adds a new chunk.
Clear
 Removes all chunks from the collection.
GetEnumerator
 Gets an enumerator that iterates over all chunks in the collection.
Remove(GH_Chunk)
 Removes a chunk.
Remove(ID)
 Removes an ID.
TryGetValue
 Try and find the chunk that belongs to a given ID.
Top
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace