Grasshopper API
GH_FieldElement Methods
The GH_FieldElement type exposes the following members.
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Duplicate
Force
IsCoincident
Read
Write
Top
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace