Grasshopper API
AnnotationDimensionSettings Methods
The AnnotationDimensionSettings type exposes the following members.
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace