Grasshopper API
GH_Alias Methods
The GH_Alias type exposes the following members.
Methods
Name | Description
AliasToString
CompareTo
StringToAlias
Top
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace