Grasshopper API
DisplayColorGradient Methods
The DisplayColorGradient type exposes the following members.
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateColourGradient
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace