Grasshopper API
GH_MeshProxy Methods
The GH_Mesh.GH_MeshProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_Mesh.GH_MeshProxy Class
Grasshopper.Kernel.Types Namespace