Grasshopper API
GH_DocumentIO Methods
The GH_DocumentIO type exposes the following members.
Methods
Name | Description
ClearClipboard
 Clear the Clipboard Text content. This function wipes both the Text and UnicodeText clipboard fields.
Copy(GH_ClipboardType)
 Copy the internal document into the clipboard.
Copy(GH_ClipboardType, Boolean)
 Copy the internal document into the clipboard.
Copy(GH_ClipboardType, IEnumerable<Guid>)
 Copy the specified objects in the internal document into the clipboard.
GetDocumentIcon
 Try and extract the icon image of a document. Not all gh/ghx files contain an icon so this function may return null. The document itself is not loaded and rendered, so the icon really has to be part of the file already.
GetDocumentThumbnail
 Try and extract the preview image of a document. Not all gh/ghx files contain a thumbnail so this function may return null. The document itself is not loaded and rendered, so the thumbnail really has to be part of the file already.
Open()
 Perform a default Open operation and store the result as the internal document.
Open(String)
 Open the file at the given location.
OpenDocumentDialog
 Display the Open GH/GHX dialog.
Paste
 Deserialize a Grasshopper document from the clipboard. On success, the internal document of this GH_DocumentIO instance will be set.
Save
 Perform a default Save operation on the internal document.
SaveAs
 Perform a default Save As operation on the internal document.
SaveAsCopyDocumentDialog
 Display the Save As Copy GH/GHX dialog.
SaveAsDocumentDialog
 Display the Save As GH/GHX dialog.
SaveBackup
 Save a time-stamped copy of the current file.
SaveDocumentDialog
 Display the Save GH/GHX dialog.
SaveQuiet
 Quietly save a file to a given location.
ShowOverwriteDialog(String)
ShowOverwriteDialog(String, DateTime, DateTime)
SubsidiaryDocumentSavePrompt(GH_Document)
 Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
SubsidiaryDocumentSavePrompt(String, Boolean, Int32)
 Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
Top
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace