Grasshopper API
GH_IWriter Methods
The GH_IWriter type exposes the following members.
Methods
Name | Description
AddComment
 Adds a text comment to this chunk. Comments are serialized only if the output flavour is a human readable format. Comments are never deserialized, they are purely for the benefit of the humans reading the file data.
CreateChunk(String)
 Create a new child chunk with the specified name but without an index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
CreateChunk(String, Int32)
 Create a new child chunk with the specified name and index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
RemoveChunk(GH_IChunk)
 Remove the specified chunk from the litter.
RemoveChunk(String)
 Remove the first chunk with a matching name. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
RemoveChunk(String, Int32)
 Remove the first chunk with a matching name and index. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
RemoveItem(String)
 Remove an unindexed item from this chunk.
RemoveItem(String, Int32)
 Remove an indexed item from this chunk.
SetBoolean(String, Boolean)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetBoolean(String, Int32, Boolean)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetBoundingBox(String, GH_BoundingBox)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetBoundingBox(String, Int32, GH_BoundingBox)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetByte(String, Byte)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetByte(String, Int32, Byte)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetByteArray(String, Byte[])
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetByteArray(String, Int32, Byte[])
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDate(String, DateTime)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDate(String, Int32, DateTime)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDecimal(String, Decimal)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDecimal(String, Int32, Decimal)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDouble(String, Double)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDouble(String, Int32, Double)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDoubleArray(String, Double[])
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDoubleArray(String, Int32, Double[])
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingBitmap(String, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingBitmap(String, Int32, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingColor(String, Color)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingColor(String, Int32, Color)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingPoint(String, Point)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingPoint(String, Int32, Point)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingPointF(String, PointF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingPointF(String, Int32, PointF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingRectangle(String, Rectangle)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingRectangle(String, Int32, Rectangle)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingRectangleF(String, RectangleF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingRectangleF(String, Int32, RectangleF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingSize(String, Size)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingSize(String, Int32, Size)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetDrawingSizeF(String, SizeF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingSizeF(String, Int32, SizeF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetGuid(String, Guid)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetGuid(String, Int32, Guid)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInt32(String, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInt32(String, Int32, Int32)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInt64(String, Int64)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInt64(String, Int32, Int64)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInterval1D(String, GH_Interval1D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInterval1D(String, Int32, GH_Interval1D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetInterval2D(String, GH_Interval2D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInterval2D(String, Int32, GH_Interval2D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetLine(String, GH_Line)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetLine(String, Int32, GH_Line)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPath(String, String, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPath(String, Int32, String, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPlane(String, GH_Plane)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPlane(String, Int32, GH_Plane)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPoint2D(String, GH_Point2D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint2D(String, Int32, GH_Point2D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPoint3D(String, GH_Point3D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint3D(String, Int32, GH_Point3D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPoint4D(String, GH_Point4D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint4D(String, Int32, GH_Point4D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetSingle(String, Single)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetSingle(String, Int32, Single)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetString(String, String)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetString(String, Int32, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetVersion(String, GH_Version)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetVersion(String, Int32, GH_Version)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetVersion(String, Int32, Int32, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetVersion(String, Int32, Int32, Int32, Int32)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace