Grasshopper API
GH_ClippingPlane Methods
The GH_ClippingPlane type exposes the following members.
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the clipping plane is referenced, the local instance of the clipping plane is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateClippingPlane
 Create a duplicate of this clipping plane.
DuplicateGeometry
 Create a duplicate of this clipping plane.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the clipping plane is referenced and not yet loaded, attempts to load the clipping plane.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the clipping plane using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace