Grasshopper API
GH_DocumentAssociations Methods
The GH_DocumentAssociations type exposes the following members.
Methods
Name | Description
Associate
 Add an association between a Rhino and a Grasshopper file. If a similar association already exists, it will be overwritten. This function reads and writes to the disk, it is SLOW. Only call it when you KNOW something changed.
GetGrasshopperAssociations
 Find all the Grasshopper ghx files that have been associated with a given Rhino file.
GetRhinoAssociations
 Find all the Rhino 3dm files that have been associated with a given Grasshopper file.
Top
See Also
Reference
GH_DocumentAssociations Class
Grasshopper.Kernel Namespace