Grasshopper API
Attributes Methods
The ModelRenderTexture.Attributes type exposes the following members.
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
See Also
Reference
ModelRenderTexture.Attributes Class
Grasshopper.Rhinoceros.Render Namespace