Grasshopper API
ModelDataParam<T> Methods
The ModelDataParam<T> generic type exposes the following members.
Methods
Name | Description
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
Top
See Also
Reference
ModelDataParam<T> Class
Grasshopper.Rhinoceros.Params Namespace