Grasshopper API
IGH_UpgradeObject Methods
The IGH_UpgradeObject type exposes the following members.
Methods
Name | Description
Upgrade
 Upgrade an existing object.
Top
See Also
Reference
IGH_UpgradeObject Interface
Grasshopper.Kernel Namespace