Grasshopper API
GH_PatternMatching Methods
The GH_PatternMatching type exposes the following members.
Methods
Name | Description
Contains
EndsWith
Equals
IsMatch
MatchRegex
MatchWildcards
StartsWith
Top
See Also
Reference
GH_PatternMatching Class
Grasshopper.Kernel Namespace