Grasshopper API
GH_ISerializable Methods
The GH_ISerializable type exposes the following members.
Methods
Name | Description
Read
 This method is called whenever the instance is required to deserialize itself.
Write
 This method is called whenever the instance is required to serialize itself.
Top
See Also
Reference
GH_ISerializable Interface
GH_IO Namespace