Grasshopper API
GH_AssemblyPriority Methods
The GH_AssemblyPriority type exposes the following members.
Methods
Name | Description
PriorityLoad
 This method will be called exactly once before any of the Components in your project are loaded.
Top
See Also
Reference
GH_AssemblyPriority Class
Grasshopper.Kernel Namespace