Grasshopper API
Attributes Methods
The ModelSectionStyle.Attributes type exposes the following members.
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace