Grasshopper API
ModelSectionStyle Methods
The ModelSectionStyle type exposes the following members.
Methods
Name | Description
Cast
ToAttributes
Top
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace