Grasshopper API
GH_ZuiAction Methods
The GH_ZuiAction type exposes the following members.
Methods
Name | Description
IsTooltipRegion
Perform
SetupTooltip
Top
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace