Grasshopper API
ChildSlotNameComparer Methods
The ChildSlotNameComparer type exposes the following members.
Methods
Name | Description
Compare
Top
See Also
Reference
ChildSlotNameComparer Class
Grasshopper.Rhinoceros.Render Namespace