Grasshopper API
ModelColor Methods
The ModelColor type exposes the following members.
Methods
Name | Description
CompareTo
Equals(ModelColor)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
FromArgb(Int32)
FromArgb(Byte, Byte, Byte)
FromArgb(Byte, Byte, Byte, Byte)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToArgb
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace