Grasshopper API
GH_ArchivedUndoAction Methods
The GH_ArchivedUndoAction type exposes the following members.
Methods
Name | Description
Deserialize
 Deserializes the obj from the local archive.
Read |  (Overrides GH_UndoAction.Read(GH_IReader).)
Serialize
 Serializes the obj into the local archive.
SerializeToByteArray
 Serializes the obj into the local archive.
Write |  (Overrides GH_UndoAction.Write(GH_IWriter).)
Top
See Also
Reference
GH_ArchivedUndoAction Class
Grasshopper.Kernel.Undo Namespace