Grasshopper API
GH_TextDotProxy Methods
The GH_TextDot.GH_TextDotProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
GH_TextDot.GH_TextDotProxy Class
Grasshopper.Kernel.Types Namespace