Grasshopper API
GH_RelevantObjectData Methods
The GH_RelevantObjectData type exposes the following members.
Methods
Name | Description
CreateBalloonData
CreateGripData
CreateGroupData
CreateObjectData
CreateWireData
Top
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace