Grasshopper API
GH_List Methods
The GH_List type exposes the following members.
Methods
Name | Description
Create(Boolean)
Create(Boolean, IEnumerable<IGH_Content>)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_List Class
Grasshopper.Documentation Namespace