Grasshopper API
ID Methods
The ID type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this ID to another ID.
Equals
 Determines if two IDs are equal.
GetHashCode
 Gets the hash code.
 (Overrides ValueType.GetHashCode().)
ToString
 Gets a string representation for this ID.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
ID Structure
GH_IO.Serialization Namespace