Grasshopper API
Attributes Methods
The ModelContent.Attributes type exposes the following members.
Methods
Name | Description
CloneOnWrite<A>
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
IsValidContentName
Read |  (Overrides ModelData.Attributes.Read(GH_IReader).)
ReadData
ToString |  (Overrides ModelData.Attributes.ToString().)
Write |  (Overrides ModelData.Attributes.Write(GH_IWriter).)
WriteData
Top
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace