Grasshopper API
NullParamAttributes Methods
The GH_ComponentParamServer.NullParamAttributes type exposes the following members.
Methods
Name | Description
Read |  (Overrides GH_Attributes<T>.Read(GH_IReader).)
Write |  (Overrides GH_Attributes<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_ComponentParamServer.NullParamAttributes Class
Grasshopper.Kernel Namespace