Grasshopper API
GH_Plane Methods
The GH_Plane type exposes the following members.
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_Plane Structure
GH_IO.Types Namespace