Grasshopper API
ModelComponentContent Methods
The ModelComponentContent type exposes the following members.
Methods
Name | Description
ToAttributes
Top
See Also
Reference
ModelComponentContent Class
Grasshopper.Rhinoceros Namespace