Grasshopper API
GH_PointCharge Methods
The GH_PointCharge type exposes the following members.
Methods
Name | Description
DrawViewportWires |  (Overrides GH_FieldElement.DrawViewportWires(GH_PreviewWireArgs).)
Duplicate |  (Overrides GH_FieldElement.Duplicate().)
Force |  (Overrides GH_FieldElement.Force(Point3d).)
IsCoincident |  (Overrides GH_FieldElement.IsCoincident(Point3d, Double).)
Read |  (Overrides GH_FieldElement.Read(GH_IReader).)
Write |  (Overrides GH_FieldElement.Write(GH_IWriter).)
Top
See Also
Reference
GH_PointCharge Class
Grasshopper.Kernel.Types Namespace