Grasshopper API
GH_TagArtist_WirePainter Methods
The GH_TagArtist_WirePainter type exposes the following members.
Methods
Name | Description
Paint |  (Overrides GH_TagArtist.Paint(GH_Canvas, GH_CanvasChannel).)
Top
See Also
Reference
GH_TagArtist_WirePainter Class
Grasshopper.GUI.Canvas.TagArtists Namespace