Grasshopper API
ModelView Methods
The ModelView type exposes the following members.
Methods
Name | Description
Cast
CastTo<Q>
Equals(ModelView)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetBoundingBox
GetHashCode |  (Overrides Object.GetHashCode().)
Morph
ToString |  (Overrides Object.ToString().)
ToViewportInfo
Transform
Top
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace