Grasshopper API
GH_CanvasValidator Methods
The GH_CanvasValidator type exposes the following members.
Methods
Name | Description
AddedToCanvas
 Override this method if you want to be informed when this validator gets assigned to a canvas. But *always* call the base class method.
AppliesToDocument
CanAcceptObject
CanCreateObject
CanCreateWire
CanDeleteObject
CanDeleteWire
CanDragObject
CanNavigateCanvas
CanShowCanvasMenu
CanShowComponentSearchBox
CanShowObjectMenu
RemovedFromCanvas
 Override this method if you want to be informed when this validator gets removed from a canvas. But *always* call the base class method.
Top
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace