Grasshopper API
GH_RuleComplex Methods
The GH_RuleComplex type exposes the following members.
Methods
Name | Description
Apply
Top
See Also
Reference
GH_RuleComplex Class
Grasshopper.Kernel.Data Namespace