Grasshopper API
GH_ExtrusionProxy Methods
The GH_Extrusion.GH_ExtrusionProxy type exposes the following members.
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace