Grasshopper API
ModelTags Methods
The ModelTags type exposes the following members.
Methods
Name | Description
AddRange
CompareTo(ModelTags)
CompareTo(Object)
Contains
Equals(ModelTags)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetEnumerator
GetHashCode |  (Overrides ValueType.GetHashCode().)
RemoveRange
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace