Grasshopper API
GH_TextBoxInputBase Methods
The GH_TextBoxInputBase type exposes the following members.
Methods
Name | Description
HandleTextInputAccepted
HideTextInputBox
 Hides the text-input override form (if it is displayed).
RespondToEnter
RespondToEscape
ShowTextInputBox(Control, String, Boolean)
 Display a floating text-box on top of the owner control.
ShowTextInputBox(Control, String, Boolean, Boolean)
 Display a floating text-box on top of the owner control.
ShowTextInputBox(Control, String, Boolean, Boolean, Matrix)
 Display a floating text-box on top of the owner control.
Top
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace