Grasshopper API
Param_Predicate Methods
The Param_Predicate type exposes the following members.
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_Param<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
Read |  (Overrides GH_Param<T>.Read(GH_IReader).)
RemoveEffects |  (Overrides GH_Param<T>.RemoveEffects().)
Write |  (Overrides GH_Param<T>.Write(GH_IWriter).)
Top
See Also
Reference
Param_Predicate Class
Grasshopper.Kernel.Parameters Namespace