Grasshopper API
GH_AddObjectAction Methods
The GH_AddObjectAction type exposes the following members.
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
See Also
Reference
GH_AddObjectAction Class
Grasshopper.Kernel.Undo.Actions Namespace