Grasshopper API
GH_PreviewBoundary Methods
The GH_PreviewBoundary type exposes the following members.
Methods
Name | Description
IsVisible
 Gets whether a specific object is visible within this boundary.
Read
Write
Top
See Also
Reference
GH_PreviewBoundary Class
Grasshopper.Kernel Namespace