Grasshopper API
GH_StateTag Methods
The GH_StateTag type exposes the following members.
Methods
Name | Description
Render
RenderFreeformIcon
 Render a filled path with default shading.
RenderTagBlankIcon(Graphics)
 Render a blank rectangle icon.
RenderTagBlankIcon(Graphics, GH_StateTag.DrawCallback)
 Render a blank rectangle icon.
RenderTagPolygonIcon
 Render a filled polygon with default shading.
Top
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace