Grasshopper API
GH_ScrollBarVerticalBase Methods
The GH_ScrollBarVerticalBase type exposes the following members.
Methods
Name | Description
BeginDrag
 Start a new drag operation.
ContinueDrag
 Continue a drag operation.
ScrollBar(Rectangle)
 Compute the size and position of the scroll bar in the scroll rail.
ScrollBar(RectangleF)
 Compute the size and position of the scroll bar in the scroll rail.
Top
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace