Grasshopper API
GH_Version Methods
The GH_Version type exposes the following members.
Methods
Name | Description
Equals
 Performs value equality comparison.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Returns the hash code for this instance.
 (Overrides ValueType.GetHashCode().)
ToString
 Default formatter for Version data: M.m.RRRR Revision section is padded with zeroes until it is at least 4 digits long.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace