Grasshopper API
GH_UndoAction Methods
The GH_UndoAction type exposes the following members.
Methods
Name | Description
Internal_Redo
Internal_Undo
Read
Redo
Undo
Write
Top
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace