Grasshopper API
IGH_GeometricGoo Methods
The IGH_GeometricGoo type exposes the following members.
Methods
Name | Description
ClearCaches
 Clears all caches. Typically if the geometry is referenced, this will erase the local copy.
DuplicateGeometry
 Make a complete duplicate of this geometry. No shallow copies.
GetBoundingBox
 Compute an aligned boundingbox.
LoadGeometry()
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
LoadGeometry(RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
Morph
 Morph the object or a deformable representation of the object.
Transform
 Transforms the object or a deformable representation of the object.
Top
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace