Grasshopper API
GH_Slider Methods
The GH_Slider type exposes the following members.
Methods
Name | Description
Input_Assign |  (Overrides GH_TextInputBaseControl.Input_Assign(String).)
Input_Parse |  (Overrides GH_TextInputBaseControl.Input_Parse(String).)
Input_Supply |  (Overrides GH_TextInputBaseControl.Input_Supply().)
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
Extension Methods
Name | Description
ToEto |  (Defined by EtoExtensions.)
Top
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace