Grasshopper API
PathLengthComparer Methods
The GH_Path.PathLengthComparer type exposes the following members.
Methods
Name | Description
Compare
Top
See Also
Reference
GH_Path.PathLengthComparer Class
Grasshopper.Kernel.Data Namespace