Grasshopper API
GH_WireAction Methods
The GH_WireAction type exposes the following members.
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
See Also
Reference
GH_WireAction Class
Grasshopper.Kernel.Undo.Actions Namespace