Grasshopper API
Param_MatchText Methods
The Param_MatchText type exposes the following members.
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_PersistentParam<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
MatchText
Menu_CustomMultiValueItem |  (Overrides GH_PersistentParam<T>.Menu_CustomMultiValueItem().)
Menu_CustomSingleValueItem |  (Overrides GH_PersistentParam<T>.Menu_CustomSingleValueItem().)
Menu_SingleStringValueKeyDown
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
RemoveEffects |  (Overrides GH_Param<T>.RemoveEffects().)
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace