Grasshopper API
Orientation Methods
The Orientation type exposes the following members.
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Orientation Class
Grasshopper.Kernel.Types.Transforms Namespace