Grasshopper API
Folders Methods
The Folders type exposes the following members.
Methods
Name | Description
ShowFolderInExplorer
 Open a specific folder in Windows Explorer.
Top
See Also
Reference
Folders Class
Grasshopper Namespace