Grasshopper API
GH_LooseChunk Methods
The GH_LooseChunk type exposes the following members.
Methods
Name | Description
Deserialize_Binary
 Deserializes a byte array.
Deserialize_Xml
 Deserializes an Xml string.
Serialize_Binary
 Serializes the data tree into a byte array.
Serialize_Xml
 Serializes the data tree into an Xml string.
Top
See Also
Reference
GH_LooseChunk Class
GH_IO.Serialization Namespace