Grasshopper API
GH_ParserSymbol Methods
The GH_ParserSymbol type exposes the following members.
Methods
Name | Description
CompareTo
Equals |  (Overrides Object.Equals(Object).)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_ParserSymbol Class
Grasshopper.Kernel.Expressions Namespace