Grasshopper API
ObjectVisibility Methods
The ObjectVisibility type exposes the following members.
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToDetails
Top
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace