Grasshopper API
IGH_ValueProxy Methods
The IGH_ValueProxy type exposes the following members.
Methods
Name | Description
Duplicate
 Create an exact duplicate of the type.
FromString
 If IsParsable(), then attempts to convert the string to a generic type value
MutateString
 Munge a string to remove obvious errors on account of the user.
ToString
 Returns a String description of the current value.
Top
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace