Grasshopper API
AnnotationLeaderSettings Methods
The AnnotationLeaderSettings type exposes the following members.
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace