Grasshopper API
GH_TreeRules Methods
The GH_TreeRules type exposes the following members.
Methods
Name | Description
Apply(GH_Path)
 Apply all the local rules to a path.
Apply(GH_Path, Int32)
 Apply all the local rules to a path+index combination.
FromString
 Attempt to parse a Pattern string.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace