Grasshopper API
GH_IO.Serialization Namespace
Namespace in GH_IO.dll that contains all the classes used during (de)serialization.
Classes
Class | Description
GH_Archive
 This is the base archive class which takes care of all (de)serialization and messaging.
GH_Chunk
 Full implementation of GH_IChunk, GH_IReader, GH_IWriter, GH_IBinarySupport and GH_IXmlSupport. Instances of this class are usually disguised as one of the interfaces it implements.
GH_Chunk.ChunkKeyedCollection
 Represents a collection of chunks with associated IDs
GH_Compression
 Provides static methods for compression of byte-arrays.
GH_LooseChunk
 A utility class for creating partial archives.
GH_Message
 Represents an archive log message. Messages are collected during read/write operations.
Structures
Structure | Description
ID
 An ID is used to uniquely identify a specific item.
Interfaces
Interface | Description
GH_IBinarySupport
 Interface which declares all methods required for objects that can be (de)serialized to and from a binary archive.
GH_IChunk
 Base interface for all Archive Chunks.
GH_IReader
 Provides access to a subset of GH_Chunk methods used for reading archives.
GH_IWriter
 Provides access to a subset of GH_Chunk methods used for writing archives.
GH_IXmlSupport
 Interface which declares all methods required for objects that can be (de)serialized to and from an Xml archive.
Enumerations
Enumeration | Description
GH_Message_Type
 Message type flag.