Grasshopper API
Grasshopper.Kernel.Expressions Namespace
Namespace which contains all classes needed to evaluate Grasshopper expressions.
Classes
Class | Description
GH_CodeString
GH_CodeStringSegment
GH_ExpressionParser
 Provides a run-time evaluator for Grasshopper expressions.
GH_ExpressionString
GH_ExpressionSyntaxWriter
GH_ParserOperator
GH_ParserSymbol
GH_ScriptVariant
GH_SignatureException
GH_SolverException
GH_SyntaxException
GH_Variant
 Variant data used in Grasshopper Expressions.
Enumerations
Enumeration | Description
GH_CharType
GH_OperatorType
GH_ParserPrecedence
GH_ParserTokenClass
GH_ScriptVariantType
GH_VariantType
 Lists all possible variable types supported in the Grasshopper Expression Parser.