Grasshopper API
Grasshopper.GUI Namespace
Namespace for all things GUI. This namespace contains practically all the custom Form and Control classes used in Grasshopper, but it also contains many utility functions and classes. Note that many specific classes have been excluded from this helpfile as they are either very obtuse or overly specific.
Classes
Class | Description
GH_Animator
 Provides static methods and constructors GH_Animator(Of T).
GH_Animator<T>
 Provides methods for animating values.
GH_AsynchFileData
 This class provides asynchronous methods to keep tabs on a file.
GH_BezierSolver
 Class for evaluating four-point bezier curves as used in GDI+
GH_CanvasMouseEvent
 Class used in Canvas UI events.
GH_CanvasObjectMouseDownEventArgs
 Event arguments for the CanvasObjectMouseDown events.
GH_ColourPicker
 Provides the standard Grasshopper Colour picker as a winforms Control.
GH_ColourSwatchEventArgs
 Event arguments used in the GH_ColourSwatchControl.ColourChanged event.
GH_CursorServer
 Class used to cache and set cursors.
GH_DebugLogForm
GH_DigitScroller
 Provides the standard Grasshopper Digit scroller as a winforms Control.
GH_DocumentEditor
 The Grasshopper main window.
GH_DoubleBufferedPanel
 Derives from Windows.Forms.Panel but overrides certain flags that improve on-screen rendering. Use panel if you want to have a custom drawn control that is under the control of the owner form.
GH_DragInfo
 Contains data used for UI drag operations.
GH_EtoUtil
GH_ExternalFileConflictDialog
GH_FadeAnimation
 Utility class for animating fade ZUI events on the canvas.
GH_FontControl
 Represents a control that offers both Font preview and Picking methods.
GH_FontList
 Represents the installed Font collection. This control allows both navigation and selection of Font Families.
GH_FontPicker
GH_FontScroller
 Represents a panel with a scrolling collection of pangrams.
GH_FormShepard
 A Form shepard is used to herde a bunch of floating forms. Important forms that potentially spout child forms might choose to implement one.
GH_GDI_Util
 Contains some global function for filleting corners of GDI objects.
GH_GeometricFont
 Exposes methods for drawing geometric characters.
GH_GraphicsUtil
 Utility class with static (Shared) functions that help with colour, shape and text rendering.
GH_HorizontalSeparator
 GUI elements for creating visual separations.
GH_IconLabel
 A simple Icon with an icon overlay plus highlight rectangle.
GH_IconPicker
 Provides a standard icon selection interface.
GH_LoadProtectDialog
GH_MaterialPreviewControl
 Offers a frontend for Grasshopper Material previews.
GH_MenuTextBox
 Utility control for putting textboxes into menus.
GH_MouseTracker
 Record mouse-movements over time.
GH_NumberSliderSnappingEditor
GH_PanelEditorControl
GH_QuickImageEditor
GH_RotationalTuningData<T>
 Utility class for keeping track of rotational mouse events.
GH_SamplingSphere
 Represents a coloured sphere that can be sampled at various rotations.
GH_SettingsCategory
 Base implementation of IGH_SettingsCategory. Derive from this class and provide an empty constructor to play ball.
GH_Slider
 Provides a standard Grasshopper slider as a winforms control.
GH_Slider_Obsolete
 General purpose numeric slider.
GH_StandardIcons
 Provides access to a set of standard icons.
GH_Tooltip
 Implements a custom Tooltip class with advanced functionality. All methods and fields are Shared. There can never be more than one GH_Tooltip.
GH_TooltipComponent
 This component provides Grasshopper tooltip functionality through a winforms Component.
GH_TooltipDisplayEventArgs
 Event arguments used in the Tooltip Component.
GH_UnrecognizedObjectsForm
GH_VerticalScrollBar
 Scroll bar control with floating point accuracy.
GH_VerticalSeparator
 GUI elements for creating visual separations.
GH_VoronoiWarningForm
GH_WindowsControlUtil
 Exposes some static (Shared) utility functions for setting text-rendering properties en masse.
GH_WindowsFormUtil
 Exposes some static (Shared) utility functions for positioning custom windows.
GH_YakDownloadFormEto
GH_YakDownloadFormEto.MissingObjectItem
Structures
Structure | Description
GH_RotationalFrame
 Represents a single frame in a rotational tuning history.
GH_TrackerFrame
 Represents a single frame in a mouse-tracker history. A frame represents all relevant mouse and keyboard data at a given time.
Interfaces
Interface | Description
IGH_Embeddable
 Implement this interface in your custom control if you want to be called before a menu commits or cancels.
IGH_FileDropTarget
 Implement this interface in your IGH_DocumentObject if you want to participate in Drag+Drop events.
IGH_SettingCategory
 Represents a single category in the Settings UI. Implement this interface or derive from GH_SettingsCategory to add a new Category to the Grasshopper Settings interface.
IGH_SettingFrontend
 Represents a single setting in the Settings UI. Implement this interface to participate in the Grasshopper Settings interface.
IGH_Tooltip
 Accessor interface for the Grasshopper Tooltip form.
Delegates
Delegate | Description
GH_Animator<T>.Interpolate
 Delegate for interpolating values.
GH_AsynchFileData.FileChangedDelegate
GH_ColourPicker.ColourChangedEventHandler
GH_DigitScroller.ValueChangedEventHandler
GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler
GH_DocumentEditor.EditorFoldStateChangedEventHandler
GH_FontScroller.PostPaint
GH_MaterialPreviewControl.ColourChangedEventHandler
GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler
GH_MaterialPreviewControl.SelectedChangedEventHandler
GH_MenuTextBox.KeyDownEventHandler
GH_MenuTextBox.TextChangedEventHandler
GH_Slider.ValueChangedEventHandler
GH_Slider_Obsolete.ValueChangedEventHandler
GH_TooltipComponent.PopulateTooltipEventHandler
GH_VerticalScrollBar.ScrollRatioChangedEventHandler
Enumerations
Enumeration | Description
GH_AnimationPhase
 Enumerates the possible phases in which an animation can occur.
GH_Constraint
 Constraints used during UI dragging operations.
GH_FadePhase
 Enumerates the possible states of a ZUI fade animation.
GH_Interpolation
 Enumerates the possible animation progression types.
GH_SeparatorDisplay
 Enumerates all possible display modes for horizontal and vertical separators.
GH_SliderInputMode
 Enumerates all possible slider text input modes.