Grasshopper API
Attributes Type Conversions
The ModelRenderMaterial.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelRenderMaterial.Attributes)
Top
See Also
Reference
ModelRenderMaterial.Attributes Class
Grasshopper.Rhinoceros.Render Namespace