Grasshopper API
ModelColor Operators and Type Conversions
The ModelColor type exposes the following members.
Operators
Name | Description
Equality(Color, ModelColor)
Equality(ModelColor, ModelColor)
Equality(ModelColor, Color)
Explicit(ModelColor to ColorRGBA)
Implicit(Color to ModelColor)
Implicit(ColorRGBA to ModelColor)
Implicit(ModelColor to Color)
Inequality(Color, ModelColor)
Inequality(ModelColor, ModelColor)
Inequality(ModelColor, Color)
Top
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace