Grasshopper API
ObjectVisibility Type Conversions
The ObjectVisibility type exposes the following members.
Operators
Name | Description
Implicit(ObjectVisibility.Attributes to ObjectVisibility)
Top
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace