Grasshopper API
ModelUserText Operators
The ModelUserText type exposes the following members.
Operators
Name | Description
Addition(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
Addition(ModelUserText, IEnumerable<String>)
BitwiseAnd(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
BitwiseAnd(ModelUserText, IEnumerable<String>)
BitwiseOr(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
BitwiseOr(ModelUserText, IEnumerable<String>)
Equality
Inequality
Subtraction(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
Subtraction(ModelUserText, IEnumerable<String>)
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace