Grasshopper API
ModelContentName Operators and Type Conversions
The ModelContentName type exposes the following members.
Operators
Name | Description
Division
Equality(ModelContentName, ModelContentName)
Equality(ModelContentName, String)
Equality(String, ModelContentName)
Implicit(ModelContentName to String)
Implicit(String to ModelContentName)
Inequality(ModelContentName, ModelContentName)
Inequality(ModelContentName, String)
Inequality(String, ModelContentName)
OnesComplement
Top
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace