Grasshopper API
Attributes Type Conversions
The ModelRenderEnvironment.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelRenderEnvironment.Attributes)
Top
See Also
Reference
ModelRenderEnvironment.Attributes Class
Grasshopper.Rhinoceros.Render Namespace