Grasshopper API
AnnotationArrowSettings Type Conversions
The AnnotationArrowSettings type exposes the following members.
Operators
Name | Description
Explicit(AnnotationArrowSettings to DimensionStyle)
Implicit(AnnotationArrowSettings.Attributes to AnnotationArrowSettings)
Top
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace