Grasshopper API
Complex Operators
The Complex type exposes the following members.
Operators
Name | Description
Addition(Complex, Complex)
Addition(Complex, Double)
Addition(Double, Complex)
Division(Complex, Complex)
Division(Complex, Double)
Division(Double, Complex)
Multiply(Complex, Complex)
Multiply(Complex, Double)
Multiply(Double, Complex)
Subtraction(Complex, Complex)
Subtraction(Complex, Double)
Subtraction(Double, Complex)
UnaryNegation
UnaryPlus
Top
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace