Grasshopper API
Attributes Type Conversions
The ModelInstanceDefinition.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelInstanceDefinition.Attributes)
Top
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace