Grasshopper API
Attributes Type Conversions
The ModelLayer.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelLayer.Attributes)
Top
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace