Grasshopper API
ModelTextureSlot Type Conversions
The ModelTextureSlot type exposes the following members.
Operators
Name | Description
Implicit(ModelTextureSlot.Attributes to ModelTextureSlot)
Top
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace