Grasshopper API
AnnotationToleranceSettings Type Conversions
The AnnotationToleranceSettings type exposes the following members.
Operators
Name | Description
Explicit(AnnotationToleranceSettings to DimensionStyle)
Implicit(AnnotationToleranceSettings.Attributes to AnnotationToleranceSettings)
Top
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace