Grasshopper API
ObjectDrafting Type Conversions
The ObjectDrafting type exposes the following members.
Operators
Name | Description
Implicit(ObjectDrafting.Attributes to ObjectDrafting)
Top
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace