Grasshopper API
Attributes Type Conversions
The ModelLinetype.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelLinetype.Attributes)
Top
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace