Grasshopper API
Value Operators
The ModelUnitSystem.Value type exposes the following members.
Operators
Name | Description
Equality
Inequality
Top
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace