Grasshopper API
Attributes Type Conversions
The ModelRenderTexture.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelRenderTexture.Attributes)
Top
See Also
Reference
ModelRenderTexture.Attributes Class
Grasshopper.Rhinoceros.Render Namespace