Grasshopper API
ModelRenderSkylight Type Conversions
The ModelRenderSkylight type exposes the following members.
Operators
Name | Description
Implicit(ModelRenderSkylight.Attributes to ModelRenderSkylight)
Top
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace