Grasshopper API
Attributes Type Conversions
The ModelHatchPattern.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelHatchPattern.Attributes)
Top
See Also
Reference
ModelHatchPattern.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace