Grasshopper API
GH_MeshingParameters Type Conversions
The GH_MeshingParameters type exposes the following members.
Operators
Name | Description
Implicit(MeshingParameters to GH_MeshingParameters)
Top
See Also
Reference
GH_MeshingParameters Class
Grasshopper.Kernel.Types Namespace