Grasshopper API
Attributes Type Conversions
The ModelAnnotationStyle.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelAnnotationStyle.Attributes)
Top
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace