Grasshopper API
PageSettings Type Conversions
The PageSettings type exposes the following members.
Operators
Name | Description
Implicit(PageSettings.Attributes to PageSettings)
Top
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace