Grasshopper API
ObjectRender Type Conversions
The ObjectRender type exposes the following members.
Operators
Name | Description
Implicit(ObjectRender.Attributes to ObjectRender)
Top
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace