Grasshopper API
AnnotationDimensionSettings Type Conversions
The AnnotationDimensionSettings type exposes the following members.
Operators
Name | Description
Explicit(AnnotationDimensionSettings to DimensionStyle)
Implicit(AnnotationDimensionSettings.Attributes to AnnotationDimensionSettings)
Top
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace