Grasshopper API
Attributes Type Conversions
The ModelTextureMapping.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelTextureMapping.Attributes)
Top
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace