Grasshopper API
ObjectDisplay Type Conversions
The ObjectDisplay type exposes the following members.
Operators
Name | Description
Implicit(ObjectDisplay.Attributes to ObjectDisplay)
Top
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace