Grasshopper API
AnnotationTextSettings Type Conversions
The AnnotationTextSettings type exposes the following members.
Operators
Name | Description
Explicit(AnnotationTextSettings to DimensionStyle)
Implicit(AnnotationTextSettings.Attributes to AnnotationTextSettings)
Top
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace