Grasshopper API
ClippingDrawingSettings Type Conversions
The ClippingDrawingSettings type exposes the following members.
Operators
Name | Description
Implicit(ClippingDrawingSettings.Attributes to ClippingDrawingSettings)
Top
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace