Grasshopper API
Attributes Type Conversions
The ModelSectionStyle.Attributes type exposes the following members.
Operators
Name | Description
Implicit(String to ModelSectionStyle.Attributes)
Top
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace