Grasshopper API
GH_Path Operators
The GH_Path type exposes the following members.
Operators
Name | Description
Equality
GreaterThan
Inequality
LessThan
Top
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace