Grasshopper API
AnnotationUnitsSettings Type Conversions
The AnnotationUnitsSettings type exposes the following members.
Operators
Name | Description
Explicit(AnnotationUnitsSettings to DimensionStyle)
Implicit(AnnotationUnitsSettings.Attributes to AnnotationUnitsSettings)
Top
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace