Grasshopper API
GH_ScriptVariant Operators and Type Conversions
The GH_ScriptVariant type exposes the following members.
Operators
Name | Description
Addition
BitwiseAnd
BitwiseOr
Concatenate
Division
Equality
ExclusiveOr
Explicit(GH_ScriptVariant to Plane)
Explicit(GH_ScriptVariant to Point3d)
Explicit(GH_ScriptVariant to Vector3d)
Explicit(GH_ScriptVariant to Boolean)
Explicit(GH_ScriptVariant to DateTime)
Explicit(GH_ScriptVariant to Double)
Explicit(GH_ScriptVariant to Int32)
Explicit(GH_ScriptVariant to String)
Exponent
False
GreaterThan
GreaterThanOrEqual
Implicit(Boolean to GH_ScriptVariant)
Implicit(DateTime to GH_ScriptVariant)
Implicit(Double to GH_ScriptVariant)
Implicit(Int32 to GH_ScriptVariant)
Implicit(Plane to GH_ScriptVariant)
Implicit(Point3d to GH_ScriptVariant)
Implicit(String to GH_ScriptVariant)
Implicit(Vector3d to GH_ScriptVariant)
Inequality
IntegerDivision
LeftShift
LessThan
LessThanOrEqual
Modulus
Multiply
OnesComplement
RightShift
Subtraction
True
UnaryNegation
UnaryPlus
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace