Grasshopper API
ModelRenderSun Type Conversions
The ModelRenderSun type exposes the following members.
Operators
Name | Description
Implicit(ModelRenderSun.Attributes to ModelRenderSun)
Top
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace