Grasshopper API
ModelTags Operators and Type Conversions
The ModelTags type exposes the following members.
Operators
Name | Description
Addition
Equality
Implicit(ModelTags to String)
Implicit(String to ModelTags)
Inequality
Subtraction
Top
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace