Grasshopper API
AnnotationLeaderSettings Type Conversions
The AnnotationLeaderSettings type exposes the following members.
Operators
Name | Description
Explicit(AnnotationLeaderSettings to DimensionStyle)
Implicit(AnnotationLeaderSettings.Attributes to AnnotationLeaderSettings)
Top
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace