Grasshopper API
GH_ResizeBorder.Setup Method
Overload List
Name | Description
Setup(IGH_Attributes, PointF)
 Set up a new sizing operation.
Setup(IGH_Attributes, PointF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF)
 Set up a new sizing operation.
Setup(IGH_Attributes, PointF, SizeF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF, SizeF, SizeF)
 Set up a new sizing operation.
Top
See Also
Reference
GH_ResizeBorder Class
Grasshopper.GUI.Canvas Namespace