Grasshopper API
Value Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelColor to ObjectDraftingColor.Value)
Implicit(ObjectPlotColorSource to ObjectDraftingColor.Value)
Implicit(ObjectDraftingColor.Value to ModelColor)
Implicit(ObjectDraftingColor.Value to ObjectPlotColorSource)
Top
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace