Grasshopper API
ObjectDrafting.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ModelValue.Equals(Object).)
Top
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace