Grasshopper API
ObjectRenderMaterial.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ModelValue.Equals(Object).)
Top
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace