Grasshopper API
GH_DocumentObject.GetValue Method
Overload List
Name | Description
GetValue(String, Boolean)
 Get a boolean value from the component value table.
GetValue(String, Double)
 Get a double value from the component value table.
GetValue(String, Color)
 Get a color value from the component value table.
GetValue(String, Int32)
 Get an integer value from the component value table.
GetValue(String, String)
 Get a string value from the component value table.
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace