Grasshopper API
DataTree<T>.EnsurePath Method
Overload List
Name | Description
EnsurePath(GH_Path)
 Create a new branch with the specified path if it doesn't already exists.
EnsurePath(Int32[])
 Create a new branch with the specified path if it doesn't already exists.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace