Grasshopper API
GH_WindowsFormUtil.CenterFormOnWindow Method
Overload List
Name | Description
CenterFormOnWindow(Form, Form, Boolean)
 Positions a Form so that it is centered on the supplied window. If the window doesn't exist or is hidden, the form will be centered on the screen instead.
CenterFormOnWindow(Window, Window, Boolean)
 Positions a Form so that it is centered on the supplied window. If the window doesn't exist or is hidden, the form will be centered on the screen instead.
Top
See Also
Reference
GH_WindowsFormUtil Class
Grasshopper.GUI Namespace