Grasshopper API
GH_ComponentServer.FindAssemblyByObject Method
Overload List
Name | Description
FindAssemblyByObject(Guid)
 Gets the assembly that corresponds to the given library ID.
FindAssemblyByObject(IGH_DocumentObject)
 Gets the assembly that corresponds to the given library ID.
Top
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace