Grasshopper API
GH_GraphicsUtil.DentHorizontal Method
Overload List
Name | Description
DentHorizontal(Graphics, Rectangle)
 Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
DentHorizontal(Graphics, Rectangle, Int32, Int32)
 Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace