Grasshopper API
GH_RenderArgs Constructor
Overload List
Name | Description
GH_RenderArgs(RhinoDoc, ViewportInfo, RenderPrimitiveList, Guid, Dictionary<Int32, RenderMaterial>) |  Obsolete.
 Create new render arguments.
GH_RenderArgs(RhinoDoc, ViewportInfo, RenderPrimitiveList, Guid, RenderMaterial, RenderMaterial) |  Obsolete.
 Create new render arguments.
Top
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace