Grasshopper API
GH_Interval2D Constructor
Overload List
Name | Description
GH_Interval2D(GH_Interval1D, GH_Interval1D)
 Constructor.
GH_Interval2D(Double, Double, Double, Double)
 Constructor.
Top
See Also
Reference
GH_Interval2D Structure
GH_IO.Types Namespace