Grasshopper API
GH_MemoryBitmap Constructor
Overload List
Name | Description
GH_MemoryBitmap(Bitmap)
 Default constructor.
GH_MemoryBitmap(Bitmap, WrapMode)
 Constructor with Wrap mode override.
Top
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace