Grasshopper API
ObjectDraftingLinetype.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
See Also
Reference
ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace