Grasshopper API
GH_PluginUtil.SendKeyCodeToRhino Method
Overload List
Name | Description
SendKeyCodeToRhino(Char)
 Send a key-code to the Rhino command line.
SendKeyCodeToRhino(Int32)
 Send a key-code to the Rhino command line.
SendKeyCodeToRhino(String)
 Send a string of characters to the Rhino command line.
Top
See Also
Reference
GH_PluginUtil Class
Grasshopper.Plugin Namespace