Grasshopper API
GH_WindowsControlUtil.FixTextRenderingDefault Method
Overload List
Name | Description
FixTextRenderingDefault(Control)
 Sets the UseCompatibleTextRendering value to False on the control.
FixTextRenderingDefault(Control.ControlCollection)
 Recursively sets the UseCompatibleTextRendering value to False on each control.
FixTextRenderingDefault(IEnumerable<Control>)
Top
See Also
Reference
GH_WindowsControlUtil Class
Grasshopper.GUI Namespace