Grasshopper API
ModelColor.Equality Operator
Overload List
Name | Description
Equality(Color, ModelColor)
Equality(ModelColor, ModelColor)
Equality(ModelColor, Color)
Top
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace