Grasshopper API
Value Constructor
Overload List
Name | Description
ObjectSectionStyle.Value(ModelSectionStyle)
Initializes a new instance of the ObjectSectionStyle.Value class
ObjectSectionStyle.Value(ObjectSectionAttributesSource)
Initializes a new instance of the ObjectSectionStyle.Value class
ObjectSectionStyle.Value(ObjectSectionAttributesSource, ModelSectionStyle)
Initializes a new instance of the ObjectSectionStyle.Value class
Top
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace