Grasshopper API
IGH_DataAccess.GetDataTree Method
Overload List
Name | Description
GetDataTree<T>(Int32, GH_Structure<T>)
 Retrieve an entire data tree from an input parameter during GH_Component.SolveInstance().
GetDataTree<T>(String, GH_Structure<T>)
 Retrieve an entire data tree from an input parameter during GH_Component.SolveInstance().
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace