Grasshopper API
ModelInstanceDefinition Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelInstanceDefinition.Attributes to ModelInstanceDefinition)
Implicit(InstanceDefinition to ModelInstanceDefinition)
Implicit(String to ModelInstanceDefinition)
Top
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace