Grasshopper API
GH_IReader.TryGetDrawingRectangleF Method
Overload List
Name | Description
TryGetDrawingRectangleF(String, RectangleF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingRectangleF(String, Int32, RectangleF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace