Grasshopper API
GH_UpgradeUtil.MigrateInputParameters Method
Overload List
Name | Description
MigrateInputParameters(IGH_Component, IGH_Component)
 Migrate all input parameters.
MigrateInputParameters(IGH_Component, IGH_Component, Int32[], Int32[])
 Migrate a bunch of input parameters.
Top
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace