Grasshopper API
GH_ComponentAttributes.IsPickRegion Method
Overload List
Name | Description
IsPickRegion(PointF) |  (Overrides GH_Attributes<T>.IsPickRegion(PointF).)
Top
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace