Grasshopper API
Projection Constructor
Overload List
Name | Description
Projection()
Initializes a new instance of the Projection class
Projection(Plane)
Initializes a new instance of the Projection class
Top
See Also
Reference
Projection Class
Grasshopper.Kernel.Types.Transforms Namespace