Grasshopper API
GH_Hatch Constructor
Overload List
Name | Description
GH_Hatch()
 Default constructor, creates an invalid hatch.
GH_Hatch(GH_Hatch)
 Create a duplicate of another GH_Hatch. This constructor also copies reference data.
GH_Hatch(Guid)
 Create a new referenced hatch that references a Rhino hatch with the specified ID.
GH_Hatch(Hatch)
 Create a duplicate of an existing hatch.
GH_Hatch(Hatch, ModelHatchPattern)
 Create a duplicate of an existing hatch.
Top
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace