Grasshopper API
GH_Chunk.TryGetDrawingSizeF Method
Overload List
Name | Description
TryGetDrawingSizeF(String, SizeF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingSizeF(String, Int32, SizeF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace