Grasshopper API
ModelTextureMapping Constructor
Overload List
Name | Description
ModelTextureMapping()
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(ModelTextureMapping.Attributes)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(Guid)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(TextureMapping)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(TextureMapping, Int32)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(TextureMapping, Int32, Transform)
Initializes a new instance of the ModelTextureMapping class
Top
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace