Grasshopper API
GH_DetailView.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the detail view is referenced and not yet loaded, attempts to load the detail view.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace