Grasshopper API
GH_Animator<T> Constructor
Overload List
Name | Description
GH_Animator<T>(T, T, TimeSpan, GH_Animator<T>.Interpolate)
 Create a new instance of the generic animator.
GH_Animator<T>(T, T, DateTime, DateTime, GH_Animator<T>.Interpolate)
 Create a new instance of the generic animator.
Top
See Also
Reference
GH_Animator<T> Class
Grasshopper.GUI Namespace