Grasshopper API
GH_ExpressionParser.AddVariable Method
Overload List
Name | Description
AddVariable(String, Complex)
AddVariable(String, Plane)
AddVariable(String, Point3d)
AddVariable(String, Vector3d)
AddVariable(String, Boolean)
AddVariable(String, Double)
AddVariable(String, Int32)
AddVariable(String, String)
Top
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace