Grasshopper API
GH_IWriter.CreateChunk Method
Overload List
Name | Description
CreateChunk(String)
 Create a new child chunk with the specified name but without an index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
CreateChunk(String, Int32)
 Create a new child chunk with the specified name and index qualifier. If another chunk already exists with similar properties, an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace