Grasshopper API
GH_InputParamManager.AddPointParameter Method
Overload List
Name | Description
AddPointParameter(String, String, String, GH_ParamAccess)
 Add a 3D Point parameter to the input list of this component.
AddPointParameter(String, String, String, GH_ParamAccess, Point3d)
 Register a new 3D point param with a single default coordinate.
AddPointParameter(String, String, String, GH_ParamAccess, IEnumerable<Point3d>)
 Register a new 3D point param with multiple default coordinates.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace