Grasshopper API
GH_GeometricGooWrapper Constructor
Overload List
Name | Description
GH_GeometricGooWrapper()
Initializes a new instance of the GH_GeometricGooWrapper class
GH_GeometricGooWrapper(IGH_GeometricGoo)
Initializes a new instance of the GH_GeometricGooWrapper class
Top
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace