Grasshopper API
GH_Chunk.TryGetByte Method
Overload List
Name | Description
TryGetByte(String, Byte)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetByte(String, Int32, Byte)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace