Grasshopper API
GH_GraphicsUtil.RenderObjectOverlay Method
Overload List
Name | Description
RenderObjectOverlay(Graphics, IGH_DocumentObject, RectangleF)
 Render all overlay icons for a specific object. Overlays aren't drawn when the zoom is less than 80%
RenderObjectOverlay(Graphics, IGH_ObjectProxy, RectangleF)
 Render all overlay icons for a specific object. Overlays aren't drawn when the zoom is less than 80%
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace