Grasshopper API
Value Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelColor to ObjectDisplayColor.Value)
Implicit(ObjectColorSource to ObjectDisplayColor.Value)
Implicit(ObjectDisplayColor.Value to ModelColor)
Implicit(ObjectDisplayColor.Value to ObjectColorSource)
Top
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace