Grasshopper API
Value Constructor
Overload List
Name | Description
ObjectDraftingColor.Value(ModelColor)
Initializes a new instance of the ObjectDraftingColor.Value class
ObjectDraftingColor.Value(ObjectPlotColorSource)
Initializes a new instance of the ObjectDraftingColor.Value class
ObjectDraftingColor.Value(ObjectPlotColorSource, ModelColor)
Initializes a new instance of the ObjectDraftingColor.Value class
Top
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace