Grasshopper API
GH_Attributes<T>.IsPickRegion Method
Overload List
Name | Description
IsPickRegion(PointF)
 Determines whether a point is within the pickable region for this object. By default, any point inside the Bounds is treated as pickable.
IsPickRegion(RectangleF, GH_PickBox)
 Determines whether a rectangle is a valid pick region for this object. By default, the picking rectangle is intersected with the Bounds rectangle.
Top
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace