Grasshopper API
GH_Alias Constructor
Overload List
Name | Description
GH_Alias()
Initializes a new instance of the GH_Alias class
GH_Alias(GH_Alias)
Initializes a new instance of the GH_Alias class
GH_Alias(String, Guid)
Initializes a new instance of the GH_Alias class
Top
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace