Grasshopper API
GH_OutputParamManager.Register_RectangleParam Method
Overload List
Name | Description
Register_RectangleParam(String, String, String)
 Register a new 3D rectangle parameter
Register_RectangleParam(String, String, String, GH_ParamAccess)
 Register a new 3D rectangle parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace