Grasshopper API
GH_IReader.TryGetDecimal Method
Overload List
Name | Description
TryGetDecimal(String, Decimal)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDecimal(String, Int32, Decimal)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace