Grasshopper API
GH_LooseChunk Constructor
Overload List
Name | Description
GH_LooseChunk(String)
 Create a new loose chunk. A loose chunk does not have an owner archive and thus cannot store runtime messages.
GH_LooseChunk(String, Int32)
 Create a new loose chunk. A loose chunk does not have an owner archive and thus cannot store runtime messages.
Top
See Also
Reference
GH_LooseChunk Class
GH_IO.Serialization Namespace