Grasshopper API
GH_IWriter.RemoveChunk Method
Overload List
Name | Description
RemoveChunk(GH_IChunk)
 Remove the specified chunk from the litter.
RemoveChunk(String)
 Remove the first chunk with a matching name. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
RemoveChunk(String, Int32)
 Remove the first chunk with a matching name and index. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace