Grasshopper API
ModelInstanceDefinition Constructor
Overload List
Name | Description
ModelInstanceDefinition()
Initializes a new instance of the ModelInstanceDefinition class
ModelInstanceDefinition(ModelInstanceDefinition.Attributes)
Initializes a new instance of the ModelInstanceDefinition class
ModelInstanceDefinition(Guid)
Initializes a new instance of the ModelInstanceDefinition class
ModelInstanceDefinition(InstanceDefinition)
Initializes a new instance of the ModelInstanceDefinition class
Top
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace