Grasshopper API
GH_GraphicsUtil.BoxFurthestPoint Method
Overload List
Name | Description
BoxFurthestPoint(Point, Rectangle)
 Find the furthest point on or in a box given a test point.
BoxFurthestPoint(PointF, RectangleF)
 Find the furthest point on or in a box given a test point.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace