Grasshopper API
GH_IWriter.SetDouble Method
Overload List
Name | Description
SetDouble(String, Double)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDouble(String, Int32, Double)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace