Grasshopper API
ChunkKeyedCollection.Remove Method
Overload List
Name | Description
Remove(GH_Chunk)
 Removes a chunk.
Remove(ID)
 Removes an ID.
Top
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace