Grasshopper API
ObjectSectionStyle Constructor
Overload List
Name | Description
ObjectSectionStyle()
Initializes a new instance of the ObjectSectionStyle class
ObjectSectionStyle(ObjectSectionStyle.Value)
Initializes a new instance of the ObjectSectionStyle class
Top
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace