Grasshopper API
GH_SubD Constructor
Overload List
Name | Description
GH_SubD()
Initializes a new instance of the GH_SubD class
GH_SubD(GH_SubD)
Initializes a new instance of the GH_SubD class
GH_SubD(Guid)
Initializes a new instance of the GH_SubD class
GH_SubD(SubD)
Initializes a new instance of the GH_SubD class
Top
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace