Grasshopper API
GH_DetailView Constructor
Overload List
Name | Description
GH_DetailView()
 Default constructor, creates an invalid detail view.
GH_DetailView(DetailView)
 Create a duplicate of an existing detail view.
GH_DetailView(GH_DetailView)
 Create a duplicate of another GH_DetailView. This constructor also copies reference data.
GH_DetailView(Guid)
 Create a new referenced detail view that references a Rhino detail view with the specified ID.
Top
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace