Grasshopper API
IGH_DocumentObject.OnObjectChanged Method
Overload List
Name | Description
OnObjectChanged(GH_ObjectChangedEventArgs)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(GH_ObjectEventType)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(String)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(GH_ObjectEventType, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(String, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
Top
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace