Grasshopper API
GH_DocumentServer.IndexOf Method
Overload List
Name | Description
IndexOf(GH_Document)
 Gets the index of the given document.
IndexOf(String)
 Gets the index of the document that matches the filepath.
Top
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace