Grasshopper API
ObjectDisplayColor Implicit Conversion Operators
Overload List
Name | Description
Implicit(ObjectDisplayColor to ObjectDisplayColor.Value)
Implicit(ObjectDisplayColor.Value to ObjectDisplayColor)
Top
See Also
Reference
ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace