Grasshopper API
ModelTextureSlot Constructor
Overload List
Name | Description
ModelTextureSlot()
Initializes a new instance of the ModelTextureSlot class
ModelTextureSlot(ModelTextureSlot.Attributes)
Initializes a new instance of the ModelTextureSlot class
ModelTextureSlot(RenderContent, String)
Initializes a new instance of the ModelTextureSlot class
Top
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace