Grasshopper API
ObjectRenderMaterial Implicit Conversion Operators
Overload List
Name | Description
Implicit(ObjectRenderMaterial to ObjectRenderMaterial.Value)
Implicit(ObjectRenderMaterial.Value to ObjectRenderMaterial)
Top
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace