Grasshopper API
GH_IWriter.SetDrawingSizeF Method
Overload List
Name | Description
SetDrawingSizeF(String, SizeF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingSizeF(String, Int32, SizeF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace