Grasshopper API
GH_IWriter.SetBoolean Method
Overload List
Name | Description
SetBoolean(String, Boolean)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetBoolean(String, Int32, Boolean)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace