Grasshopper API
GH_Variant Constructor
Overload List
Name | Description
GH_Variant()
 Create a new Null variant.
GH_Variant(Boolean)
 Create a new Bool variant.
GH_Variant(Complex)
 Create a new Complex variant.
GH_Variant(Double)
 Create a new Double variant.
GH_Variant(GH_Variant)
 Duplicate a Variant.
GH_Variant(Int32)
 Create a new Integer variant.
GH_Variant(Plane)
 Create a new Plane variant.
GH_Variant(Point3d)
 Create a new Point variant.
GH_Variant(String)
 Create a new String variant.
GH_Variant(Vector3d)
 Create a new Point variant.
Top
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace