Grasshopper API
GH_Chunk.SetPath Method
Overload List
Name | Description
SetPath(String, String, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetPath(String, Int32, String, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace