Grasshopper API
GH_Extrusion Constructor
Overload List
Name | Description
GH_Extrusion()
Initializes a new instance of the GH_Extrusion class
GH_Extrusion(Extrusion)
Initializes a new instance of the GH_Extrusion class
GH_Extrusion(GH_Extrusion)
Initializes a new instance of the GH_Extrusion class
GH_Extrusion(Guid)
Initializes a new instance of the GH_Extrusion class
Top
See Also
Reference
GH_Extrusion Class
Grasshopper.Kernel.Types Namespace