Grasshopper API
GH_Gradient.RemoveGrip Method
Overload List
Name | Description
RemoveGrip(GH_Grip)
 Remove the specified grip.
RemoveGrip(Int32)
 Remove the grip at the specified index.
Top
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace