Grasshopper API
GH_OrdinateDimension Constructor
Overload List
Name | Description
GH_OrdinateDimension()
 Default constructor, creates an invalid ordinate dimension.
GH_OrdinateDimension(GH_OrdinateDimension)
 Create a duplicate of another GH_OrdinateDimension. This constructor also copies reference data.
GH_OrdinateDimension(Guid)
 Create a new referenced ordinate dimension that references a Rhino dimension with the specified ID.
GH_OrdinateDimension(OrdinateDimension)
 Create a duplicate of an existing ordinate dimension.
GH_OrdinateDimension(OrdinateDimension, ModelAnnotationStyle)
 Create a duplicate of an existing ordinate dimension.
Top
See Also
Reference
GH_OrdinateDimension Class
Grasshopper.Kernel.Types Namespace