Grasshopper API
Value Constructor
Overload List
Name | Description
ObjectDisplayColor.Value(ModelColor)
Initializes a new instance of the ObjectDisplayColor.Value class
ObjectDisplayColor.Value(ObjectColorSource)
Initializes a new instance of the ObjectDisplayColor.Value class
ObjectDisplayColor.Value(ObjectColorSource, ModelColor)
Initializes a new instance of the ObjectDisplayColor.Value class
Top
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace