Grasshopper API
ObjectSectionStyle Implicit Conversion Operators
Overload List
Name | Description
Implicit(ObjectSectionStyle to ObjectSectionStyle.Value)
Implicit(ObjectSectionStyle.Value to ObjectSectionStyle)
Top
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace