Grasshopper API
GH_BoundingBox Constructor
Overload List
Name | Description
GH_BoundingBox(GH_Point3D, GH_Point3D)
 Constructor.
GH_BoundingBox(Double, Double, Double, Double, Double, Double)
 Constructor.
Top
See Also
Reference
GH_BoundingBox Structure
GH_IO.Types Namespace