Grasshopper API
GH_ComponentParamServer.RegisterOutputParam Method
Overload List
Name | Description
RegisterOutputParam(IGH_Param)
 Add a parameter to the end of the output list.
RegisterOutputParam(IGH_Param, Int32)
 Add a parameter at the specific index of the output list.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace