Grasshopper API
GH_DocumentObject.Menu_AppendItem Method
Overload List
Name | Description
Menu_AppendItem(ToolStrip, String)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Boolean)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Image)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Boolean, Boolean)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Image, Object)
 Utility function for appending generic menu items.
Menu_AppendItem(ToolStrip, String, EventHandler, Image, Boolean, Boolean)
 Utility function for appending generic menu items.
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace