Grasshopper API
Param_ModelConstructionPlane.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace