Grasshopper API
IGH_DataAccess.SetDataList Method
Overload List
Name | Description
SetDataList(Int32, IEnumerable)
 Stores a list of data in an output parameter during GH_Component.SolveInstance().
SetDataList(String, IEnumerable)
 Stores data in an output parameter during GH_Component.SolveInstance().
SetDataList(Int32, IEnumerable, Int32)
 Expert user function. Stores a list of data in an output parameter during GH_Component.SolveInstance().
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace