Grasshopper API
GH_ClippingPlane Constructor
Overload List
Name | Description
GH_ClippingPlane()
 Default constructor, creates an invalid clipping plane.
GH_ClippingPlane(ClippingPlaneSurface)
 Create a duplicate of an existing clipping plane.
GH_ClippingPlane(GH_ClippingPlane)
 Create a duplicate of another GH_ClippingPlane. This constructor also copies reference data.
GH_ClippingPlane(Guid)
 Create a new referenced clipping plane that references a clipping plane in a Rhino document with a specified ID.
Top
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace