Grasshopper API
GH_DocumentIO.SubsidiaryDocumentSavePrompt Method
Overload List
Name | Description
SubsidiaryDocumentSavePrompt(GH_Document)
 Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
SubsidiaryDocumentSavePrompt(String, Boolean, Int32)
 Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
Top
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace