Grasshopper API
GH_ComponentParamServer.SortInput Method
Overload List
Name | Description
SortInput(Double[])
 Sort the input parameter order based on a numeric key array.
SortInput(Int32[])
 Sort the input parameter order based on a numeric key array.
SortInput(Single[])
 Sort the input parameter order based on a numeric key array.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace