Grasshopper API
AnnotationDateTimeFormat.Equals Method
Overload List
Name | Description
Equals(AnnotationDateTimeFormat)
Equals(Object) |  (Overrides Object.Equals(Object).)
Top
See Also
Reference
AnnotationDateTimeFormat Class
Grasshopper.Rhinoceros.Annotations Namespace