Grasshopper API
GH_IWriter.SetPoint2D Method
Overload List
Name | Description
SetPoint2D(String, GH_Point2D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint2D(String, Int32, GH_Point2D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace