Grasshopper API
Value Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelSectionStyle to ObjectSectionStyle.Value)
Implicit(ObjectSectionAttributesSource to ObjectSectionStyle.Value)
Implicit(ObjectSectionStyle.Value to ModelSectionStyle)
Implicit(ObjectSectionStyle.Value to ObjectSectionAttributesSource)
Top
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace