Grasshopper API
GH_StringMismatchException Constructor
Overload List
Name | Description
GH_StringMismatchException()
Initializes a new instance of the GH_StringMismatchException class
GH_StringMismatchException(String)
Initializes a new instance of the GH_StringMismatchException class
Top
See Also
Reference
GH_StringMismatchException Class
Grasshopper.Kernel.Data Namespace