Grasshopper API
GH_DocumentObject Constructor
Overload List
Name | Description
GH_DocumentObject(IGH_InstanceDescription)
Initializes a new instance of the GH_DocumentObject class
GH_DocumentObject(String, String, String, String, String)
Initializes a new instance of the GH_DocumentObject class
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace