Grasshopper API
GH_LexerCombo Constructor
Overload List
Name | Description
GH_LexerCombo()
Initializes a new instance of the GH_LexerCombo class
GH_LexerCombo(GH_Lexer, GH_Lexer)
Initializes a new instance of the GH_LexerCombo class
GH_LexerCombo(String, String)
Initializes a new instance of the GH_LexerCombo class
Top
See Also
Reference
GH_LexerCombo Class
Grasshopper.Kernel.Data Namespace