Grasshopper API
GH_OutputParamManager.Register_FieldParam Method
Overload List
Name | Description
Register_FieldParam(String, String, String)
 Register a new field parameter
Register_FieldParam(String, String, String, GH_ParamAccess)
 Register a new field parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace