Grasshopper API
GH_OutputParamManager.Register_PlaneParam Method
Overload List
Name | Description
Register_PlaneParam(String, String, String)
 Register a new 3D plane parameter
Register_PlaneParam(String, String, String, GH_ParamAccess)
 Register a new 3D plane parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace