Grasshopper API
ItemDisplayColor Implicit Conversion Operators
Overload List
Name | Description
Implicit(ItemDisplayColor to ItemDisplayColor.Value)
Implicit(ItemDisplayColor.Value to ItemDisplayColor)
Top
See Also
Reference
ItemDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace