Grasshopper API
GH_IndexRange Constructor
Overload List
Name | Description
GH_IndexRange(Int32)
 Create a new singular range.
GH_IndexRange(Int32, Int32)
 Create a new range.
Top
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace