Grasshopper API
GH_InputParamManager.AddCultureParameter Method
Overload List
Name | Description
AddCultureParameter(String, String, String, GH_ParamAccess)
 Add a Cultue parameter to the input list of this component.
AddCultureParameter(String, String, String, GH_ParamAccess, CultureInfo)
 Add a Culture parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace