Grasshopper API
GH_Time Constructor
Overload List
Name | Description
GH_Time()
 Blank constructor
GH_Time(DateTime)
Initializes a new instance of the GH_Time class
GH_Time(GH_Time)
Initializes a new instance of the GH_Time class
Top
See Also
Reference
GH_Time Class
Grasshopper.Kernel.Types Namespace