Grasshopper API
GH_GraphicsUtil.EtchVertical Method
Overload List
Name | Description
EtchVertical(Graphics, Int32, Int32, Int32, Int32)
 Draws an etched line segment.
EtchVertical(Graphics, Single, Single, Single, Int32)
 Draws an etched line segment.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace