Grasshopper API
GH_Viewport.IsVisible Method
Overload List
Name | Description
IsVisible(PointF, Single)
 Test visibility of a point.
IsVisible(RectangleF, Single)
 Test visibility of a rectangle.
Top
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace