Grasshopper API
GH_ObjectWrapper Constructor
Overload List
Name | Description
GH_ObjectWrapper()
Initializes a new instance of the GH_ObjectWrapper class
GH_ObjectWrapper(Object)
Initializes a new instance of the GH_ObjectWrapper class
Top
See Also
Reference
GH_ObjectWrapper Class
Grasshopper.Kernel.Types Namespace