Grasshopper API
GH_DocumentIO Constructor
Overload List
Name | Description
GH_DocumentIO()
 Create a new instance of GH_DocumentIO without an internal document.
GH_DocumentIO(GH_Document)
 Create a new instance of GH_DocumentIO with an internal document.
Top
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace