Grasshopper API
GH_Chunk.SetDrawingRectangleF Method
Overload List
Name | Description
SetDrawingRectangleF(String, RectangleF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingRectangleF(String, Int32, RectangleF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace