Grasshopper API
GH_StructurePath.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_StructurePath Class
Grasshopper.Kernel.Types Namespace