Grasshopper API
GH_PersistentGeometryParam<T> Constructor
Overload List
Name | Description
GH_PersistentGeometryParam<T>(GH_InstanceDescription)
Initializes a new instance of the GH_PersistentGeometryParam<T> class
GH_PersistentGeometryParam<T>(GH_InstanceDescription, Boolean) |  Obsolete.
Initializes a new instance of the GH_PersistentGeometryParam<T> class
Top
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace