Grasshopper API
GH_Document.FilterObjects Method
Overload List
Name | Description
FilterObjects(GH_Filter, GH_Filter, GH_Filter)
 Returns all objects in the document that pass the filter specification
FilterObjects(List<IGH_DocumentObject>, GH_Filter, GH_Filter, GH_Filter)
 Filter a list of objects using several filters at once
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace