Grasshopper API
GH_Interval2D Constructor
Overload List
Name | Description
GH_Interval2D()
 Default constructor. Creates two empty intervals.
GH_Interval2D(GH_Interval2D)
 Create a duplicate of another two-dimensional interval
GH_Interval2D(UVInterval)
 Duplicates a one-dimensional interval in both directions.
Top
See Also
Reference
GH_Interval2D Class
Grasshopper.Kernel.Types Namespace