Grasshopper API
GH_Extrusion.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Extrusion Class
Grasshopper.Kernel.Types Namespace