Grasshopper API
Value.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ItemDisplayColor.Value)
Top
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace