Grasshopper API
ModelViewport Constructor
Overload List
Name | Description
ModelViewport()
Initializes a new instance of the ModelViewport class
ModelViewport(ModelViewport.Attributes)
Initializes a new instance of the ModelViewport class
ModelViewport(ModelViewport.Attributes, Guid)
Initializes a new instance of the ModelViewport class
Top
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace