Grasshopper API
Utility.FixNewlines Method
Overload List
Name | Description
FixNewlines(String)
 Make sure all newlines in a string adhere to the current platform standard.
FixNewlines(String, String)
 Make sure all newlines in a string have a specific pattern.
Top
See Also
Reference
Utility Class
Grasshopper Namespace