Grasshopper API
IGH_Param.ReplaceSource Method
Overload List
Name | Description
ReplaceSource(Guid, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
ReplaceSource(IGH_Param, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
Top
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace