Grasshopper API
GH_Chunk.TryGetBoundingBox Method
Overload List
Name | Description
TryGetBoundingBox(String, GH_BoundingBox)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetBoundingBox(String, Int32, GH_BoundingBox)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace