Grasshopper API
Node3d<T>.FurthestItem Method
Overload List
Name | Description
FurthestItem(T)
 Find the furtest item.
FurthestItem(Point3d)
 Find the furtest item.
FurthestItem(Double, Double, Double)
 Find the furtest item.
FurthestItem(T, Double, Double)
 Find the furtest item.
FurthestItem(Point3d, Double, Double)
 Find the furtest item.
FurthestItem(Double, Double, Double, Double, Double)
 Find the furtest item.
Top
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace