Grasshopper API
GH_State.Data Property
Overload List
Name | Description
Data[Guid]
 Gets the state data stored under the specified ID
Data[Int32]
 Gets the state data stored under the specified index
Top
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace