Grasshopper API
GH_OutputParamManager.Register_2DIntervalParam Method
Overload List
Name | Description
Register_2DIntervalParam(String, String, String)
 Register a new two-dimensional OnInterval parameter
Register_2DIntervalParam(String, String, String, GH_ParamAccess)
 Register a new two-dimensional OnInterval parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace