Grasshopper API
IGH_Param.RemoveSource Method
Overload List
Name | Description
RemoveSource(Guid)
 Remove the specified source from this parameter.
RemoveSource(IGH_Param)
 Remove the specified source from this parameter.
Top
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace