Grasshopper API
GH_Capsule.Render Method
Overload List
Name | Description
Render(Graphics, GH_PaletteStyle)
 Have this capsule draw itself onto a Graphics surface with a custom Style override.
Render(Graphics, Color)
 Have this capsule draw itself onto a Graphics surface with a custom colour override.
Render(Graphics, Image, GH_PaletteStyle)
 Have this capsule draw itself onto a Graphics surface with a custom Style override.
Render(Graphics, Image, Color)
 Have this capsule draw itself onto a Graphics surface with a custom colour override.
Render(Graphics, Boolean, Boolean, Boolean)
 Render the capsule onto a graphics context.
Render(Graphics, Image, Boolean, Boolean, Boolean)
 Render the capsule onto a graphics context.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace