Grasshopper API
GH_OutputParamManager.Register_GeometryParam Method
Overload List
Name | Description
Register_GeometryParam(String, String, String)
 Register a new 3D geometry parameter
Register_GeometryParam(String, String, String, GH_ParamAccess)
 Register a new 3D geometry parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace