Grasshopper API
GH_Dimension Constructor
Overload List
Name | Description
GH_Dimension()
 Default constructor, creates an invalid dimension.
GH_Dimension(Dimension)
 Create a duplicate of an existing dimension.
GH_Dimension(GH_Dimension)
 Create a duplicate of another GH_Dimension. This constructor also copies reference data.
GH_Dimension(Guid)
 Create a new referenced dimension that references a Rhino dimension with the specified ID.
GH_Dimension(ObjRef)
Initializes a new instance of the GH_Dimension class
GH_Dimension(Dimension, ModelAnnotationStyle)
 Create a duplicate of an existing dimension.
Top
See Also
Reference
GH_Dimension Class
Grasshopper.Kernel.Types Namespace