Grasshopper API
GH_PathOffset.OffsetPath Method
Overload List
Name | Description
OffsetPath(GH_Path, Int32, GH_Path, Int32)
 Offset a path + index value without wrapping.
OffsetPath(GH_Path, Int32, IGH_Structure, GH_Path, Int32)
 Offset a path + index value with wrapping and bounds checking.
Top
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace