Grasshopper API
GH_Chunk.Read Method
Overload List
Name | Description
Read(BinaryReader)
 Read this chunk and all child chunks from a binary stream.
Read(XmlNode)
 Read this chunk and all child chunks from an Xml node.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace