Grasshopper API
GH_Mesh Constructor
Overload List
Name | Description
GH_Mesh()
Initializes a new instance of the GH_Mesh class
GH_Mesh(GH_Mesh)
Initializes a new instance of the GH_Mesh class
GH_Mesh(Guid)
Initializes a new instance of the GH_Mesh class
GH_Mesh(Mesh)
Initializes a new instance of the GH_Mesh class
Top
See Also
Reference
GH_Mesh Class
Grasshopper.Kernel.Types Namespace