Grasshopper API
GH_WindowsFormUtil.CenterFormOnCursor Method
Overload List
Name | Description
CenterFormOnCursor(Form, Boolean)
 Positions a Form so that it is centered around the cursor
CenterFormOnCursor(Window, Boolean)
 Positions a Form so that it is centered around the cursor
Top
See Also
Reference
GH_WindowsFormUtil Class
Grasshopper.GUI Namespace