Grasshopper API
Node3d<T>.NearestItems Method
Overload List
Name | Description
NearestItems(T, Int32)
 Find the N nearest items.
NearestItems(Double, Double, Double, Int32)
 Find the N nearest items.
NearestItems(T, Int32, Double, Double)
 Find the N nearest items.
NearestItems(Double, Double, Double, Int32, Double, Double)
 Find the N nearest items.
Top
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace