Grasshopper API
GH_CapsuleRenderEngine.RenderIcon Method
Overload List
Name | Description
RenderIcon(Graphics, Image, Int32, Int32)
 Render an image icon centered into the box. If the content box has been defined the icon will be centered there, otherwise the outline box will be used.
RenderIcon(Graphics, Image, RectangleF, Int32, Int32)
 Render an image icon centered into the box. If the content box has been defined the icon will be centered there, otherwise the outline box will be used.
Top
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace