Grasshopper API
ObjectDraftingLineWidth.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ModelValue.Equals(Object).)
Top
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace