Grasshopper API
GH_IReader.TryGetDrawingPoint Method
Overload List
Name | Description
TryGetDrawingPoint(String, Point)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingPoint(String, Int32, Point)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace