Grasshopper API
GH_ComponentAttributes.RenderComponentCapsule Method
Overload List
Name | Description
RenderComponentCapsule(GH_Canvas, Graphics)
 Utility function, draws the complete component capsule including all parameter data.
RenderComponentCapsule(GH_Canvas, Graphics, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Utility function, draws the component capsule including all specified elements.
Top
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace