Grasshopper API
Node3d<T> Constructor
Overload List
Name | Description
Node3d<T>(Coordinates3d<T>, BoundingBox)
 Create a new spatial tree root.
Node3d<T>(Coordinates3d<T>, BoundingBox, Int32)
 Create a new spatial tree root.
Top
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace