Grasshopper API
GH_Item.Write Method
Overload List
Name | Description
Write(BinaryWriter)
 Serialize this item into a binary stream.
Write(XmlWriter)
 Serialize this item into an Xml stream.
Top
See Also
Reference
GH_Item Class
GH_IO.Types Namespace