Grasshopper API
GH_GraphicsUtil.RenderHighlightBox Method
Overload List
Name | Description
RenderHighlightBox(Graphics, Rectangle, Int32)
 Render a typical blueish highlight rectangle
RenderHighlightBox(Graphics, Rectangle, Int32, Boolean, Boolean)
 Render a typical blueish highlight rectangle
RenderHighlightBox(Graphics, Rectangle, Int32, Color, Color)
 Render a typical blueish highlight rectangle
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace