Grasshopper API
GH_GeometricGoo<T>.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
LoadGeometry(RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
Top
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace