Grasshopper API
GH_Point Constructor
Overload List
Name | Description
GH_Point()
Initializes a new instance of the GH_Point class
GH_Point(GH_Point)
Initializes a new instance of the GH_Point class
GH_Point(Guid)
Initializes a new instance of the GH_Point class
GH_Point(Point3d)
Initializes a new instance of the GH_Point class
Top
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace