Grasshopper API
GH_Param<T> Constructor
Overload List
Name | Description
GH_Param<T>(IGH_InstanceDescription)
Initializes a new instance of the GH_Param<T> class
GH_Param<T>(IGH_InstanceDescription, GH_ParamAccess)
Initializes a new instance of the GH_Param<T> class
GH_Param<T>(String, String, String, String, String, GH_ParamAccess)
Initializes a new instance of the GH_Param<T> class
Top
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace