Grasshopper API
IGH_DocumentObject.TriggerAutoSave Method
Overload List
Name | Description
TriggerAutoSave()
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(GH_AutoSaveTrigger)
 Triggers the AutoSave function on the owner document with a custom flag.
TriggerAutoSave(Guid)
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(GH_AutoSaveTrigger, Guid)
 Triggers the AutoSave function on the owner document with a custom flag.
Top
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace