Grasshopper API
Value Implicit Conversion Operators
Overload List
Name | Description
Implicit(ItemColorSource to ItemDisplayColor.Value)
Implicit(ModelColor to ItemDisplayColor.Value)
Implicit(ItemDisplayColor.Value to ModelColor)
Implicit(ItemDisplayColor.Value to ItemColorSource)
Top
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace