Grasshopper API
ObjectDraftingColor Implicit Conversion Operators
Overload List
Name | Description
Implicit(ObjectDraftingColor to ObjectDraftingColor.Value)
Implicit(ObjectDraftingColor.Value to ObjectDraftingColor)
Top
See Also
Reference
ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting Namespace