Grasshopper API
GH_StateTag.RenderTagBlankIcon Method
Overload List
Name | Description
RenderTagBlankIcon(Graphics)
 Render a blank rectangle icon.
RenderTagBlankIcon(Graphics, GH_StateTag.DrawCallback)
 Render a blank rectangle icon.
Top
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace