Grasshopper API
GH_OutputParamManager.Register_CurveParam Method
Overload List
Name | Description
Register_CurveParam(String, String, String)
 Register a new 3D curve parameter
Register_CurveParam(String, String, String, GH_ParamAccess)
 Register a new 3D curve parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace