Grasshopper API
ObjectSectionStyle.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace