Grasshopper API
GH_Convert.ToSHA_Hash Method
Overload List
Name | Description
ToSHA_Hash(Byte[])
 Create a SHA hash. The hash algorithm is only guaranteed to yield the same results from within a unique application domain.
ToSHA_Hash(Stream)
 Create a SHA hash. The hash algorithm is only guaranteed to yield the same results from within a unique application domain.
Top
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace