Grasshopper API
GH_IWriter.SetInterval2D Method
Overload List
Name | Description
SetInterval2D(String, GH_Interval2D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInterval2D(String, Int32, GH_Interval2D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace