Grasshopper API
GH_Hatch.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the hatch is referenced and not yet loaded, attempts to load the hatch.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace