Grasshopper API
ItemDisplayColor Constructor
Overload List
Name | Description
ItemDisplayColor()
Initializes a new instance of the ItemDisplayColor class
ItemDisplayColor(ItemDisplayColor.Value)
Initializes a new instance of the ItemDisplayColor class
Top
See Also
Reference
ItemDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace