Grasshopper API
Value Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelRenderMaterial to ObjectRenderMaterial.Value)
Implicit(ObjectMaterialSource to ObjectRenderMaterial.Value)
Implicit(ObjectRenderMaterial.Value to ModelRenderMaterial)
Implicit(ObjectRenderMaterial.Value to ObjectMaterialSource)
Top
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace