Grasshopper API
GH_Mesh.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Mesh Class
Grasshopper.Kernel.Types Namespace