Grasshopper API
GH_Document.SetPreviewFlags Method
Overload List
Name | Description
SetPreviewFlags(Boolean)
 Set the preview flags of all selected objects to true or false
SetPreviewFlags(List<IGH_DocumentObject>, Boolean)
 Set the preview flags of all specified objects to true or false
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace