Grasshopper API
GH_Curve Constructor
Overload List
Name | Description
GH_Curve()
 Default constructor, creates an invalid curve.
GH_Curve(Curve)
 Create a duplicate of an existing curve.
GH_Curve(GH_Curve)
 Create a duplicate of another GH_Curve. This constructor also copies reference data.
GH_Curve(Guid)
 Create a new referenced curve that references a Rhino curve object with the specified ID.
GH_Curve(Guid, Int32)
 Create a new references edge curve that references an edge index in a Rhino Brep object.
Top
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace