Grasshopper API
GH_OutputParamManager.Register_LineParam Method
Overload List
Name | Description
Register_LineParam(String, String, String)
 Register a new 3D line parameter
Register_LineParam(String, String, String, GH_ParamAccess)
 Register a new 3D line parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace