Grasshopper API
Param_TextEntity.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_TextEntity Class
Grasshopper.Kernel.Parameters Namespace