Grasshopper API
GH_ScriptVariant Explicit Conversion Operators
Overload List
Name | Description
Explicit(GH_ScriptVariant to Plane)
Explicit(GH_ScriptVariant to Point3d)
Explicit(GH_ScriptVariant to Vector3d)
Explicit(GH_ScriptVariant to Boolean)
Explicit(GH_ScriptVariant to DateTime)
Explicit(GH_ScriptVariant to Double)
Explicit(GH_ScriptVariant to Int32)
Explicit(GH_ScriptVariant to String)
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace