Grasshopper API
GH_OutputParamManager.Register_MeshParam Method
Overload List
Name | Description
Register_MeshParam(String, String, String)
 Register a new 3D Mesh parameter
Register_MeshParam(String, String, String, GH_ParamAccess)
 Register a new 3D Mesh parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace