Grasshopper API
GH_String Constructor
Overload List
Name | Description
GH_String()
 Blank constructor
GH_String(GH_String)
Initializes a new instance of the GH_String class
GH_String(String)
Initializes a new instance of the GH_String class
Top
See Also
Reference
GH_String Class
Grasshopper.Kernel.Types Namespace