Grasshopper API
GH_Viewport.Zoom Property
Overload List
Name | Description
Zoom
 Gets or sets the Zoom factor of the viewport. Please assign only sensible values.
Zoom[Boolean]
 Sets the zoom of the viewport with a view anchor.
Top
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace