Grasshopper API
ModelContentName Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelContentName to String)
Implicit(String to ModelContentName)
Top
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace