Grasshopper API
GH_GeometricGoo<T> Constructor
Overload List
Name | Description
GH_GeometricGoo<T>()
 Blank constructor, m_value will be set to default (null for reference types, zeroes for value types)
GH_GeometricGoo<T>(T)
 Data constructor, m_value will be set to internal_data.
Top
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace