Grasshopper API
GH_ExpressionSyntaxWriter.RewriteForEvaluator Method
Overload List
Name | Description
RewriteForEvaluator(GH_CodeString)
 Rewrite the expression so that all temporary keywords and symbols are replaced by evaluator-specific chars. The expression will become less readable, do not let the user see the result of this function. You need to rewrite the expression with this function if you intend to feed it into the Evaluator.
RewriteForEvaluator(String)
 Rewrite the expression so that all temporary keywords and symbols are replaced by evaluator-specific chars. The expression will become less readable, do not let the user see the result of this function. You need to rewrite the expression with this function if you intend to feed it into the Evaluator.
Top
See Also
Reference
GH_ExpressionSyntaxWriter Class
Grasshopper.Kernel.Expressions Namespace