Grasshopper API
GH_Colour Constructor
Overload List
Name | Description
GH_Colour()
 Blank constructor
GH_Colour(Color)
Initializes a new instance of the GH_Colour class
GH_Colour(GH_Colour)
Initializes a new instance of the GH_Colour class
Top
See Also
Reference
GH_Colour Class
Grasshopper.Kernel.Types Namespace