Grasshopper API
GH_Format.FormatExtrusion Method
Overload List
Name | Description
FormatExtrusion(Extrusion)
FormatExtrusion(GH_Extrusion)
Top
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace