Grasshopper API
GH_Plane Constructor
Overload List
Name | Description
GH_Plane(GH_Point3D, GH_Point3D, GH_Point3D)
 Constructor.
GH_Plane(Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Constructor.
Top
See Also
Reference
GH_Plane Structure
GH_IO.Types Namespace