Grasshopper API
GH_Rectangle Constructor
Overload List
Name | Description
GH_Rectangle()
 Default constructor
GH_Rectangle(GH_Rectangle)
 Create a duplicate of another circle.
GH_Rectangle(Rectangle3d)
 Create a duplicate of another rectangle.
Top
See Also
Reference
GH_Rectangle Class
Grasshopper.Kernel.Types Namespace