Grasshopper API
GH_GraphicsUtil.ShadowRectangle Method
Overload List
Name | Description
ShadowRectangle(Graphics, Rectangle, Int32, Color)
 Draws shadow edges on the interior of a rectangle.
ShadowRectangle(Graphics, Rectangle, Int32, Int32)
 Draws shadow edges on the interior of a rectangle.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace