Grasshopper API
GH_SubD.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace