Grasshopper API
Attributes.Equals Method
Overload List
Name | Description
Equals(ObjectRender.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace