Grasshopper API
GH_ClippingPlane.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the clipping plane is referenced and not yet loaded, attempts to load the clipping plane.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace