Grasshopper API
GH_Chunk.GetLine Method
Overload List
Name | Description
GetLine(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetLine(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace