Grasshopper API
IGH_DataAccess.SetData Method
Overload List
Name | Description
SetData(Int32, Object)
 Stores data in an output parameter during GH_Component.SolveInstance(). Use this function only for setting individual data items. If you want to set lists of data, you *must* call SetDataList() instead.
SetData(String, Object)
 Stores data in an output parameter during GH_Component.SolveInstance().
SetData(Int32, Object, Int32)
 Expert user function. Stores data in an output parameter during GH_Component.SolveInstance(). Use this function only for setting individual data items. If you want to set lists of data, you *must* call SetDataList() instead.
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace