Grasshopper API
ModelUserText.UpdateRange Method
Overload List
Name | Description
UpdateRange(IEnumerable<KeyValuePair<String, String>>)
UpdateRange(IEnumerable<String>)
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace