Grasshopper API
GH_GeometricGoo<T>.CastTo Method
Overload List
Name | Description
CastTo<Q>(Q)
 Attempt a cast to type T.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace