Grasshopper API
GH_ScriptVariant Implicit Conversion Operators
Overload List
Name | Description
Implicit(Boolean to GH_ScriptVariant)
Implicit(DateTime to GH_ScriptVariant)
Implicit(Double to GH_ScriptVariant)
Implicit(Int32 to GH_ScriptVariant)
Implicit(Plane to GH_ScriptVariant)
Implicit(Point3d to GH_ScriptVariant)
Implicit(String to GH_ScriptVariant)
Implicit(Vector3d to GH_ScriptVariant)
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace