Grasshopper API
ModelHatchPattern Constructor
Overload List
Name | Description
ModelHatchPattern()
Initializes a new instance of the ModelHatchPattern class
ModelHatchPattern(ModelHatchPattern.Attributes)
Initializes a new instance of the ModelHatchPattern class
ModelHatchPattern(Guid)
Initializes a new instance of the ModelHatchPattern class
ModelHatchPattern(HatchPattern)
Initializes a new instance of the ModelHatchPattern class
Top
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace