Grasshopper API
Value.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectSectionStyle.Value)
Equals(Object, IEqualityComparer)
Top
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace