Grasshopper API
ModelConstructionPlane Constructor
Overload List
Name | Description
ModelConstructionPlane()
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(ConstructionPlane)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(Guid)
 Create a new referenced view that references a RhinoView or NamedView object with the specified ref_guid.
ModelConstructionPlane(ModelConstructionPlane)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(Plane)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(RhinoView)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(RhinoViewport)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(Plane, String)
Initializes a new instance of the ModelConstructionPlane class
Top
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace