Grasshopper API
GH_Gradient Constructor
Overload List
Name | Description
GH_Gradient()
Initializes a new instance of the GH_Gradient class
GH_Gradient(GH_Gradient)
 Create a duplicate of another gradient.
GH_Gradient(IEnumerable<Double>, IEnumerable<Color>)
 Create a new gradient from grips and colours.
Top
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace