Grasshopper API
GH_NamedView.SetToViewport Method
Overload List
Name | Description
SetToViewport(GH_Canvas)
 Set the named view to the canvas viewport and redraw the canvas.
SetToViewport(GH_Viewport)
 Set the named view to a viewport.
SetToViewport(GH_Canvas, Int32)
 Animates a view transition.
Top
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace