Grasshopper API
GH_OutputParamManager.Register_IntervalParam Method
Overload List
Name | Description
Register_IntervalParam(String, String, String)
 Register a new Interval parameter
Register_IntervalParam(String, String, String, GH_ParamAccess)
 Register a new Interval parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace