Grasshopper API
GH_Interval Constructor
Overload List
Name | Description
GH_Interval()
 Default constructor
GH_Interval(GH_Interval)
 Create a duplicate from another interval.
GH_Interval(Interval)
 Create a duplicate of another interval
Top
See Also
Reference
GH_Interval Class
Grasshopper.Kernel.Types Namespace