Grasshopper API
GH_IReader.TryGetInterval1D Method
Overload List
Name | Description
TryGetInterval1D(String, GH_Interval1D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInterval1D(String, Int32, GH_Interval1D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace