Grasshopper API
GH_Chunk.Write Method
Overload List
Name | Description
Write(BinaryWriter)
 Write this chunk and all child chunks to a binary stream.
Write(XmlWriter)
 Serialize this chunk into an Xml stream.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace