Grasshopper API
Value.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingLinetype.Value)
Top
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace