Grasshopper API
ModelContentName.Equality Operator
Overload List
Name | Description
Equality(ModelContentName, ModelContentName)
Equality(ModelContentName, String)
Equality(String, ModelContentName)
Top
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace