Grasshopper API
ModelColor.FromArgb Method
Overload List
Name | Description
FromArgb(Int32)
FromArgb(Byte, Byte, Byte)
FromArgb(Byte, Byte, Byte, Byte)
Top
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace