Grasshopper API
ModelUserText.BitwiseOr Operator
Overload List
Name | Description
BitwiseOr(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
BitwiseOr(ModelUserText, IEnumerable<String>)
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace