Grasshopper API
GH_OutputParamManager.Register_BooleanParam Method
Overload List
Name | Description
Register_BooleanParam(String, String, String)
 Register a new Boolean primitive parameter
Register_BooleanParam(String, String, String, GH_ParamAccess)
 Register a new Boolean primitive parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace