Grasshopper API
GH_MemoryBitmap.Filter_Multiply Method
Overload List
Name | Description
Filter_Multiply(GH_BitmapChannel, Double)
 Multiply all values in a specific channel with a specific factor.
Filter_Multiply(GH_BitmapChannel, Double, Byte)
 Multiply all values in a specific channel with a specific factor, using a custom scaling center anchor.
Top
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace