Grasshopper API
GH_Document.AlignObjects Method
Overload List
Name | Description
AlignObjects(GH_Align, GH_Distribute)
 Perform alignment and distribution logic on all selected objects.
AlignObjects(GH_Align, GH_Distribute, List<IGH_DocumentObject>)
 Perform alignment and distribution logic on a set of objects.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace