Grasshopper API
GH_OutputParamManager.Register_PathParam Method
Overload List
Name | Description
Register_PathParam(String, String, String)
 Register a new Data Structure path parameter
Register_PathParam(String, String, String, GH_ParamAccess)
 Register a new Data Structure path parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace