Grasshopper API
ModelUserText.Subtraction Operator
Overload List
Name | Description
Subtraction(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
Subtraction(ModelUserText, IEnumerable<String>)
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace