Grasshopper API
GH_OutputParamManager.Register_DoubleParam Method
Overload List
Name | Description
Register_DoubleParam(String, String, String)
 Register a new Double primitive parameter
Register_DoubleParam(String, String, String, GH_ParamAccess)
 Register a new Double primitive parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace