Grasshopper API
Value Constructor
Overload List
Name | Description
ObjectDraftingLinetype.Value(ModelLinetype)
Initializes a new instance of the ObjectDraftingLinetype.Value class
ObjectDraftingLinetype.Value(ObjectLinetypeSource)
Initializes a new instance of the ObjectDraftingLinetype.Value class
ObjectDraftingLinetype.Value(ObjectLinetypeSource, ModelLinetype)
Initializes a new instance of the ObjectDraftingLinetype.Value class
Top
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace