Grasshopper API
ModelNamedConstructionPlane Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelNamedConstructionPlane.Attributes to ModelNamedConstructionPlane)
Implicit(ConstructionPlane to ModelNamedConstructionPlane)
Top
See Also
Reference
ModelNamedConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace