Grasshopper API
GH_IWriter.SetDrawingPoint Method
Overload List
Name | Description
SetDrawingPoint(String, Point)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingPoint(String, Int32, Point)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace