Grasshopper API
Param_OrdinateDimension.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_OrdinateDimension Class
Grasshopper.Kernel.Parameters Namespace