Grasshopper API
GH_Material Constructor
Overload List
Name | Description
GH_Material()
Initializes a new instance of the GH_Material class
GH_Material(Color)
 Create a new material based on a colour. The colour is used to control Diffuse, Emission and Transparency. Ambient, Specular and Shine are always default.
GH_Material(DisplayMaterial)
 Create a new Material.
GH_Material(GH_Material)
 Copy another GH_Material instance.
GH_Material(Guid)
 Create a new Material from an RDK material ID.
GH_Material(RenderMaterial)
 Create a new Material.
GH_Material(String)
 Create a new Material from an RDK xml string.
Top
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace