Grasshopper API
AnnotationLeaderSettings Constructor
Overload List
Name | Description
AnnotationLeaderSettings()
Initializes a new instance of the AnnotationLeaderSettings class
AnnotationLeaderSettings(AnnotationLeaderSettings.Attributes)
Initializes a new instance of the AnnotationLeaderSettings class
AnnotationLeaderSettings(DimensionStyle)
Initializes a new instance of the AnnotationLeaderSettings class
Top
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace