Grasshopper API
GH_OutputParamManager.Register_ColourParam Method
Overload List
Name | Description
Register_ColourParam(String, String, String)
 Register a new Colour primitive parameter
Register_ColourParam(String, String, String, GH_ParamAccess)
 Register a new Colour primitive parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace