Grasshopper API
GH_InputParamManager.AddColourParameter Method
Overload List
Name | Description
AddColourParameter(String, String, String, GH_ParamAccess)
 Add an ARGB Colour parameter to the input list of this component.
AddColourParameter(String, String, String, GH_ParamAccess, IEnumerable<Color>)
 Add an ARGB Colour parameter to the input list of this component.
AddColourParameter(String, String, String, GH_ParamAccess, Color)
 Add an ARGB Colour parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace