Grasshopper API
Value.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingLineWidth.Value)
Top
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace