Grasshopper API
ObjectRender.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace