Grasshopper API
GH_ComponentParamServer.InventUniqueNickname Method
Overload List
Name | Description
InventUniqueNickname(String, IEnumerable<IGH_Param>)
 Create a new, unique parameter nickname.
InventUniqueNickname(String, IEnumerable<String>)
 Create a new, unique parameter nickname.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace