Grasshopper API
GH_Grip Constructor
Overload List
Name | Description
GH_Grip()
Initializes a new instance of the GH_Grip class
GH_Grip(GH_Grip)
Initializes a new instance of the GH_Grip class
GH_Grip(Double, Color)
Initializes a new instance of the GH_Grip class
GH_Grip(Double, Color, Color)
Initializes a new instance of the GH_Grip class
Top
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace