Grasshopper API
AnnotationTextSettings Constructor
Overload List
Name | Description
AnnotationTextSettings()
Initializes a new instance of the AnnotationTextSettings class
AnnotationTextSettings(AnnotationTextSettings.Attributes)
Initializes a new instance of the AnnotationTextSettings class
AnnotationTextSettings(DimensionStyle)
Initializes a new instance of the AnnotationTextSettings class
Top
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace