Grasshopper API
GH_Boolean.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Boolean Class
Grasshopper.Kernel.Types Namespace