Grasshopper API
VersionNumber.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
 Compares the value of this instance to a specified VersionNumber value and returns an integer that indicates whether this instance is earlier than, the same as, or later than the specified VersionNumber value.
CompareTo(VersionNumber)
 Compares the value of this instance to a specified VersionNumber value and returns an integer that indicates whether this instance is earlier than, the same as, or later than the specified VersionNumber value.
Top
See Also
Reference
VersionNumber Structure
GH_IO Namespace