Grasshopper API
GH_ScriptVariant Constructor
Overload List
Name | Description
GH_ScriptVariant()
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Boolean)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Byte)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(DateTime)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Double)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Int32)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Plane)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Point3d)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(String)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Vector3d)
Initializes a new instance of the GH_ScriptVariant class
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace