Grasshopper API
ModelColor Implicit Conversion Operators
Overload List
Name | Description
Implicit(Color to ModelColor)
Implicit(ColorRGBA to ModelColor)
Implicit(ModelColor to Color)
Top
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace