Grasshopper API
Value.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
CompareTo(ObjectRenderMaterial.Value)
Top
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace