Grasshopper API
ModelSectionStyle Constructor
Overload List
Name | Description
ModelSectionStyle()
Initializes a new instance of the ModelSectionStyle class
ModelSectionStyle(ModelSectionStyle.Attributes)
Initializes a new instance of the ModelSectionStyle class
ModelSectionStyle(Guid)
Initializes a new instance of the ModelSectionStyle class
ModelSectionStyle(SectionStyle)
Initializes a new instance of the ModelSectionStyle class
Top
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace