Grasshopper API
GH_GDI_Util.FilletPolyline Method
Overload List
Name | Description
FilletPolyline(Point[], Int32)
 Fillet all the corners of a freeform outline.
FilletPolyline(PointF[], Single)
 Fillet all the corners of a freeform outline.
Top
See Also
Reference
GH_GDI_Util Class
Grasshopper.GUI Namespace