Grasshopper API
GH_CapsuleRenderEngine.CreateHighlightBar Method
Overload List
Name | Description
CreateHighlightBar(Rectangle, Int32, Int32)
 Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
CreateHighlightBar(Rectangle, Int32, Int32, Int32)
 Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
CreateHighlightBar(Rectangle, Int32, Int32, Boolean, Boolean)
 Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
CreateHighlightBar(Rectangle, Int32, Int32, Int32, Boolean, Boolean)
 Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
Top
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace