Grasshopper API
GH_List.Create Method
Overload List
Name | Description
Create(Boolean)
Create(Boolean, IEnumerable<IGH_Content>)
Top
See Also
Reference
GH_List Class
Grasshopper.Documentation Namespace