Grasshopper API
GH_SettingsServer.SetValue Method
Overload List
Name | Description
SetValue(String)
SetValue(String, Boolean)
SetValue(String, Byte)
SetValue(String, DateTime)
SetValue(String, Double)
SetValue(String, Color)
SetValue(String, Point)
SetValue(String, Rectangle)
SetValue(String, Size)
SetValue(String, Int32)
SetValue(String, String)
Top
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace