Grasshopper API
GH_Integer Constructor
Overload List
Name | Description
GH_Integer()
 Blank constructor
GH_Integer(GH_Integer)
Initializes a new instance of the GH_Integer class
GH_Integer(Int32)
Initializes a new instance of the GH_Integer class
Top
See Also
Reference
GH_Integer Class
Grasshopper.Kernel.Types Namespace