Grasshopper API
ModelRenderContent Constructor
Overload List
Name | Description
ModelRenderContent(ModelRenderContent.Attributes)
Initializes a new instance of the ModelRenderContent class
ModelRenderContent(ModelRenderContent.Attributes, Guid)
Initializes a new instance of the ModelRenderContent class
Top
See Also
Reference
ModelRenderContent Class
Grasshopper.Rhinoceros.Render Namespace