Grasshopper API
Attributes.Equals Method
Overload List
Name | Description
Equals(ObjectDrafting.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace