Grasshopper API
ModelUnitSystem.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace