Grasshopper API
ModelRenderMaterial.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
Top
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace