Grasshopper API
GH_LinearDimension.CastTo Method
Overload List
Name | Description
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
Top
See Also
Reference
GH_LinearDimension Class
Grasshopper.Kernel.Types Namespace