Grasshopper API
GH_UpgradeUtil.SwapComponents Method
Overload List
Name | Description
SwapComponents(IGH_Component, IGH_Component)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, Guid)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, IGH_Component, Boolean)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, Guid, Boolean)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
Top
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace