Grasshopper API
ObjectDisplayColor Constructor
Overload List
Name | Description
ObjectDisplayColor()
Initializes a new instance of the ObjectDisplayColor class
ObjectDisplayColor(ObjectDisplayColor.Value)
Initializes a new instance of the ObjectDisplayColor class
Top
See Also
Reference
ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace