Grasshopper API
GH_Capsule.CreateCapsule Method
Overload List
Name | Description
CreateCapsule(Rectangle, GH_Palette)
 Create a new blank capsule with default radius and highlight dimensions.
CreateCapsule(RectangleF, GH_Palette)
 Create a new blank capsule with default radius and highlight dimensions.
CreateCapsule(Rectangle, GH_Palette, Int32, Int32)
 Create a new blank capsule.
CreateCapsule(Rectangle, GH_Palette, Int32[], Int32)
 Create a new blank capsule.
CreateCapsule(RectangleF, GH_Palette, Int32, Int32)
 Create a new blank capsule.
CreateCapsule(RectangleF, GH_Palette, Int32[], Int32)
 Create a new blank capsule.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace