Grasshopper API
Attributes Constructor
Overload List
Name | Description
ModelRenderContent.Attributes()
Initializes a new instance of the ModelRenderContent.Attributes class
ModelRenderContent.Attributes(RenderContent)
Initializes a new instance of the ModelRenderContent.Attributes class
Top
See Also
Reference
ModelRenderContent.Attributes Class
Grasshopper.Rhinoceros.Render Namespace