Grasshopper API
GH_Gradient.AddGrip Method
Overload List
Name | Description
AddGrip(Double)
 Add a new grip to the gradient. The colour of the grip will be picked so that there is no difference to the gradient, though this is not actually possible when the interpolation mode is not linear.
AddGrip(GH_Grip)
 Add a new grip to the gradient. This method does not raise the GradientChanged event, so you need to do that yourself by calling OnGradientChanged().
AddGrip(Double, Color)
 Add a new single-colour grip.
AddGrip(Double, Color, Color)
 Add a new bi-colour grip.
Top
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace