Grasshopper API
GH_IReader.TryGetDrawingSize Method
Overload List
Name | Description
TryGetDrawingSize(String, Size)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingSize(String, Int32, Size)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace