Grasshopper API
IGH_Param.AddSource Method
Overload List
Name | Description
AddSource(IGH_Param)
 Append a new Source parameter to the end of the Sources list. Sources provide this parameter with data at runtime.
AddSource(IGH_Param, Int32)
 Insert a new Source parameter into the Sources list. Sources provide this parameter with data at runtime.
Top
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace