Grasshopper API
GH_Attributes<T>.RenderIncomingWires Method
Overload List
Name | Description
RenderIncomingWires(GH_Painter, IEnumerable<IGH_Param>, GH_ParamWireDisplay)
 Utility function for derived classes. This method draws all the wires going into the left side of the attributes.
RenderIncomingWires(GH_Painter, IEnumerable<IGH_Param>, IEnumerable<Pen>)
 Utility function for derived classes. This method draws all the wires going into the left side of the attributes.
Top
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace