Grasshopper API
GH_ExpressionSyntaxWriter.RewriteForGraphicInterface Method
Overload List
Name | Description
RewriteForGraphicInterface(GH_CodeString)
 Rewrite the expression so that tags are replaced by the complex characters that make up the esoteric operators, functions and constants. The expression should become more readable for humans.
RewriteForGraphicInterface(String)
 Rewrite the expression so that tags are replaced by the complex characters that make up the esoteric operators, functions and constants. The expression should become more readable
Top
See Also
Reference
GH_ExpressionSyntaxWriter Class
Grasshopper.Kernel.Expressions Namespace