Grasshopper API
GH_Goo<T> Constructor
Overload List
Name | Description
GH_Goo<T>()
 Blank constructor, m_value will be set to default (null for reference types, zeroes for value types)
GH_Goo<T>(T)
 Data constructor, m_value will be set to internal_data.
GH_Goo<T>(GH_Goo<T>)
 Copy constructor, copies the data from another GH_Goo(Of T) instance. Reference types will not be duplicated.
Top
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace