Grasshopper API
GH_ComponentParamServer.UnregisterInputParameter Method
Overload List
Name | Description
UnregisterInputParameter(IGH_Param)
 Removes the specified parameter from this component.
UnregisterInputParameter(IGH_Param, Boolean)
 Removes the specified parameter from this component.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace