Grasshopper API
GH_OutputParamManager.Register_MeshFaceParam Method
Overload List
Name | Description
Register_MeshFaceParam(String, String, String)
 Register a new 3D Mesh face parameter
Register_MeshFaceParam(String, String, String, GH_ParamAccess)
 Register a new 3D Mesh face parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace