Grasshopper API
GH_IReader.TryGetInt64 Method
Overload List
Name | Description
TryGetInt64(String, Int64)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInt64(String, Int32, Int64)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace