Grasshopper API
ModelAnnotationStyle Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelAnnotationStyle.Attributes to ModelAnnotationStyle)
Implicit(DimensionStyle to ModelAnnotationStyle)
Implicit(String to ModelAnnotationStyle)
Top
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace