Grasshopper API
GH_FileSystemEventServer.RemoveWatcher Method
Overload List
Name | Description
RemoveWatcher(Object)
 Remove all watchers that are linked to a specific object.
RemoveWatcher(Object, String)
 Remove all watchers that are linked to a specific object and a specific file path.
Top
See Also
Reference
GH_FileSystemEventServer Class
Grasshopper.Kernel Namespace