Grasshopper API
GH_Chunk.TryGetPoint4D Method
Overload List
Name | Description
TryGetPoint4D(String, GH_Point4D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint4D(String, Int32, GH_Point4D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace