Grasshopper API
Param_InstanceReference.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_InstanceReference Class
Grasshopper.Kernel.Parameters Namespace