Grasshopper API
GH_GraphicsUtil.RenderCenteredIcon Method
Overload List
Name | Description
RenderCenteredIcon(Graphics, RectangleF, Image) |  Obsolete.
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
RenderCenteredIcon(Graphics, RectangleF, Image, Double)
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
RenderCenteredIcon(Graphics, RectangleF, Image, Single) |  Obsolete.
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace