Grasshopper API
Value Constructor
Overload List
Name | Description
ObjectRenderMaterial.Value(ModelRenderMaterial)
Initializes a new instance of the ObjectRenderMaterial.Value class
ObjectRenderMaterial.Value(ObjectMaterialSource)
Initializes a new instance of the ObjectRenderMaterial.Value class
ObjectRenderMaterial.Value(ObjectMaterialSource, ModelRenderMaterial)
Initializes a new instance of the ObjectRenderMaterial.Value class
Top
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace