Grasshopper API
GH_Chunk.SetString Method
Overload List
Name | Description
SetString(String, String)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetString(String, Int32, String)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace