Grasshopper API
GH_Document.FindAllDownstreamObjects Method
Overload List
Name | Description
FindAllDownstreamObjects(IGH_ActiveObject)
 Find all objects that depend in some way on the Source.
FindAllDownstreamObjects(List<IGH_ActiveObject>)
 Find all objects that depend in some way on the Source collection
FindAllDownstreamObjects(IGH_ActiveObject, GH_Document.GH_ActiveObjectFilter)
 Find all objects that depend in some way on the Source.
FindAllDownstreamObjects(List<IGH_ActiveObject>, GH_Document.GH_ActiveObjectFilter)
 Find all objects that depend in some way on the Source collection
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace