Grasshopper API
DisplayColorStop Constructor
Overload List
Name | Description
DisplayColorStop()
 Blank constructor
DisplayColorStop(ColorStop)
Initializes a new instance of the DisplayColorStop class
DisplayColorStop(DisplayColorStop)
Initializes a new instance of the DisplayColorStop class
Top
See Also
Reference
DisplayColorStop Class
Grasshopper.Rhinoceros.Display Namespace