Grasshopper API
GH_Chunk.GetPlane Method
Overload List
Name | Description
GetPlane(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPlane(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace