Grasshopper API
GH_Boolean Constructor
Overload List
Name | Description
GH_Boolean()
 Blank constructor
GH_Boolean(Boolean)
Initializes a new instance of the GH_Boolean class
GH_Boolean(GH_Boolean)
Initializes a new instance of the GH_Boolean class
Top
See Also
Reference
GH_Boolean Class
Grasshopper.Kernel.Types Namespace