Grasshopper API
GH_ComponentParamServer.IndexOfOutputParam Method
Overload List
Name | Description
IndexOfOutputParam(Guid)
 Finds the index of the output parameter that matches the specified search mask.
IndexOfOutputParam(String)
 Finds the index of the output parameter that matches the specified search mask.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace