Grasshopper API
DataTree<T>.Branch Method
Overload List
Name | Description
Branch(GH_Path)
 Gets the list of data which belongs to a given Branch path.
Branch(Int32)
 Gets the list of data which belongs to the branch path at the given index.
Branch(Int32[])
 Gets the list of data which belongs to a given Branch path.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace