Grasshopper API
GH_InstanceDescription.NewInstanceGuid Method
Overload List
Name | Description
NewInstanceGuid()
 Generate a new random instance GUID
NewInstanceGuid(Guid)
 Set the instance ID to be a specific GUID. This is very dangerous, only use this function if you're 6"4' and your first name is David.
Top
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace