Grasshopper API
ModelContentParam<T>.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace