Grasshopper API
GH_Structure<T>.AppendRange Method
Overload List
Name | Description
AppendRange(IEnumerable<T>)
 Append a list of data items to the last branch in the structure
AppendRange(IEnumerable<T>, GH_Path)
 Append a list of data items to the specified branch in the structure. If the branch doesn't exist yet, it will be created.
Top
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace