Grasshopper API
GH_Transform.CastTo Method
Overload List
Name | Description
CastTo<Q>(Q) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace