Grasshopper API
ModelData.Read Method
Overload List
Name | Description
Read(GH_IReader)
Read(GH_IReader, String, IReadOnlyList<Point2d>)
Read(GH_IReader, String, IReadOnlyList<Point3d>)
Read(GH_IReader, String, IReadOnlyList<Byte>)
Read(GH_IReader, String, IReadOnlyList<Double>)
Read(GH_IReader, String, IReadOnlyList<String>)
Read(GH_IReader, String, Nullable<Plane>)
Read(GH_IReader, String, Nullable<Point2d>)
Read(GH_IReader, String, Nullable<Point3d>)
Read(GH_IReader, String, Nullable<Transform>)
Read(GH_IReader, String, Nullable<Vector2d>)
Read(GH_IReader, String, Nullable<Vector3d>)
Read(GH_IReader, String, Nullable<Boolean>)
Read(GH_IReader, String, Nullable<Byte>)
Read(GH_IReader, String, Nullable<Char>)
Read(GH_IReader, String, Nullable<DateTime>)
Read(GH_IReader, String, Nullable<Double>)
Read(GH_IReader, String, Nullable<Color>)
Read(GH_IReader, String, Nullable<Guid>)
Read(GH_IReader, String, Nullable<Int32>)
Read(GH_IReader, String, Nullable<Int64>)
Read(GH_IReader, String, Nullable<Single>)
Read(GH_IReader, String, String)
Read<T>(GH_IReader, String, T)
Read<T>(GH_IReader, String, IReadOnlyList<T>)
Read<TEnum>(GH_IReader, String, Nullable<TEnum>)
Top
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace