Grasshopper API
ModelAnnotationStyle Constructor
Overload List
Name | Description
ModelAnnotationStyle()
Initializes a new instance of the ModelAnnotationStyle class
ModelAnnotationStyle(ModelAnnotationStyle.Attributes)
Initializes a new instance of the ModelAnnotationStyle class
ModelAnnotationStyle(DimensionStyle)
Initializes a new instance of the ModelAnnotationStyle class
ModelAnnotationStyle(Guid)
Initializes a new instance of the ModelAnnotationStyle class
Top
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace