Grasshopper API
GH_Document.FindClusters Method
Overload List
Name | Description
FindClusters(Guid)
 Find all the clusters that have a matching ID.
FindClusters(String)
 Find all the clusters that have a matching filepath.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace