Grasshopper API
GH_CapsuleRenderEngine.GetImpliedStyle Method
Overload List
Name | Description
GetImpliedStyle(GH_Palette, IGH_Attributes)
 Static (Shared in VB) method for solving which palette style is implied by the properties.
GetImpliedStyle(GH_Palette, Boolean, Boolean, Boolean)
 Static (Shared in VB) method for solving which palette style is implied by the properties.
Top
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace