Grasshopper API
GH_InputParamManager.AddIntegerParameter Method
Overload List
Name | Description
AddIntegerParameter(String, String, String, GH_ParamAccess)
 Add a Integer parameter to the input list of this component.
AddIntegerParameter(String, String, String, GH_ParamAccess, IEnumerable<Int32>)
 Add a Integer parameter to the input list of this component.
AddIntegerParameter(String, String, String, GH_ParamAccess, Int32)
 Add a Integer parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace