Grasshopper API
GH_Arc.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Arc Class
Grasshopper.Kernel.Types Namespace