Grasshopper API
ModelColor.Inequality Operator
Overload List
Name | Description
Inequality(Color, ModelColor)
Inequality(ModelColor, ModelColor)
Inequality(ModelColor, Color)
Top
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace