Grasshopper API
GH_Chunk.FindItem Method
Overload List
Name | Description
FindItem(String)
 Finds the first item that matches the given name. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
FindItem(String, Int32)
 Finds the first item that matches the given name and index. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace