Grasshopper API
Value Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelLinetype to ObjectDraftingLinetype.Value)
Implicit(ObjectLinetypeSource to ObjectDraftingLinetype.Value)
Implicit(ObjectDraftingLinetype.Value to ModelLinetype)
Implicit(ObjectDraftingLinetype.Value to ObjectLinetypeSource)
Top
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace