Grasshopper API
Param_ModelView.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace