Grasshopper API
GH_Leader Constructor
Overload List
Name | Description
GH_Leader()
 Default constructor, creates an invalid leader.
GH_Leader(GH_Leader)
 Create a duplicate of another GH_Leader. This constructor also copies reference data.
GH_Leader(Guid)
 Create a new referenced leader that references a Rhino leader with the specified ID.
GH_Leader(Leader)
 Create a duplicate of an existing leader.
GH_Leader(Leader, ModelAnnotationStyle)
 Create a duplicate of an existing annotation.
Top
See Also
Reference
GH_Leader Class
Grasshopper.Kernel.Types Namespace