Grasshopper API
SliderSnapRange Constructor
Overload List
Name | Description
SliderSnapRange(Decimal)
Initializes a new instance of the SliderSnapRange class
SliderSnapRange(Decimal, Decimal)
Initializes a new instance of the SliderSnapRange class
Top
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace