Grasshopper API
GH_DocumentObject.Menu_MoveItem Method
Overload List
Name | Description
Menu_MoveItem(ToolStripItem, String[])
 Utility function for moving menu items.
Menu_MoveItem(ToolStripItem, Boolean, String[])
 Utility function for moving menu items.
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace