Grasshopper API
GH_FontServer.StringWidth Method
Overload List
Name | Description
StringWidth(IEnumerable<String>, Font)
 Measure the maximum width of a collection of strings
StringWidth(String, Font)
 Measure the width of a string in pixels
Top
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace