Grasshopper API
GH_TextEntity Constructor
Overload List
Name | Description
GH_TextEntity()
 Default constructor, creates an invalid text entity.
GH_TextEntity(GH_TextEntity)
 Create a duplicate of another GH_TextEntity. This constructor also copies reference data.
GH_TextEntity(Guid)
 Create a new referenced text entity that references a Rhino text object with the specified ID.
GH_TextEntity(TextEntity)
 Create a duplicate of an existing text entity.
GH_TextEntity(TextEntity, ModelAnnotationStyle)
 Create a duplicate of an existing text entity.
Top
See Also
Reference
GH_TextEntity Class
Grasshopper.Kernel.Types Namespace