Grasshopper API
ObjectDisplay Constructor
Overload List
Name | Description
ObjectDisplay()
Initializes a new instance of the ObjectDisplay class
ObjectDisplay(ObjectDisplay.Attributes)
Initializes a new instance of the ObjectDisplay class
Top
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace