Grasshopper API
GH_Chunk.SetLine Method
Overload List
Name | Description
SetLine(String, GH_Line)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetLine(String, Int32, GH_Line)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace