Grasshopper API
ModelSectionStyle Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelSectionStyle.Attributes to ModelSectionStyle)
Implicit(SectionStyle to ModelSectionStyle)
Implicit(String to ModelSectionStyle)
Top
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace