Grasshopper API
GH_Document.FindAttribute Method
Overload List
Name | Description
FindAttribute(Guid)
 Find the object that matches the ID
FindAttribute(PointF, Boolean)
 Search for attributes that contain a certain point.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace