Grasshopper API
GH_OutputParamManager.Register_GroupParam Method
Overload List
Name | Description
Register_GroupParam(String, String, String)
 Register a new geometric group parameter
Register_GroupParam(String, String, String, GH_ParamAccess)
 Register a new geometric group parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace