Grasshopper API
GH_Chunk.SetInt64 Method
Overload List
Name | Description
SetInt64(String, Int64)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInt64(String, Int32, Int64)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace