Grasshopper API
GH_ActiveObject Constructor
Overload List
Name | Description
GH_ActiveObject(IGH_InstanceDescription)
Initializes a new instance of the GH_ActiveObject class
GH_ActiveObject(String, String, String, String, String)
Initializes a new instance of the GH_ActiveObject class
Top
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace