Grasshopper API
GH_Param<T>.AddVolatileDataList Method
Overload List
Name | Description
AddVolatileDataList(GH_Path, List<T>)
AddVolatileDataList(GH_Path, IEnumerable)
Top
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace