Grasshopper API
ObjectRender Constructor
Overload List
Name | Description
ObjectRender()
Initializes a new instance of the ObjectRender class
ObjectRender(ObjectRender.Attributes)
Initializes a new instance of the ObjectRender class
Top
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace