Grasshopper API
ModelHatchLine Constructor
Overload List
Name | Description
ModelHatchLine()
Initializes a new instance of the ModelHatchLine class
ModelHatchLine(ModelHatchLine.Attributes)
Initializes a new instance of the ModelHatchLine class
ModelHatchLine(HatchLine)
Initializes a new instance of the ModelHatchLine class
Top
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace