Grasshopper API
Value Implicit Conversion Operators
Overload List
Name | Description
Implicit(Double to ObjectDraftingLineWidth.Value)
Implicit(ObjectPlotWeightSource to ObjectDraftingLineWidth.Value)
Implicit(ObjectDraftingLineWidth.Value to ObjectPlotWeightSource)
Implicit(ObjectDraftingLineWidth.Value to Double)
Top
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace