Grasshopper API
GH_ComponentParamServer.UnregisterParameter Method
Overload List
Name | Description
UnregisterParameter(IGH_Param)
 Removes the specified parameter from this component.
UnregisterParameter(IGH_Param, Boolean)
 Removes the specified parameter from this component.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace