Grasshopper API
Value.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingColor.Value)
Top
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace