Grasshopper API
GH_StateServer.RestoreState Method
Overload List
Name | Description
RestoreState(Int32, Int32, Int32)
 Restore a certain state.
RestoreState(String, Int32, Int32)
 Restore a certain state.
RestoreState(Int32, Boolean, Int32, Int32)
 Restore a certain state.
Top
See Also
Reference
GH_StateServer Class
Grasshopper.Kernel Namespace