Grasshopper API
GH_FontServer.MeasureString Method
Overload List
Name | Description
MeasureString(String, Font)
 Measure the size of a string
MeasureString(String, Font, SizeF)
 Measure the size of a string
MeasureString(String, Font, Single)
 Measure the size of a string
Top
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace