Grasshopper API
GH_Chunk.ItemExists Method
Overload List
Name | Description
ItemExists(String)
 Gets the occupancy for a specific item name. Only items without index qualifiers are considered.
ItemExists(String, Int32)
 Checks whether an item with the specified name and index exists. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace