Grasshopper API
Param_Hatch.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_Hatch Class
Grasshopper.Kernel.Parameters Namespace