Grasshopper API
GH_GraphicsUtil.RenderFadedImage Method
Overload List
Name | Description
RenderFadedImage(Graphics, Image, Rectangle, Double)
 Render an icon into a rectangle with a specific fading factor.
RenderFadedImage(Graphics, Image, Rectangle, Int32)
 Render an icon into a rectangle with a specific fading factor.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace