Grasshopper API
ModelObject.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
Top
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace