Grasshopper API
ID Constructor
Overload List
Name | Description
ID(String)
 Constuctor for IDs.
ID(String, Int32)
 Constructor for IDs.
Top
See Also
Reference
ID Structure
GH_IO.Serialization Namespace