Grasshopper API
GH_Vector Constructor
Overload List
Name | Description
GH_Vector()
 Default constructor. Creates a zero-length vector.
GH_Vector(GH_Vector)
 Create a duplicate of another vector
GH_Vector(Vector3d)
 Create a vector from x, y and z components.
Top
See Also
Reference
GH_Vector Class
Grasshopper.Kernel.Types Namespace