Grasshopper API
ModelInstanceDefinition.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
Top
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace