Grasshopper API
GH_LinearDimension Constructor
Overload List
Name | Description
GH_LinearDimension()
 Default constructor, creates an invalid linear dimension.
GH_LinearDimension(GH_LinearDimension)
 Create a duplicate of another GH_LinearDimension. This constructor also copies reference data.
GH_LinearDimension(Guid)
 Create a new referenced linear dimension that references a Rhino dimension with the specified ID.
GH_LinearDimension(LinearDimension)
 Create a duplicate of an existing linear dimension.
GH_LinearDimension(LinearDimension, ModelAnnotationStyle)
 Create a duplicate of an existing linear dimension.
Top
See Also
Reference
GH_LinearDimension Class
Grasshopper.Kernel.Types Namespace