Grasshopper API
GH_DocDiagramPainter.PaintDiagram Method
Overload List
Name | Description
PaintDiagram(IEnumerable<IGH_DocumentObject>, Int32, Int32)
 Paint a diagram of a document.
PaintDiagram(IEnumerable<IGH_DocumentObject>, Int32, Int32, Int32)
 Paint a diagram of a document.
Top
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace