Grasshopper API
GH_NamedView Constructor
Overload List
Name | Description
GH_NamedView()
 Create a default named view.
GH_NamedView(Rectangle, RectangleF)
 Create a new view useful for box-fit transitions.
GH_NamedView(GH_Viewport, Point, PointF)
 Create a new view useful for point match transitions.
GH_NamedView(GH_Viewport, Rectangle, PointF)
 Create a new view useful for point inclusion transitions.
GH_NamedView(String, PointF, Single, GH_NamedViewType)
 Create a new named view.
Top
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace