Grasshopper API
GH_SettingsServer Constructor
Overload List
Name | Description
GH_SettingsServer(String)
 Create a new instance of the GH_SettingsServer class. The server will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory. If a file with the same name already exists, its settings will be automatically loaded.
GH_SettingsServer(String, Boolean)
 Create a new instance of the GH_SettingsServer class. The server will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory.
Top
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace