Grasshopper API
Node3d<T>.NearestItem Method
Overload List
Name | Description
NearestItem(T)
 Find the nearest item.
NearestItem(Point3d)
 Find the nearest item.
NearestItem(Double, Double, Double)
 Find the nearest item.
NearestItem(T, Double, Double)
 Find the nearest item.
NearestItem(Point3d, Double, Double)
 Find the nearest item.
NearestItem(Double, Double, Double, Validation3d<T>)
 Find the nearest item using custom validation criteria.
NearestItem(Double, Double, Double, Double, Double)
 Find the nearest item.
Top
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace