Grasshopper API
GH_Canvas.ShowComponentSearchBox Method
Overload List
Name | Description
ShowComponentSearchBox()
 Display the component Search dialog at the current mouse location. The dialog cannot be shown if ModifiersEnabled=False.
ShowComponentSearchBox(Point)
 Display the component Search dialog at the given coordinate. The dialog cannot be shown if ModifiersEnabled=False.
Top
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace