Grasshopper API
GH_GeometricGooWrapper.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
LoadGeometry(RhinoDoc)
Top
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace