Grasshopper API
GH_Chunk.TryGetDouble Method
Overload List
Name | Description
TryGetDouble(String, Double)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDouble(String, Int32, Double)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace