Grasshopper API
GH_ComponentParamServer.IndexOfInputParam Method
Overload List
Name | Description
IndexOfInputParam(Guid)
 Finds the index of the input parameter that matches the specified search mask.
IndexOfInputParam(String)
 Finds the index of the input parameter that matches the specified search mask.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace