Grasshopper API
GH_IWriter.SetGuid Method
Overload List
Name | Description
SetGuid(String, Guid)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetGuid(String, Int32, Guid)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace