Grasshopper API
GH_IWriter.SetDrawingColor Method
Overload List
Name | Description
SetDrawingColor(String, Color)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingColor(String, Int32, Color)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace