Grasshopper API
GH_InstanceReference.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the instance reference is referenced and not yet loaded, attempts to load the instance reference.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace