Grasshopper API
GH_Point.ReferenceParam Method
Overload List
Name | Description
ReferenceParam(Int32)
 Retrieve the indexed param of the point reference data.
ReferenceParam(Int32, Double)
 Sets the index of the point reference data.
Top
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace