Grasshopper API
GH_ComponentServer.RemoveCachedObject Method
Overload List
Name | Description
RemoveCachedObject(Guid)
 Remove a cache entry from the object cache. This cannot be undone.
RemoveCachedObject(String)
 Remove the user object (if any) that loads itself from a specified *.ghuser file.
Top
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace