Grasshopper API
GH_Convert.GetTimeKind Method
Overload List
Name | Description
GetTimeKind(DateTime)
 Gets the kind of time implied by a System.DateTime value.
GetTimeKind(DateTime, DateTime)
 Gets the kind of time implied by two System.DateTime values.
Top
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace