Grasshopper API
ModelColor.Equals Method
Overload List
Name | Description
Equals(ModelColor)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
ModelColor Structure
Grasshopper.Rhinoceros Namespace