Grasshopper API
GH_IReader.GetVersion Method
Overload List
Name | Description
GetVersion(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetVersion(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace