Grasshopper API
ModelData.Equals Method
Overload List
Name | Description
Equals(ModelData)
Equals(Object) |  (Overrides Object.Equals(Object).)
Top
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace