Grasshopper API
Generic Constructor
Overload List
Name | Description
Generic()
Initializes a new instance of the Generic class
Generic(Transform)
Initializes a new instance of the Generic class
Top
See Also
Reference
Generic Class
Grasshopper.Kernel.Types.Transforms Namespace