Grasshopper API
Param_ClippingPlane.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_ClippingPlane Class
Grasshopper.Kernel.Parameters Namespace