Grasshopper API
GH_IReader.TryGetPlane Method
Overload List
Name | Description
TryGetPlane(String, GH_Plane)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPlane(String, Int32, GH_Plane)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace