Grasshopper API
GH_Interval2D.CastTo Method
Overload List
Name | Description
CastTo<T>(T)
 Local to Remote caster function. this stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Interval2D Class
Grasshopper.Kernel.Types Namespace