Grasshopper API
GH_AnnotationBase Constructor
Overload List
Name | Description
GH_AnnotationBase()
 Default constructor, creates an invalid annotation.
GH_AnnotationBase(AnnotationBase)
 Create a duplicate of an existing annotation.
GH_AnnotationBase(GH_AnnotationBase)
 Create a duplicate of another GH_AnnotationBase. This constructor also copies reference data.
GH_AnnotationBase(Guid)
 Create a new referenced annotation that references a Rhino dimension with the specified ID.
GH_AnnotationBase(ObjRef)
Initializes a new instance of the GH_AnnotationBase class
GH_AnnotationBase(AnnotationBase, ModelAnnotationStyle)
 Create a duplicate of an existing annotation.
Top
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace