Grasshopper API
Complex Constructor
Overload List
Name | Description
Complex(Double)
Initializes a new instance of the Complex class
Complex(Double, Double)
Initializes a new instance of the Complex class
Top
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace