Grasshopper API
Tracing.Assert Method
Overload List
Name | Description
Assert(Guid)
 Display a typical ASSERT dialog with stack information.
Assert(Guid, Exception)
 Display a typical assert dialog with stack information.
Assert(Guid, String)
 Display a typical assert dialog with stack information.
Assert(Guid, String, Exception)
 Display a typical assert dialog with stack information.
Top
See Also
Reference
Tracing Class
Grasshopper Namespace