Grasshopper API
GH_Chunk Constructor
Overload List
Name | Description
GH_Chunk()
 Blank constructor. You typically do not need to create your own Chunks. The GH_Archive class will create top-level chunks and existing chunks can create child chunks.
GH_Chunk(GH_Archive)
 Constructor. You typically do not need to create your own Chunks. The GH_Archive class will create top-level chunks and existing chunks can create child chunks.
GH_Chunk(GH_Archive, String)
 Constructor. You typically do not need to create your own Chunks. The GH_Archive class will create top-level chunks and existing chunks can create child chunks.
GH_Chunk(GH_Archive, String, Int32)
 Constructor. You typically do not need to create your own Chunks. The GH_Archive class will create top-level chunks and existing chunks can create child chunks.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace