Grasshopper API
ModelLayer Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelLayer.Attributes to ModelLayer)
Implicit(Layer to ModelLayer)
Implicit(String to ModelLayer)
Top
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace