Grasshopper API
ModelSpaceViewport Constructor
Overload List
Name | Description
ModelSpaceViewport(ModelSpaceViewport.Attributes)
Initializes a new instance of the ModelSpaceViewport class
ModelSpaceViewport(ModelSpaceViewport.Attributes, Guid)
Initializes a new instance of the ModelSpaceViewport class
Top
See Also
Reference
ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display Namespace