Grasshopper API
GH_ComponentServer.FindObjects Method
Overload List
Name | Description
FindObjects(Guid)
 Find all the objects that are part of a certain library.
FindObjects(String[], Int32, IGH_ObjectProxy[], Double[])
 Searches the list of cached object proxies for objects that might be implied by a search term.
Top
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace