Grasshopper API
Utility.InvokeMethodSafe Method
Overload List
Name | Description
InvokeMethodSafe(Object, String)
 Call a method via its name. No exceptions are thrown.
InvokeMethodSafe(Object, String, Object[])
 Call a method via its name. No exceptions are thrown.
Top
See Also
Reference
Utility Class
Grasshopper Namespace