Grasshopper API
GH_SamplingSphere.SampleSphere Method
Overload List
Name | Description
SampleSphere(Sphere)
 Sample the UV locations of a sphere. The sphere should be centered on the world origin.
SampleSphere(Sphere, GH_MemoryBitmap)
 Sample a sphere with a UV texture and return a bitmap of sampled values.
Top
See Also
Reference
GH_SamplingSphere Class
Grasshopper.GUI Namespace