Grasshopper API
ModelLinetype Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelLinetype.Attributes to ModelLinetype)
Implicit(Linetype to ModelLinetype)
Implicit(String to ModelLinetype)
Top
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace