Grasshopper API
GH_UserObject Constructor
Overload List
Name | Description
GH_UserObject()
 Empty constructor
GH_UserObject(String)
 Create a new user object from an existing *.ghuser file.
Top
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace