Grasshopper API
GH_Chunk.TryGetLine Method
Overload List
Name | Description
TryGetLine(String, GH_Line)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetLine(String, Int32, GH_Line)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace