Grasshopper API
GH_Path.IsCoincident Method
Overload List
Name | Description
IsCoincident(GH_Path)
 Test to see if this path is coincident with another path.
IsCoincident(Int32[])
 Test to see if this path is coincident with set of integers.
Top
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace