Grasshopper API
GH_OutputParamManager.Register_StringParam Method
Overload List
Name | Description
Register_StringParam(String, String, String)
 Register a new String primitive parameter
Register_StringParam(String, String, String, GH_ParamAccess)
 Register a new String primitive parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace