Grasshopper API
GH_Centermark Constructor
Overload List
Name | Description
GH_Centermark()
 Default constructor, creates an invalid centermark.
GH_Centermark(Centermark)
 Create a duplicate of an existing centermark.
GH_Centermark(GH_Centermark)
 Create a duplicate of another GH_Centermark. This constructor also copies reference data.
GH_Centermark(Guid)
 Create a new referenced centermark that references a Rhino centermark with the specified ID.
GH_Centermark(Centermark, ModelAnnotationStyle)
 Create a duplicate of an existing centermark.
Top
See Also
Reference
GH_Centermark Class
Grasshopper.Kernel.Types Namespace