Grasshopper API
ModelPageViewport Constructor
Overload List
Name | Description
ModelPageViewport()
Initializes a new instance of the ModelPageViewport class
ModelPageViewport(ModelPageViewport.Attributes)
Initializes a new instance of the ModelPageViewport class
ModelPageViewport(Guid)
Initializes a new instance of the ModelPageViewport class
ModelPageViewport(RhinoViewport)
Initializes a new instance of the ModelPageViewport class
Top
See Also
Reference
ModelPageViewport Class
Grasshopper.Rhinoceros.Display Namespace