Grasshopper API
Value.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingLineWidth.Value)
Top
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace