Grasshopper API
GH_IReader.TryGetSingle Method
Overload List
Name | Description
TryGetSingle(String, Single)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetSingle(String, Int32, Single)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace