Grasshopper API
GH_ComplexNumber Constructor
Overload List
Name | Description
GH_ComplexNumber()
 Blank constructor
GH_ComplexNumber(Complex)
Initializes a new instance of the GH_ComplexNumber class
GH_ComplexNumber(GH_ComplexNumber)
Initializes a new instance of the GH_ComplexNumber class
Top
See Also
Reference
GH_ComplexNumber Class
Grasshopper.Kernel.Types Namespace