Grasshopper API
GH_ImageSettings Constructor
Overload List
Name | Description
GH_Canvas.GH_ImageSettings()
 Create a new instance of the GH_ImageSettings class with default values.
GH_Canvas.GH_ImageSettings(String)
 Create a new instance of the GH_ImageSettings class.
GH_Canvas.GH_ImageSettings(String, String, String)
 Create a new instance of the GH_ImageSettings class.
Top
See Also
Reference
GH_Canvas.GH_ImageSettings Class
Grasshopper.GUI.Canvas Namespace