Grasshopper API
GH_DocumentObject.Menu_AppendTextItem Method
Overload List
Name | Description
Menu_AppendTextItem(ToolStripDropDown, String, GH_MenuTextBox.KeyDownEventHandler, GH_MenuTextBox.TextChangedEventHandler, Boolean)
 Utility function for inserting text boxes into menus.
Menu_AppendTextItem(ToolStripDropDown, String, GH_MenuTextBox.KeyDownEventHandler, GH_MenuTextBox.TextChangedEventHandler, Boolean, Int32, Boolean)
 Utility function for inserting text boxes into menus.
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace