Grasshopper API
GH_Chunk.TryGetDrawingPointF Method
Overload List
Name | Description
TryGetDrawingPointF(String, PointF)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingPointF(String, Int32, PointF)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace