Grasshopper API
GH_Document.FindComponent Method
Overload List
Name | Description
FindComponent(Guid)
 Search for components using an ID filter
FindComponent(Point)
 Search for components that contain the locus
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace