Grasshopper API
GH_Document.RelevantObjectAtPoint Method
Overload List
Name | Description
RelevantObjectAtPoint(PointF)
 Find the most relevant object at a given canvas location. The most relevant object might be a regular Object (Component or Parameter), it might be an attribute grip, an attribute balloon, a wire or a group.
RelevantObjectAtPoint(PointF, GH_RelevantObjectFilter)
 Find the most relevant object at a given canvas location. The most relevant object might be a regular Object (Component or Parameter), it might be an attribute grip, an attribute balloon, a wire or a group.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace