Grasshopper API
GH_Chunk.GetPath Method
Overload List
Name | Description
GetPath(String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetPath(String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace