Grasshopper API
ModelComponentContent Constructor
Overload List
Name | Description
ModelComponentContent(ModelComponentContent.Attributes)
Initializes a new instance of the ModelComponentContent class
ModelComponentContent(ModelComponentContent.Attributes, Guid)
Initializes a new instance of the ModelComponentContent class
Top
See Also
Reference
ModelComponentContent Class
Grasshopper.Rhinoceros Namespace