Grasshopper API
GH_IReader.TryGetInterval2D Method
Overload List
Name | Description
TryGetInterval2D(String, GH_Interval2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetInterval2D(String, Int32, GH_Interval2D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace