Grasshopper API
GH_MeshFace Constructor
Overload List
Name | Description
GH_MeshFace()
 Default constructor. Sets all corners to 0.
GH_MeshFace(GH_MeshFace)
 Create a duplicate of another mesh face
GH_MeshFace(MeshFace)
 Create a duplicate of another mesh face.
GH_MeshFace(Int32, Int32, Int32)
 Create a triangular mesh face from 3 corners indices.
GH_MeshFace(Int32, Int32, Int32, Int32)
 Create a quadrangular mesh face from 4 corners indices.
Top
See Also
Reference
GH_MeshFace Class
Grasshopper.Kernel.Types Namespace