Grasshopper API
GH_Line Constructor
Overload List
Name | Description
GH_Line(GH_Point3D, GH_Point3D)
 Constructor.
GH_Line(Double, Double, Double, Double, Double, Double)
 Constructor.
Top
See Also
Reference
GH_Line Structure
GH_IO.Types Namespace