Grasshopper API
GH_OutputParamManager.Register_GenericParam Method
Overload List
Name | Description
Register_GenericParam(String, String, String)
 Register a new Generic (Object) parameter
Register_GenericParam(String, String, String, GH_ParamAccess)
 Register a new Generic (Object) parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace