Grasshopper API
GH_MouseTracker.Deviation Method
Overload List
Name | Description
Deviation()
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history record.
Deviation(DateTime, DateTime)
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history span. It does not measure the largest deviation between any two points in the time span, only the first and any subsequent point.
Top
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace