Grasshopper API
GH_PersistentParam<T> Constructor
Overload List
Name | Description
GH_PersistentParam<T>(GH_InstanceDescription)
Initializes a new instance of the GH_PersistentParam<T> class
GH_PersistentParam<T>(GH_InstanceDescription, Boolean) |  Obsolete.
Initializes a new instance of the GH_PersistentParam<T> class
GH_PersistentParam<T>(String, String, String, String, String)
Initializes a new instance of the GH_PersistentParam<T> class
Top
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace