Grasshopper API
GH_Circle Constructor
Overload List
Name | Description
GH_Circle()
 Default constructor
GH_Circle(Circle)
 Create a duplicate of another circle
GH_Circle(GH_Circle)
 Create a duplicate of another circle.
Top
See Also
Reference
GH_Circle Class
Grasshopper.Kernel.Types Namespace