Grasshopper API
GH_Leader.CastTo Method
Overload List
Name | Description
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_AnnotationBase.CastTo<T>(T).)
Top
See Also
Reference
GH_Leader Class
Grasshopper.Kernel.Types Namespace