Grasshopper API
GH_InputParamManager.AddRectangleParameter Method
Overload List
Name | Description
AddRectangleParameter(String, String, String, GH_ParamAccess)
 Add a 3D Rectangle parameter to the input list of this component.
AddRectangleParameter(String, String, String, GH_ParamAccess, Rectangle3d)
 Add a 3D Rectangle parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace