Grasshopper API
GH_InputParamManager.AddAngleParameter Method
Overload List
Name | Description
AddAngleParameter(String, String, String, GH_ParamAccess)
 Add a floating point Number parameter to the input list of this component. The parameter will be aware that it is representing angles.
AddAngleParameter(String, String, String, GH_ParamAccess, IEnumerable<Double>)
 Add a floating point Number parameter to the input list of this component. The parameter will be aware that it is representing angles.
AddAngleParameter(String, String, String, GH_ParamAccess, Double)
 Add a floating point Number parameter to the input list of this component. The parameter will be aware that it is representing angles.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace