Grasshopper API
GH_IWriter.SetInt32 Method
Overload List
Name | Description
SetInt32(String, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInt32(String, Int32, Int32)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace