Grasshopper API
DataTree<T>.RemovePath Method
Overload List
Name | Description
RemovePath(GH_Path)
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
RemovePath(Int32[])
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace