Grasshopper API
Value.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingColor.Value)
Top
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace