Grasshopper API
ModelLinetype Constructor
Overload List
Name | Description
ModelLinetype()
Initializes a new instance of the ModelLinetype class
ModelLinetype(ModelLinetype.Attributes)
Initializes a new instance of the ModelLinetype class
ModelLinetype(Guid)
Initializes a new instance of the ModelLinetype class
ModelLinetype(Linetype)
Initializes a new instance of the ModelLinetype class
Top
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace