Grasshopper API
GH_DocumentObject.SetValue Method
Overload List
Name | Description
SetValue(String, Boolean)
 Set a named value. This value will be serialized with the component.
SetValue(String, Double)
 Set a named value. This value will be serialized with the component.
SetValue(String, Color)
 Set a named value. This value will be serialized with the component.
SetValue(String, Int32)
 Set a named value. This value will be serialized with the component.
SetValue(String, String)
 Set a named value. This value will be serialized with the component.
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace