Grasshopper API
GH_Chunk.FindChunk Method
Overload List
Name | Description
FindChunk(String)
 Finds the first chunk in the litter that matches the given name. Only chunks without index qualifiers are considered.
FindChunk(String, Int32)
 Finds the first chunk in the list that matches the given name and index. Only chunks with index qualifiers are considered.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace