Grasshopper API
ObjectDraftingColor Constructor
Overload List
Name | Description
ObjectDraftingColor()
Initializes a new instance of the ObjectDraftingColor class
ObjectDraftingColor(ObjectDraftingColor.Value)
Initializes a new instance of the ObjectDraftingColor class
Top
See Also
Reference
ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting Namespace