Grasshopper API
GH_ScriptVariant.ThrowOperatorException Method
Overload List
Name | Description
ThrowOperatorException(String, GH_ScriptVariantType)
ThrowOperatorException(String, String)
ThrowOperatorException(String, GH_ScriptVariantType, GH_ScriptVariantType)
ThrowOperatorException(String, String, String)
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace