Grasshopper API
GH_Structure<T>.Append Method
Overload List
Name | Description
Append(T)
 Append a data item to the last branch in the structure. If no branch exist yet, a new one will be created with [path = {0}]
Append(T, GH_Path)
 Append a data item to the specified branch in the structure. If the branch doesn't exist yet, it will be created.
Top
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace