Grasshopper API
Param_Centermark.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_Centermark Class
Grasshopper.Kernel.Parameters Namespace