Grasshopper API
Param_TextDot.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace