Grasshopper API
GH_Item.Read Method
Overload List
Name | Description
Read(BinaryReader)
 Deserialize this item from a binary stream.
Read(XmlNode)
 Deserialize this item from an Xml node.
Top
See Also
Reference
GH_Item Class
GH_IO.Types Namespace