Grasshopper API
GH_OutputParamManager.Register_ComplexParam Method
Overload List
Name | Description
Register_ComplexParam(String, String, String)
 Register a new Complex primitive parameter
Register_ComplexParam(String, String, String, GH_ParamAccess)
 Register a new Complex primitive parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace