Grasshopper API
GH_Arc Constructor
Overload List
Name | Description
GH_Arc()
 Default constructor
GH_Arc(Arc)
 Create a duplicate of another arc
GH_Arc(GH_Arc)
 Create a duplicate of another arc
Top
See Also
Reference
GH_Arc Class
Grasshopper.Kernel.Types Namespace