Grasshopper API
GH_InputParamManager.AddParameter Method
Overload List
Name | Description
AddParameter(IGH_Param)
 Generic parameter addition. If you cannot use one of the utility methods provided by this class, you can register a customized parameter using this method.
AddParameter(IGH_Param, String, String, String, GH_ParamAccess)
 Generic parameter addition. If you cannot use one of the utility methods provided by this class, you can register a customized parameter using this method.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace