Grasshopper API
GH_UndoServer.PushUndoRecord Method
Overload List
Name | Description
PushUndoRecord(GH_UndoRecord)
 Add a new undo record to the undo stack, this function clears the Redo stack.
PushUndoRecord(String, GH_UndoAction)
 Add a new undo record to the undo stack, this function clears the Redo stack.
Top
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace