Grasshopper API
ModelObject Constructor
Overload List
Name | Description
ModelObject()
Initializes a new instance of the ModelObject class
ModelObject(ModelObject.Attributes)
Initializes a new instance of the ModelObject class
ModelObject(Guid)
Initializes a new instance of the ModelObject class
ModelObject(RhinoObject)
Initializes a new instance of the ModelObject class
ModelObject(RhinoDoc, ObjectAttributes)
Initializes a new instance of the ModelObject class
ModelObject(RhinoDoc, ObjectAttributes, GeometryBase)
Initializes a new instance of the ModelObject class
Top
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace