Grasshopper API
GH_Convert.CreatePureTime Method
Overload List
Name | Description
CreatePureTime(DateTime)
 Convert a datetime structure into a pure time, i.e. remove the date portion. As per convention, this means setting the year, month and day to 1.
CreatePureTime(Int32, Int32, Int32)
 Create a pure time instance. If the total number of hours, minutes and seconds exceeds a full year then it is not possible to create a pure time and the largest possible pure time will be returned instead.
Top
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace