Grasshopper API
GH_ColourPickerBase.SetupColourPicker Method
Overload List
Name | Description
SetupColourPicker(Color, Point4d, GH_ColourSpace)
 Setup all UI elements.
SetupColourPicker(Color, Color, GH_ColourSpace)
 Setup all UI elements.
Top
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace