Grasshopper API
GH_Author Constructor
Overload List
Name | Description
GH_Author()
Initializes a new instance of the GH_Author class
GH_Author(IGH_Author)
Initializes a new instance of the GH_Author class
Top
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace