Grasshopper API
GH_IReader.TryGetDate Method
Overload List
Name | Description
TryGetDate(String, DateTime)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDate(String, Int32, DateTime)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace