Grasshopper API
GH_GraphicsUtil.ShadowVertical Method
Overload List
Name | Description
ShadowVertical(Graphics, Int32, Int32, Int32, Int32, Boolean, Color)
 Draws a vertical shadow edge.
ShadowVertical(Graphics, Int32, Int32, Int32, Int32, Boolean, Int32)
 Draws a vertical shadow edge.
ShadowVertical(Graphics, Single, Single, Single, Single, Boolean, Int32)
 Draws a vertical shadow edge.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace