Grasshopper API
GH_ComponentParamServer.Clear Method
Overload List
Name | Description
Clear()
 Removes all input and output parameters.
Clear(Boolean)
 Removes all input and output parameters.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace