Grasshopper API
GH_Document.NewSolution Method
Overload List
Name | Description
NewSolution(Boolean)
 Start a new solution.
NewSolution(Boolean, GH_SolutionMode)
 Start a new solution.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace