Grasshopper API
GH_GeometricFont.DrawNumber Method
Overload List
Name | Description
DrawNumber(Graphics, Int32, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, Int64, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, UInt32, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, UInt64, Color, PointF)
 Draw an integer at the specified location.
Top
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace