Grasshopper API
GH_InputParamManager.AddCircleParameter Method
Overload List
Name | Description
AddCircleParameter(String, String, String, GH_ParamAccess)
 Add a 3D Circle parameter to the input list of this component.
AddCircleParameter(String, String, String, GH_ParamAccess, Circle)
 Add a 3D Circle parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace