Grasshopper API
ModelRenderMaterial Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelRenderMaterial.Attributes to ModelRenderMaterial)
Implicit(ColorRGBA to ModelRenderMaterial)
Implicit(Material to ModelRenderMaterial)
Implicit(RenderMaterial to ModelRenderMaterial)
Implicit(String to ModelRenderMaterial)
Top
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace