Grasshopper API
GH_Item.CreateFrom Method
Overload List
Name | Description
CreateFrom(BinaryReader)
 Creates a new instance of GH_Item and sets the fields from a reader object.
CreateFrom(XmlNode)
 Creates a new instance of GH_Item and sets the fields from an Xml node object.
Top
See Also
Reference
GH_Item Class
GH_IO.Types Namespace