Grasshopper API
GH_Canvas.RemoveTagArtist Method
Overload List
Name | Description
RemoveTagArtist(Guid)
 Remove all IGH_TagArtists from this canvas that match a certain ID.
RemoveTagArtist(IGH_TagArtist)
 Remove a specific tag artist from this canvas. If the instance occurs multiple times in the TagArtist list, all instances will be removed.
Top
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace