Grasshopper API
GH_Parser.IsLinkLine Method
Overload List
Name | Description
IsLinkLine(String)
 Test whether a line represents a referenced link target. Note; this is a quick check. The link might still be invalid, use the IsLinkLine overload to include validity checks.
IsLinkLine(String, String, String, String)
 Test whether a line represents a referenced link target.
Top
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace