Grasshopper API
GH_PointCloud Constructor
Overload List
Name | Description
GH_PointCloud()
 Default constructor, creates an invalid curve.
GH_PointCloud(GH_PointCloud)
 Create a duplicate of another GH_PointCloud. This constructor also copies reference data.
GH_PointCloud(Guid)
 Create a new referenced curve that references a Rhino curve object with the specified ID.
GH_PointCloud(PointCloud)
 Create a duplicate of an existing point-cloud.
Top
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace