Grasshopper API
IGH_DataAccess.GetData Method
Overload List
Name | Description
GetData<T>(Int32, T)
 Retrieve data from an input parameter during GH_Component.SolveInstance().
GetData<T>(String, T)
 Retrieve data from an input parameter during GH_Component.SolveInstance().
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace