Grasshopper API
ObjectDraftingLinetype Constructor
Overload List
Name | Description
ObjectDraftingLinetype()
Initializes a new instance of the ObjectDraftingLinetype class
ObjectDraftingLinetype(ObjectDraftingLinetype.Value)
Initializes a new instance of the ObjectDraftingLinetype class
Top
See Also
Reference
ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace