Grasshopper API
GH_FileWatcher.CreateFileWatcher Method
Overload List
Name | Description
CreateFileWatcher(String, GH_FileWatcherEvents, GH_FileWatcher.FileChanged)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateFileWatcher(String, GH_FileWatcherEvents, GH_FileWatcher.FileChangedSimple)
 Create a new FileSystem Watcher object aimed at a specific file.
Top
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace