Grasshopper API
GH_InputParamManager.AddVectorParameter Method
Overload List
Name | Description
AddVectorParameter(String, String, String, GH_ParamAccess)
 Add a 3D Vector parameter to the input list of this component.
AddVectorParameter(String, String, String, GH_ParamAccess, Vector3d)
 Add a 3D Vector parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace