Grasshopper API
GH_ComponentParamServer.SortOutput Method
Overload List
Name | Description
SortOutput(Double[])
 Sort the input parameter order based on a numeric key array.
SortOutput(Int32[])
 Sort the output parameter order based on a numeric key array.
SortOutput(Single[])
 Sort the output parameter order based on a numeric key array.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace