Grasshopper API
GH_FontServer.NewFont Method
Overload List
Name | Description
NewFont(Font, FontStyle)
 Safe font constructor.
NewFont(Font, Single)
 Safe font constructor.
NewFont(FontFamily, Single)
 Safe font constructor.
NewFont(Font, Single, FontStyle)
 Safe font constructor.
NewFont(FontFamily, Single, FontStyle)
 Safe font constructor.
NewFont(String, Single, FontStyle)
 High level function for Font creation. We've ran into loads of trouble in the past with missing Fonts. Never create a font directly via GDI+, always use this method.
Top
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace