Grasshopper API
GH_OutputParamManager.Register_CircleParam Method
Overload List
Name | Description
Register_CircleParam(String, String, String)
 Register a new 3D circle parameter
Register_CircleParam(String, String, String, GH_ParamAccess)
 Register a new 3D circle parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace