Grasshopper API
DisplayColorGradient Constructor
Overload List
Name | Description
DisplayColorGradient()
 Blank constructor
DisplayColorGradient(ColorGradient)
Initializes a new instance of the DisplayColorGradient class
DisplayColorGradient(DisplayColorGradient)
Initializes a new instance of the DisplayColorGradient class
Top
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace