Grasshopper API
GH_Document.RemoveObject Method
Overload List
Name | Description
RemoveObject(IGH_Attributes, Boolean)
 Remove the top-level object in the attribute tree from the document. This method does not add an Undo event, that is the responsibility of the caller.
RemoveObject(IGH_DocumentObject, Boolean)
 Remove the object from the document. This removal is the precursor to object deletion. Do not call this function if you intend to transfer the object to another GH_Document. This method does not add an Undo event, that is the responsibility of the caller.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace