Grasshopper API
GH_GraphicsUtil.AppendArc Method
Overload List
Name | Description
AppendArc(Point3d, Point3d, Vector3d, GraphicsPath)
 Append an arc segment to a GraphicsPath. If the arc cannot be solved, a linear segment is appended instead.
AppendArc(PointF, PointF, SizeF, GraphicsPath)
 Append an arc segment to a GraphicsPath. If the arc cannot be solved, a linear segment is appended instead.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace