Grasshopper API
GH_ExpressionParser.Evaluate Method
Overload List
Name | Description
Evaluate()
 Evaluate the expression currently loaded in the Symbols cache using the currently loaded variables.
Evaluate(Queue<GH_ParserSymbol>)
 Evaluate the expression queue without overriding any local caches. You can obtain an expression queue by calling CachedSymbols()
Evaluate(String)
 Store a new expression in the Symbols cache and evaluate it using the current variables
Top
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace