Grasshopper API
GH_Surface.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace