Grasshopper API
IGH_DocumentObject.RecordUndoEvent Method
Overload List
Name | Description
RecordUndoEvent(GH_UndoRecord)
 Record an entire undo record.
RecordUndoEvent(String)
 Record a generic object change undo event.
RecordUndoEvent(String, IGH_UndoAction)
 Record a specific object change undo event.
Top
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace