Grasshopper API
GH_IReader.ChunkExists Method
Overload List
Name | Description
ChunkExists(String)
 Checks whether a chunk with the specified name exists in the litter. Only chunks without index qualifiers are considered. Name comparisons are not case-sensitive.
ChunkExists(String, Int32)
 Checks whether a chunk with the specified name and index exists in the litter. Only chunks with index qualifiers are considered. Name comparisons are not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace