Grasshopper API
GH_Lexer Constructor
Overload List
Name | Description
GH_Lexer()
 Blank constructor.
GH_Lexer(String)
 Create a new mask from a textual string.
Top
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace