Grasshopper API
GH_Structure<T> Constructor
Overload List
Name | Description
GH_Structure<T>()
 Default constructor, create a blank data structure.
GH_Structure<T>(GH_Structure<T>, Boolean)
 Copy constructor, duplicate another data structure.
Top
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace