Grasshopper API
GH_AngularDimension Constructor
Overload List
Name | Description
GH_AngularDimension()
 Default constructor, creates an invalid angular dimension.
GH_AngularDimension(AngularDimension)
 Create a duplicate of an existing angular dimension.
GH_AngularDimension(GH_AngularDimension)
 Create a duplicate of another GH_AngularDimension. This constructor also copies reference data.
GH_AngularDimension(Guid)
 Create a new referenced angular dimension that references a Rhino dimension with the specified ID.
GH_AngularDimension(AngularDimension, ModelAnnotationStyle)
 Create a duplicate of an existing angular dimension.
Top
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace