Grasshopper API
GH_InputParamManager.AddBoxParameter Method
Overload List
Name | Description
AddBoxParameter(String, String, String, GH_ParamAccess)
 Add a 3D Box parameter to the input list of this component.
AddBoxParameter(String, String, String, GH_ParamAccess, Box)
 Add a 3D Box parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace