Grasshopper API
GH_Item Constructor
Overload List
Name | Description
GH_Item(String, GH_BoundingBox)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Interval1D)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Interval2D)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Line)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Plane)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Point2D)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Point3D)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Point4D)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, GH_Version)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Boolean)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Byte)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Byte[])
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, DateTime)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Decimal)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Double)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Double[])
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Bitmap)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Color)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Point)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, PointF)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Rectangle)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, RectangleF)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Size)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, SizeF)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Guid)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Int32)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Int64)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Single)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, String)
 Construct a new instance of GH_Item with the specified name and value.
GH_Item(String, Int32, GH_BoundingBox)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Interval1D)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Interval2D)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Line)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Plane)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Point2D)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Point3D)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Point4D)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, GH_Version)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Boolean)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Byte)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Byte[])
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, DateTime)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Decimal)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Double)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Double[])
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Bitmap)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Color)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Point)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, PointF)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Rectangle)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, RectangleF)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Size)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, SizeF)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Guid)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Int32)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Int64)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, Single)
 Construct a new instance of GH_Item with the specified name, index and value.
GH_Item(String, Int32, String)
 Construct a new instance of GH_Item with the specified name, index and value.
Top
See Also
Reference
GH_Item Class
GH_IO.Types Namespace