Grasshopper API
Attributes.Equals Method
Overload List
Name | Description
Equals(ModelHatchLine.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Top
See Also
Reference
ModelHatchLine.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace