Grasshopper API
ModelTextureMapping Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelTextureMapping.Attributes to ModelTextureMapping)
Implicit(String to ModelTextureMapping)
Implicit(TextureMapping to ModelTextureMapping)
Top
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace