Grasshopper API
GH_Chunk.SetVersion Method
Overload List
Name | Description
SetVersion(String, GH_Version)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetVersion(String, Int32, GH_Version)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
SetVersion(String, Int32, Int32, Int32)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetVersion(String, Int32, Int32, Int32, Int32)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace