Grasshopper API
IGH_GeometricGoo.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
LoadGeometry(RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
Top
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace