Grasshopper API
IGH_DataAccess.GetDataList Method
Overload List
Name | Description
GetDataList<T>(Int32, List<T>)
 Retrieve an entire list of data from an input parameter during GH_Component.SolveInstance().
GetDataList<T>(String, List<T>)
 Retrieve an entire list of data from an input parameter during GH_Component.SolveInstance().
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace