Grasshopper API
ObjectRenderMaterial.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace