Grasshopper API
GH_InputParamManager.AddArcParameter Method
Overload List
Name | Description
AddArcParameter(String, String, String, GH_ParamAccess)
 Add a 3D Arc parameter to the input list of this component.
AddArcParameter(String, String, String, GH_ParamAccess, Arc)
 Add a 3D Arc parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace