Grasshopper API
GH_Culture Constructor
Overload List
Name | Description
GH_Culture()
 Blank constructor
GH_Culture(CultureInfo)
Initializes a new instance of the GH_Culture class
GH_Culture(GH_Culture)
Initializes a new instance of the GH_Culture class
Top
See Also
Reference
GH_Culture Class
Grasshopper.Kernel.Types Namespace