Grasshopper API
GH_Document.SetEnabledFlags Method
Overload List
Name | Description
SetEnabledFlags(Boolean)
 Set the enabled flags of all selected objects to true or false
SetEnabledFlags(List<IGH_DocumentObject>, Boolean)
 Set the enabled flags of all specified objects to true or false
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace