Grasshopper API
GH_Document.Select Method
Overload List
Name | Description
Select(GH_RelevantObjectData)
 Default pick selection behaviour. (looks at current Shift + Control modifier states to determine addition/removal)
Select(GH_RelevantObjectData, Boolean, Boolean)
 Default pick selection behaviour
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace