Grasshopper API
DataTree<T>.Graft Method
Overload List
Name | Description
Graft(Boolean)
 Graft all paths in this tree. "Grafting" means appending a new branch for every item in an existing branch.
Graft(GH_Path, Boolean)
 Graft a single path in the tree. "Grafting" means appending a new branch for every item in an existing branch.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace