Grasshopper API
Complex.Subtraction Operator
Overload List
Name | Description
Subtraction(Complex, Complex)
Subtraction(Complex, Double)
Subtraction(Double, Complex)
Top
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace