Grasshopper API
ModelNamedView.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
Top
See Also
Reference
ModelNamedView Class
Grasshopper.Rhinoceros.Display Namespace