Grasshopper API
GH_Message Constructor
Overload List
Name | Description
GH_Message()
 Fake constructor to avoid new instances being created by a PropertyGrid.
GH_Message(String)
 Create a new message of type GH_Message_Type.info
GH_Message(String, GH_Message_Type)
 Create a new message.
Top
See Also
Reference
GH_Message Class
GH_IO.Serialization Namespace