Grasshopper API
ModelData.WriteChunk Method
Overload List
Name | Description
WriteChunk<T>(GH_IWriter, String, T)
WriteChunk<T>(GH_IWriter, String, Nullable<T>)
Top
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace