Grasshopper API
AnnotationArrow Implicit Conversion Operators
Overload List
Name | Description
Implicit(ArrowType to AnnotationArrow)
Implicit(AnnotationArrow.Attributes to AnnotationArrow)
Top
See Also
Reference
AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations Namespace