Grasshopper API
ObjectDraftingLinetype Implicit Conversion Operators
Overload List
Name | Description
Implicit(ObjectDraftingLinetype to ObjectDraftingLinetype.Value)
Implicit(ObjectDraftingLinetype.Value to ObjectDraftingLinetype)
Top
See Also
Reference
ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace