Grasshopper API
GH_OutputParamManager.Register_TransformParam Method
Overload List
Name | Description
Register_TransformParam(String, String, String)
 Register a new Transform parameter
Register_TransformParam(String, String, String, GH_ParamAccess)
 Register a new Transform parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace