Grasshopper API
GH_IWriter.SetPoint3D Method
Overload List
Name | Description
SetPoint3D(String, GH_Point3D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPoint3D(String, Int32, GH_Point3D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace