Grasshopper API
Value Constructor
Overload List
Name | Description
ModelUnitSystem.Value(LengthUnit)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(ActiveSpace, String)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(UnitSystem, String)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(UnitSystem, String, Double)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(ModelUnitSystem.Value, String, Nullable<Double>)
Initializes a new instance of the ModelUnitSystem.Value class
Top
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace