Grasshopper API
GH_Transform Constructor
Overload List
Name | Description
GH_Transform()
Initializes a new instance of the GH_Transform class
GH_Transform(GH_Transform)
Initializes a new instance of the GH_Transform class
GH_Transform(ITransform)
Initializes a new instance of the GH_Transform class
GH_Transform(Transform)
Initializes a new instance of the GH_Transform class
Top
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace