Grasshopper API
GH_Format.FormatFilePath Method
Overload List
Name | Description
FormatFilePath(String, Int32)
 Format a filepath so that it doesn't exceed a string length. If the filepath filename is already longer than maxLength it will be returned intact.
FormatFilePath(String, Int32, Font)
 Format a filepath so that it doesn't exceed width. If the filepath filename is already longer than maxLength it will be returned intact.
Top
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace