Grasshopper API
GH_MemoryBitmap.Sample Method
Overload List
Name | Description
Sample(Double, Double, Color)
 Top level sampling function for interpolated sampling.
Sample(Int32, Int32, Color)
 Top level sampling function.
Top
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace