Grasshopper API
GH_Plane Constructor
Overload List
Name | Description
GH_Plane()
 Default constructor. Creates a world XY plane.
GH_Plane(GH_Plane)
 Create a duplicate of another plane.
GH_Plane(Guid)
Initializes a new instance of the GH_Plane class
GH_Plane(Plane)
 Create a duplicate of another plane.
Top
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace