Grasshopper API
GH_Surface Constructor
Overload List
Name | Description
GH_Surface()
Initializes a new instance of the GH_Surface class
GH_Surface(Brep)
Initializes a new instance of the GH_Surface class
GH_Surface(GH_Surface)
Initializes a new instance of the GH_Surface class
GH_Surface(Guid)
Initializes a new instance of the GH_Surface class
GH_Surface(Surface)
Initializes a new instance of the GH_Surface class
Top
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace