Grasshopper API
Value.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDisplayColor.Value)
Top
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace