Grasshopper API
GH_FileWatcher.SetCustomUIThread Method
Overload List
Name | Description
SetCustomUIThread(Control)
 If you want to override the default Invoke behaviour, you must set InvokeOnDefaultThread to False and supply either a custom Control or a Form.
SetCustomUIThread(Form)
 If you want to override the default Invoke behaviour, you must set InvokeOnDefaultThread to False and supply either a custom Control or a Form.
Top
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace