Grasshopper API
GH_GraphicsUtil.EtchHorizontal Method
Overload List
Name | Description
EtchHorizontal(Graphics, Single, Single, Single, Int32)
 Draws an etched line segment.
EtchHorizontal(Graphics, Int32, Int32, Int32, Int32, Int32)
 Draws an etched line segment.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace