Grasshopper API
GH_Brep.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace