Grasshopper API
GH_PointRefData Constructor
Overload List
Name | Description
GH_PointRefData()
Initializes a new instance of the GH_PointRefData class
GH_PointRefData(GH_PointRefData)
Initializes a new instance of the GH_PointRefData class
Top
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace