Grasshopper API
GH_Chunk.TryGetPoint3D Method
Overload List
Name | Description
TryGetPoint3D(String, GH_Point3D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint3D(String, Int32, GH_Point3D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace