Grasshopper API
ModelEarthAnchorPoint Constructor
Overload List
Name | Description
ModelEarthAnchorPoint()
Initializes a new instance of the ModelEarthAnchorPoint class
ModelEarthAnchorPoint(ModelEarthAnchorPoint.Attributes)
Initializes a new instance of the ModelEarthAnchorPoint class
ModelEarthAnchorPoint(EarthAnchorPoint)
Initializes a new instance of the ModelEarthAnchorPoint class
Top
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace