Grasshopper API
GH_Vector.CastTo Method
Overload List
Name | Description
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Vector Class
Grasshopper.Kernel.Types Namespace