Grasshopper API
GH_Archive.AddMessage Method
Overload List
Name | Description
AddMessage(GH_Message)
 Add a new message to the record.
AddMessage(String, GH_Message_Type)
 Add a new message to the record.
Top
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace