Grasshopper API
GH_GraphicsUtil.TransparencyMatrix Method
Overload List
Name | Description
TransparencyMatrix(Double)
 Create an image transparency matrix for a specific blending factor.
TransparencyMatrix(Int32)
 Create an image transparency matrix for a specific blending factor.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace