Grasshopper API
GH_InputParamManager.AddLineParameter Method
Overload List
Name | Description
AddLineParameter(String, String, String, GH_ParamAccess)
 Add a 3D Line parameter to the input list of this component.
AddLineParameter(String, String, String, GH_ParamAccess, Line)
 Add a 3D Line parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace