Grasshopper API
GH_ComponentParamServer.Sync Method
Overload List
Name | Description
Sync(GH_ComponentParamServer.IGH_SyncObject)
 Sync changes from a prerecorded state. All param references in the sync object which are no longer present in the current server will be properly deleted. The sync object will be reset in the process, so you can only call this function with a specific Sync object once.
Sync(Object)
 Sync changes from a prerecorded state. All param references in the sync object which are no longer present in the current server will be properly deleted. The sync object will be reset in the process, so you can only call this function with a specific Sync object once.
Sync(GH_ComponentParamServer.IGH_SyncObject, Int32)
 Sync changes from a prerecorded state. All param references in the sync object which are no longer present in the current server will be properly deleted. The sync object will be reset in the process, so you can only call this function with a specific Sync object once.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace