Grasshopper API
GH_InputParamManager.AddTextParameter Method
Overload List
Name | Description
AddTextParameter(String, String, String, GH_ParamAccess)
 Add a Text parameter to the input list of this component.
AddTextParameter(String, String, String, GH_ParamAccess, IEnumerable<String>)
 Add a Text parameter to the input list of this component.
AddTextParameter(String, String, String, GH_ParamAccess, String)
 Add a Text parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace