Grasshopper API
GH_Chunk.SetDecimal Method
Overload List
Name | Description
SetDecimal(String, Decimal)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDecimal(String, Int32, Decimal)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace