Grasshopper API
GH_ExpressionParser.AddVariableEx Method
Overload List
Name | Description
AddVariableEx(String, GH_Variant)
AddVariableEx(String, IGH_Goo)
Top
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace