Grasshopper API
GH_GraphicsUtil.RenderColourIcon Method
Overload List
Name | Description
RenderColourIcon(Graphics, Rectangle, Color) |  Obsolete.
 Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
RenderColourIcon(Graphics, Rectangle, Color, Single)
 Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace