Grasshopper API
Param_Leader.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace