Grasshopper API
AnnotationUnitsSettings Constructor
Overload List
Name | Description
AnnotationUnitsSettings()
Initializes a new instance of the AnnotationUnitsSettings class
AnnotationUnitsSettings(AnnotationUnitsSettings.Attributes)
Initializes a new instance of the AnnotationUnitsSettings class
AnnotationUnitsSettings(DimensionStyle)
Initializes a new instance of the AnnotationUnitsSettings class
Top
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace