Grasshopper API
GH_OutputParamManager.Register_PointParam Method
Overload List
Name | Description
Register_PointParam(String, String, String)
 Register a new 3D point parameter
Register_PointParam(String, String, String, GH_ParamAccess)
 Register a new 3D point parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace