Grasshopper API
GH_ColourCube.Average Method
Overload List
Name | Description
Average(Color, Color)
 Compute the average of two colours.
Average(Color, Color, Color, Color)
 Compute the average of four colours.
Top
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace