Grasshopper API
GH_MouseTracker.Record Method
Overload List
Name | Description
Record(Point)
 Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
Record(Point, Object)
 Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
Top
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace