Grasshopper API
GH_Chunk.SetPlane Method
Overload List
Name | Description
SetPlane(String, GH_Plane)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetPlane(String, Int32, GH_Plane)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace