Grasshopper API
GH_Chunk.TryGetString Method
Overload List
Name | Description
TryGetString(String, String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetString(String, Int32, String)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace