Grasshopper API
ModelRenderTexture Constructor
Overload List
Name | Description
ModelRenderTexture()
Initializes a new instance of the ModelRenderTexture class
ModelRenderTexture(ModelRenderTexture.Attributes)
Initializes a new instance of the ModelRenderTexture class
ModelRenderTexture(Guid)
Initializes a new instance of the ModelRenderTexture class
ModelRenderTexture(RenderTexture)
Initializes a new instance of the ModelRenderTexture class
Top
See Also
Reference
ModelRenderTexture Class
Grasshopper.Rhinoceros.Render Namespace