Grasshopper API
ModelData.Write Method
Overload List
Name | Description
Write(GH_IWriter)
Write(GH_IWriter, String, IReadOnlyList<Point2d>)
Write(GH_IWriter, String, IReadOnlyList<Point3d>)
Write(GH_IWriter, String, IReadOnlyList<Byte>)
Write(GH_IWriter, String, IReadOnlyList<Double>)
Write(GH_IWriter, String, IReadOnlyList<String>)
Write(GH_IWriter, String, Nullable<Plane>)
Write(GH_IWriter, String, Nullable<Point2d>)
Write(GH_IWriter, String, Nullable<Point3d>)
Write(GH_IWriter, String, Nullable<Transform>)
Write(GH_IWriter, String, Nullable<Vector2d>)
Write(GH_IWriter, String, Nullable<Vector3d>)
Write(GH_IWriter, String, Nullable<Boolean>)
Write(GH_IWriter, String, Nullable<Byte>)
Write(GH_IWriter, String, Nullable<Char>)
Write(GH_IWriter, String, Nullable<DateTime>)
Write(GH_IWriter, String, Nullable<Double>)
Write(GH_IWriter, String, Nullable<Color>)
Write(GH_IWriter, String, Nullable<Guid>)
Write(GH_IWriter, String, Nullable<Int32>)
Write(GH_IWriter, String, Nullable<Int64>)
Write(GH_IWriter, String, Nullable<Single>)
Write(GH_IWriter, String, String)
Write<T>(GH_IWriter, String, T)
Write<T>(GH_IWriter, String, IReadOnlyList<T>)
Write<TEnum>(GH_IWriter, String, Nullable<TEnum>)
Top
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace