Grasshopper API
GH_Light Constructor
Overload List
Name | Description
GH_Light()
 Default constructor, creates an new light
GH_Light(GH_Light)
 Create a duplicate of another GH_Light. This constructor also copies reference data.
GH_Light(Guid)
 Create a new referenced light that references a Rhino light with the specified ID.
GH_Light(Light)
 Create a duplicate of an existing light.
Top
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace