Grasshopper API
GH_Culture.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Culture Class
Grasshopper.Kernel.Types Namespace