Grasshopper API
GH_ComponentParamServer.RegisterInputParam Method
Overload List
Name | Description
RegisterInputParam(IGH_Param)
 Add a parameter to the end of the input list.
RegisterInputParam(IGH_Param, Int32)
 Add a parameter at the specific index of the input list.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace