Grasshopper API
GH_MemoryBitmap.Filter_Blur Method
Overload List
Name | Description
Filter_Blur()
 Blur the image in both directions.
Filter_Blur(Int32)
 Blur the image N times in both directions.
Filter_Blur(Int32, Int32)
 Blur the image in both directions.
Filter_Blur(Int32, Int32, Int32)
 Blur the image N times in both directions.
Top
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace