Grasshopper API
ObjectDraftingColor.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ModelValue.Equals(Object).)
Top
See Also
Reference
ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting Namespace