Grasshopper API
GH_Chunk.TryGetPoint2D Method
Overload List
Name | Description
TryGetPoint2D(String, GH_Point2D)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetPoint2D(String, Int32, GH_Point2D)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace