Grasshopper API
ModelRenderTexture Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelRenderTexture.Attributes to ModelRenderTexture)
Implicit(ColorRGBA to ModelRenderTexture)
Implicit(RenderTexture to ModelRenderTexture)
Implicit(String to ModelRenderTexture)
Top
See Also
Reference
ModelRenderTexture Class
Grasshopper.Rhinoceros.Render Namespace