Grasshopper API
DataTree<T>.PathExists Method
Overload List
Name | Description
PathExists(GH_Path)
 Test if the specified path is already defined inside the tree.
PathExists(Int32[])
 Test if the specified path is already defined inside the tree.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace