Grasshopper API
GH_Brep Constructor
Overload List
Name | Description
GH_Brep()
Initializes a new instance of the GH_Brep class
GH_Brep(Brep)
Initializes a new instance of the GH_Brep class
GH_Brep(GH_Brep)
Initializes a new instance of the GH_Brep class
GH_Brep(Guid)
Initializes a new instance of the GH_Brep class
Top
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace