Grasshopper API
GH_TreeRules.Apply Method
Overload List
Name | Description
Apply(GH_Path)
 Apply all the local rules to a path.
Apply(GH_Path, Int32)
 Apply all the local rules to a path+index combination.
Top
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace