Grasshopper API
Utility.InvokeMethod Method
Overload List
Name | Description
InvokeMethod(Object, String)
 Call a method via its name.
InvokeMethod(Object, String, Object[])
 Call a method via its name.
Top
See Also
Reference
Utility Class
Grasshopper Namespace