Grasshopper API
Attributes.Equals Method
Overload List
Name | Description
Equals(Object, IEqualityComparer) |  (Overrides ModelContent.Attributes.Equals(Object, IEqualityComparer).)
Top
See Also
Reference
ModelNamedConstructionPlane.Attributes Class
Grasshopper.Rhinoceros.Display Namespace