Grasshopper API
Translation Constructor
Overload List
Name | Description
Translation()
Initializes a new instance of the Translation class
Translation(Vector3d)
Initializes a new instance of the Translation class
Top
See Also
Reference
Translation Class
Grasshopper.Kernel.Types.Transforms Namespace