Grasshopper API
GH_RotationalTuningData<T> Constructor
Overload List
Name | Description
GH_RotationalTuningData<T>(T, PointF)
 Create a new instance of the rotational tuning data.
GH_RotationalTuningData<T>(T, PointF, PointF)
 Create a new instance of the rotational tuning data.
Top
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace