Grasshopper API
GH_Path.ToString Method
Overload List
Name | Description
ToString()
 Concatenates the indices in the path.
 (Overrides Object.ToString().)
ToString(Boolean)
 Concatenates the indices in the path.
Top
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace