Grasshopper API
GH_Document.Write Method
Overload List
Name | Description
Write(GH_IWriter)
 Standard archiving function. Will serialize the entire document.
Write(GH_IWriter, IList<IGH_DocumentObject>)
 Special function that allows writing of a custom object list. This function is used when partial documents need to be serialized such as when exporting or during clipboard operations.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace