Grasshopper API
Node3d<T>.Remove Method
Overload List
Name | Description
Remove(Index3d<T>)
 Remove the item with the given index from the entire tree. It doesn't matter on which node you call this function, it is a tree-wide operation.
Remove(Int32)
 Remove the item with the given index from the entire tree. It doesn't matter on which node you call this function, it is a tree-wide operation.
Top
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace