Grasshopper API
GH_InputParamManager.AddNumberParameter Method
Overload List
Name | Description
AddNumberParameter(String, String, String, GH_ParamAccess)
 Add a floating point Number parameter to the input list of this component.
AddNumberParameter(String, String, String, GH_ParamAccess, IEnumerable<Double>)
 Add a floating point Number parameter to the input list of this component.
AddNumberParameter(String, String, String, GH_ParamAccess, Double)
 Add a floating point Number parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace