Grasshopper API
GH_Border.CreateBorders Method
Overload List
Name | Description
CreateBorders(RectangleF, Int32)
 Static (Shared) method for creating a set of borders.
CreateBorders(RectangleF, Padding)
 Static (Shared) method for creating a set of borders.
CreateBorders(RectangleF, Int32, Int32)
 Static (Shared) method for creating a set of borders.
CreateBorders(RectangleF, Int32, Int32, Int32, Int32)
 Static (Shared) method for creating a set of borders.
Top
See Also
Reference
GH_Border Class
Grasshopper.GUI.Canvas Namespace