Grasshopper API
DataTree<T>.RenumberPaths Method
Overload List
Name | Description
RenumberPaths()
 Renumber all paths in this data tree, using a single incrementing path index.
RenumberPaths(String)
 Renumber all paths in this data tree, using a single incrementing path index.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace