Grasshopper API
GH_GraphicsUtil.RenderUnscaledIcon Method
Overload List
Name | Description
RenderUnscaledIcon(Graphics, Image, Int32, Int32) |  Obsolete.
 Draws an image file at 1:1 scale centered on the given coordinates.
RenderUnscaledIcon(Graphics, Image, Int32, Int32, Double) |  Obsolete.
 Draws an image file at 1:1 scale centered on the given coordinates.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace