Grasshopper API
GH_Document.TogglePreviewFlags Method
Overload List
Name | Description
TogglePreviewFlags()
 Toggle the preview flags of all selected objects
TogglePreviewFlags(List<IGH_DocumentObject>)
 Toggle the preview flags of all specified objects
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace