Grasshopper API
GH_Hatch.CastTo Method
Overload List
Name | Description
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace