Grasshopper API
GH_Chunk.TryGetVersion Method
Overload List
Name | Description
TryGetVersion(String, GH_Version)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetVersion(String, Int32, GH_Version)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace