Grasshopper API
GH_ObjectWrapper.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_ObjectWrapper Class
Grasshopper.Kernel.Types Namespace