Grasshopper API
GH_Viewport Constructor
Overload List
Name | Description
GH_Viewport()
Initializes a new instance of the GH_Viewport class
GH_Viewport(GH_Viewport)
Initializes a new instance of the GH_Viewport class
GH_Viewport(Point)
Initializes a new instance of the GH_Viewport class
GH_Viewport(Point, Single)
Initializes a new instance of the GH_Viewport class
Top
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace