Grasshopper API
GH_DocumentObject.Menu_AppendCustomItem Method
Overload List
Name | Description
Menu_AppendCustomItem(ToolStripDropDown, Control)
 Utility function for inserting exotic controls into dropdown menus.
Menu_AppendCustomItem(ToolStripDropDown, Control, KeyDownEventHandler)
 Utility function for inserting exotic controls into dropdown menus.
Menu_AppendCustomItem(ToolStripDropDown, Control, KeyDownEventHandler, Boolean, Int32, Boolean)
 Utility function for inserting exotic controls into dropdown menus.
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace