Grasshopper API
GH_Chunk.SetDrawingBitmap Method
Overload List
Name | Description
SetDrawingBitmap(String, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingBitmap(String, Int32, Bitmap)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace