Grasshopper API
GH_Document.AutoSave Method
Overload List
Name | Description
AutoSave(GH_AutoSaveTrigger)
 Creates a new autosave file on the disk. The previous autosave file (assuming it exists) will be temporarily renamed and eventually deleted entirely. Note: AutoSave is only possible on Documents that have TopLevel Rank and a valid FilePath.
AutoSave(GH_AutoSaveTrigger, Guid)
 Creates a new autosave file on the disk. The previous autosave file (assuming it exists) will be temporarily renamed and eventually deleted entirely. Note: AutoSave is only possible on Documents that have TopLevel Rank and a valid FilePath.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace