Grasshopper API
GH_Point.ReferenceIndex Method
Overload List
Name | Description
ReferenceIndex()
 Retrieve the index of the point reference data.
ReferenceIndex(Int32)
 Sets the index of the point reference data.
Top
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace