Grasshopper API
GH_DocumentObject.OnObjectChanged Method
Overload List
Name | Description
OnObjectChanged(GH_ObjectChangedEventArgs)
OnObjectChanged(GH_ObjectEventType)
OnObjectChanged(String)
OnObjectChanged(GH_ObjectEventType, Object)
OnObjectChanged(String, Object)
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace