Grasshopper API
ModelData.ReadChunk Method
Overload List
Name | Description
ReadChunk<T>(GH_IReader, String, T)
ReadChunk<T>(GH_IReader, String, Nullable<T>)
Top
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace