Grasshopper API
GH_Capsule.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the GH_Capsule
Dispose(Boolean)
Releases the unmanaged resources used by the GH_Capsule and optionally releases the managed resources
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace