Grasshopper API
GH_PathOffset Constructor
Overload List
Name | Description
GH_PathOffset()
Initializes a new instance of the GH_PathOffset class
GH_PathOffset(IEnumerable<Int32>)
Initializes a new instance of the GH_PathOffset class
GH_PathOffset(IEnumerable<Int32>, Int32)
Initializes a new instance of the GH_PathOffset class
GH_PathOffset(IEnumerable<Int32>, Int32, Boolean, Boolean)
Initializes a new instance of the GH_PathOffset class
Top
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace