Grasshopper API
GH_DetailView.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace