Grasshopper API
GH_SettingsServer.GetValue Method
Overload List
Name | Description
GetValue(String, Boolean)
GetValue(String, Byte)
GetValue(String, DateTime)
GetValue(String, Double)
GetValue(String, Color)
GetValue(String, Point)
GetValue(String, Rectangle)
GetValue(String, Size)
GetValue(String, Int32)
GetValue(String, String)
Top
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace