Grasshopper API
GH_Capsule.CreateTextCapsule Method
Overload List
Name | Description
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, GH_Orientation)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, GH_Orientation)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, GH_Orientation, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(Rectangle, Rectangle, GH_Palette, String, Font, GH_Orientation, Int32[], Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, GH_Orientation, Int32, Int32)
 Create a new capsule with content text.
CreateTextCapsule(RectangleF, RectangleF, GH_Palette, String, Font, GH_Orientation, Int32[], Int32)
 Create a new capsule with content text.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace