Grasshopper API
GH_Box Constructor
Overload List
Name | Description
GH_Box()
Initializes a new instance of the GH_Box class
GH_Box(BoundingBox)
Initializes a new instance of the GH_Box class
GH_Box(Box)
Initializes a new instance of the GH_Box class
GH_Box(GH_Box)
Initializes a new instance of the GH_Box class
GH_Box(Guid)
Initializes a new instance of the GH_Box class
Top
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace