Grasshopper API
GH_IndexRuleSet.AddDigitPatternRule Method
Overload List
Name | Description
AddDigitPatternRule(Int32[])
 Append a rule for filtering digit patterns.
AddDigitPatternRule(Int32, Int32)
 Append a rule for filtering digit patterns. This pattern does not have an upper bound.
AddDigitPatternRule(Int32, Int32, Int32)
 Append a rule for filtering digit patterns.
Top
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace