Grasshopper API
ClippingDrawingSettings Constructor
Overload List
Name | Description
ClippingDrawingSettings()
Initializes a new instance of the ClippingDrawingSettings class
ClippingDrawingSettings(ClippingDrawingSettings.Attributes)
Initializes a new instance of the ClippingDrawingSettings class
Top
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace