Grasshopper API
GH_GraphicsUtil.BlendColour Method
Overload List
Name | Description
BlendColour(Color, Color)
 Overlays two colours. The Alpha component of the top colour controls the blend.
BlendColour(Color, Color, Double)
 Overlays two colours.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace