Grasshopper API
ClippingArrow Implicit Conversion Operators
Overload List
Name | Description
Implicit(ClippingArrow.Attributes to ClippingArrow)
Implicit(ClippingArrowType to ClippingArrow)
Top
See Also
Reference
ClippingArrow Class
Grasshopper.Rhinoceros.Annotations Namespace