Grasshopper API
Rotation Constructor
Overload List
Name | Description
Rotation()
Initializes a new instance of the Rotation class
Rotation(Point3d, Vector3d, Vector3d)
Initializes a new instance of the Rotation class
Rotation(Point3d, Vector3d, Double)
Initializes a new instance of the Rotation class
Top
See Also
Reference
Rotation Class
Grasshopper.Kernel.Types.Transforms Namespace