Grasshopper API
GH_ConnectivityDiagram Constructor
Overload List
Name | Description
GH_ConnectivityDiagram(GH_ConnectivityDiagram)
 Create a duplicate of another Connectivity Diagram.
GH_ConnectivityDiagram(GH_Document)
 Create a new Connectivity Diagram from a GH_Document.
Top
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace