Grasshopper API
GH_GraphicsUtil.ColourARGB Method
Overload List
Name | Description
ColourARGB(Double, Double, Double)
 Create a colour from floating ARGB channels (0.0~1.0). Channels are clipped to valid ranges.
ColourARGB(Int32, Int32, Int32)
 Create a colour from integer RGB channels. Channels are clipped to valid ranges.
ColourARGB(Int32, Int32, Int32, Int32)
 Create a colour from integer ARGB channels. Channels are clipped to valid ranges.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace