Grasshopper API
GH_Chunk.RemoveItem Method
Overload List
Name | Description
RemoveItem(String)
 Remove an unindexed item from this chunk.
RemoveItem(String, Int32)
 Remove an indexed item from this chunk.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace