Grasshopper API
GH_Box.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace