Grasshopper API
ModelContent.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelData.CastTo<T>(T).)
Top
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace