Grasshopper API
GH_Version Constructor
Overload List
Name | Description
GH_Version(GH_Version)
 Copy constructor. Duplicate an existing version structure.
GH_Version(Int32, Int32, Int32)
 Default constructor. Create a new version from specified fields.
Top
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace