Grasshopper API
GH_InputParamManager.AddComplexNumberParameter Method
Overload List
Name | Description
AddComplexNumberParameter(String, String, String, GH_ParamAccess)
 Add a Complex Number parameter to the input list of this component.
AddComplexNumberParameter(String, String, String, GH_ParamAccess, GH_ComplexNumber)
 Add a Complex Number parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace