Grasshopper API
ModelUnitSystem Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelUnitSystem to ModelUnitSystem.Value)
Implicit(ModelUnitSystem.Value to ModelUnitSystem)
Top
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace