Grasshopper API
GH_InputParamManager.AddTimeParameter Method
Overload List
Name | Description
AddTimeParameter(String, String, String, GH_ParamAccess)
 Add a Time parameter to the input list of this component.
AddTimeParameter(String, String, String, GH_ParamAccess, DateTime)
 Add a Time parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace