Grasshopper API
GH_IWriter.SetByteArray Method
Overload List
Name | Description
SetByteArray(String, Byte[])
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetByteArray(String, Int32, Byte[])
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace