Grasshopper API
GH_DebugDescriptionWriter.WriteLine Method
Overload List
Name | Description
WriteLine()
 Write a new blank line to the log.
WriteLine(String)
 Write a new line to the log.
WriteLine(String, Object[])
 Write a new formatted line to the log.
Top
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace