Grasshopper API
GH_ResizeBorder Constructor
Overload List
Name | Description
GH_ResizeBorder(GH_Border)
 Create a new instance of the GH_ResizeBorder class.
GH_ResizeBorder(RectangleF, GH_BorderTopology)
 Create a new instance of the GH_ResizeBorder class.
Top
See Also
Reference
GH_ResizeBorder Class
Grasshopper.GUI.Canvas Namespace