Grasshopper API
GH_OutputParamManager.Register_MatrixParam Method
Overload List
Name | Description
Register_MatrixParam(String, String, String)
 Register a new matrix parameter
Register_MatrixParam(String, String, String, GH_ParamAccess)
 Register a new matrix parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace