Grasshopper API
GH_DocumentIO.Open Method
Overload List
Name | Description
Open()
 Perform a default Open operation and store the result as the internal document.
Open(String)
 Open the file at the given location.
Top
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace