Grasshopper API
GH_Chunk.SetDrawingPointF Method
Overload List
Name | Description
SetDrawingPointF(String, PointF)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingPointF(String, Int32, PointF)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace