Grasshopper API
ModelRenderEnvironment Constructor
Overload List
Name | Description
ModelRenderEnvironment()
Initializes a new instance of the ModelRenderEnvironment class
ModelRenderEnvironment(ModelRenderEnvironment.Attributes)
Initializes a new instance of the ModelRenderEnvironment class
ModelRenderEnvironment(Guid)
Initializes a new instance of the ModelRenderEnvironment class
ModelRenderEnvironment(RenderEnvironment)
Initializes a new instance of the ModelRenderEnvironment class
Top
See Also
Reference
ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render Namespace