Grasshopper API
GH_Theme Constructor
Overload List
Name | Description
GH_Theme()
 Create a new default theme.
GH_Theme(GH_Theme)
 Make a duplicate of another theme.
Top
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace