Grasshopper API
GH_FileWatcher.CreateDirectoryWatcher Method
Overload List
Name | Description
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents, GH_FileWatcher.FileChanged)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents, GH_FileWatcher.FileChangedSimple)
 Create a new FileSystem Watcher object aimed at a specific file.
Top
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace