Grasshopper API
GH_ObjectChangedEventArgs Constructor
Overload List
Name | Description
GH_ObjectChangedEventArgs(IGH_DocumentObject, GH_ObjectEventType)
Initializes a new instance of the GH_ObjectChangedEventArgs class
GH_ObjectChangedEventArgs(IGH_DocumentObject, String)
Initializes a new instance of the GH_ObjectChangedEventArgs class
GH_ObjectChangedEventArgs(IGH_DocumentObject, GH_ObjectEventType, Object)
Initializes a new instance of the GH_ObjectChangedEventArgs class
GH_ObjectChangedEventArgs(IGH_DocumentObject, String, Object)
Initializes a new instance of the GH_ObjectChangedEventArgs class
Top
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace