Grasshopper API
GH_Document.ToggleEnabledFlags Method
Overload List
Name | Description
ToggleEnabledFlags()
 Toggle the enabled flags of all selected objects
ToggleEnabledFlags(List<IGH_DocumentObject>)
 Toggle the enabled flags of all specified objects
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace