Grasshopper API
GH_DocumentIO.Copy Method
Overload List
Name | Description
Copy(GH_ClipboardType)
 Copy the internal document into the clipboard.
Copy(GH_ClipboardType, Boolean)
 Copy the internal document into the clipboard.
Copy(GH_ClipboardType, IEnumerable<Guid>)
 Copy the specified objects in the internal document into the clipboard.
Top
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace