Grasshopper API
GH_GraphicsUtil.BoxClosestPoint Method
Overload List
Name | Description
BoxClosestPoint(Point, Rectangle)
 Find the closest point on or in a box given a test point.
BoxClosestPoint(PointF, RectangleF)
 Find the closest point on or in a box given a test point.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace