Grasshopper API
ObjectRenderMaterial Constructor
Overload List
Name | Description
ObjectRenderMaterial()
Initializes a new instance of the ObjectRenderMaterial class
ObjectRenderMaterial(ObjectRenderMaterial.Value)
Initializes a new instance of the ObjectRenderMaterial class
Top
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace