Grasshopper API
GH_DocumentEditor.ScriptAccess_SaveDocumentAs Method
Overload List
Name | Description
ScriptAccess_SaveDocumentAs()
 Saves the currently active document to disk.
ScriptAccess_SaveDocumentAs(String)
 Saves the currently active document to disk.
Top
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace