Grasshopper API
GH_Chunk.SetDate Method
Overload List
Name | Description
SetDate(String, DateTime)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDate(String, Int32, DateTime)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace