Grasshopper API
GH_Chunk.SetDrawingRectangle Method
Overload List
Name | Description
SetDrawingRectangle(String, Rectangle)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingRectangle(String, Int32, Rectangle)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace