Grasshopper API
GH_PaletteStyle Constructor
Overload List
Name | Description
GH_PaletteStyle(Color)
 Construct a new GH_Box_Palette_Colours instance with a single base colour.
GH_PaletteStyle(Color, Color)
 Construct a new GH_Box_Palette_Colours instance.
GH_PaletteStyle(Color, Color, Color)
 Construct a new GH_Box_Palette_Colours instance.
Top
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace