Grasshopper API
IGH_DataAccess.SetDataTree Method
Overload List
Name | Description
SetDataTree(Int32, IGH_DataTree)
 Folds a utility tree representation into this tree.
SetDataTree(Int32, IGH_Structure)
 Folds a utility tree representation into this tree.
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace