Grasshopper API
Scale Constructor
Overload List
Name | Description
Scale()
Initializes a new instance of the Scale class
Scale(Plane, Double)
Initializes a new instance of the Scale class
Scale(Point3d, Double)
Initializes a new instance of the Scale class
Scale(Plane, Double, Double, Double)
Initializes a new instance of the Scale class
Top
See Also
Reference
Scale Class
Grasshopper.Kernel.Types.Transforms Namespace