Grasshopper API
GH_Lexer.PerformLexicalReplace Method
Overload List
Name | Description
PerformLexicalReplace<T>(GH_Lexer, GH_Lexer, DataTree<T>, DataTree<T>)
 Lexical Find..Replace operations.
PerformLexicalReplace<T>(GH_Lexer, GH_Lexer, IGH_Structure, GH_Structure<T>)
 Lexical Find..Replace operations.
Top
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace