Grasshopper API
GH_DocumentEditor.ScriptAccess_OpenDocument Method
Overload List
Name | Description
ScriptAccess_OpenDocument()
 Displays a command line interface for File Open... then loads that file into the Canvas.
ScriptAccess_OpenDocument(String)
 Loads a specific file off the hard disk into the Canvas.
Top
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace