Grasshopper API
GH_Chunk.SetDrawingSize Method
Overload List
Name | Description
SetDrawingSize(String, Size)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetDrawingSize(String, Int32, Size)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace