Grasshopper API
GH_MemoryBitmap.Colour Method
Overload List
Name | Description
Colour(Int32, Int32)
 Gets the colour at the given pixel coordinates.
Colour(Int32, Int32, Color)
 Sets the colour at the given pixel coordinates.
Top
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace