Grasshopper API
GH_UndoRecord Constructor
Overload List
Name | Description
GH_UndoRecord()
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String)
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String, IGH_UndoAction)
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String, IGH_UndoAction[])
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String, IEnumerable<IGH_UndoAction>)
Initializes a new instance of the GH_UndoRecord class
Top
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace