Grasshopper API
ObjectDisplayColor.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ModelValue.Equals(Object).)
Top
See Also
Reference
ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace