Grasshopper API
GH_IWriter.SetInterval1D Method
Overload List
Name | Description
SetInterval1D(String, GH_Interval1D)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetInterval1D(String, Int32, GH_Interval1D)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_IWriter Interface
GH_IO.Serialization Namespace