Grasshopper API
GH_Archive.MessageCount Method
Overload List
Name | Description
MessageCount()
 Gets the number of messages recorded since the most recent IO operation began.
MessageCount(Boolean, Boolean, Boolean)
 Gets the number of messages recorded since the most recent IO operation began. Message count can be filtered by message type.
Top
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace