Grasshopper API
ModelLineWidth.Equals Method
Overload List
Name | Description
Equals(ModelLineWidth)
Equals(Object) |  (Overrides Object.Equals(Object).)
Top
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace