Grasshopper API
GH_GeometryGroup.LoadGeometry Method
Overload List
Name | Description
LoadGeometry()
LoadGeometry(RhinoDoc)
Top
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace