Grasshopper API
IGH_Structure.Graft Method
Overload List
Name | Description
Graft(GH_GraftMode)
 Grafts all paths by reallocating all data into child paths.
Graft(GH_GraftMode, GH_Path)
 Grafts a specific path by reallocating all data into child paths. If a grafted path coincides with an existing path, the data item in question will be appended to the existing path.
Top
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace