Grasshopper API
GH_Viewport.Focus Method
Overload List
Name | Description
Focus(IGH_Attributes)
 Look at a specific object.
Focus(List<IGH_Attributes>)
 Look at a set of specific objects.
Focus(Point)
 Look at a specific point.
Focus(PointF)
 Look at a specific point.
Top
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace