Grasshopper API
GH_Chunk.GetInt64 Method
Overload List
Name | Description
GetInt64(String)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
GetInt64(String, Int32)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace