Grasshopper API
GH_InputParamManager.AddIntervalParameter Method
Overload List
Name | Description
AddIntervalParameter(String, String, String, GH_ParamAccess)
 Add an Interval (i.e. numeric domain) parameter to the input list of this component.
AddIntervalParameter(String, String, String, GH_ParamAccess, Interval)
 Add an Interval (i.e. numeric domain) parameter to the input list of this component.
AddIntervalParameter(String, String, String, GH_ParamAccess, IEnumerable<Interval>)
 Add an Interval (i.e. numeric domain) parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace