Grasshopper API
GH_WindowsFormUtil.CenterFormOnScreen Method
Overload List
Name | Description
CenterFormOnScreen(Form, Boolean)
 Positions a Form so that it is centered on the current screen. The current screen being defined as the screen containing the cursor.
CenterFormOnScreen(Window, Boolean)
 Positions a Form so that it is centered on the current screen. The current screen being defined as the screen containing the cursor.
Top
See Also
Reference
GH_WindowsFormUtil Class
Grasshopper.GUI Namespace