Grasshopper API
GH_OutputParamManager.Register_SurfaceParam Method
Overload List
Name | Description
Register_SurfaceParam(String, String, String)
 Register a new 3D surface parameter
Register_SurfaceParam(String, String, String, GH_ParamAccess)
 Register a new 3D surface parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace