Grasshopper API
GH_RadialDimension Constructor
Overload List
Name | Description
GH_RadialDimension()
 Default constructor, creates an invalid radial dimension.
GH_RadialDimension(GH_RadialDimension)
 Create a duplicate of another GH_RadialDimension. This constructor also copies reference data.
GH_RadialDimension(Guid)
 Create a new referenced radial dimension that references a Rhino dimension with the specified ID.
GH_RadialDimension(RadialDimension)
 Create a duplicate of an existing radial dimension.
GH_RadialDimension(RadialDimension, ModelAnnotationStyle)
 Create a duplicate of an existing radial dimension.
Top
See Also
Reference
GH_RadialDimension Class
Grasshopper.Kernel.Types Namespace