Grasshopper API
GH_Chunk.SetSingle Method
Overload List
Name | Description
SetSingle(String, Single)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetSingle(String, Int32, Single)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace