Grasshopper API
ModelHatchLine Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelHatchLine.Attributes to ModelHatchLine)
Implicit(HatchLine to ModelHatchLine)
Top
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace