Grasshopper API
GH_Box.LoadGeometry Method
Overload List
Name | Description
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace