Grasshopper API
GH_IReader.TryGetBoundingBox Method
Overload List
Name | Description
TryGetBoundingBox(String, GH_BoundingBox)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetBoundingBox(String, Int32, GH_BoundingBox)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace