Grasshopper API
ModelNamedConstructionPlane.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
Top
See Also
Reference
ModelNamedConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace