Grasshopper API
Value.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
CompareTo(ObjectSectionStyle.Value)
Top
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace