Grasshopper API
VersionNumber.TryParse Method
Overload List
Name | Description
TryParse(String, VersionNumber)
 Converts the specified string representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
TryParse(Version, VersionNumber)
 Attempt so convert the System.Version representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
Top
See Also
Reference
VersionNumber Structure
GH_IO Namespace