Grasshopper API
ModelLayer Constructor
Overload List
Name | Description
ModelLayer()
Initializes a new instance of the ModelLayer class
ModelLayer(ModelLayer.Attributes)
Initializes a new instance of the ModelLayer class
ModelLayer(Guid)
Initializes a new instance of the ModelLayer class
ModelLayer(Layer)
Initializes a new instance of the ModelLayer class
Top
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace