Grasshopper API
GH_InstanceReference Constructor
Overload List
Name | Description
GH_InstanceReference()
 Default constructor.
GH_InstanceReference(GH_InstanceReference)
 Create a duplicate of another instance reference.
GH_InstanceReference(Guid)
 Create a new instance reference to a Rhino instance reference object with the specified ID.
GH_InstanceReference(InstanceReferenceGeometry)
 Create a new instance reference with the specified instance-reference-geometry.
GH_InstanceReference(Transform)
 Create a transformed empty instance reference.
GH_InstanceReference(InstanceReferenceGeometry, ModelInstanceDefinition)
 Create a new instance reference with the specified instance-reference-geometry and instance-definition.
GH_InstanceReference(Transform, ModelInstanceDefinition)
 Create a transformed instance reference of the specified instance-definition.
Top
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace