Grasshopper API
Param_RadialDimension.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_RadialDimension Class
Grasshopper.Kernel.Parameters Namespace