Grasshopper API
ModelHatchPattern Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelHatchPattern.Attributes to ModelHatchPattern)
Implicit(HatchPattern to ModelHatchPattern)
Implicit(String to ModelHatchPattern)
Top
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace