Grasshopper API
GH_Chunk.SetBoundingBox Method
Overload List
Name | Description
SetBoundingBox(String, GH_BoundingBox)
 Add a new data item to this chunk. The name must be unique or an exception will be thrown.
SetBoundingBox(String, Int32, GH_BoundingBox)
 Add a new data item to this chunk. The combination of name and index must be unique or an exception will be thrown.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace