Grasshopper API
PageSettings Constructor
Overload List
Name | Description
PageSettings()
Initializes a new instance of the PageSettings class
PageSettings(PageSettings.Attributes)
Initializes a new instance of the PageSettings class
Top
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace