Grasshopper API
GH_OutputParamManager.Register_IntegerParam Method
Overload List
Name | Description
Register_IntegerParam(String, String, String)
 Register a new Integer primitive parameter
Register_IntegerParam(String, String, String, GH_ParamAccess)
 Register a new Integer primitive parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace