Grasshopper API
GH_GraphicsUtil.OffsetColour Method
Overload List
Name | Description
OffsetColour(Color, Int32)
 Add a fixed value to all the channels in a colour.
OffsetColour(Color, Int32, Int32, Int32)
 Add a fixed value to all the channels in a colour.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace