Grasshopper API
GH_GDI_Util.Freeform_Blob Method
Overload List
Name | Description
Freeform_Blob(IEnumerable<RectangleF>, Int32, Double)
 Create a meta-ball outline for a set of rectangles.
Freeform_Blob(IEnumerable<RectangleF>, Int32, Double, FieldSolver, Double)
 Create a meta-ball outline for a set of rectangles.
Top
See Also
Reference
GH_GDI_Util Class
Grasshopper.GUI Namespace