Grasshopper API
GH_InputParamManager.AddBooleanParameter Method
Overload List
Name | Description
AddBooleanParameter(String, String, String, GH_ParamAccess)
 Add a Boolean parameter to the input list of this component.
AddBooleanParameter(String, String, String, GH_ParamAccess, Boolean)
 Add a Boolean parameter to the input list of this component.
AddBooleanParameter(String, String, String, GH_ParamAccess, IEnumerable<Boolean>)
 Add a Boolean parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace