Grasshopper API
ObjectDrafting.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace