Grasshopper API
GH_UpgradeUtil.MigrateOutputParameters Method
Overload List
Name | Description
MigrateOutputParameters(IGH_Component, IGH_Component)
 Migrate all output parameters.
MigrateOutputParameters(IGH_Component, IGH_Component, Int32[], Int32[])
 Migrate a bunch of output parameters.
Top
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace