Grasshopper API
GH_Guid Constructor
Overload List
Name | Description
GH_Guid()
 Blank constructor
GH_Guid(GH_Guid)
Initializes a new instance of the GH_Guid class
GH_Guid(Guid)
Initializes a new instance of the GH_Guid class
Top
See Also
Reference
GH_Guid Class
Grasshopper.Kernel.Types Namespace