Grasshopper API
GH_SettingsCategory Constructor
Overload List
Name | Description
GH_SettingsCategory(String, Bitmap)
 Create a new top-level category.
GH_SettingsCategory(String, String, Bitmap)
 Create a new nested category.
Top
See Also
Reference
GH_SettingsCategory Class
Grasshopper.GUI Namespace