Grasshopper API
GH_Point.ReferenceType Method
Overload List
Name | Description
ReferenceType()
 Retrieve the reference type of this point object.
ReferenceType(GH_PointRefType)
 Sets the type of the point reference data.
Top
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace