Grasshopper API
GH_IReader.ItemExists Method
Overload List
Name | Description
ItemExists(String)
 Checks whether an item with the specified name exists. Only items without index qualifiers are considered. Name comparisons are not case-sensitive.
ItemExists(String, Int32)
 Checks whether an item with the specified name and index exists. Only items with index qualifiers are considered. Name comparisons are not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace