Grasshopper API
IGH_DataAccess.DisableGapLogic Method
Overload List
Name | Description
DisableGapLogic()
 Call this function if you want to disable the gap null logic for the current iteration.
DisableGapLogic(Int32)
 Call this function if you want to disable the gap null logic for a specific output parameter.
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace