Grasshopper API
GH_Document.MergeDocument Method
Overload List
Name | Description
MergeDocument(GH_Document)
 Hoist all objects from another document into this one.
MergeDocument(GH_Document, Boolean)
 Hoist all objects from another document into this one.
MergeDocument(GH_Document, Boolean, Boolean)
 Hoist all objects from another document into this one.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace