Grasshopper API
Value Constructor
Overload List
Name | Description
ObjectDraftingLineWidth.Value(Double)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
ObjectDraftingLineWidth.Value(ObjectPlotWeightSource)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
ObjectDraftingLineWidth.Value(ObjectPlotWeightSource, Double)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
Top
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace