Grasshopper API
GH_OutputParamManager.Register_BRepParam Method
Overload List
Name | Description
Register_BRepParam(String, String, String)
 Register a new 3D Brep parameter
Register_BRepParam(String, String, String, GH_ParamAccess)
 Register a new 3D Brep parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace