Grasshopper API
ModelUnitSystem Constructor
Overload List
Name | Description
ModelUnitSystem()
Initializes a new instance of the ModelUnitSystem class
ModelUnitSystem(ModelUnitSystem.Value)
Initializes a new instance of the ModelUnitSystem class
ModelUnitSystem(ActiveSpace, RhinoDoc)
Initializes a new instance of the ModelUnitSystem class
Top
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace