Grasshopper API
GH_InputParamManager.AddPlaneParameter Method
Overload List
Name | Description
AddPlaneParameter(String, String, String, GH_ParamAccess)
 Add a 3D Plane parameter to the input list of this component.
AddPlaneParameter(String, String, String, GH_ParamAccess, Plane)
 Add a 3D Plane parameter to the input list of this component.
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace