Grasshopper API
DataTree<T>.Add Method
Overload List
Name | Description
Add(T)
 Add (append) a data item to the last branch in the tree. If no branches exist yet, a new one will be created with [path = {0}]
Add(T, GH_Path)
 Add (append) a data item to the specified branch in the tree. If the branch doesn't exist yet, it will be created.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace