Grasshopper API
GH_MemoryBitmap.Filter_GreyScale Method
Overload List
Name | Description
Filter_GreyScale()
 Convert the image to a greyscale shadow of its former self.
Filter_GreyScale(Double)
 Convert the image to a greyscale shadow of its former self.
Top
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace