Grasshopper API
ModelTags Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelTags to String)
Implicit(String to ModelTags)
Top
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace