Grasshopper API
ModelLineWidth Constructor
Overload List
Name | Description
ModelLineWidth()
Initializes a new instance of the ModelLineWidth class
ModelLineWidth(Double)
Initializes a new instance of the ModelLineWidth class
Top
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace