Grasshopper API
GH_Structure<T>.EnsurePath Method
Overload List
Name | Description
EnsurePath(GH_Path)
 Create a new branch with the specified path if it doesn't already exists.
EnsurePath(Int32[])
 Create a new branch with the specified path if it doesn't already exists.
Top
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace