Grasshopper API
GH_IndexRange.Contains Method
Overload List
Name | Description
Contains(GH_IndexRange)
 Tests whether a specified range is entirely contained within this range.
Contains(Int32)
 Tests whether a specified index is defined by this range.
Top
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace