Grasshopper API
AnnotationArrowSettings Constructor
Overload List
Name | Description
AnnotationArrowSettings()
Initializes a new instance of the AnnotationArrowSettings class
AnnotationArrowSettings(AnnotationArrowSettings.Attributes)
Initializes a new instance of the AnnotationArrowSettings class
AnnotationArrowSettings(DimensionStyle)
Initializes a new instance of the AnnotationArrowSettings class
Top
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace