Grasshopper API
GH_OutputParamManager.Register_ArcParam Method
Overload List
Name | Description
Register_ArcParam(String, String, String)
 Register a new 3D arc parameter
Register_ArcParam(String, String, String, GH_ParamAccess)
 Register a new 3D arc parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace