Grasshopper API
ModelUserText.RemoveRange Method
Overload List
Name | Description
RemoveRange(IEnumerable<KeyValuePair<String, String>>)
RemoveRange(IEnumerable<String>)
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace