Grasshopper API
GH_Chunk.TryGetDrawingRectangle Method
Overload List
Name | Description
TryGetDrawingRectangle(String, Rectangle)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingRectangle(String, Int32, Rectangle)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace