Grasshopper API
Value Constructor
Overload List
Name | Description
ItemDisplayColor.Value(ItemColorSource)
Initializes a new instance of the ItemDisplayColor.Value class
ItemDisplayColor.Value(ModelColor)
Initializes a new instance of the ItemDisplayColor.Value class
ItemDisplayColor.Value(ItemColorSource, ModelColor)
Initializes a new instance of the ItemDisplayColor.Value class
Top
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace