Grasshopper API
GH_Brep.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace