Grasshopper API
GH_OutputParamManager.RegisterParam Method
Overload List
Name | Description
RegisterParam(IGH_Param)
 Generic parameter registration. This class provides methods to register standard parameters, but if you have a special type you're in charge of setting it all up yourself.
RegisterParam(IGH_Param, GH_ParamAccess)
 Generic parameter registration. This class provides methods to register standard parameters, but if you have a special type you're in charge of setting it all up yourself.
RegisterParam(IGH_Param, String, String, String)
 Generic parameter registration. This class provides methods to register standard parameters, but if you have a special type you're in charge of setting it all up yourself.
RegisterParam(IGH_Param, String, String, String, GH_ParamAccess)
 Generic parameter registration. This class provides methods to register standard parameters, but if you have a special type you're in charge of setting it all up yourself.
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace