Grasshopper API
GH_CapsuleRenderEngine.CreateRoundedRectangle Method
Overload List
Name | Description
CreateRoundedRectangle(Rectangle, Int32)
 Static (Shared in VB) method for creating rectangles with rounded corners.
CreateRoundedRectangle(RectangleF, Single)
 Static (Shared in VB) method for creating rectangles with rounded corners.
CreateRoundedRectangle(Rectangle, Int32, Int32, Int32, Int32)
 Static (Shared in VB) method for creating rectangles with rounded corners.
CreateRoundedRectangle(RectangleF, Single, Single, Single, Single)
 Static (Shared in VB) method for creating rectangles with rounded corners.
Top
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace