Grasshopper API
GH_OutputParamManager.Register_VectorParam Method
Overload List
Name | Description
Register_VectorParam(String, String, String)
 Register a new 3D vector parameter
Register_VectorParam(String, String, String, GH_ParamAccess)
 Register a new 3D vector parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace