Grasshopper API
GH_Document.ScheduleSolution Method
Overload List
Name | Description
ScheduleSolution(Int32)
 Schedule a new solution after a specified time interval. The schedule is erased if another solution is triggered before the schedule is executed. Tight schedules override loose schedules. If this method is called during a solution, the schedule will be started after the current solution completes.
ScheduleSolution(Int32, GH_Document.GH_ScheduleDelegate)
 Schedule a new solution after a specified time interval. The schedule is erased if another solution is triggered before the schedule is executed. Tight schedules override loose schedules. If this method is called during a solution, the schedule will be started after the current solution completes.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace