Grasshopper API
ObjectDraftingLineWidth Implicit Conversion Operators
Overload List
Name | Description
Implicit(ObjectDraftingLineWidth to ObjectDraftingLineWidth.Value)
Implicit(ObjectDraftingLineWidth.Value to ObjectDraftingLineWidth)
Top
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace