Grasshopper API
ModelObject Implicit Conversion Operators
Overload List
Name | Description
Implicit(ModelObject.Attributes to ModelObject)
Implicit(RhinoObject to ModelObject)
Top
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace