Grasshopper API
GH_Chunk.TryGetDrawingColor Method
Overload List
Name | Description
TryGetDrawingColor(String, Color)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetDrawingColor(String, Int32, Color)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace