Grasshopper API
GH_GraphicsUtil.SolveArc Method
Overload List
Name | Description
SolveArc(Point3d, Point3d, Vector3d, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
SolveArc(PointF, PointF, SizeF, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
SolveArc(Double, Double, Double, Double, Double, Double, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace