Grasshopper API
GH_PersistentParam<T>.SetPersistentData Method
Overload List
Name | Description
SetPersistentData(T)
 Add a single item to the persistent data. This method will record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add more than one piece of data, you should use the appropriate overload for this method.
SetPersistentData(GH_Structure<T>)
 Assign a tree of items to the persistent data. This method will erase any existing data, record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add a tree of data, you should use the appropriate overload for this method.
SetPersistentData(IEnumerable<T>)
 Assign a list of items to the persistent data. This method will erase any existing data, record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add a tree of data, you should use the appropriate overload for this method.
SetPersistentData(Object[])
 Add a collection of values to the persistent data.
Top
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace