Grasshopper API
GH_Integer.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Integer Class
Grasshopper.Kernel.Types Namespace