Grasshopper API
Orientation Constructor
Overload List
Name | Description
Orientation()
Initializes a new instance of the Orientation class
Orientation(Plane, Plane)
Initializes a new instance of the Orientation class
Top
See Also
Reference
Orientation Class
Grasshopper.Kernel.Types.Transforms Namespace