Grasshopper API
GH_Capsule.AddOutputGrip Method
Overload List
Name | Description
AddOutputGrip(Point)
 Add an output grip to this UI Box.
AddOutputGrip(PointF)
 Add an output grip to this UI Box.
AddOutputGrip(Single)
 Add an output grip to this UI Box. This is the recommended overload.
AddOutputGrip(Single, Single)
 Add an output grip to this UI Box.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace