Grasshopper API
VersionNumber Constructor
Overload List
Name | Description
VersionNumber(Version)
 Construct VersionNumber based on existing System.Version class.
VersionNumber(Int32, Int32, DateTime, VersionNumber.Branch)
 Initializes a new instance of the VersionNumber structure to the version specified by the parameters.
VersionNumber(Int32, Int32, Int32, Int32)
 Initializes a new instance of the VersionNumber structure to the version specified by the version quartet values.
Top
See Also
Reference
VersionNumber Structure
GH_IO Namespace