Grasshopper API
GH_Chunk.TryGetGuid Method
Overload List
Name | Description
TryGetGuid(String, Guid)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetGuid(String, Int32, Guid)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace