Grasshopper API
GH_Document.FindAttributeByGrip Method
Overload List
Name | Description
FindAttributeByGrip(PointF, Boolean, Int32)
 Search for attributes that contain grips near the search locus
FindAttributeByGrip(PointF, Boolean, Boolean, Boolean, Int32)
 Search for attributes that contain grips near the search locus
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace