Grasshopper API
GH_DigitNumber Constructor
Overload List
Name | Description
GH_DigitNumber(GH_DigitNumber)
 Create an exact duplicate of another GH_DigitNumber instance.
GH_DigitNumber(Int32)
 Create a new GH_DigitNumber instance with the specified number of decimal places.
GH_DigitNumber(Int32, Int32)
 Create a new GH_DigitNumber instance with the specified number of decimal places and a given radix position.
Top
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace