Grasshopper API
GH_GHXHarvester.HarvestPivots Method
Overload List
Name | Description
HarvestPivots(GH_Archive)
 Harvest all attribute pivots from a GHX/GH archive.
HarvestPivots(GH_IReader)
 Harvest all attribute pivots from a GHX/GH node.
HarvestPivots(String)
 Harvest all attribute pivots from a GHX/GH archive.
Top
See Also
Reference
GH_GHXHarvester Class
Grasshopper.Kernel Namespace