Grasshopper API
AnnotationDimensionSettings Constructor
Overload List
Name | Description
AnnotationDimensionSettings()
Initializes a new instance of the AnnotationDimensionSettings class
AnnotationDimensionSettings(AnnotationDimensionSettings.Attributes)
Initializes a new instance of the AnnotationDimensionSettings class
AnnotationDimensionSettings(DimensionStyle)
Initializes a new instance of the AnnotationDimensionSettings class
Top
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace