Grasshopper API
IGH_BakeAwareObject.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
 Bake all the goemetry in this object in the given Rhino document.
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
 Bake all the goemetry in this object in the given Rhino document.
Top
See Also
Reference
IGH_BakeAwareObject Interface
Grasshopper.Kernel Namespace