Grasshopper API
GH_Plane.DrawPlane Method
Overload List
Name | Description
DrawPlane(DisplayPipeline, Plane)
 Draw a plane with default colours and default size.
DrawPlane(DisplayPipeline, Plane, Double, Int32)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color, Color)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color, Color, Color)
Top
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace