Grasshopper API
GH_Material.CastTo Method
Overload List
Name | Description
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Top
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace