Grasshopper API
GH_Attributes<T>.NewInstanceGuid Method
Overload List
Name | Description
NewInstanceGuid()
 Generate a new instance GUID for the owner object.
NewInstanceGuid(Guid)
 Generate a new instance GUID for the owner object. Do not use this overload unless you're > 1.95m and called David.
Top
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace