Grasshopper API
GH_TextDot Constructor
Overload List
Name | Description
GH_TextDot()
 Default constructor, creates an invalid text dot.
GH_TextDot(GH_TextDot)
 Create a duplicate of another GH_TextDot. This constructor also copies reference data.
GH_TextDot(Guid)
 Create a new referenced text dot that references a Rhino text dot with the specified ID.
GH_TextDot(TextDot)
 Create a duplicate of an existing text dot.
Top
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace