Grasshopper API
GH_GraphicsUtil.ShadowHorizontal Method
Overload List
Name | Description
ShadowHorizontal(Graphics, Int32, Int32, Int32, Int32, Boolean, Color)
 Draws a horizontal shadow edge.
ShadowHorizontal(Graphics, Int32, Int32, Int32, Int32, Boolean, Int32)
 Draws a horizontal shadow edge.
ShadowHorizontal(Graphics, Single, Single, Single, Single, Boolean, Int32)
 Draws a horizontal shadow edge.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace