Grasshopper API
GH_MouseTracker.DropFrames Method
Overload List
Name | Description
DropFrames(DateTime)
 Drop all frames older than a given limit.
DropFrames(Double)
 Find the youngest frame that deviates too much from the current locus and drop it and everything preceding it.
DropFrames(Double, Point)
 Find the youngest frame that deviates too much from the given locus and drop it and everything preceding it.
Top
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace