Grasshopper API
GH_GraphicsUtil.DentVertical Method
Overload List
Name | Description
DentVertical(Graphics, Rectangle)
 Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
DentVertical(Graphics, Rectangle, Int32, Int32)
 Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace