Grasshopper API
Value.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
CompareTo(ModelUnitSystem.Value)
Top
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace