Grasshopper API
ObjectDraftingLineWidth Constructor
Overload List
Name | Description
ObjectDraftingLineWidth()
Initializes a new instance of the ObjectDraftingLineWidth class
ObjectDraftingLineWidth(ObjectDraftingLineWidth.Value)
Initializes a new instance of the ObjectDraftingLineWidth class
Top
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace