Grasshopper API
GH_Capsule.AddInputGrip Method
Overload List
Name | Description
AddInputGrip(Point)
 Add an input grip to this UI Box.
AddInputGrip(PointF)
 Add an input grip to this UI Box.
AddInputGrip(Single)
 Add an input grip to this UI Box. This is the recommended overload.
AddInputGrip(Single, Single)
 Add an input grip to this UI Box.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace