Grasshopper API
GH_Structure<T>.DataItem Property
Overload List
Name | Description
DataItem[Int32]
 Gets the item at a given offset. The structure is treated as a linear list in this case. If index is out of range, null is returned. For repeated indexed retrieval, consider using a For Each loop since the enumerator is more efficient.
DataItem[GH_Path, Int32]
 Gets a direct pointer to a data item under a specific path and index.
Top
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace