Grasshopper API
GH_OutputParamManager.Register_BoxParam Method
Overload List
Name | Description
Register_BoxParam(String, String, String)
 Register a new 3D box parameter
Register_BoxParam(String, String, String, GH_ParamAccess)
 Register a new 3D box parameter
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace