Grasshopper API
GH_UndoException Constructor
Overload List
Name | Description
GH_UndoException(String)
Initializes a new instance of the GH_UndoException class
GH_UndoException(String, Object[])
Initializes a new instance of the GH_UndoException class
Top
See Also
Reference
GH_UndoException Class
Grasshopper.Kernel.Undo Namespace