Grasshopper API
ObjectDrafting Constructor
Overload List
Name | Description
ObjectDrafting()
Initializes a new instance of the ObjectDrafting class
ObjectDrafting(ObjectDrafting.Attributes)
Initializes a new instance of the ObjectDrafting class
Top
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace