Grasshopper API
DataTree<T>.AddRange Method
Overload List
Name | Description
AddRange(IEnumerable<T>)
 Add (append) a list of data items to the last branch in the tree. If no branch exists yet, a new one will be created.
AddRange(IEnumerable<T>, GH_Path)
 Add (append) a list of data items to the specified branch in the tree. If the branch doesn't exist yet, it will be created.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace