Grasshopper API
IGH_Structure.Branch Property
Overload List
Name | Description
Branch[GH_Path]
 Gets a limited access pointer to the data list associated with a certain path.
Branch[Int32]
 Gets a limited access pointer to the data list at the specified index.
Top
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace