Grasshopper API
GH_Param<T>.RemoveSource Method
Overload List
Name | Description
RemoveSource(Guid)
 Remove the specified source from this parameter.
RemoveSource(IGH_Param)
 Remove the specified source from this parameter.
Top
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace