Grasshopper API
Param_LinearDimension.BakeGeometry Method
Overload List
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Top
See Also
Reference
Param_LinearDimension Class
Grasshopper.Kernel.Parameters Namespace