Grasshopper API
ModelRenderMaterial Constructor
Overload List
Name | Description
ModelRenderMaterial()
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(ModelRenderMaterial.Attributes)
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(Guid)
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(Material)
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(RenderMaterial)
Initializes a new instance of the ModelRenderMaterial class
Top
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace