Grasshopper API
GH_Gradient.NearestGrip Method
Overload List
Name | Description
NearestGrip(Double)
 Find the nearest grip to a parameter.
NearestGrip(Double, GH_GripSide)
 Find the nearest grip to a parameter.
NearestGrip(RectangleF, PointF, Double)
 Find the nearest grip in screen coordinates.
Top
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace