Grasshopper API
GH_StructurePath Constructor
Overload List
Name | Description
GH_StructurePath()
 Blank constructor
GH_StructurePath(GH_Path)
Initializes a new instance of the GH_StructurePath class
GH_StructurePath(GH_StructurePath)
Initializes a new instance of the GH_StructurePath class
Top
See Also
Reference
GH_StructurePath Class
Grasshopper.Kernel.Types Namespace