Grasshopper API
AnnotationToleranceSettings Constructor
Overload List
Name | Description
AnnotationToleranceSettings()
Initializes a new instance of the AnnotationToleranceSettings class
AnnotationToleranceSettings(AnnotationToleranceSettings.Attributes)
Initializes a new instance of the AnnotationToleranceSettings class
AnnotationToleranceSettings(DimensionStyle)
Initializes a new instance of the AnnotationToleranceSettings class
Top
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace