Grasshopper API
GH_Matrix Constructor
Overload List
Name | Description
GH_Matrix()
 Blank constructor
GH_Matrix(GH_Matrix)
Initializes a new instance of the GH_Matrix class
GH_Matrix(Matrix)
Initializes a new instance of the GH_Matrix class
Top
See Also
Reference
GH_Matrix Class
Grasshopper.Kernel.Types Namespace