Grasshopper API
GH_Number Constructor
Overload List
Name | Description
GH_Number()
 Blank constructor
GH_Number(Double)
Initializes a new instance of the GH_Number class
GH_Number(GH_Number)
Initializes a new instance of the GH_Number class
Top
See Also
Reference
GH_Number Class
Grasshopper.Kernel.Types Namespace