Grasshopper API
GH_TextBoxInputBase.ShowTextInputBox Method
Overload List
Name | Description
ShowTextInputBox(Control, String, Boolean)
 Display a floating text-box on top of the owner control.
ShowTextInputBox(Control, String, Boolean, Boolean)
 Display a floating text-box on top of the owner control.
ShowTextInputBox(Control, String, Boolean, Boolean, Matrix)
 Display a floating text-box on top of the owner control.
Top
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace