Grasshopper API
GH_FileWatcher.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the GH_FileWatcher
Dispose(Boolean)
Releases the unmanaged resources used by the GH_FileWatcher and optionally releases the managed resources
Top
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace