Grasshopper API
GH_WindowsFormUtil.CenterFormOnEditor Method
Overload List
Name | Description
CenterFormOnEditor(Form, Boolean)
 Positions a Form so that it is centered on the active editor. If the editor doesn't exist or is hidden, the form will be centered on the screen instead.
CenterFormOnEditor(Window, Boolean)
 Positions a Form so that it is centered on the active editor. If the editor doesn't exist or is hidden, the form will be centered on the screen instead.
Top
See Also
Reference
GH_WindowsFormUtil Class
Grasshopper.GUI Namespace