Grasshopper API
GH_ComponentParamServer.UnregisterOutputParameter Method
Overload List
Name | Description
UnregisterOutputParameter(IGH_Param)
 Removes the specified parameter from this component.
UnregisterOutputParameter(IGH_Param, Boolean)
 Removes the specified parameter from this component.
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace