Grasshopper API
DataTree<T> Constructor
Overload List
Name | Description
DataTree<T>()
 Default constructor, create an empty data tree.
DataTree<T>(DataTree<T>)
 Create a shallow duplicate of another data tree. This means it will create a new tree that contains the same items.
DataTree<T>(DataTree<T>, DataTree<T>.DuplicateT)
 Create a true duplicate of another data tree.
DataTree<T>(IEnumerable<T>, GH_Path)
 Create a tree with a single branch
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace