Grasshopper API
GH_GraphicsUtil.Grid Method
Overload List
Name | Description
Grid(Graphics, RectangleF, Int32)
 Draw a default grid.
Grid(Graphics, RectangleF, Int32, Int32)
 Draw a default grid.
Grid(Graphics, RectangleF, Int32, Int32, Color, Color)
 Draw a grid.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace