Grasshopper API
GH_IReader.TryGetBoolean Method
Overload List
Name | Description
TryGetBoolean(String, Boolean)
 Gets the value of the item with the specified name. Name comparison is not case-sensitive.
TryGetBoolean(String, Int32, Boolean)
 Gets the value of the item with the specified name and index. Name comparison is not case-sensitive.
Top
See Also
Reference
GH_IReader Interface
GH_IO.Serialization Namespace