Grasshopper API
GH_Item._boundingbox Property
 Returns the internal data of this item cast to a BoundingBox. If the data is not stored as a BoundingBox, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_BoundingBox _boundingbox { get; }
Public ReadOnly Property _boundingbox As GH_BoundingBox
	Get
Property Value
Type: GH_BoundingBox
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._boundingbox"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace