Grasshopper API
GH_Archive.Path Property
 Gets the path to the file from which this archive was read and/or written to. If the archive hasn't been read or written yet, this field will be null.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string Path { get; set; }
Public Property Path As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.Path"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace