Grasshopper API
GH_Chunk.Items Property
 Gets a pointer to the internal list of items. Do not access this list unless you know what you are doing.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public List<GH_Item> Items { get; }
Public ReadOnly Property Items As List(Of GH_Item)
	Get
Property Value
Type: List<GH_Item>
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.Items"]
Implements
GH_IChunk.Items
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace