Grasshopper API
GH_IChunk.ChunkCount Property
 Gets the number of child chunks contained in this chunk. The set of all child chunks is referred to as a 'litter'.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
int ChunkCount { get; }
ReadOnly Property ChunkCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.ChunkCount"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace