Grasshopper API
ID.HasIndex Property
 Gets whether the index has been set.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasIndex { get; }
Public ReadOnly Property HasIndex As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.ID.HasIndex"]
See Also
Reference
ID Structure
GH_IO.Serialization Namespace