Grasshopper API
GH_Item.HasType Property
 Gets the type set validity of this item. The item is considered to have a type if type != GH_Types.unset
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasType { get; }
Public ReadOnly Property HasType As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Types.GH_Item.HasType"]
See Also
Reference
GH_Item Class
GH_IO.Types Namespace