Grasshopper API
GH_Item._drawing_rectangle Property
 Returns the internal data of this item cast to a Rectangle. If the data is not stored as a Rectangle, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Rectangle _drawing_rectangle { get; }
Public ReadOnly Property _drawing_rectangle As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._drawing_rectangle"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace