Grasshopper API
VersionNumber.Major Property
 Gets the major version number component of this instance.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int Major { get; }
Public ReadOnly Property Major As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.VersionNumber.Major"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace