Grasshopper API
GH_Item.HasName Property
 Gets the name validity of this item. The item is considered to have an invalid name if string.IsNullOrEmpty(name)
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasName { get; }
Public ReadOnly Property HasName As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Types.GH_Item.HasName"]
See Also
Reference
GH_Item Class
GH_IO.Types Namespace