Grasshopper API
GH_Item.Index Property
 Gets or sets the index of an item. Typically, indices are set at construction and do not change. If you change indices after construction, you could corrupt an archive.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
Negative indices are clamped to -1.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace