Grasshopper API
GH_Item._plane Property
 Returns the internal data of this item cast to a Plane. If the data is not stored as a Plane, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Plane _plane { get; }
Public ReadOnly Property _plane As GH_Plane
	Get
Property Value
Type: GH_Plane
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._plane"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace