Grasshopper API
VersionNumber.UnsetTime Property
 The value of an Unset VersionNumber.Time.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static DateTime UnsetTime { get; }
Public Shared ReadOnly Property UnsetTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:GH_IO.VersionNumber.UnsetTime"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace