Grasshopper API
GH_Item.HasIndex Property
 Gets the index existence implication. The item is considered to have an index qualifier if the index value is larger than or equal to zero.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasIndex { get; }
Public ReadOnly Property HasIndex As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Types.GH_Item.HasIndex"]
See Also
Reference
GH_Item Class
GH_IO.Types Namespace