Grasshopper API
ID.Index Property
 Gets the index of this ID, if there is no valid index then -1 is returned.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.ID.Index"]
See Also
Reference
ID Structure
GH_IO.Serialization Namespace