Grasshopper API
VersionNumber.MaxValid Property
 The largest possible valid VersionNumber.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static VersionNumber MaxValid { get; }
Public Shared ReadOnly Property MaxValid As VersionNumber
	Get
Property Value
Type: VersionNumber
[Missing <value> documentation for "P:GH_IO.VersionNumber.MaxValid"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace