Grasshopper API
GH_Chunk.Index Property
 Gets the index of this chunk. The index is set by the owner of this chunk. Indices smaller than zero imply no index has been set. The combination of name+index is always unique among a set of chunks in the same litter.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.Index"]
Implements
GH_IChunk.Index
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace