Grasshopper API
GH_Archive.GH_IO_Version Property
 Gets the version number of the current GH_IO build.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static GH_Version GH_IO_Version { get; }
Public Shared ReadOnly Property GH_IO_Version As GH_Version
	Get
Property Value
Type: GH_Version
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.GH_IO_Version"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace