Grasshopper API
GH_IChunk.Archive Property
 Gets a pointer to the archive that owns the Root of the tree this chunk belongs to.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
GH_Archive Archive { get; }
ReadOnly Property Archive As GH_Archive
	Get
Property Value
Type: GH_Archive
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.Archive"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace