Grasshopper API
VersionNumber.MinValidTime Property
 The smallest possible valid value of VersionNumber.Time. This field is read-only.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static DateTime MinValidTime { get; }
Public Shared ReadOnly Property MinValidTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:GH_IO.VersionNumber.MinValidTime"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace