Grasshopper API
VersionNumber.IsValid Property
 True when all information in the VersionNumber has valid values.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.VersionNumber.IsValid"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace