Grasshopper API
GH_DeveloperDetails.DefaultDeveloperContact Property
 Gets the default developer contact details.
 Namespace: GH_IO.UserInterface
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static string DefaultDeveloperContact { get; }
Public Shared ReadOnly Property DefaultDeveloperContact As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.UserInterface.GH_DeveloperDetails.DefaultDeveloperContact"]
See Also
Reference
GH_DeveloperDetails Class
GH_IO.UserInterface Namespace