Grasshopper API
GH_Chunk.HasName Property
 Gets the name validity of this item. The item is considered to have an invalid name if string.IsNullOrEmpty(name)
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasName { get; }
Public ReadOnly Property HasName As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.HasName"]
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace