Grasshopper API
GH_Archive.IsBinaryPath Property
 Gets a value that indicates whether the Path field points to a Binary Grasshopper file.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool IsBinaryPath { get; }
Public ReadOnly Property IsBinaryPath As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.IsBinaryPath"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace