Grasshopper API
VersionNumber.MaxMajorVersionNumber Property
 The largest possible valid value of VersionNumber.MajorVersionNumber.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static int MaxMajorVersionNumber { get; }
Public Shared ReadOnly Property MaxMajorVersionNumber As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.VersionNumber.MaxMajorVersionNumber"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace