Grasshopper API
GH_Item.Name Property
 Gets or sets the name of this item. Typically, names are set at construction and do not change. If you change names after construction, you could corrupt an archive.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Types.GH_Item.Name"]
Exceptions
Exception | Condition
ArgumentNullException | Thrown if the new name is null or empty.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace