Grasshopper API
GH_Item._drawing_color Property
 Returns the internal data of this item cast to a Color. If the data is not stored as a Color, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Color _drawing_color { get; }
Public ReadOnly Property _drawing_color As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._drawing_color"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace