Grasshopper API
GH_Item._line Property
 Returns the internal data of this item cast to a Line. If the data is not stored as a Line, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Line _line { get; }
Public ReadOnly Property _line As GH_Line
	Get
Property Value
Type: GH_Line
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._line"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace