Grasshopper API
GH_Item._point3d Property
 Returns the internal data of this item cast to a Point3D. If the data is not stored as a Point3D, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point3D _point3d { get; }
Public ReadOnly Property _point3d As GH_Point3D
	Get
Property Value
Type: GH_Point3D
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._point3d"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace