Grasshopper API
GH_Chunk.Chunks Property
 Gets a pointer to the internal list of child chunks. Do not access this list unless you know what you are doing.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public List<GH_IChunk> Chunks { get; }
Public ReadOnly Property Chunks As List(Of GH_IChunk)
	Get
Property Value
Type: List<GH_IChunk>
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.Chunks"]
Implements
GH_IChunk.Chunks
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace