Grasshopper API
GH_Item._interval2d Property
 Returns the internal data of this item cast to an Interval2D. If the data is not stored as an Interval2D, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval2D _interval2d { get; }
Public ReadOnly Property _interval2d As GH_Interval2D
	Get
Property Value
Type: GH_Interval2D
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._interval2d"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace