Grasshopper API
GH_Archive.GrasshopperXmlExtension Property
 Gets the file extension (including the dot) associated with Grasshopper® XML data.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static string GrasshopperXmlExtension { get; }
Public Shared ReadOnly Property GrasshopperXmlExtension As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.GrasshopperXmlExtension"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace