Grasshopper API
VersionNumber.Minor Property
 Gets the minor version number component of this instance.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int Minor { get; }
Public ReadOnly Property Minor As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.VersionNumber.Minor"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace