Grasshopper API
GH_IChunk.ArchiveLocation Property
 Gets a string representing the URI with which the archive is associated. The location may be a null string.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
string ArchiveLocation { get; }
ReadOnly Property ArchiveLocation As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.ArchiveLocation"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace