Grasshopper API
GH_Item.InternalData Property
 Retrieves the internal data of this item. No type casting is performed.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Object InternalData { get; }
Public ReadOnly Property InternalData As Object
	Get
Property Value
Type: Object
[Missing <value> documentation for "P:GH_IO.Types.GH_Item.InternalData"]
See Also
Reference
GH_Item Class
GH_IO.Types Namespace