Grasshopper API
GH_Archive.WorstCaseMessageType Property
 Gets the worst case message type. If the record contains at least 1 error, the worst case is GH_Message_Type.error. If the record contains no errors, but at least 1 warning, the worst case is GH_Message_Type.warning. If the record contains no messages or only infos, the worst case type is GH_Message_Type.info.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Message_Type WorstCaseMessageType { get; }
Public ReadOnly Property WorstCaseMessageType As GH_Message_Type
	Get
Property Value
Type: GH_Message_Type
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.WorstCaseMessageType"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace