Grasshopper API
GH_Item._guid Property
 Returns the internal data of this item cast to a Guid. If the data is not stored as a Guid, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Guid _guid { get; }
Public ReadOnly Property _guid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._guid"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace