Grasshopper API
GH_Archive.IsPath Property
 Gets a value that indicates whether or not the path field has been set.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool IsPath { get; }
Public ReadOnly Property IsPath As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.IsPath"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace