Grasshopper API
GH_Message.Message Property
 Gets the text content of this message.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string Message { get; }
Public ReadOnly Property Message As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Message.Message"]
See Also
Reference
GH_Message Class
GH_IO.Serialization Namespace