Grasshopper API
GH_IChunk.Chunks Property
 Gets a pointer to the internal list of child chunks. Do not access this list unless you know what you are doing.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
List<GH_IChunk> Chunks { get; }
ReadOnly Property Chunks As List(Of GH_IChunk)
	Get
Property Value
Type: List<GH_IChunk>
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.Chunks"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace