Grasshopper API
GH_IChunk.Name Property
 Gets the name of this chunk. The name is set by the owner of this chunk. Names must be at least 1 character long. The combination of name+index is always unique among a set of chunks in a single litter.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
string Name { get; }
ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.Name"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace