Grasshopper API
GH_Item._double Property
 Returns the internal data of this item cast to a Double. If the data is not stored as a Double, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public double _double { get; }
Public ReadOnly Property _double As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._double"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace