Grasshopper API
GH_Item._int64 Property
 Returns the internal data of this item cast to an Int64. If the data is not stored as an Int64, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public long _int64 { get; }
Public ReadOnly Property _int64 As Long
	Get
Property Value
Type: Int64
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._int64"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace