Grasshopper API
GH_Chunk.ChunkCount Property
 Gets the number of child chunks contained in this chunk. The set of all child chunks is referred to as a 'litter'.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int ChunkCount { get; }
Public ReadOnly Property ChunkCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.ChunkCount"]
Implements
GH_IChunk.ChunkCount
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace