Grasshopper API
VersionNumber.MinMinorVersionNumber Property
 The smallest possible valid value of VersionNumber.MinorVersionNumber.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static int MinMinorVersionNumber { get; }
Public Shared ReadOnly Property MinMinorVersionNumber As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.VersionNumber.MinMinorVersionNumber"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace