Grasshopper API
GH_Archive.IsXmlPath Property
 Gets a value that indicates whether the Path field points to an Xml Grasshopper file.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool IsXmlPath { get; }
Public ReadOnly Property IsXmlPath As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.IsXmlPath"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace