Grasshopper API
GH_Chunk.HasIndex Property
 Gets the index existence implication. The item is considered to have an index qualifier if the index value is larger than or equal to zero.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasIndex { get; }
Public ReadOnly Property HasIndex As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.HasIndex"]
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace