Grasshopper API
GH_Item._string Property
 Returns the internal data of this item cast to a String. If the data is not stored as a String, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string _string { get; }
Public ReadOnly Property _string As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._string"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace