Grasshopper API
VersionNumber.Time Property
 Gets the version time component of this instance.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public DateTime Time { get; }
Public ReadOnly Property Time As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:GH_IO.VersionNumber.Time"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace