Grasshopper API
VersionNumber.MinValid Property
 The smallest possible valid VersionNumber.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static VersionNumber MinValid { get; }
Public Shared ReadOnly Property MinValid As VersionNumber
	Get
Property Value
Type: VersionNumber
[Missing <value> documentation for "P:GH_IO.VersionNumber.MinValid"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace