Grasshopper API
VersionNumber.Unset Property
 The Unset VersionNumber. VersionNumber.Unset.IsValid is false.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static VersionNumber Unset { get; }
Public Shared ReadOnly Property Unset As VersionNumber
	Get
Property Value
Type: VersionNumber
[Missing <value> documentation for "P:GH_IO.VersionNumber.Unset"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace