Grasshopper API
GH_Item._doublearray Property
 Returns the internal data of this item cast to a Byte array. If the data is not stored as a Byte array, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public double[] _doublearray { get; }
Public ReadOnly Property _doublearray As Double()
	Get
Property Value
Type: Double[]
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._doublearray"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace