Grasshopper API
GH_Chunk.ChunkKeyedCollection.Count Property
 Returns the amount in the collection.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.Count"]
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace