Grasshopper API
GH_DeveloperDetails.DeveloperContact Property
 Gets or sets the local developer contact info (e-mail). By default, the developer email is DefaultDeveloperContact; This email address is used in the Message Report viewer when sending a support e-mail.
 Namespace: GH_IO.UserInterface
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static string DeveloperContact { get; set; }
Public Shared Property DeveloperContact As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.UserInterface.GH_DeveloperDetails.DeveloperContact"]
See Also
Reference
GH_DeveloperDetails Class
GH_IO.UserInterface Namespace