Grasshopper API
GH_IChunk.ItemCount Property
 Gets the number of items contained in this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
int ItemCount { get; }
ReadOnly Property ItemCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.ItemCount"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace