Grasshopper API
GH_Item._byte Property
 Returns the internal data of this item cast to a Byte. If the data is not stored as a Byte, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public byte _byte { get; }
Public ReadOnly Property _byte As Byte
	Get
Property Value
Type: Byte
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._byte"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace