Grasshopper API
GH_Chunk.Archive Property
 Gets a pointer to the archive that owns the Root of the tree this chunk belongs to.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Archive Archive { get; }
Public ReadOnly Property Archive As GH_Archive
	Get
Property Value
Type: GH_Archive
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.Archive"]
Implements
GH_IChunk.Archive
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace