Grasshopper API
GH_Item._drawing_rectanglef Property
 Returns the internal data of this item cast to a RectangleF. If the data is not stored as a RectangleF, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public RectangleF _drawing_rectanglef { get; }
Public ReadOnly Property _drawing_rectanglef As RectangleF
	Get
Property Value
Type: RectangleF
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._drawing_rectanglef"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace