Grasshopper API
GH_IChunk.Index Property
 Gets the index of this chunk. The index is set by the owner of this chunk. Indices smaller than zero imply no index has been set. The combination of name+index is always unique among a set of chunks in the same litter.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
int Index { get; }
ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.Index"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace