Grasshopper API
GH_Item._bool Property
 Returns the internal data of this item cast to a Boolean. If the data is not stored as a Boolean, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool _bool { get; }
Public ReadOnly Property _bool As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._bool"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace