Grasshopper API
GH_Chunk.ArchiveLocation Property
 Gets a string representing the URI with which the archive is associated. The location may be a null string.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string ArchiveLocation { get; }
Public ReadOnly Property ArchiveLocation As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.ArchiveLocation"]
Implements
GH_IChunk.ArchiveLocation
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace