Grasshopper API
ID.Hash Property
 Gets the hash code.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int Hash { get; }
Public ReadOnly Property Hash As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.ID.Hash"]
See Also
Reference
ID Structure
GH_IO.Serialization Namespace