Grasshopper API
ID.Name Property
 Gets the name of this ID.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.ID.Name"]
See Also
Reference
ID Structure
GH_IO.Serialization Namespace