Grasshopper API
VersionNumber.MinValidBuildBranch Property
 Represents the smallest possible valid value of VersionNumber.BuildBranch. This field is read-only.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static VersionNumber.Branch MinValidBuildBranch { get; }
Public Shared ReadOnly Property MinValidBuildBranch As VersionNumber.Branch
	Get
Property Value
Type: VersionNumber.Branch
[Missing <value> documentation for "P:GH_IO.VersionNumber.MinValidBuildBranch"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace