Grasshopper API
GH_Item._single Property
 Returns the internal data of this item cast to a Single. If the data is not stored as a Single, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public float _single { get; }
Public ReadOnly Property _single As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._single"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace