Grasshopper API
GH_Chunk.HasComments Property
 Gets a value that indicates whether or not comments have been stored in this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasComments { get; }
Public ReadOnly Property HasComments As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.HasComments"]
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace