Grasshopper API
GH_Archive.Messages Property
 Gets the internal list of messages.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public List<GH_Message> Messages { get; }
Public ReadOnly Property Messages As List(Of GH_Message)
	Get
Property Value
Type: List<GH_Message>
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.Messages"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace