Grasshopper API
GH_Item._date Property
 Returns the internal data of this item cast to a DateTime. If the data is not stored as a DateTime, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public DateTime _date { get; }
Public ReadOnly Property _date As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._date"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace