Grasshopper API
GH_Item._drawing_bitmap Property
 Returns the internal data of this item cast to a Bitmap. If the data is not stored as a Bitmap, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Bitmap _drawing_bitmap { get; }
Public ReadOnly Property _drawing_bitmap As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._drawing_bitmap"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace