Grasshopper API
GH_Archive.GrasshopperUserExtension Property
 Gets the file extension (including the dot) associated with Grasshopper® User Object file.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static string GrasshopperUserExtension { get; }
Public Shared ReadOnly Property GrasshopperUserExtension As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.GrasshopperUserExtension"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace