Grasshopper API
ID.HasName Property
 Gets whether the name has been set. Every valid ID must have a name.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool HasName { get; }
Public ReadOnly Property HasName As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:GH_IO.Serialization.ID.HasName"]
See Also
Reference
ID Structure
GH_IO.Serialization Namespace