Grasshopper API
GH_Item._interval1d Property
 Returns the internal data of this item cast to an Interval1D. If the data is not stored as an Interval1D, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Interval1D _interval1d { get; }
Public ReadOnly Property _interval1d As GH_Interval1D
	Get
Property Value
Type: GH_Interval1D
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._interval1d"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace