Grasshopper API
GH_Item._version Property
 Returns the internal data of this item cast to a Version. If the data is not stored as a Version, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Version _version { get; }
Public ReadOnly Property _version As GH_Version
	Get
Property Value
Type: GH_Version
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._version"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace