Grasshopper API
GH_Chunk.ItemCount Property
 Gets the number of items contained in this chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int ItemCount { get; }
Public ReadOnly Property ItemCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.ItemCount"]
Implements
GH_IChunk.ItemCount
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace