Grasshopper API
GH_Item._int32 Property
 Returns the internal data of this item cast to an Int32. If the data is not stored as an Int32, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int _int32 { get; }
Public ReadOnly Property _int32 As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._int32"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace