Grasshopper API
GH_Item.Type Property
 Gets the type of this item. Type flags are set during construction and cannot be altered.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Types Type { get; }
Public ReadOnly Property Type As GH_Types
	Get
Property Value
Type: GH_Types
[Missing <value> documentation for "P:GH_IO.Types.GH_Item.Type"]
See Also
Reference
GH_Item Class
GH_IO.Types Namespace