Grasshopper API
VersionNumber.BuildBranch Property
 Gets the build branch component of this instance.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public VersionNumber.Branch BuildBranch { get; }
Public ReadOnly Property BuildBranch As VersionNumber.Branch
	Get
Property Value
Type: VersionNumber.Branch
[Missing <value> documentation for "P:GH_IO.VersionNumber.BuildBranch"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace