Grasshopper API
GH_Archive.FileName Property
 Gets the filename (without extension) of the currently loaded data tree. If the path field has not been set, "unnamed" is returned.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.FileName"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace