Grasshopper API
GH_Item._drawing_pointf Property
 Returns the internal data of this item cast to a PointF. If the data is not stored as a PointF, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public PointF _drawing_pointf { get; }
Public ReadOnly Property _drawing_pointf As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._drawing_pointf"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace