Grasshopper API
VersionNumber.MaxValidTime Property
 The largest possible valid value of VersionNumber.Time. This field is read-only.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static DateTime MaxValidTime { get; }
Public Shared ReadOnly Property MaxValidTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:GH_IO.VersionNumber.MaxValidTime"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace