Grasshopper API
GH_Item._drawing_point Property
 Returns the internal data of this item cast to a Point. If the data is not stored as a Point, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public Point _drawing_point { get; }
Public ReadOnly Property _drawing_point As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._drawing_point"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace