Grasshopper API
GH_Item._point4d Property
 Returns the internal data of this item cast to a Point4D. If the data is not stored as a Point4D, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Point4D _point4d { get; }
Public ReadOnly Property _point4d As GH_Point4D
	Get
Property Value
Type: GH_Point4D
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._point4d"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace