Grasshopper API
GH_Archive.GetRootNode Property
 Gets the root node of this archive. Typically you do not need to modify the Root. Use functions like CreateTopLevelNode(), AppendObject() and ExtractObject() instead. If you modify the Root node, you may corrupt the archive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Chunk GetRootNode { get; }
Public ReadOnly Property GetRootNode As GH_Chunk
	Get
Property Value
Type: GH_Chunk
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.GetRootNode"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace