Grasshopper API
GH_Message.Type Property
 Gets the type of this message.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public GH_Message_Type Type { get; }
Public ReadOnly Property Type As GH_Message_Type
	Get
Property Value
Type: GH_Message_Type
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Message.Type"]
See Also
Reference
GH_Message Class
GH_IO.Serialization Namespace