Grasshopper API
VersionNumber.UnsetBuildBranch Property
 The value of an Unset VersionNumber.BuildBranch.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static VersionNumber.Branch UnsetBuildBranch { get; }
Public Shared ReadOnly Property UnsetBuildBranch As VersionNumber.Branch
	Get
Property Value
Type: VersionNumber.Branch
[Missing <value> documentation for "P:GH_IO.VersionNumber.UnsetBuildBranch"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace