Grasshopper API
GH_Chunk.Name Property
 Gets the name of this chunk. The name is set by the owner of this chunk. Names must be at least 1 character long. The combination of name+index is always unique among a set of chunks in a single litter.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Chunk.Name"]
Implements
GH_IChunk.Name
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace