Grasshopper API
VersionNumber.MaxMinorVersionNumber Property
 The largest possible valid value of VersionNumber.MinorVersionNumber.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static int MaxMinorVersionNumber { get; }
Public Shared ReadOnly Property MaxMinorVersionNumber As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.VersionNumber.MaxMinorVersionNumber"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace