Grasshopper API
GH_Item._decimal Property
 Returns the internal data of this item cast to a Decimal. If the data is not stored as a Decimal, a conversion exception might be thrown.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public decimal _decimal { get; }
Public ReadOnly Property _decimal As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:GH_IO.Types.GH_Item._decimal"]
Exceptions
Exception | Condition
OverflowException | Thrown if the type conversion fails.
InvalidCastException | Thrown if the type conversion is invalid.
See Also
Reference
GH_Item Class
GH_IO.Types Namespace