Grasshopper API
VersionNumber.MaxValidBuildBranch Property
 Represents the largest possible valid value of VersionNumber.BuildBranch. This field is read-only.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static VersionNumber.Branch MaxValidBuildBranch { get; }
Public Shared ReadOnly Property MaxValidBuildBranch As VersionNumber.Branch
	Get
Property Value
Type: VersionNumber.Branch
[Missing <value> documentation for "P:GH_IO.VersionNumber.MaxValidBuildBranch"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace