Grasshopper API
VersionNumber.MinMajorVersionNumber Property
 The smallest possible valid value of VersionNumber.MajorVersionNumber.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static int MinMajorVersionNumber { get; }
Public Shared ReadOnly Property MinMajorVersionNumber As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:GH_IO.VersionNumber.MinMajorVersionNumber"]
See Also
Reference
VersionNumber Structure
GH_IO Namespace