Grasshopper API
GH_Archive.GrasshopperBinaryExtension Property
 Gets the file extension (including the dot) associated with Grasshopper® Binary data.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public static string GrasshopperBinaryExtension { get; }
Public Shared ReadOnly Property GrasshopperBinaryExtension As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:GH_IO.Serialization.GH_Archive.GrasshopperBinaryExtension"]
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace