Grasshopper API
GH_IChunk.Items Property
 Gets a pointer to the internal list of items. Do not access this list unless you know what you are doing.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
List<GH_Item> Items { get; }
ReadOnly Property Items As List(Of GH_Item)
	Get
Property Value
Type: List<GH_Item>
[Missing <value> documentation for "P:GH_IO.Serialization.GH_IChunk.Items"]
See Also
Reference
GH_IChunk Interface
GH_IO.Serialization Namespace