Grasshopper API
ObjectRender.Material Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRenderMaterial.Value? Material { get; }
Public ReadOnly Property Material As ObjectRenderMaterial.Value?
	Get
Property Value
Type: Nullable<ObjectRenderMaterial.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.Material"]
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace