Grasshopper API
AnnotationArrowSettings.Attributes.LeaderArrowSize Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.LeaderArrowSize"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace