Grasshopper API
GH_AnnotationBase.GH_AnnotationBaseProxy<T>.AnnotationStyle Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string AnnotationStyle { get; }
Public ReadOnly Property AnnotationStyle As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.GH_AnnotationBaseProxy`1.AnnotationStyle"]
See Also
Reference
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Grasshopper.Kernel.Types Namespace