Grasshopper API
AnnotationDimensionSettings.RadialTextAngleType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LeaderContentAngleStyle? RadialTextAngleType { get; }
Public ReadOnly Property RadialTextAngleType As LeaderContentAngleStyle?
	Get
Property Value
Type: Nullable<LeaderContentAngleStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.RadialTextAngleType"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace