Grasshopper API
ModelView.ReferenceID Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
internal Guid ReferenceID { get; set; }
Friend Property ReferenceID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelView.ReferenceID"]
Implements
IGH_GeometricGoo.ReferenceID
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace