Grasshopper API
ModelContentName.Separator Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string Separator { get; }
Public Shared ReadOnly Property Separator As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContentName.Separator"]
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace