Grasshopper API
ModelSectionStyle.HatchPatternLineWeight Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? HatchPatternLineWeight { get; }
Public ReadOnly Property HatchPatternLineWeight As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.HatchPatternLineWeight"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace