Grasshopper API
ModelUnitSystem.BaseSystem Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public UnitSystem BaseSystem { get; }
Public ReadOnly Property BaseSystem As UnitSystem
	Get
Property Value
Type: UnitSystem
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.BaseSystem"]
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace