Grasshopper API
ObjectDrafting.LineWidth Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLineWidth.Value? LineWidth { get; }
Public ReadOnly Property LineWidth As ObjectDraftingLineWidth.Value?
	Get
Property Value
Type: Nullable<ObjectDraftingLineWidth.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.LineWidth"]
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace