Grasshopper API
AnnotationDimensionSettings.Attributes.CentermarkStyle Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public CenterMarkStyle? CentermarkStyle { get; set; }
Public Property CentermarkStyle As CenterMarkStyle?
	Get
	Set
Property Value
Type: Nullable<CenterMarkStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.CentermarkStyle"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace