Grasshopper API
ModelSectionStyle.HatchPatternPrintColor Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color? HatchPatternPrintColor { get; }
Public ReadOnly Property HatchPatternPrintColor As Color?
	Get
Property Value
Type: Nullable<Color>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.HatchPatternPrintColor"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace