Grasshopper API
ObjectDrafting.LineScale Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? LineScale { get; }
Public ReadOnly Property LineScale As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.LineScale"]
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace