Grasshopper API
GH_TaskCapableComponent<T>.InPreSolve Property
 Is set to True by the framework right before a "use tasks" pass is made on SolveIntance calls. When True, SolveInstance should be using Tasks to start calculations on input data. When False, SolveInstance should be setting the output data by either using the result of a task or directly computing the results.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool InPreSolve { get; set; }
Public Property InPreSolve As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_TaskCapableComponent`1.InPreSolve"]
Implements
IGH_TaskCapableComponent.InPreSolve
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace