Grasshopper API
AnnotationTextSettings.MaskFrame Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public MaskFrame? MaskFrame { get; }
Public ReadOnly Property MaskFrame As MaskFrame?
	Get
Property Value
Type: Nullable<MaskFrame>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.MaskFrame"]
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace