Grasshopper API
ModelContent.Notes Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Notes { get; }
Public ReadOnly Property Notes As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Notes"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace