Grasshopper API
GH_Document.ValueTable Property
 Gets the value table associated with this document.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_SettingsServer ValueTable { get; }
Public ReadOnly Property ValueTable As GH_SettingsServer
	Get
Property Value
Type: GH_SettingsServer
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ValueTable"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace