Grasshopper API
ModelSectionStyle.Attributes.BackgroundFillPrintColor Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color? BackgroundFillPrintColor { get; set; }
Public Property BackgroundFillPrintColor As Color?
	Get
	Set
Property Value
Type: Nullable<Color>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.BackgroundFillPrintColor"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace