Grasshopper API
ModelLayer.Linetype Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype Linetype { get; }
Public ReadOnly Property Linetype As ModelLinetype
	Get
Property Value
Type: ModelLinetype
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Linetype"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace