Grasshopper API
ModelLayer.HiddenOnModel Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? HiddenOnModel { get; }
Public ReadOnly Property HiddenOnModel As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.HiddenOnModel"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace