Grasshopper API
ModelMeshingParameters.QualityRender Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelMeshingParameters QualityRender { get; }
Public Shared ReadOnly Property QualityRender As ModelMeshingParameters
	Get
Property Value
Type: ModelMeshingParameters
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelMeshingParameters.QualityRender"]
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace