Grasshopper API
ModelTextureSlot.Color Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color4f? Color { get; }
Public ReadOnly Property Color As Color4f?
	Get
Property Value
Type: Nullable<Color4f>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Color"]
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace