Grasshopper API
ModelTextureMapping.UVWRepeat Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? UVWRepeat { get; }
Public ReadOnly Property UVWRepeat As Vector3d?
	Get
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.UVWRepeat"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace