Grasshopper API
ClippingDrawingSettings.Attributes.LabelStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public SectionLabelStyle? LabelStyle { get; set; }
Public Property LabelStyle As SectionLabelStyle?
	Get
	Set
Property Value
Type: Nullable<SectionLabelStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes.LabelStyle"]
See Also
Reference
ClippingDrawingSettings.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace