Grasshopper API
GH_DocumentIO.DisableOverwriteProtection Property
 Gets or sets whether the file overwrite protection dialog ought to be shown during risky saves.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool DisableOverwriteProtection { get; set; }
Public Shared Property DisableOverwriteProtection As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentIO.DisableOverwriteProtection"]
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace