Grasshopper API
ModelUnitSystem.Value.Name Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.Name"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace