Grasshopper API
ModelSectionStyle.BackgroundFillColor Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color? BackgroundFillColor { get; }
Public ReadOnly Property BackgroundFillColor As Color?
	Get
Property Value
Type: Nullable<Color>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.BackgroundFillColor"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace