Grasshopper API
GH_SubD.ReferenceID Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ReferenceID { get; set; }
Public Overrides Property ReferenceID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.ReferenceID"]
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace