Grasshopper API
ModelUnitSystem.IsValid Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.IsValid"]
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace