Grasshopper API
DisplayColorGradient.IsValidWhyNot Property
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string IsValidWhyNot { get; }
Public Overrides ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.DisplayColorGradient.IsValidWhyNot"]
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace