Grasshopper API
ModelHatchPattern.FillType Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public HatchPatternFillType? FillType { get; }
Public ReadOnly Property FillType As HatchPatternFillType?
	Get
Property Value
Type: Nullable<HatchPatternFillType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.FillType"]
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace