Grasshopper API
ModelAnnotationStyle.DimensionSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDimensionSettings DimensionSettings { get; }
Public ReadOnly Property DimensionSettings As AnnotationDimensionSettings
	Get
Property Value
Type: AnnotationDimensionSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.DimensionSettings"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace