Grasshopper API
IGH_TaskCapableComponent.UseTasks Property
 Returns True if the component is set to support tasks. Components can have this feature turned on/off. Note that even if UseTasks returns True, there is a chance that a multipass task based solution may not be invoked depending on if multiple calls need to be made during enumeration. You must pay attention to the value of InPreSolve during SolveInstance. The set version of this property can be called by the framework if we want to provide a technique to globally turn on/off task support for all components in a definition.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
bool UseTasks { get; set; }
Property UseTasks As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_TaskCapableComponent.UseTasks"]
See Also
Reference
IGH_TaskCapableComponent Interface
Grasshopper.Kernel Namespace