Grasshopper API
PageSettings.PaperHeight Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? PaperHeight { get; }
Public ReadOnly Property PaperHeight As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.PaperHeight"]
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace