Grasshopper API
GH_InstanceReference.IsGeometryLoaded Property
 Gets the load state of this instance reference object. The instance reference is considered to be loaded when the local instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_InstanceReference.IsGeometryLoaded"]
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace