Grasshopper API
Param_ModelRenderMaterial.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderMaterial.ComponentGuid"]
See Also
Reference
Param_ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace