Grasshopper API
Param_ModelObject.ClippingBox Property
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.Params.Param_ModelObject.ClippingBox"]
Implements
IGH_PreviewObject.ClippingBox
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace