Grasshopper API
ObjectVisibility.Locked Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Locked { get; }
Public ReadOnly Property Locked As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectVisibility.Locked"]
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace