Grasshopper API
ModelInstanceDefinition.Objects Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<ModelObject> Objects { get; }
Public ReadOnly Property Objects As IReadOnlyList(Of ModelObject)
	Get
Property Value
Type: IReadOnlyList<ModelObject>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Objects"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace