Grasshopper API
AnnotationUnitsSettings.LengthResolution Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? LengthResolution { get; }
Public ReadOnly Property LengthResolution As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.LengthResolution"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace