Grasshopper API
GH_AssemblyInfoStub.Id Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid Id { get; }
Public Overrides ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfoStub.Id"]
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace