Grasshopper API
CentralSettings.TrackFileStamps Property
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool TrackFileStamps { get; set; }
Public Shared Property TrackFileStamps As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.TrackFileStamps"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace