Grasshopper API
ModelSectionStyle.Attributes.SectionFillRule Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionFillRule? SectionFillRule { get; set; }
Public Property SectionFillRule As ObjectSectionFillRule?
	Get
	Set
Property Value
Type: Nullable<ObjectSectionFillRule>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.SectionFillRule"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace