Grasshopper API
ObjectDrafting.Attributes.Color Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingColor.Value? Color { get; set; }
Public Property Color As ObjectDraftingColor.Value?
	Get
	Set
Property Value
Type: Nullable<ObjectDraftingColor.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes.Color"]
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace