Grasshopper API
ObjectVisibility.Viewport Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelViewport Viewport { get; }
Public ReadOnly Property Viewport As ModelViewport
	Get
Property Value
Type: ModelViewport
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectVisibility.Viewport"]
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace