Grasshopper API
GH_PointCloud.PointCloudProxy.ContainsValues Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool ContainsValues { get; }
Public ReadOnly Property ContainsValues As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.PointCloudProxy.ContainsValues"]
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace