Grasshopper API
Param_ClippingPlane.Icon Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_ClippingPlane.Icon"]
See Also
Reference
Param_ClippingPlane Class
Grasshopper.Kernel.Parameters Namespace