Grasshopper API
CentralSettings.TryDownloadMissingPlugins Property
 Gets or sets whether the 'Unrecognized Objects' dialog pops up on file load.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool TryDownloadMissingPlugins { get; set; }
Public Shared Property TryDownloadMissingPlugins As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.TryDownloadMissingPlugins"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace