Grasshopper API
GH_Document.ActiveDoc Property
 Gets or sets a value indicating that this document was last active in a multi-doc aware Rhino.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool ActiveDoc { get; set; }
Public Property ActiveDoc As Boolean
	Get
	Set
Property Value
Type: Boolean
true if this was the last active document; otherwise, false.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace