Grasshopper API
ModelConstructionPlane.LineCount Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? LineCount { get; }
Public ReadOnly Property LineCount As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelConstructionPlane.LineCount"]
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace