Grasshopper API
ModelUserText.Keys Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IEnumerable<string> Keys { get; }
Public ReadOnly Property Keys As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUserText.Keys"]
Implements
IReadOnlyDictionary<TKey, TValue>.Keys
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace