Grasshopper API
GH_PointCloud.IsGeometryLoaded Property
 Gets the load state of this curve object. The curve is considered to be loaded when the local OnCurve instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.IsGeometryLoaded"]
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace