Grasshopper API
PageSettings.Attributes.PaperName Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string PaperName { get; set; }
Public Property PaperName As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.Attributes.PaperName"]
See Also
Reference
PageSettings.Attributes Class
Grasshopper.Rhinoceros.Display Namespace