Grasshopper API
GH_Hatch.BackgroundColor Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BackgroundColor"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace