Grasshopper API
ObjectRenderMaterial.Value.Default Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectRenderMaterial.Value Default { get; }
Public Shared ReadOnly Property Default As ObjectRenderMaterial.Value
	Get
Property Value
Type: ObjectRenderMaterial.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value.Default"]
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace