Grasshopper API
Param_MatchText.Negate Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Negate { get; set; }
Public Property Negate As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_MatchText.Negate"]
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace