Grasshopper API
ModelLayer.DraftingColor Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor? DraftingColor { get; }
Public ReadOnly Property DraftingColor As ModelColor?
	Get
Property Value
Type: Nullable<ModelColor>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.DraftingColor"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace