Grasshopper API
ObjectSectionStyle.Value.ByLayer Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectSectionStyle.Value ByLayer { get; }
Public Shared ReadOnly Property ByLayer As ObjectSectionStyle.Value
	Get
Property Value
Type: ObjectSectionStyle.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value.ByLayer"]
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace