Grasshopper API
ModelFont.InstalledFonts Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static IReadOnlyList<ModelFont> InstalledFonts { get; }
Public Shared ReadOnly Property InstalledFonts As IReadOnlyList(Of ModelFont)
	Get
Property Value
Type: IReadOnlyList<ModelFont>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelFont.InstalledFonts"]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace