Grasshopper API
Param_ModelAttributeKey.BaseProperty Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string BaseProperty { get; set; }
Public Property BaseProperty As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_ModelAttributeKey.BaseProperty"]
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace