Grasshopper API
AnnotationDimensionSettings.BaselineSpacing Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? BaselineSpacing { get; }
Public ReadOnly Property BaselineSpacing As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.BaselineSpacing"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace