Grasshopper API
ModelTextureMapping.Capped Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Capped { get; }
Public ReadOnly Property Capped As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Capped"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace