Grasshopper API
ObjectRenderMaterial.Source Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectMaterialSource Source { get; }
Public ReadOnly Property Source As ObjectMaterialSource
	Get
Property Value
Type: ObjectMaterialSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Source"]
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace