Grasshopper API
ModelInstanceDefinition.UpdateType Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public InstanceDefinitionUpdateType? UpdateType { get; }
Public ReadOnly Property UpdateType As InstanceDefinitionUpdateType?
	Get
Property Value
Type: Nullable<InstanceDefinitionUpdateType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.UpdateType"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace