Grasshopper API
IGH_ContextualParameter.ContextualData Property
 Iterate over all specified contextual values.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
IEnumerable<Object> ContextualData { get; }
ReadOnly Property ContextualData As IEnumerable(Of Object)
	Get
Property Value
Type: IEnumerable<Object>
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ContextualParameter.ContextualData"]
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace