Grasshopper API
ModelLineWidth.IsValidWhyNot Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string IsValidWhyNot { get; }
Public ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.IsValidWhyNot"]
Implements
IGH_Goo.IsValidWhyNot
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace