Grasshopper API
ClippingDrawingSettings.LabelStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public SectionLabelStyle? LabelStyle { get; }
Public ReadOnly Property LabelStyle As SectionLabelStyle?
	Get
Property Value
Type: Nullable<SectionLabelStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.LabelStyle"]
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace