Grasshopper API
AnnotationDimensionSettings.Attributes.RadialTextAngleType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LeaderContentAngleStyle? RadialTextAngleType { get; set; }
Public Property RadialTextAngleType As LeaderContentAngleStyle?
	Get
	Set
Property Value
Type: Nullable<LeaderContentAngleStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.RadialTextAngleType"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace