Grasshopper API
ModelLinetype.Attributes.Segments Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<double> Segments { get; set; }
Public Property Segments As IReadOnlyList(Of Double)
	Get
	Set
Property Value
Type: IReadOnlyList<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes.Segments"]
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace