Grasshopper API
Param_AnnotationTextSettings.Exposure Property
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationTextSettings.Exposure"]
See Also
Reference
Param_AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace