Grasshopper API
ModelLayer.Unset Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLayer Unset { get; }
Public Shared ReadOnly Property Unset As ModelLayer
	Get
Property Value
Type: ModelLayer
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Unset"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace