Grasshopper API
ModelSectionStyle.BoundaryLineWeight Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? BoundaryLineWeight { get; }
Public ReadOnly Property BoundaryLineWeight As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.BoundaryLineWeight"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace