Grasshopper API
ObjectRender.TextureMappings Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<ModelTextureMapping> TextureMappings { get; }
Public ReadOnly Property TextureMappings As IReadOnlyList(Of ModelTextureMapping)
	Get
Property Value
Type: IReadOnlyList<ModelTextureMapping>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.TextureMappings"]
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace