Grasshopper API
GH_InstanceReference.ModelTransform Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Transform ModelTransform { get; set; }
Public Property ModelTransform As Transform
	Get
	Set
Property Value
Type: Transform
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_InstanceReference.ModelTransform"]
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace