Grasshopper API
ModelRenderSun.Attributes.DaylightSavingEnabled Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? DaylightSavingEnabled { get; set; }
Public Property DaylightSavingEnabled As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes.DaylightSavingEnabled"]
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace