Grasshopper API
ModelTextureMapping.Attributes.UVWOffset Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? UVWOffset { get; set; }
Public Property UVWOffset As Vector3d?
	Get
	Set
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.UVWOffset"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace