Grasshopper API
ModelRenderSun.Attributes.Enabled Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Enabled { get; set; }
Public Property Enabled As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes.Enabled"]
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace