Grasshopper API
ModelTextureMapping.ClippingBox Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.ClippingBox"]
Implements
IGH_PreviewData.ClippingBox
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace