Grasshopper API
AnnotationTextSettings.TextHeight Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? TextHeight { get; }
Public ReadOnly Property TextHeight As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.TextHeight"]
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace