Grasshopper API
ModelTextureSlot.Attributes.Number Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Number { get; set; }
Public Property Number As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Attributes.Number"]
See Also
Reference
ModelTextureSlot.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace