Grasshopper API
ModelLayer.Attributes.Locked Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Locked { get; set; }
Public Property Locked As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.Locked"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace