Grasshopper API
GH_ClippingPlane.AnnotationStyle Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle AnnotationStyle { get; set; }
Public Property AnnotationStyle As ModelAnnotationStyle
	Get
	Set
Property Value
Type: ModelAnnotationStyle
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.AnnotationStyle"]
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace