Grasshopper API
AnnotationToleranceSettings.Attributes.ToleranceFormat Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ToleranceDisplayFormat? ToleranceFormat { get; set; }
Public Property ToleranceFormat As ToleranceDisplayFormat?
	Get
	Set
Property Value
Type: Nullable<ToleranceDisplayFormat>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.Attributes.ToleranceFormat"]
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace