Grasshopper API
GH_TextDot.GH_TextDotProxy.Text Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Text { get; }
Public ReadOnly Property Text As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_TextDot.GH_TextDotProxy.Text"]
See Also
Reference
GH_TextDot.GH_TextDotProxy Class
Grasshopper.Kernel.Types Namespace