Grasshopper API
GH_ClippingPlane.LabelStyle Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public SectionLabelStyle LabelStyle { get; set; }
Public Property LabelStyle As SectionLabelStyle
	Get
	Set
Property Value
Type: SectionLabelStyle
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.LabelStyle"]
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace