Grasshopper API
ObjectDraftingLineWidth.Value.ByLayer Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingLineWidth.Value ByLayer { get; }
Public Shared ReadOnly Property ByLayer As ObjectDraftingLineWidth.Value
	Get
Property Value
Type: ObjectDraftingLineWidth.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value.ByLayer"]
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace