Grasshopper API
GH_SubD.GH_SubDProxy.EdgeCount Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int EdgeCount { get; }
Public ReadOnly Property EdgeCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.GH_SubDProxy.EdgeCount"]
See Also
Reference
GH_SubD.GH_SubDProxy Class
Grasshopper.Kernel.Types Namespace