Grasshopper API
ModelPageViewport.Attributes.PageNumber Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? PageNumber { get; set; }
Public Property PageNumber As Integer?
	Get
	Set
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelPageViewport.Attributes.PageNumber"]
See Also
Reference
ModelPageViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace