Grasshopper API
Param_ModelInstanceDefinition.IsPreviewCapable Property
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsPreviewCapable { get; }
Public ReadOnly Property IsPreviewCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.Params.Param_ModelInstanceDefinition.IsPreviewCapable"]
Implements
IGH_PreviewObject.IsPreviewCapable
See Also
Reference
Param_ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model.Params Namespace