Grasshopper API
ModelSectionStyle.BackgroundFillMode Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public SectionBackgroundFillMode? BackgroundFillMode { get; }
Public ReadOnly Property BackgroundFillMode As SectionBackgroundFillMode?
	Get
Property Value
Type: Nullable<SectionBackgroundFillMode>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.BackgroundFillMode"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace