Grasshopper API
GH_Material.RdkMaterialXml Property
 Gets or sets the RDK material Xml string.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string RdkMaterialXml { get; set; }
Public Property RdkMaterialXml As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.RdkMaterialXml"]
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace