Grasshopper API
Param_AnnotationDimensionSettings.Icon Property
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationDimensionSettings.Icon"]
See Also
Reference
Param_AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace