Grasshopper API
CentralSettings.PreviewSelectionThickening Property
 Gets or sets the amount of thickening to apply to selected wires.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int PreviewSelectionThickening { get; set; }
Public Shared Property PreviewSelectionThickening As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PreviewSelectionThickening"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace