Grasshopper API
AnnotationArrowSettings.Arrow1 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrow Arrow1 { get; }
Public ReadOnly Property Arrow1 As AnnotationArrow
	Get
Property Value
Type: AnnotationArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Arrow1"]
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace