Grasshopper API
GH_Predicate.IsValidWhyNot Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string IsValidWhyNot { get; }
Public ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.IsValidWhyNot"]
Implements
IGH_Goo.IsValidWhyNot
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace