Grasshopper API
AnnotationTextSettings.Attributes.TextVerticalAlignment Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextVerticalAlignment? TextVerticalAlignment { get; set; }
Public Property TextVerticalAlignment As TextVerticalAlignment?
	Get
	Set
Property Value
Type: Nullable<TextVerticalAlignment>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes.TextVerticalAlignment"]
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace