Grasshopper API
ObjectVisibility.Attributes.Hidden Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Hidden { get; set; }
Public Property Hidden As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectVisibility.Attributes.Hidden"]
See Also
Reference
ObjectVisibility.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace