Grasshopper API
GH_SubD.GH_SubDProxy.ObjectID Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ObjectID { get; set; }
Public Property ObjectID As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.GH_SubDProxy.ObjectID"]
See Also
Reference
GH_SubD.GH_SubDProxy Class
Grasshopper.Kernel.Types Namespace