Grasshopper API
GH_Leader.ValueType Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Type ValueType { get; }
Protected Overrides ReadOnly Property ValueType As Type
	Get
Property Value
Type: Type
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Leader.ValueType"]
See Also
Reference
GH_Leader Class
Grasshopper.Kernel.Types Namespace