Grasshopper API
ModelLayer.Attributes.HiddenOnModel Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? HiddenOnModel { get; set; }
Public Property HiddenOnModel As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.HiddenOnModel"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace