Grasshopper API
GH_Predicate.Description Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.Description"]
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace