Grasshopper API
ObjectRender.Attributes.TextureMappings Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<ModelTextureMapping> TextureMappings { get; set; }
Public Property TextureMappings As IReadOnlyList(Of ModelTextureMapping)
	Get
	Set
Property Value
Type: IReadOnlyList<ModelTextureMapping>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.Attributes.TextureMappings"]
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace