Grasshopper API
ModelView.IsValid Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelView.IsValid"]
Implements
IGH_Goo.IsValid
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace