Grasshopper API
ModelObject.Url Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Url { get; }
Public ReadOnly Property Url As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Url"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace