Grasshopper API
Param_ModelView.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ModelView.ComponentGuid"]
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace