Grasshopper API
GH_PreviewBoundary.Points Property
 Gets the array of points this boundary was made from.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public PointF[] Points { get; }
Public ReadOnly Property Points As PointF()
	Get
Property Value
Type: PointF[]
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewBoundary.Points"]
See Also
Reference
GH_PreviewBoundary Class
Grasshopper.Kernel Namespace