Grasshopper API
ModelHatchLine.Attributes.Base Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Point2d Base { get; set; }
Public Property Base As Point2d
	Get
	Set
Property Value
Type: Point2d
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Attributes.Base"]
See Also
Reference
ModelHatchLine.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace