Grasshopper API
ModelData.IsValidWhyNot Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected virtual string IsValidWhyNot { get; }
Protected Overridable ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelData.IsValidWhyNot"]
Implements
IGH_Goo.IsValidWhyNot
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace