Grasshopper API
GH_PointCloud.TypeName Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.TypeName"]
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace