Grasshopper API
Param_ModelView.ClippingBox Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ModelView.ClippingBox"]
Implements
IGH_PreviewObject.ClippingBox
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace