Grasshopper API
ObjectRender.Attributes.Material Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRenderMaterial.Value? Material { get; set; }
Public Property Material As ObjectRenderMaterial.Value?
	Get
	Set
Property Value
Type: Nullable<ObjectRenderMaterial.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.Attributes.Material"]
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace