Grasshopper API
ModelViewport.Attributes.UserText Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText UserText { get; set; }
Public Property UserText As ModelUserText
	Get
	Set
Property Value
Type: ModelUserText
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.Attributes.UserText"]
See Also
Reference
ModelViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace