Grasshopper API
ModelRenderSun.North Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? North { get; }
Public ReadOnly Property North As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.North"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace