Grasshopper API
Param_ModelAnnotationStyle.Exposure Property
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.Params.Param_ModelAnnotationStyle.Exposure"]
See Also
Reference
Param_ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations.Params Namespace