Grasshopper API
Instances.EtoDocumentEditor Property
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Window EtoDocumentEditor { get; }
Public Shared ReadOnly Property EtoDocumentEditor As Window
	Get
Property Value
Type: Window
[Missing <value> documentation for "P:Grasshopper.Instances.EtoDocumentEditor"]
See Also
Reference
Instances Class
Grasshopper Namespace