Grasshopper API
ModelConstructionPlane.GridSpacing Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? GridSpacing { get; }
Public ReadOnly Property GridSpacing As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelConstructionPlane.GridSpacing"]
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace