Grasshopper API
Param_ModelLayer.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.Params.Param_ModelLayer.ComponentGuid"]
See Also
Reference
Param_ModelLayer Class
Grasshopper.Rhinoceros.Model.Params Namespace