Grasshopper API
PageSettings.PaperWidth Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? PaperWidth { get; }
Public ReadOnly Property PaperWidth As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.PaperWidth"]
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace