Grasshopper API
ModelPageViewport.PageSettings Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public PageSettings PageSettings { get; }
Public ReadOnly Property PageSettings As PageSettings
	Get
Property Value
Type: PageSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelPageViewport.PageSettings"]
See Also
Reference
ModelPageViewport Class
Grasshopper.Rhinoceros.Display Namespace