Grasshopper API
ModelLinetype.Attributes.CapStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LineCapStyle? CapStyle { get; set; }
Public Property CapStyle As LineCapStyle?
	Get
	Set
Property Value
Type: Nullable<LineCapStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes.CapStyle"]
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace