Grasshopper API
ModelInstanceDefinition.Attributes.FilePath Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string FilePath { get; set; }
Public Property FilePath As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes.FilePath"]
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace