Grasshopper API
ModelSectionStyle.BoundaryColor Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color? BoundaryColor { get; }
Public ReadOnly Property BoundaryColor As Color?
	Get
Property Value
Type: Nullable<Color>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.BoundaryColor"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace