Grasshopper API
AnnotationUnitsSettings.Attributes.AngularRoundoff Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? AngularRoundoff { get; set; }
Public Property AngularRoundoff As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.AngularRoundoff"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace