Grasshopper API
ObjectDisplayColor.Value.Color Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor Color { get; }
Public ReadOnly Property Color As ModelColor
	Get
Property Value
Type: ModelColor
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value.Color"]
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace