Grasshopper API
ModelContent.IsReferencedDataLoaded Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected bool IsReferencedDataLoaded { get; }
Protected ReadOnly Property IsReferencedDataLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.IsReferencedDataLoaded"]
Implements
IGH_ReferencedData.IsReferencedDataLoaded
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace