Grasshopper API
ModelContent.Attributes.Parent Property
 Path of the parent element in 'Root::Parent' format if nested.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContentName Parent { get; set; }
Public Property Parent As ModelContentName
	Get
	Set
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Attributes.Parent"]
Return Value
Type: ModelContentName
Remarks
Empty string in case it is not nested.
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace