Grasshopper API
ModelData.TypeDescription Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected string TypeDescription { get; }
Protected ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelData.TypeDescription"]
Implements
IGH_Goo.TypeDescription
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace