Grasshopper API
ModelLayer.DisplayColor Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor? DisplayColor { get; }
Public ReadOnly Property DisplayColor As ModelColor?
	Get
Property Value
Type: Nullable<ModelColor>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.DisplayColor"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace