Grasshopper API
ModelConstructionPlane.SnapSpacing Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? SnapSpacing { get; }
Public ReadOnly Property SnapSpacing As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelConstructionPlane.SnapSpacing"]
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace