Grasshopper API
ModelInstanceDefinition.Attributes.Objects Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<ModelObject> Objects { get; set; }
Public Property Objects As IReadOnlyList(Of ModelObject)
	Get
	Set
Property Value
Type: IReadOnlyList<ModelObject>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes.Objects"]
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace