Grasshopper API
ModelLineWidth.Hairline Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLineWidth Hairline { get; }
Public Shared ReadOnly Property Hairline As ModelLineWidth
	Get
Property Value
Type: ModelLineWidth
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.Hairline"]
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace