Grasshopper API
ModelEarthAnchorPoint.Elevation Property
 Gets a point elevation on earth, in meters.
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Elevation { get; }
Public ReadOnly Property Elevation As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Elevation"]
Remarks
In meters.
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace