Grasshopper API
CentralSettings.CapsuleHighlight Property
 Gets or sets the global setting for drawing highlight bars on capsules.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool CapsuleHighlight { get; set; }
Public Shared Property CapsuleHighlight As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CapsuleHighlight"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace