Grasshopper API
ModelHatchPattern.Attributes.Units Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem.Value? Units { get; set; }
Public Property Units As ModelUnitSystem.Value?
	Get
	Set
Property Value
Type: Nullable<ModelUnitSystem.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Attributes.Units"]
See Also
Reference
ModelHatchPattern.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace