Grasshopper API
EtoExtensions.EtoWin32Window.Handle Property
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
[Missing <value> documentation for "P:Grasshopper.EtoExtensions.EtoWin32Window.Handle"]
Implements
IWin32Window.Handle
See Also
Reference
EtoExtensions.EtoWin32Window Class
Grasshopper Namespace