Grasshopper API
ModelObject.Render Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRender Render { get; }
Public ReadOnly Property Render As ObjectRender
	Get
Property Value
Type: ObjectRender
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Render"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace