Grasshopper API
ModelAnnotationStyle.Attributes.LeaderSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationLeaderSettings LeaderSettings { get; set; }
Public Property LeaderSettings As AnnotationLeaderSettings
	Get
	Set
Property Value
Type: AnnotationLeaderSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes.LeaderSettings"]
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace