Grasshopper API
ModelUnitSystem.Value.ActiveSpace Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ActiveSpace ActiveSpace { get; }
Public ReadOnly Property ActiveSpace As ActiveSpace
	Get
Property Value
Type: ActiveSpace
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.ActiveSpace"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace