Grasshopper API
GH_AngularDimension.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AngularDimension Value { get; set; }
Public Property Value As AngularDimension
	Get
	Set
Property Value
Type: AngularDimension
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AngularDimension.Value"]
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace