Grasshopper API
GH_Light.IsGeometryLoaded Property
 Gets the load state of this light object. The light is considered to be loaded when the local light instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Light.IsGeometryLoaded"]
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace