Grasshopper API
ObjectDraftingLineWidth.Source Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectPlotWeightSource Source { get; }
Public ReadOnly Property Source As ObjectPlotWeightSource
	Get
Property Value
Type: ObjectPlotWeightSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Source"]
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace