Grasshopper API
ModelObject.Drafting Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDrafting Drafting { get; }
Public ReadOnly Property Drafting As ObjectDrafting
	Get
Property Value
Type: ObjectDrafting
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Drafting"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace