Grasshopper API
ModelObject.Attributes.Display Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplay Display { get; set; }
Public Property Display As ObjectDisplay
	Get
	Set
Property Value
Type: ObjectDisplay
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.Display"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace