Grasshopper API
AnnotationDimensionSettings.Attributes.CentermarkSize Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? CentermarkSize { get; set; }
Public Property CentermarkSize As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.CentermarkSize"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace