Grasshopper API
ClippingArrow.ArrowType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrowType? ArrowType { get; }
Public ReadOnly Property ArrowType As ClippingArrowType?
	Get
Property Value
Type: Nullable<ClippingArrowType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ClippingArrow.ArrowType"]
See Also
Reference
ClippingArrow Class
Grasshopper.Rhinoceros.Annotations Namespace