Grasshopper API
ModelAnnotationStyle.UnitsSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationUnitsSettings UnitsSettings { get; }
Public ReadOnly Property UnitsSettings As AnnotationUnitsSettings
	Get
Property Value
Type: AnnotationUnitsSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.UnitsSettings"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace