Grasshopper API
AnnotationToleranceSettings.ToleranceHeightScale Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? ToleranceHeightScale { get; }
Public ReadOnly Property ToleranceHeightScale As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.ToleranceHeightScale"]
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace