Grasshopper API
AnnotationTextSettings.Attributes.MaskColorSource Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public MaskType? MaskColorSource { get; set; }
Public Property MaskColorSource As MaskType?
	Get
	Set
Property Value
Type: Nullable<MaskType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes.MaskColorSource"]
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace