Grasshopper API
ItemDisplayColor.Value.Source Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ItemColorSource Source { get; }
Public ReadOnly Property Source As ItemColorSource
	Get
Property Value
Type: ItemColorSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value.Source"]
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace