Grasshopper API
ModelInstanceDefinition.Unset Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelInstanceDefinition Unset { get; }
Public Shared ReadOnly Property Unset As ModelInstanceDefinition
	Get
Property Value
Type: ModelInstanceDefinition
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Unset"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace