Grasshopper API
AnnotationUnitsSettings.AngleZeroSuppression Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ZeroSuppression? AngleZeroSuppression { get; }
Public ReadOnly Property AngleZeroSuppression As ZeroSuppression?
	Get
Property Value
Type: Nullable<ZeroSuppression>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.AngleZeroSuppression"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace