Grasshopper API
ModelLinetype.Segments Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<double> Segments { get; }
Public ReadOnly Property Segments As IReadOnlyList(Of Double)
	Get
Property Value
Type: IReadOnlyList<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.Segments"]
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace