Grasshopper API
Param_ModelInstanceDefinition.Hidden Property
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.Params.Param_ModelInstanceDefinition.Hidden"]
Implements
IGH_PreviewObject.Hidden
See Also
Reference
Param_ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model.Params Namespace