Grasshopper API
ModelDataParam<T>.Icon Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.ModelDataParam`1.Icon"]
See Also
Reference
ModelDataParam<T> Class
Grasshopper.Rhinoceros.Params Namespace