Grasshopper API
ModelRenderMaterial.Unset Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelRenderMaterial Unset { get; }
Public Shared ReadOnly Property Unset As ModelRenderMaterial
	Get
Property Value
Type: ModelRenderMaterial
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderMaterial.Unset"]
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace