Grasshopper API
AnnotationToleranceSettings.Attributes.ToleranceUpperValue Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? ToleranceUpperValue { get; set; }
Public Property ToleranceUpperValue As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.Attributes.ToleranceUpperValue"]
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace