Grasshopper API
ModelLinetype.Unset Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLinetype Unset { get; }
Public Shared ReadOnly Property Unset As ModelLinetype
	Get
Property Value
Type: ModelLinetype
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.Unset"]
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace