Grasshopper API
ModelContent.Tags Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTags Tags { get; }
Public ReadOnly Property Tags As ModelTags
	Get
Property Value
Type: ModelTags
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Tags"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace