Grasshopper API
GH_AnnotationBase.IsGeometryLoaded Property
 Gets the load state of this annotation object. The annotation is considered to be loaded when the local annotation instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.IsGeometryLoaded"]
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace