Grasshopper API
ModelObject.Attributes.Render Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectRender Render { get; set; }
Public Property Render As ObjectRender
	Get
	Set
Property Value
Type: ObjectRender
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.Render"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace