Grasshopper API
PageSettings.Attributes.PaperHeight Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? PaperHeight { get; set; }
Public Property PaperHeight As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.Attributes.PaperHeight"]
See Also
Reference
PageSettings.Attributes Class
Grasshopper.Rhinoceros.Display Namespace