Grasshopper API
CentralSettings.CapsuleShine Property
 Gets or sets the global setting for drawing shiny edges on capsules.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool CapsuleShine { get; set; }
Public Shared Property CapsuleShine As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CapsuleShine"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace