Grasshopper API
AnnotationTextSettings.FitText Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextFit? FitText { get; }
Public ReadOnly Property FitText As TextFit?
	Get
Property Value
Type: Nullable<TextFit>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.FitText"]
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace