Grasshopper API
AnnotationTextSettings.DrawTextMask Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? DrawTextMask { get; }
Public ReadOnly Property DrawTextMask As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.DrawTextMask"]
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace