Grasshopper API
ModelAnnotationStyle.Attributes.ArrowSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrowSettings ArrowSettings { get; set; }
Public Property ArrowSettings As AnnotationArrowSettings
	Get
	Set
Property Value
Type: AnnotationArrowSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes.ArrowSettings"]
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace