Grasshopper API
ModelHatchPattern.Unset Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelHatchPattern Unset { get; }
Public Shared ReadOnly Property Unset As ModelHatchPattern
	Get
Property Value
Type: ModelHatchPattern
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Unset"]
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace