Grasshopper API
AnnotationToleranceSettings.ToleranceUpperValue Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? ToleranceUpperValue { get; }
Public ReadOnly Property ToleranceUpperValue As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.ToleranceUpperValue"]
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace