Grasshopper API
ModelView.Title Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Title { get; }
Public ReadOnly Property Title As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelView.Title"]
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace