Grasshopper API
AnnotationDimensionSettings.RadialTextLocation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextLocation? RadialTextLocation { get; }
Public ReadOnly Property RadialTextLocation As TextLocation?
	Get
Property Value
Type: Nullable<TextLocation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.RadialTextLocation"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace