Grasshopper API
DisplayColorGradient.ClippingBox Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.DisplayColorGradient.ClippingBox"]
Implements
IGH_PreviewData.ClippingBox
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace