Grasshopper API
ModelHatchLine.Base Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Point2d Base { get; }
Public ReadOnly Property Base As Point2d
	Get
Property Value
Type: Point2d
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Base"]
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace