Grasshopper API
GH_Predicate.Present Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Predicate Present { get; }
Public Shared ReadOnly Property Present As GH_Predicate
	Get
Property Value
Type: GH_Predicate
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.Present"]
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace