Grasshopper API
GH_Hatch.GH_HatchProxy.BasePoint Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Point3d_Wrapper BasePoint { get; }
Public ReadOnly Property BasePoint As GH_Point3d_Wrapper
	Get
Property Value
Type: GH_Point3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.GH_HatchProxy.BasePoint"]
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace