Grasshopper API
IGH_ContextualParameter.AtMost Property
 Maximum number of inputs to request.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
int AtMost { get; }
ReadOnly Property AtMost As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ContextualParameter.AtMost"]
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace