Grasshopper API
ModelObject.IsValidWhyNot Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override string IsValidWhyNot { get; }
Protected Overrides ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.IsValidWhyNot"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace