Grasshopper API
ModelRenderSun.Manual Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Manual { get; }
Public ReadOnly Property Manual As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Manual"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace