Grasshopper API
AnnotationArrowSettings.Attributes.ClippingArrow2 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrow ClippingArrow2 { get; set; }
Public Property ClippingArrow2 As ClippingArrow
	Get
	Set
Property Value
Type: ClippingArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.ClippingArrow2"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace