Grasshopper API
ModelTextureSlot.Attributes.Amount Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Amount { get; set; }
Public Property Amount As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Attributes.Amount"]
See Also
Reference
ModelTextureSlot.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace