Grasshopper API
GH_Hatch.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Hatch Value { get; set; }
Public Overrides Property Value As Hatch
	Get
	Set
Property Value
Type: Hatch
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.Value"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace