Grasshopper API
ModelMeshingParameters.DefaultAnalysis Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelMeshingParameters DefaultAnalysis { get; }
Public Shared ReadOnly Property DefaultAnalysis As ModelMeshingParameters
	Get
Property Value
Type: ModelMeshingParameters
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelMeshingParameters.DefaultAnalysis"]
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace