Grasshopper API
Param_ModelHatchPattern.Icon Property
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.Params.Param_ModelHatchPattern.Icon"]
See Also
Reference
Param_ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting.Params Namespace