Grasshopper API
GH_Document.ContainsCustomPreviewObjects Property
 Gets whether this document contains *any* custom preview objects.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool ContainsCustomPreviewObjects { get; }
Public ReadOnly Property ContainsCustomPreviewObjects As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ContainsCustomPreviewObjects"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace