Grasshopper API
AnnotationArrowSettings.Attributes.ClippingArrow1 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrow ClippingArrow1 { get; set; }
Public Property ClippingArrow1 As ClippingArrow
	Get
	Set
Property Value
Type: ClippingArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.ClippingArrow1"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace