Grasshopper API
AnnotationArrow.Attributes.ArrowType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ArrowType? ArrowType { get; set; }
Public Property ArrowType As ArrowType?
	Get
	Set
Property Value
Type: Nullable<ArrowType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrow.Attributes.ArrowType"]
See Also
Reference
AnnotationArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace