Grasshopper API
GH_Predicate.True Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Predicate True { get; }
Public Shared ReadOnly Property True As GH_Predicate
	Get
Property Value
Type: GH_Predicate
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.True"]
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace