Grasshopper API
ClippingDrawingSettings.Attributes.SectionHatch Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? SectionHatch { get; set; }
Public Property SectionHatch As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes.SectionHatch"]
See Also
Reference
ClippingDrawingSettings.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace