Grasshopper API
ObjectRenderMaterial.Material Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial Material { get; }
Public ReadOnly Property Material As ModelRenderMaterial
	Get
Property Value
Type: ModelRenderMaterial
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Material"]
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace