Grasshopper API
CentralSettings.CanvasSpaceIsRadialMenu Property
 Gets or sets whether the space bar triggers the radial menu (pre Rhino 6.3 behaviour) or the Create menu (post Rhino 6.3 behaviour).
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool CanvasSpaceIsRadialMenu { get; set; }
Public Shared Property CanvasSpaceIsRadialMenu As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasSpaceIsRadialMenu"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace