Grasshopper API
GH_SubD.IsGeometryLoaded Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.IsGeometryLoaded"]
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace