Grasshopper API
ModelViewport.ViewportType Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual ViewportType ViewportType { get; }
Public Overridable ReadOnly Property ViewportType As ViewportType
	Get
Property Value
Type: ViewportType
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.ViewportType"]
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace