Grasshopper API
ModelAnnotationStyle.TextSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationTextSettings TextSettings { get; }
Public ReadOnly Property TextSettings As AnnotationTextSettings
	Get
Property Value
Type: AnnotationTextSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.TextSettings"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace