Grasshopper API
GH_AnnotationBase.Overrides Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle Overrides { get; set; }
Public Property Overrides As ModelAnnotationStyle
	Get
	Set
Property Value
Type: ModelAnnotationStyle
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.Overrides"]
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace