Grasshopper API
ModelContent.Attributes.Notes Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Notes { get; set; }
Public Property Notes As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Attributes.Notes"]
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace