Grasshopper API
GH_Light.IsValid Property
 Gets the validity of this light. If the light is referenced but cannot be loaded, then the light is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Light.IsValid"]
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace