Grasshopper API
GH_AnnotationBase.ValueType Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected abstract Type ValueType { get; }
Protected MustOverride ReadOnly Property ValueType As Type
	Get
Property Value
Type: Type
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.ValueType"]
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace