Grasshopper API
GH_Hatch.GH_HatchProxy.PatternScale Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double PatternScale { get; }
Public ReadOnly Property PatternScale As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.GH_HatchProxy.PatternScale"]
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace