Grasshopper API
AnnotationArrowSettings.Attributes.Arrow1 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrow Arrow1 { get; set; }
Public Property Arrow1 As AnnotationArrow
	Get
	Set
Property Value
Type: AnnotationArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.Arrow1"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace