Grasshopper API
GH_DocumentEditor.ForeColor Property
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Color ForeColor { get; set; }
Public Overrides Property ForeColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DocumentEditor.ForeColor"]
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace