Grasshopper API
IGH_ContextualParameter.Prompt Property
 Gets the prompt to be displayed while asking the user to enter data. The prompt string may contain '{0}' fields which will be populated with the amount of values picked so far.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
string Prompt { get; }
ReadOnly Property Prompt As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ContextualParameter.Prompt"]
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace