Grasshopper API
ModelFont.FamilyName Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string FamilyName { get; }
Public ReadOnly Property FamilyName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelFont.FamilyName"]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace