Grasshopper API
Param_DisplayColorGradient.IsPreviewCapable Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsPreviewCapable { get; }
Public ReadOnly Property IsPreviewCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_DisplayColorGradient.IsPreviewCapable"]
Implements
IGH_PreviewObject.IsPreviewCapable
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace