Grasshopper API
GH_AssemblyInfoStub.AuthorName Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string AuthorName { get; }
Public Overrides ReadOnly Property AuthorName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfoStub.AuthorName"]
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace