Grasshopper API
ModelTextureMapping.MappingType Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextureMappingType? MappingType { get; }
Public ReadOnly Property MappingType As TextureMappingType?
	Get
Property Value
Type: Nullable<TextureMappingType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.MappingType"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace