Grasshopper API
GH_DetailView.IsValid Property
 Gets the validity of this detail view. If the detail view is referenced but cannot be loaded, the detail view is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_DetailView.IsValid"]
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace