Grasshopper API
AnnotationDimensionSettings.Attributes.ExtensionLineOffset Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? ExtensionLineOffset { get; set; }
Public Property ExtensionLineOffset As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.ExtensionLineOffset"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace