Grasshopper API
GH_Extrusion.GH_ExtrusionProxy.CapCount Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int CapCount { get; }
Public ReadOnly Property CapCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Extrusion.GH_ExtrusionProxy.CapCount"]
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace