Grasshopper API
ModelHatchLine.Angle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double Angle { get; }
Public ReadOnly Property Angle As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Angle"]
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace