Grasshopper API
ObjectDrafting.Attributes.LineScale Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? LineScale { get; set; }
Public Property LineScale As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes.LineScale"]
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace