Grasshopper API
ModelTextureMapping.Attributes.Channel Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? Channel { get; set; }
Public Property Channel As Integer?
	Get
	Set
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.Channel"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace