Grasshopper API
ModelTextureMapping.Unset Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelTextureMapping Unset { get; }
Public Shared ReadOnly Property Unset As ModelTextureMapping
	Get
Property Value
Type: ModelTextureMapping
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Unset"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace