Grasshopper API
ModelEarthAnchorPoint.SphereUParameter Property
 Gets the spherical U parameter.
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? SphereUParameter { get; }
Public ReadOnly Property SphereUParameter As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.SphereUParameter"]
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace