Grasshopper API
ModelContentName.IsDefaultOrEmpty Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsDefaultOrEmpty { get; }
Public ReadOnly Property IsDefaultOrEmpty As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContentName.IsDefaultOrEmpty"]
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace