Grasshopper API
ClippingDrawingSettings.Attributes.Hidden Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Hidden { get; set; }
Public Property Hidden As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes.Hidden"]
See Also
Reference
ClippingDrawingSettings.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace