Grasshopper API
ModelLayer.Attributes.DisplayColor Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor? DisplayColor { get; set; }
Public Property DisplayColor As ModelColor?
	Get
	Set
Property Value
Type: Nullable<ModelColor>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.DisplayColor"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace