Grasshopper API
ModelLayer.Hidden Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Hidden { get; }
Public ReadOnly Property Hidden As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Hidden"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace