Grasshopper API
GH_Hatch.BoundaryPlotWeightMillimeters Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double BoundaryPlotWeightMillimeters { get; set; }
Public Property BoundaryPlotWeightMillimeters As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BoundaryPlotWeightMillimeters"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace