Grasshopper API
CentralSettings.CanvasMaxSearchResults Property
 Gets or sets the maximum number of search results for populating the Create menu.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int CanvasMaxSearchResults { get; set; }
Public Shared Property CanvasMaxSearchResults As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasMaxSearchResults"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace