Grasshopper API
AnnotationArrowSettings.Attributes.LeaderArrow Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrow LeaderArrow { get; set; }
Public Property LeaderArrow As AnnotationArrow
	Get
	Set
Property Value
Type: AnnotationArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.LeaderArrow"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace