Grasshopper API
ObjectDraftingLineWidth.Value.ByParent Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingLineWidth.Value ByParent { get; }
Public Shared ReadOnly Property ByParent As ObjectDraftingLineWidth.Value
	Get
Property Value
Type: ObjectDraftingLineWidth.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value.ByParent"]
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace