Grasshopper API
GH_GeometryGroup.Name Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometryGroup.Name"]
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace