Grasshopper API
Instances.RcpPanel Property
 Gets the active document RCP panel instance.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static RemoteControlPanel RcpPanel { get; }
Public Shared ReadOnly Property RcpPanel As RemoteControlPanel
	Get
Property Value
Type: RemoteControlPanel
[Missing <value> documentation for "P:Grasshopper.Instances.RcpPanel"]
See Also
Reference
Instances Class
Grasshopper Namespace