Grasshopper API
ModelSectionStyle.Attributes.BackgroundFillColor Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color? BackgroundFillColor { get; set; }
Public Property BackgroundFillColor As Color?
	Get
	Set
Property Value
Type: Nullable<Color>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.BackgroundFillColor"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace