Grasshopper API
GH_Hatch.BoundaryVisible Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool BoundaryVisible { get; set; }
Public Property BoundaryVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BoundaryVisible"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace