Grasshopper API
ModelObject.TypeName Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.TypeName"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace