Grasshopper API
AnnotationArrowSettings.Arrow2 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrow Arrow2 { get; }
Public ReadOnly Property Arrow2 As AnnotationArrow
	Get
Property Value
Type: AnnotationArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Arrow2"]
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace