Grasshopper API
AnnotationArrow.ArrowBlock Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition ArrowBlock { get; }
Public ReadOnly Property ArrowBlock As ModelInstanceDefinition
	Get
Property Value
Type: ModelInstanceDefinition
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrow.ArrowBlock"]
See Also
Reference
AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations Namespace