Grasshopper API
ModelEarthAnchorPoint.Attributes.Elevation Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Elevation { get; set; }
Public Property Elevation As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes.Elevation"]
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace