Grasshopper API
GH_ParameterContext.Name Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParameterContext.Name"]
See Also
Reference
GH_ParameterContext Class
Grasshopper.Kernel Namespace