Grasshopper API
ModelHatchPattern.Units Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem.Value? Units { get; }
Public ReadOnly Property Units As ModelUnitSystem.Value?
	Get
Property Value
Type: Nullable<ModelUnitSystem.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Units"]
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace