Grasshopper API
GH_AsynchFileData.Callback Property
 Gets or sets the callback delegate to be used when properties are updated.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_AsynchFileData.FileChangedDelegate Callback { get; set; }
Public Property Callback As GH_AsynchFileData.FileChangedDelegate
	Get
	Set
Property Value
Type: GH_AsynchFileData.FileChangedDelegate
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.Callback"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace