Grasshopper API
Param_ModelUnitSystem.Exposure Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_ModelUnitSystem.Exposure"]
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace