Grasshopper API
CentralSettings.TooltipVisible Property
 Gets or sets whether the tooltip is shown.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool TooltipVisible { get; set; }
Public Shared Property TooltipVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.TooltipVisible"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace