Grasshopper API
GH_Document.PreviewBoundary Property
 Gets or sets the preview boundary applied to this document. If a boundary has been set, only those objects which are inside the boundary will be previewed.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PreviewBoundary PreviewBoundary { get; set; }
Public Property PreviewBoundary As GH_PreviewBoundary
	Get
	Set
Property Value
Type: GH_PreviewBoundary
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewBoundary"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace