Grasshopper API
AnnotationDimensionSettings.Attributes.TextLocation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextLocation? TextLocation { get; set; }
Public Property TextLocation As TextLocation?
	Get
	Set
Property Value
Type: Nullable<TextLocation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.TextLocation"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace