Grasshopper API
ModelRenderSun.Direction Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? Direction { get; }
Public ReadOnly Property Direction As Vector3d?
	Get
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Direction"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace