Grasshopper API
ObjectDraftingLinetype.Value.ByParent Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingLinetype.Value ByParent { get; }
Public Shared ReadOnly Property ByParent As ObjectDraftingLinetype.Value
	Get
Property Value
Type: ObjectDraftingLinetype.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value.ByParent"]
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace