Grasshopper API
GH_Hatch.IsValid Property
 Gets the validity of this hatch. If the hatch is referenced but cannot be loaded, the hatch is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.IsValid"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace