Grasshopper API
ModelSectionStyle.Name Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ModelContentName Name { get; }
Public Overrides ReadOnly Property Name As ModelContentName
	Get
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Name"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace