Grasshopper API
ModelRenderSun.DaylightSavingMinutes Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? DaylightSavingMinutes { get; }
Public ReadOnly Property DaylightSavingMinutes As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.DaylightSavingMinutes"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace