Grasshopper API
GH_Hatch.BoundaryColorSource Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ItemColorSource BoundaryColorSource { get; set; }
Public Property BoundaryColorSource As ItemColorSource
	Get
	Set
Property Value
Type: ItemColorSource
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BoundaryColorSource"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace