Grasshopper API
ModelInstanceDefinition.UrlDescription Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string UrlDescription { get; }
Public ReadOnly Property UrlDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.UrlDescription"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace