Grasshopper API
ModelDisplayMode.Unset Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelDisplayMode Unset { get; }
Public Shared ReadOnly Property Unset As ModelDisplayMode
	Get
Property Value
Type: ModelDisplayMode
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelDisplayMode.Unset"]
See Also
Reference
ModelDisplayMode Class
Grasshopper.Rhinoceros.Display Namespace