Grasshopper API
AnnotationUnitsSettings.Attributes.AngleZeroSuppression Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ZeroSuppression? AngleZeroSuppression { get; set; }
Public Property AngleZeroSuppression As ZeroSuppression?
	Get
	Set
Property Value
Type: Nullable<ZeroSuppression>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.AngleZeroSuppression"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace