Grasshopper API
ModelAnnotationStyle.Attributes.TextSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationTextSettings TextSettings { get; set; }
Public Property TextSettings As AnnotationTextSettings
	Get
	Set
Property Value
Type: AnnotationTextSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes.TextSettings"]
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace