Grasshopper API
ObjectSectionStyle.Value.ByObject Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectSectionStyle.Value ByObject { get; }
Public Shared ReadOnly Property ByObject As ObjectSectionStyle.Value
	Get
Property Value
Type: ObjectSectionStyle.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value.ByObject"]
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace