Grasshopper API
GH_Plane.IsGeometryLoaded Property
 Gets the load state of this plane. The plane is considered to be loaded when it is valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Plane.IsGeometryLoaded"]
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace