Grasshopper API
ObjectRender.ReceivesShadows Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? ReceivesShadows { get; }
Public ReadOnly Property ReceivesShadows As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.ReceivesShadows"]
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace