Grasshopper API
GH_InstanceReference.IsValid Property
 Gets the validity of this instance reference. If the instance reference is referenced but cannot be loaded, the instance reference is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_InstanceReference.IsValid"]
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace