Grasshopper API
ModelSectionStyle.HatchPattern Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern HatchPattern { get; }
Public ReadOnly Property HatchPattern As ModelHatchPattern
	Get
Property Value
Type: ModelHatchPattern
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.HatchPattern"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace