Grasshopper API
ClippingDrawingSettings.Attributes.AttributesSource Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingDrawingSettings.AttributeSource? AttributesSource { get; set; }
Public Property AttributesSource As ClippingDrawingSettings.AttributeSource?
	Get
	Set
Property Value
Type: Nullable<ClippingDrawingSettings.AttributeSource>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes.AttributesSource"]
See Also
Reference
ClippingDrawingSettings.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace