Grasshopper API
AnnotationUnitsSettings.Prefix Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Prefix { get; }
Public ReadOnly Property Prefix As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Prefix"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace