Grasshopper API
ModelContentParam<T>.IsBakeCapable Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsBakeCapable { get; }
Public ReadOnly Property IsBakeCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.ModelContentParam`1.IsBakeCapable"]
Implements
IGH_BakeAwareObject.IsBakeCapable
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace