Grasshopper API
ModelRenderSun.Latitude Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Latitude { get; }
Public ReadOnly Property Latitude As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Latitude"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace