Grasshopper API
GH_OrdinateDimension.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public OrdinateDimension Value { get; set; }
Public Property Value As OrdinateDimension
	Get
	Set
Property Value
Type: OrdinateDimension
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_OrdinateDimension.Value"]
See Also
Reference
GH_OrdinateDimension Class
Grasshopper.Kernel.Types Namespace