Grasshopper API
ModelAnnotationStyle.Attributes.DimensionSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationDimensionSettings DimensionSettings { get; set; }
Public Property DimensionSettings As AnnotationDimensionSettings
	Get
	Set
Property Value
Type: AnnotationDimensionSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes.DimensionSettings"]
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace