Grasshopper API
ModelUnitSystem.Value.ModelUnits Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUnitSystem.Value ModelUnits { get; }
Public Shared ReadOnly Property ModelUnits As ModelUnitSystem.Value
	Get
Property Value
Type: ModelUnitSystem.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.ModelUnits"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace