Grasshopper API
GH_PointCloud.IsValid Property
 Gets the validity of this curve. If the curve is referenced but cannot be loaded, the curve is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.IsValid"]
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace