Grasshopper API
AnnotationLeaderSettings.Attributes.TextHorizontalAlignment Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextHorizontalAlignment? TextHorizontalAlignment { get; set; }
Public Property TextHorizontalAlignment As TextHorizontalAlignment?
	Get
	Set
Property Value
Type: Nullable<TextHorizontalAlignment>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes.TextHorizontalAlignment"]
See Also
Reference
AnnotationLeaderSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace