Grasshopper API
ModelObject.Attributes.Frame Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Plane? Frame { get; set; }
Public Property Frame As Plane?
	Get
	Set
Property Value
Type: Nullable<Plane>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.Frame"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace