Grasshopper API
GH_InstanceReference.GH_InstanceReferenceProxy.Definition Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Definition { get; }
Public ReadOnly Property Definition As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_InstanceReference.GH_InstanceReferenceProxy.Definition"]
See Also
Reference
GH_InstanceReference.GH_InstanceReferenceProxy Class
Grasshopper.Kernel.Types Namespace