Grasshopper API
ModelViewport.Space Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual ActiveSpace Space { get; }
Public Overridable ReadOnly Property Space As ActiveSpace
	Get
Property Value
Type: ActiveSpace
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.Space"]
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace