Grasshopper API
ObjectRenderMaterial.Value.ByParent Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectRenderMaterial.Value ByParent { get; }
Public Shared ReadOnly Property ByParent As ObjectRenderMaterial.Value
	Get
Property Value
Type: ObjectRenderMaterial.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value.ByParent"]
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace