Grasshopper API
CentralSettings.ShowTutorials Property
 Gets or sets whether the tutorial browser is shown on Grasshopper load.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool ShowTutorials { get; set; }
Public Shared Property ShowTutorials As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.ShowTutorials"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace