Grasshopper API
AnnotationToleranceSettings.Attributes.ToleranceLowerValue Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? ToleranceLowerValue { get; set; }
Public Property ToleranceLowerValue As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.Attributes.ToleranceLowerValue"]
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace