Grasshopper API
ModelLinetype.TaperPoints Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<Point2d> TaperPoints { get; }
Public ReadOnly Property TaperPoints As IReadOnlyList(Of Point2d)
	Get
Property Value
Type: IReadOnlyList<Point2d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.TaperPoints"]
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace