Grasshopper API
ModelSectionStyle.Attributes.BoundaryLinetype Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype BoundaryLinetype { get; set; }
Public Property BoundaryLinetype As ModelLinetype
	Get
	Set
Property Value
Type: ModelLinetype
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.BoundaryLinetype"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace