Grasshopper API
ModelContentParam<T>.StateTags Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_StateTagList StateTags { get; }
Public Overrides ReadOnly Property StateTags As GH_StateTagList
	Get
Property Value
Type: GH_StateTagList
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.ModelContentParam`1.StateTags"]
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace