Grasshopper API
IGH_ContextualParameter.Immediate Property
 Gets whether this parameter triggers immediate updates from inside its getter. Immediacy is important for a smooth experience, but it maybe disabled if the expected recalculation time becomes excessive.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
bool Immediate { get; }
ReadOnly Property Immediate As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ContextualParameter.Immediate"]
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace