Grasshopper API
GH_AngularDimension.Arc Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Arc Arc { get; }
Public ReadOnly Property Arc As Arc
	Get
Property Value
Type: Arc
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AngularDimension.Arc"]
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace