Grasshopper API
ModelUnitSystem.Value.MetersPerUnit Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double MetersPerUnit { get; }
Public ReadOnly Property MetersPerUnit As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.MetersPerUnit"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace