Grasshopper API
ObjectDisplayColor.Value.Source Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectColorSource Source { get; }
Public ReadOnly Property Source As ObjectColorSource
	Get
Property Value
Type: ObjectColorSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value.Source"]
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace