Grasshopper API
GH_PointCloud.PointCloudProxy.ContainsNormals Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool ContainsNormals { get; }
Public ReadOnly Property ContainsNormals As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.PointCloudProxy.ContainsNormals"]
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace