Grasshopper API
GH_Hatch.BoundaryColor Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color BoundaryColor { get; set; }
Public Property BoundaryColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BoundaryColor"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace