Grasshopper API
AnnotationArrow.Attributes.ArrowBlock Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition ArrowBlock { get; set; }
Public Property ArrowBlock As ModelInstanceDefinition
	Get
	Set
Property Value
Type: ModelInstanceDefinition
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrow.Attributes.ArrowBlock"]
See Also
Reference
AnnotationArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace