Grasshopper API
GH_Hatch.Pattern Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern Pattern { get; set; }
Public Property Pattern As ModelHatchPattern
	Get
	Set
Property Value
Type: ModelHatchPattern
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.Pattern"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace