Grasshopper API
AnnotationArrowSettings.Attributes.Arrow2 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrow Arrow2 { get; set; }
Public Property Arrow2 As AnnotationArrow
	Get
	Set
Property Value
Type: AnnotationArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.Arrow2"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace