Grasshopper API
ModelTextureMapping.Attributes.TextureSpace Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextureSpace? TextureSpace { get; set; }
Public Property TextureSpace As TextureSpace?
	Get
	Set
Property Value
Type: Nullable<TextureSpace>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.TextureSpace"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace