Grasshopper API
ModelObject.BoundingBox Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.BoundingBox"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace