Grasshopper API
ModelLinetype.Attributes.TaperPoints Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<Point2d> TaperPoints { get; set; }
Public Property TaperPoints As IReadOnlyList(Of Point2d)
	Get
	Set
Property Value
Type: IReadOnlyList<Point2d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes.TaperPoints"]
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace