Grasshopper API
ModelLayer.Attributes.DraftingColor Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor? DraftingColor { get; set; }
Public Property DraftingColor As ModelColor?
	Get
	Set
Property Value
Type: Nullable<ModelColor>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.DraftingColor"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace