Grasshopper API
ModelLayer.Material Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial Material { get; }
Public ReadOnly Property Material As ModelRenderMaterial
	Get
Property Value
Type: ModelRenderMaterial
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Material"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace