Grasshopper API
ModelEarthAnchorPoint.Attributes.ElevationCoordinateSystem Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public EarthCoordinateSystem? ElevationCoordinateSystem { get; set; }
Public Property ElevationCoordinateSystem As EarthCoordinateSystem?
	Get
	Set
Property Value
Type: Nullable<EarthCoordinateSystem>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes.ElevationCoordinateSystem"]
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace