Grasshopper API
ModelLayer.Attributes.HiddenOnNewDetail Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? HiddenOnNewDetail { get; set; }
Public Property HiddenOnNewDetail As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.HiddenOnNewDetail"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace