Grasshopper API
GH_PersistentGeometryParam<T>.StateTags Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_StateTagList StateTags { get; }
Public Overrides ReadOnly Property StateTags As GH_StateTagList
	Get
Property Value
Type: GH_StateTagList
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PersistentGeometryParam`1.StateTags"]
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace