Grasshopper API
AnnotationDimensionSettings.Attributes.BaselineSpacing Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? BaselineSpacing { get; set; }
Public Property BaselineSpacing As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.BaselineSpacing"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace