Grasshopper API
GH_Hatch.GH_HatchProxy.PatternRotation Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double PatternRotation { get; }
Public ReadOnly Property PatternRotation As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.GH_HatchProxy.PatternRotation"]
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace