Grasshopper API
ModelContent.Attributes.Name Property
 The last component of the element Path.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContentName Name { get; set; }
Public Property Name As ModelContentName
	Get
	Set
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Attributes.Name"]
Return Value
Type: ModelContentName
Remarks
Just 'Name' in case it is nested like 'Root::Parent::Name'.
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace