Grasshopper API
ModelComponentContent.Attributes.UserText Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText UserText { get; set; }
Public Property UserText As ModelUserText
	Get
	Set
Property Value
Type: ModelUserText
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelComponentContent.Attributes.UserText"]
See Also
Reference
ModelComponentContent.Attributes Class
Grasshopper.Rhinoceros Namespace