Grasshopper API
GH_AnnotationBase.GH_AnnotationBaseProxy<T>.PlainText Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string PlainText { get; }
Public ReadOnly Property PlainText As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.GH_AnnotationBaseProxy`1.PlainText"]
See Also
Reference
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Grasshopper.Kernel.Types Namespace