Grasshopper API
ModelObject.Attributes.Drafting Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDrafting Drafting { get; set; }
Public Property Drafting As ObjectDrafting
	Get
	Set
Property Value
Type: ObjectDrafting
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.Drafting"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace