Grasshopper API
ModelUnitSystem.Value.Inches Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUnitSystem.Value Inches { get; }
Public Shared ReadOnly Property Inches As ModelUnitSystem.Value
	Get
Property Value
Type: ModelUnitSystem.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.Inches"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace