Grasshopper API
Param_AngularDimension.ClippingBox Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_AngularDimension.ClippingBox"]
Implements
IGH_PreviewObject.ClippingBox
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace