Grasshopper API
GH_SubD.GH_SubDProxy.FaceCount Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int FaceCount { get; }
Public ReadOnly Property FaceCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.GH_SubDProxy.FaceCount"]
See Also
Reference
GH_SubD.GH_SubDProxy Class
Grasshopper.Kernel.Types Namespace