Grasshopper API
ModelTextureSlot.Number Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Number { get; }
Public ReadOnly Property Number As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Number"]
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace