Grasshopper API
GH_Light.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Light Value { get; set; }
Public Overrides Property Value As Light
	Get
	Set
Property Value
Type: Light
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Light.Value"]
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace