Grasshopper API
Param_Light.Icon Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_Light.Icon"]
See Also
Reference
Param_Light Class
Grasshopper.Kernel.Parameters Namespace