Grasshopper API
GH_SubD.IsValidWhyNot Property
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string IsValidWhyNot { get; }
Public Overrides ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.IsValidWhyNot"]
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace