Grasshopper API
ModelRenderSun.Altitude Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Altitude { get; }
Public ReadOnly Property Altitude As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Altitude"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace