Grasshopper API
ModelEarthAnchorPoint.ModelCompass Property
 Gets the corresponding compass plane in model coordinates
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Plane? ModelCompass { get; }
Public ReadOnly Property ModelCompass As Plane?
	Get
Property Value
Type: Nullable<Plane>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.ModelCompass"]
Remarks
X axis points East, Y axis points North and Z axis points Up
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace