Grasshopper API
ModelRenderContent.Attributes.RenderContent Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal RenderContent RenderContent { get; set; }
Protected Friend Property RenderContent As RenderContent
	Get
	Set
Property Value
Type: RenderContent
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes.RenderContent"]
See Also
Reference
ModelRenderContent.Attributes Class
Grasshopper.Rhinoceros.Render Namespace