Grasshopper API
AnnotationUnitsSettings.StackFractionFormat Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public StackDisplayFormat? StackFractionFormat { get; }
Public ReadOnly Property StackFractionFormat As StackDisplayFormat?
	Get
Property Value
Type: Nullable<StackDisplayFormat>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.StackFractionFormat"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace