Grasshopper API
ModelSectionStyle.Attributes.BoundaryPrintColor Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color? BoundaryPrintColor { get; set; }
Public Property BoundaryPrintColor As Color?
	Get
	Set
Property Value
Type: Nullable<Color>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.BoundaryPrintColor"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace