Grasshopper API
GH_AnnotationBase.GH_AnnotationBaseProxy<T>.ObjectID Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ObjectID { get; set; }
Public Property ObjectID As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.GH_AnnotationBaseProxy`1.ObjectID"]
See Also
Reference
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Grasshopper.Kernel.Types Namespace