Grasshopper API
ModelAnnotationStyle.Attributes.ToleranceSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationToleranceSettings ToleranceSettings { get; set; }
Public Property ToleranceSettings As AnnotationToleranceSettings
	Get
	Set
Property Value
Type: AnnotationToleranceSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes.ToleranceSettings"]
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace