Grasshopper API
GH_Material.RdkMaterialRmtl Property
 Gets or sets the RDK material RMTL file path.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string RdkMaterialRmtl { get; set; }
Public Property RdkMaterialRmtl As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.RdkMaterialRmtl"]
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace