Grasshopper API
GH_AngularDimension.Line1 Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Line Line1 { get; }
Public ReadOnly Property Line1 As Line
	Get
Property Value
Type: Line
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AngularDimension.Line1"]
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace