Grasshopper API
Instances.RunningHeadless Property
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool RunningHeadless { get; }
Public Shared ReadOnly Property RunningHeadless As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.RunningHeadless"]
See Also
Reference
Instances Class
Grasshopper Namespace