Grasshopper API
GH_Material.Type Property
 Gets the implied type based on what fields have been assigned.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Material.MaterialType Type { get; }
Public ReadOnly Property Type As GH_Material.MaterialType
	Get
Property Value
Type: GH_Material.MaterialType
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.Type"]
Return Value
Type: GH_Material.MaterialType
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace