Grasshopper API
AnnotationUnitsSettings.Attributes.StackFractionFormat Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public StackDisplayFormat? StackFractionFormat { get; set; }
Public Property StackFractionFormat As StackDisplayFormat?
	Get
	Set
Property Value
Type: Nullable<StackDisplayFormat>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.StackFractionFormat"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace