Grasshopper API
ModelLineWidth.NoPrint Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLineWidth NoPrint { get; }
Public Shared ReadOnly Property NoPrint As ModelLineWidth
	Get
Property Value
Type: ModelLineWidth
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.NoPrint"]
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace