Grasshopper API
DisplayColorGradient.IsValid Property
 Gets the validity of this instance.
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.DisplayColorGradient.IsValid"]
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace