Grasshopper API
ObjectVisibility.Attributes.Viewport Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelViewport Viewport { get; set; }
Public Property Viewport As ModelViewport
	Get
	Set
Property Value
Type: ModelViewport
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectVisibility.Attributes.Viewport"]
See Also
Reference
ObjectVisibility.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace