Grasshopper API
Param_ObjectRenderMaterial.Icon Property
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.Params.Param_ObjectRenderMaterial.Icon"]
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace