Grasshopper API
ModelLayer.Attributes.LineWeight Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? LineWeight { get; set; }
Public Property LineWeight As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.LineWeight"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace