Grasshopper API
ModelLineWidth.Default Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLineWidth Default { get; }
Public Shared ReadOnly Property Default As ModelLineWidth
	Get
Property Value
Type: ModelLineWidth
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.Default"]
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace