Grasshopper API
ObjectVisibility.Hidden Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Hidden { get; }
Public ReadOnly Property Hidden As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectVisibility.Hidden"]
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace