Grasshopper API
GH_Extrusion.GH_ExtrusionProxy.ObjectID Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ObjectID { get; set; }
Public Property ObjectID As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Extrusion.GH_ExtrusionProxy.ObjectID"]
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace