Grasshopper API
ModelAnnotationStyle.ArrowSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationArrowSettings ArrowSettings { get; }
Public ReadOnly Property ArrowSettings As AnnotationArrowSettings
	Get
Property Value
Type: AnnotationArrowSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.ArrowSettings"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace