Grasshopper API
ModelHatchLine.Attributes.Offset Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector2d Offset { get; set; }
Public Property Offset As Vector2d
	Get
	Set
Property Value
Type: Vector2d
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Attributes.Offset"]
See Also
Reference
ModelHatchLine.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace