Grasshopper API
GH_BakeUtility.InvalidCount Property
 Gets the number of invalid objects encountered.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int InvalidCount { get; }
Public ReadOnly Property InvalidCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_BakeUtility.InvalidCount"]
See Also
Reference
GH_BakeUtility Class
Grasshopper.Kernel Namespace