Grasshopper API
AnnotationTextSettings.MaskColorSource Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public MaskType? MaskColorSource { get; }
Public ReadOnly Property MaskColorSource As MaskType?
	Get
Property Value
Type: Nullable<MaskType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.MaskColorSource"]
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace