Grasshopper API
AnnotationDimensionSettings.CentermarkStyle Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public CenterMarkStyle? CentermarkStyle { get; }
Public ReadOnly Property CentermarkStyle As CenterMarkStyle?
	Get
Property Value
Type: Nullable<CenterMarkStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.CentermarkStyle"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace