Grasshopper API
GH_AnnotationBase.GH_AnnotationBaseProxy<T>.AnnotationType Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationType AnnotationType { get; }
Public ReadOnly Property AnnotationType As AnnotationType
	Get
Property Value
Type: AnnotationType
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.GH_AnnotationBaseProxy`1.AnnotationType"]
See Also
Reference
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Grasshopper.Kernel.Types Namespace