Grasshopper API
AnnotationLeaderSettings.TextVerticalAlignment Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextVerticalAlignment? TextVerticalAlignment { get; }
Public ReadOnly Property TextVerticalAlignment As TextVerticalAlignment?
	Get
Property Value
Type: Nullable<TextVerticalAlignment>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.TextVerticalAlignment"]
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace