Grasshopper API
Param_ObjectSectionStyle.Exposure Property
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectSectionStyle.Exposure"]
See Also
Reference
Param_ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting.Params Namespace