Grasshopper API
GH_PersistentReferenceParam<T>.Icon Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PersistentReferenceParam`1.Icon"]
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace