Grasshopper API
ModelInstanceDefinition.IsValid Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.IsValid"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace