Grasshopper API
ModelLayer.SectionStyle Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle SectionStyle { get; }
Public ReadOnly Property SectionStyle As ModelSectionStyle
	Get
Property Value
Type: ModelSectionStyle
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.SectionStyle"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace