Grasshopper API
GH_AnnotationBase.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override AnnotationBase Value { get; set; }
Public Overrides Property Value As AnnotationBase
	Get
	Set
Property Value
Type: AnnotationBase
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.Value"]
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace