Grasshopper API
AnnotationLeaderSettings.TextOrientation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextOrientation? TextOrientation { get; }
Public ReadOnly Property TextOrientation As TextOrientation?
	Get
Property Value
Type: Nullable<TextOrientation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.TextOrientation"]
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace