Grasshopper API
ObjectDraftingColor.Color Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor? Color { get; }
Public ReadOnly Property Color As ModelColor?
	Get
Property Value
Type: Nullable<ModelColor>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Color"]
See Also
Reference
ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting Namespace