Grasshopper API
GH_DocumentEditor.CreateParams Property
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override CreateParams CreateParams { get; }
Protected Overrides ReadOnly Property CreateParams As CreateParams
	Get
Property Value
Type: CreateParams
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DocumentEditor.CreateParams"]
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace