Grasshopper API
ObjectSectionStyle.Value.SectionStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle SectionStyle { get; }
Public ReadOnly Property SectionStyle As ModelSectionStyle
	Get
Property Value
Type: ModelSectionStyle
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value.SectionStyle"]
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace