Grasshopper API
Param_ModelTextureSlot.Exposure Property
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.Params.Param_ModelTextureSlot.Exposure"]
See Also
Reference
Param_ModelTextureSlot Class
Grasshopper.Rhinoceros.Render.Params Namespace