Grasshopper API
ClippingDrawingSettings.AttributesSource Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingDrawingSettings.AttributeSource? AttributesSource { get; }
Public ReadOnly Property AttributesSource As ClippingDrawingSettings.AttributeSource?
	Get
Property Value
Type: Nullable<ClippingDrawingSettings.AttributeSource>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.AttributesSource"]
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace