Grasshopper API
ModelTextureSlot.Attributes.Color Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color4f? Color { get; set; }
Public Property Color As Color4f?
	Get
	Set
Property Value
Type: Nullable<Color4f>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Attributes.Color"]
See Also
Reference
ModelTextureSlot.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace