Grasshopper API
GH_DocumentEditor.BackColor Property
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Color BackColor { get; set; }
Public Overrides Property BackColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DocumentEditor.BackColor"]
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace