Grasshopper API
GH_InstanceReference.InstanceDefinition Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelInstanceDefinition InstanceDefinition { get; set; }
Public Property InstanceDefinition As ModelInstanceDefinition
	Get
	Set
Property Value
Type: ModelInstanceDefinition
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_InstanceReference.InstanceDefinition"]
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace