Grasshopper API
ModelRenderSkylight.Attributes.EnvironmentOverride Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? EnvironmentOverride { get; set; }
Public Property EnvironmentOverride As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSkylight.Attributes.EnvironmentOverride"]
See Also
Reference
ModelRenderSkylight.Attributes Class
Grasshopper.Rhinoceros.Render Namespace