Grasshopper API
Param_TextDot.IsPreviewCapable Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsPreviewCapable { get; }
Public ReadOnly Property IsPreviewCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_TextDot.IsPreviewCapable"]
Implements
IGH_PreviewObject.IsPreviewCapable
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace