Grasshopper API
ModelLineWidth.None Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelLineWidth None { get; }
Public Shared ReadOnly Property None As ModelLineWidth
	Get
Property Value
Type: ModelLineWidth
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.None"]
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace