Grasshopper API
GH_Dimension.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Dimension Value { get; set; }
Public Property Value As Dimension
	Get
	Set
Property Value
Type: Dimension
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Dimension.Value"]
See Also
Reference
GH_Dimension Class
Grasshopper.Kernel.Types Namespace