Grasshopper API
ObjectDraftingLinetype.Value.ByLayer Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingLinetype.Value ByLayer { get; }
Public Shared ReadOnly Property ByLayer As ObjectDraftingLinetype.Value
	Get
Property Value
Type: ObjectDraftingLinetype.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value.ByLayer"]
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace