Grasshopper API
ModelUserText.Item Property (Int32)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public KeyValuePair<string, string> this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As KeyValuePair(Of String, String)
	Get
Parameters
index
Type: System.Int32
Property Value
Type: KeyValuePair<String, String>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUserText.Item(System.Int32)"]
Implements
IReadOnlyList<T>.Item[Int32]
See Also
Reference
ModelUserText Structure
Item Overload
Grasshopper.Rhinoceros Namespace