Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T>.CustomDepth Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool CustomDepth { get; }
Public ReadOnly Property CustomDepth As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy`1.CustomDepth"]
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace