Grasshopper API
AnnotationArrowSettings.Attributes.ArrowSize Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? ArrowSize { get; set; }
Public Property ArrowSize As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.ArrowSize"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace