Grasshopper API
GH_InstanceReference.IsReferencedGeometry Property
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsReferencedGeometry { get; }
Public Overrides ReadOnly Property IsReferencedGeometry As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_InstanceReference.IsReferencedGeometry"]
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace