Grasshopper API
ObjectDraftingLinetype.Value.Continuous Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingLinetype.Value Continuous { get; }
Public Shared ReadOnly Property Continuous As ObjectDraftingLinetype.Value
	Get
Property Value
Type: ObjectDraftingLinetype.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value.Continuous"]
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace