Grasshopper API
ModelObject.SectionStyle Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionStyle.Value? SectionStyle { get; }
Public ReadOnly Property SectionStyle As ObjectSectionStyle.Value?
	Get
Property Value
Type: Nullable<ObjectSectionStyle.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.SectionStyle"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace