Grasshopper API
ObjectDraftingColor.Value.Source Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectPlotColorSource Source { get; }
Public ReadOnly Property Source As ObjectPlotColorSource
	Get
Property Value
Type: ObjectPlotColorSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value.Source"]
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace