Grasshopper API
ModelTextureSlot.Enabled Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Enabled { get; }
Public ReadOnly Property Enabled As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Enabled"]
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace