Grasshopper API
AnnotationUnitsSettings.Attributes.Prefix Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.Prefix"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace