Grasshopper API
ModelRenderSun.Attributes.TimeZone Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? TimeZone { get; set; }
Public Property TimeZone As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes.TimeZone"]
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace