Grasshopper API
ObjectDraftingColor.Value.ByParent Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingColor.Value ByParent { get; }
Public Shared ReadOnly Property ByParent As ObjectDraftingColor.Value
	Get
Property Value
Type: ObjectDraftingColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value.ByParent"]
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace