Grasshopper API
ModelLineWidth.IsValid Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.IsValid"]
Implements
IGH_Goo.IsValid
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace