Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T>.YAxis Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Vector3d_Wrapper YAxis { get; }
Public ReadOnly Property YAxis As GH_Vector3d_Wrapper
	Get
Property Value
Type: GH_Vector3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy`1.YAxis"]
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace