Grasshopper API
GH_RenderArgs.ViewportName Property
 Gets the viewport name involved in this rendering.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Since: 8.0
Syntax
public string ViewportName { get; }
Public ReadOnly Property ViewportName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.ViewportName"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace