Grasshopper API
AnnotationUnitsSettings.ZeroSuppression Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ZeroSuppression? ZeroSuppression { get; }
Public ReadOnly Property ZeroSuppression As ZeroSuppression?
	Get
Property Value
Type: Nullable<ZeroSuppression>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.ZeroSuppression"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace