Grasshopper API
ModelViewport.DisplayMode Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode DisplayMode { get; }
Public ReadOnly Property DisplayMode As ModelDisplayMode
	Get
Property Value
Type: ModelDisplayMode
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.DisplayMode"]
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace