Grasshopper API
ObjectSectionStyle.SectionStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle SectionStyle { get; }
Public ReadOnly Property SectionStyle As ModelSectionStyle
	Get
Property Value
Type: ModelSectionStyle
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.SectionStyle"]
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace