Grasshopper API
ModelObject.Attributes.Visibility Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectVisibility Visibility { get; set; }
Public Property Visibility As ObjectVisibility
	Get
	Set
Property Value
Type: ObjectVisibility
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.Visibility"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace