Grasshopper API
GH_ClippingPlane.ClippingBox Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.ClippingBox"]
Implements
IGH_PreviewData.ClippingBox
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace