Grasshopper API
ModelObject.IsValid Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.IsValid"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace