Grasshopper API
AnnotationTextSettings.Attributes.MaskFrame Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public MaskFrame? MaskFrame { get; set; }
Public Property MaskFrame As MaskFrame?
	Get
	Set
Property Value
Type: Nullable<MaskFrame>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes.MaskFrame"]
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace