Grasshopper API
ItemDisplayColor.Value.ByParent Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ItemDisplayColor.Value ByParent { get; }
Public Shared ReadOnly Property ByParent As ItemDisplayColor.Value
	Get
Property Value
Type: ItemDisplayColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value.ByParent"]
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace