Grasshopper API
GH_DetailView.Viewport Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDetailViewport Viewport { get; set; }
Public Property Viewport As ModelDetailViewport
	Get
	Set
Property Value
Type: ModelDetailViewport
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_DetailView.Viewport"]
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace