Grasshopper API
AnnotationArrowSettings.ClippingArrow2 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrow ClippingArrow2 { get; }
Public ReadOnly Property ClippingArrow2 As ClippingArrow
	Get
Property Value
Type: ClippingArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.ClippingArrow2"]
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace