Grasshopper API
GH_Predicate.False Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Predicate False { get; }
Public Shared ReadOnly Property False As GH_Predicate
	Get
Property Value
Type: GH_Predicate
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.False"]
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace