Grasshopper API
ClippingDrawingSettings.Attributes.Dots Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Dots { get; set; }
Public Property Dots As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes.Dots"]
See Also
Reference
ClippingDrawingSettings.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace