Grasshopper API
ModelUserText.Item Property (String)
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string this[
	string key
] { get; }
Public ReadOnly Default Property Item (
	key As String
) As String
	Get
Parameters
key
Type: System.String
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUserText.Item(System.String)"]
Implements
IReadOnlyDictionary<TKey, TValue>.Item[TKey]
See Also
Reference
ModelUserText Structure
Item Overload
Grasshopper.Rhinoceros Namespace