Grasshopper API
ModelPageViewport.Attributes.PageSettings Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public PageSettings PageSettings { get; set; }
Public Property PageSettings As PageSettings
	Get
	Set
Property Value
Type: PageSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelPageViewport.Attributes.PageSettings"]
See Also
Reference
ModelPageViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace