Grasshopper API
ModelContent.Parent Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContentName Parent { get; }
Public ReadOnly Property Parent As ModelContentName
	Get
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Parent"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace