Grasshopper API
ModelAnnotationStyle.ToleranceSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationToleranceSettings ToleranceSettings { get; }
Public ReadOnly Property ToleranceSettings As AnnotationToleranceSettings
	Get
Property Value
Type: AnnotationToleranceSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.ToleranceSettings"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace