Grasshopper API
Param_MatchText.Icon Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_MatchText.Icon"]
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace