Grasshopper API
GH_LinearDimension.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LinearDimension Value { get; set; }
Public Property Value As LinearDimension
	Get
	Set
Property Value
Type: LinearDimension
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_LinearDimension.Value"]
See Also
Reference
GH_LinearDimension Class
Grasshopper.Kernel.Types Namespace