Grasshopper API
ModelLineWidth.TypeName Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string TypeName { get; }
Public ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.TypeName"]
Implements
IGH_Goo.TypeName
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace