Grasshopper API
ModelTextureMapping.XYZSize Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? XYZSize { get; }
Public ReadOnly Property XYZSize As Vector3d?
	Get
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.XYZSize"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace