Grasshopper API
GH_Extrusion.GH_ExtrusionProxy.Area Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Area { get; }
Public ReadOnly Property Area As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Extrusion.GH_ExtrusionProxy.Area"]
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace