Grasshopper API
GH_TaskCapableComponent<T>.TaskList Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected List<Task<T>> TaskList { get; }
Protected ReadOnly Property TaskList As List(Of Task(Of T))
	Get
Property Value
Type: List<Task<T>>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_TaskCapableComponent`1.TaskList"]
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace