Grasshopper API
GH_Centermark.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Centermark Value { get; set; }
Public Property Value As Centermark
	Get
	Set
Property Value
Type: Centermark
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Centermark.Value"]
See Also
Reference
GH_Centermark Class
Grasshopper.Kernel.Types Namespace