Grasshopper API
ModelObject.Attributes.SectionStyle Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionStyle.Value? SectionStyle { get; set; }
Public Property SectionStyle As ObjectSectionStyle.Value?
	Get
	Set
Property Value
Type: Nullable<ObjectSectionStyle.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.SectionStyle"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace