Grasshopper API
AnnotationDimensionSettings.TextLocation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextLocation? TextLocation { get; }
Public ReadOnly Property TextLocation As TextLocation?
	Get
Property Value
Type: Nullable<TextLocation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.TextLocation"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace