Grasshopper API
ModelHatchLine.Offset Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector2d Offset { get; }
Public ReadOnly Property Offset As Vector2d
	Get
Property Value
Type: Vector2d
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchLine.Offset"]
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace