Grasshopper API
ModelNamedConstructionPlane.Attributes.CPlane Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane CPlane { get; set; }
Public Property CPlane As ModelConstructionPlane
	Get
	Set
Property Value
Type: ModelConstructionPlane
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelNamedConstructionPlane.Attributes.CPlane"]
See Also
Reference
ModelNamedConstructionPlane.Attributes Class
Grasshopper.Rhinoceros.Display Namespace