Grasshopper API
ObjectDisplay.Color Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplayColor.Value? Color { get; }
Public ReadOnly Property Color As ObjectDisplayColor.Value?
	Get
Property Value
Type: Nullable<ObjectDisplayColor.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplay.Color"]
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace