Grasshopper API
ModelAnnotationStyle.Unset Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelAnnotationStyle Unset { get; }
Public Shared ReadOnly Property Unset As ModelAnnotationStyle
	Get
Property Value
Type: ModelAnnotationStyle
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Unset"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace