Grasshopper API
GH_AngularDimension.DimlinePoint Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Point3d DimlinePoint { get; }
Public ReadOnly Property DimlinePoint As Point3d
	Get
Property Value
Type: Point3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AngularDimension.DimlinePoint"]
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace