Grasshopper API
ObjectDrafting.Attributes.LineWidth Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLineWidth.Value? LineWidth { get; set; }
Public Property LineWidth As ObjectDraftingLineWidth.Value?
	Get
	Set
Property Value
Type: Nullable<ObjectDraftingLineWidth.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes.LineWidth"]
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace