Grasshopper API
Param_ModelRenderSun.IsPreviewCapable Property
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsPreviewCapable { get; }
Public ReadOnly Property IsPreviewCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderSun.IsPreviewCapable"]
Implements
IGH_PreviewObject.IsPreviewCapable
See Also
Reference
Param_ModelRenderSun Class
Grasshopper.Rhinoceros.Render.Params Namespace