Grasshopper API
ModelConstructionPlane.Plane Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Plane? Plane { get; }
Public ReadOnly Property Plane As Plane?
	Get
Property Value
Type: Nullable<Plane>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelConstructionPlane.Plane"]
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace