Grasshopper API
GH_Light.ClippingBox Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual BoundingBox ClippingBox { get; }
Public Overridable ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Light.ClippingBox"]
Implements
IGH_PreviewData.ClippingBox
See Also
Reference
GH_Light Class
Grasshopper.Kernel.Types Namespace