Grasshopper API
ModelAnnotationStyle.Attributes.DimensionScale Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? DimensionScale { get; set; }
Public Property DimensionScale As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes.DimensionScale"]
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace