Grasshopper API
ModelViewport.Attribs Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelViewport.Attributes Attribs { get; set; }
Protected Property Attribs As ModelViewport.Attributes
	Get
	Set
Property Value
Type: ModelViewport.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.Attribs"]
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace