Grasshopper API
ModelEarthAnchorPoint.Latitude Property
 Gets a point latitude on earth, in degrees. [-90, +90]
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Latitude { get; }
Public ReadOnly Property Latitude As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Latitude"]
Remarks
In degrees.
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace