Grasshopper API
AnnotationTextSettings.Attributes.TextHeight Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? TextHeight { get; set; }
Public Property TextHeight As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes.TextHeight"]
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace