Grasshopper API
ModelTextureMapping.XYZRotation Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? XYZRotation { get; }
Public ReadOnly Property XYZRotation As Vector3d?
	Get
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.XYZRotation"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace