Grasshopper API
ModelObject.Visibility Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectVisibility Visibility { get; }
Public ReadOnly Property Visibility As ObjectVisibility
	Get
Property Value
Type: ObjectVisibility
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Visibility"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace