Grasshopper API
ObjectRender.CastsShadows Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? CastsShadows { get; }
Public ReadOnly Property CastsShadows As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.CastsShadows"]
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace