Grasshopper API
ModelRenderSkylight.Environment Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderEnvironment Environment { get; }
Public ReadOnly Property Environment As ModelRenderEnvironment
	Get
Property Value
Type: ModelRenderEnvironment
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSkylight.Environment"]
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace