Grasshopper API
ModelObject.Attribs Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelObject.Attributes Attribs { get; set; }
Protected Property Attribs As ModelObject.Attributes
	Get
	Set
Property Value
Type: ModelObject.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attribs"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace