Grasshopper API
ModelUnitSystem.Value.Unset Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUnitSystem.Value Unset { get; }
Public Shared ReadOnly Property Unset As ModelUnitSystem.Value
	Get
Property Value
Type: ModelUnitSystem.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.Unset"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace