Grasshopper API
CentralSettings.PanelDefaultFontSize Property
 Gets or sets the font family name of the default font for panels.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static float PanelDefaultFontSize { get; set; }
Public Shared Property PanelDefaultFontSize As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PanelDefaultFontSize"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace