Grasshopper API
AnnotationDimensionSettings.DecimalSeparator Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public char? DecimalSeparator { get; }
Public ReadOnly Property DecimalSeparator As Char?
	Get
Property Value
Type: Nullable<Char>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.DecimalSeparator"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace