Grasshopper API
GH_TaskCapableComponent<T>.CancelToken Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected CancellationToken CancelToken { get; }
Protected ReadOnly Property CancelToken As CancellationToken
	Get
Property Value
Type: CancellationToken
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_TaskCapableComponent`1.CancelToken"]
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace