Grasshopper API
ItemDisplayColor.Value.Color Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor Color { get; }
Public ReadOnly Property Color As ModelColor
	Get
Property Value
Type: ModelColor
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value.Color"]
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace