Grasshopper API
ModelPageViewport.Space Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ActiveSpace Space { get; }
Public Overrides ReadOnly Property Space As ActiveSpace
	Get
Property Value
Type: ActiveSpace
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelPageViewport.Space"]
See Also
Reference
ModelPageViewport Class
Grasshopper.Rhinoceros.Display Namespace