Grasshopper API
GH_ClippingPlane.IsGeometryLoaded Property
 Gets the load state of this clipping plane. The clipping plane is considered to be loaded when the local clipping plane instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.IsGeometryLoaded"]
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace