Grasshopper API
ObjectDraftingLinetype.Value.Source Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectLinetypeSource Source { get; }
Public ReadOnly Property Source As ObjectLinetypeSource
	Get
Property Value
Type: ObjectLinetypeSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Value.Source"]
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace