Grasshopper API
ModelFont.InstalledFamilies Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static IReadOnlyList<string> InstalledFamilies { get; }
Public Shared ReadOnly Property InstalledFamilies As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelFont.InstalledFamilies"]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace