Grasshopper API
ModelRenderSun.TimeZone Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? TimeZone { get; }
Public ReadOnly Property TimeZone As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.TimeZone"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace