Grasshopper API
GH_PointCloud.PointCloudProxy.ObjectID Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string ObjectID { get; set; }
Public Property ObjectID As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.PointCloudProxy.ObjectID"]
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace