Grasshopper API
Folders.DefaultAssemblyFolderVersion6 Property
 Gets the standard directory in windows ApplicationData that contains 3rd party GHA files.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string DefaultAssemblyFolderVersion6 { get; }
Public Shared ReadOnly Property DefaultAssemblyFolderVersion6 As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.DefaultAssemblyFolderVersion6"]
Return Value
Type: String
A directory path.
See Also
Reference
Folders Class
Grasshopper Namespace