Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T>.AnnotationStyle Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string AnnotationStyle { get; }
Public ReadOnly Property AnnotationStyle As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy`1.AnnotationStyle"]
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace