Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T>.Origin Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Point3d_Wrapper Origin { get; }
Public ReadOnly Property Origin As GH_Point3d_Wrapper
	Get
Property Value
Type: GH_Point3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy`1.Origin"]
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace