Grasshopper API
AnnotationLeaderSettings.Attributes.CurveType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LeaderCurveStyle? CurveType { get; set; }
Public Property CurveType As LeaderCurveStyle?
	Get
	Set
Property Value
Type: Nullable<LeaderCurveStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes.CurveType"]
See Also
Reference
AnnotationLeaderSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace