Grasshopper API
AnnotationUnitsSettings.Attributes.LengthPrefix Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string LengthPrefix { get; set; }
Public Property LengthPrefix As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.LengthPrefix"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace