Grasshopper API
ModelData.DefaultAttributes Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected abstract ModelData.Attributes DefaultAttributes { get; }
Protected MustOverride ReadOnly Property DefaultAttributes As ModelData.Attributes
	Get
Property Value
Type: ModelData.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelData.DefaultAttributes"]
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace