Grasshopper API
ModelRenderContent.TypeName Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderContent.TypeName"]
See Also
Reference
ModelRenderContent Class
Grasshopper.Rhinoceros.Render Namespace