Grasshopper API
ObjectDraftingColor.Value.Color Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor Color { get; }
Public ReadOnly Property Color As ModelColor
	Get
Property Value
Type: ModelColor
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value.Color"]
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace