Grasshopper API
ObjectVisibility.Attributes.Locked Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Locked { get; set; }
Public Property Locked As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectVisibility.Attributes.Locked"]
See Also
Reference
ObjectVisibility.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace