Grasshopper API
GH_PreviewBoundary.Limits Property
 Gets the limits of the boundary.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RectangleF Limits { get; }
Public ReadOnly Property Limits As RectangleF
	Get
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewBoundary.Limits"]
See Also
Reference
GH_PreviewBoundary Class
Grasshopper.Kernel Namespace