Grasshopper API
CentralSettings.CanvasSpaceSearchRadialMessage Property
 Gets or sets the number of times the space-is-now-search-and-not-radial message has been shown.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int CanvasSpaceSearchRadialMessage { get; set; }
Public Shared Property CanvasSpaceSearchRadialMessage As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasSpaceSearchRadialMessage"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace