Grasshopper API
GH_RadialDimension.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RadialDimension Value { get; set; }
Public Property Value As RadialDimension
	Get
	Set
Property Value
Type: RadialDimension
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_RadialDimension.Value"]
See Also
Reference
GH_RadialDimension Class
Grasshopper.Kernel.Types Namespace