Grasshopper API
ObjectRenderMaterial.Value.Material Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial Material { get; }
Public ReadOnly Property Material As ModelRenderMaterial
	Get
Property Value
Type: ModelRenderMaterial
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value.Material"]
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace