Grasshopper API
GH_Predicate.Missing Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Predicate Missing { get; }
Public Shared ReadOnly Property Missing As GH_Predicate
	Get
Property Value
Type: GH_Predicate
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.Missing"]
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace