Grasshopper API
ModelLineWidth.Value Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double Value { get; }
Public ReadOnly Property Value As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.Value"]
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace