Grasshopper API
ModelRenderSun.Attributes.DateTime Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DateTime? DateTime { get; set; }
Public Property DateTime As DateTime?
	Get
	Set
Property Value
Type: Nullable<DateTime>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes.DateTime"]
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace