Grasshopper API
ModelEarthAnchorPoint.Longitude Property
 Gets a point longitude on earth, in degrees. [-180, +180]
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Longitude { get; }
Public ReadOnly Property Longitude As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Longitude"]
Remarks
In degrees.
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace