Grasshopper API
ModelObject.Display Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplay Display { get; }
Public ReadOnly Property Display As ObjectDisplay
	Get
Property Value
Type: ObjectDisplay
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Display"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace