Grasshopper API
ItemDisplayColor.Value.ByLayer Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ItemDisplayColor.Value ByLayer { get; }
Public Shared ReadOnly Property ByLayer As ItemDisplayColor.Value
	Get
Property Value
Type: ItemDisplayColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value.ByLayer"]
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace