Grasshopper API
Instances.ActiveRhinoDoc Property
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static RhinoDoc ActiveRhinoDoc { get; }
Public Shared ReadOnly Property ActiveRhinoDoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
[Missing <value> documentation for "P:Grasshopper.Instances.ActiveRhinoDoc"]
See Also
Reference
Instances Class
Grasshopper Namespace