Grasshopper API
ModelContent.Attributes.Path Property
 Full content path in 'Root::Parent::Name' format if is nested.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContentName Path { get; set; }
Public Property Path As ModelContentName
	Get
	Set
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Attributes.Path"]
Return Value
Type: ModelContentName
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace