Grasshopper API
ObjectDrafting.Color Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingColor.Value? Color { get; }
Public ReadOnly Property Color As ObjectDraftingColor.Value?
	Get
Property Value
Type: Nullable<ObjectDraftingColor.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Color"]
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace