Grasshopper API
ModelLayer.Attributes.Material Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderMaterial Material { get; set; }
Public Property Material As ModelRenderMaterial
	Get
	Set
Property Value
Type: ModelRenderMaterial
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.Material"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace