Grasshopper API
ModelTextureMapping.Geometry Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Object Geometry { get; }
Public ReadOnly Property Geometry As Object
	Get
Property Value
Type: Object
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Geometry"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace