Grasshopper API
ModelInstanceDefinition.DefaultAttributes Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelData.Attributes DefaultAttributes { get; }
Protected Overrides ReadOnly Property DefaultAttributes As ModelData.Attributes
	Get
Property Value
Type: ModelData.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.DefaultAttributes"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace