Grasshopper API
IGH_ReferencedData.IsReferencedData Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
bool IsReferencedData { get; }
ReadOnly Property IsReferencedData As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_ReferencedData.IsReferencedData"]
See Also
Reference
IGH_ReferencedData Interface
Grasshopper.Kernel.Types Namespace