Grasshopper API
ModelHatchPattern.Attributes.Lines Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<ModelHatchLine> Lines { get; set; }
Public Property Lines As IReadOnlyList(Of ModelHatchLine)
	Get
	Set
Property Value
Type: IReadOnlyList<ModelHatchLine>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Attributes.Lines"]
See Also
Reference
ModelHatchPattern.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace