Grasshopper API
GH_Canvas.RecordPreviewBoundary Property
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool RecordPreviewBoundary { get; set; }
Public Property RecordPreviewBoundary As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.RecordPreviewBoundary"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace