Grasshopper API
AnnotationDimensionSettings.Attributes.DecimalSeparator Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public char? DecimalSeparator { get; set; }
Public Property DecimalSeparator As Char?
	Get
	Set
Property Value
Type: Nullable<Char>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.DecimalSeparator"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace