Grasshopper API
ModelViewport.Attributes.View Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelView View { get; set; }
Public Property View As ModelView
	Get
	Set
Property Value
Type: ModelView
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.Attributes.View"]
See Also
Reference
ModelViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace