Grasshopper API
AnnotationDateTimeFormat.DisplayName Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string DisplayName { get; }
Public ReadOnly Property DisplayName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDateTimeFormat.DisplayName"]
See Also
Reference
AnnotationDateTimeFormat Class
Grasshopper.Rhinoceros.Annotations Namespace