Grasshopper API
GH_AssemblyInfoStub.AssemblyIcon Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Bitmap AssemblyIcon { get; }
Public Overrides ReadOnly Property AssemblyIcon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfoStub.AssemblyIcon"]
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace