Grasshopper API
GH_Hatch.GH_HatchProxy.Pattern Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Pattern { get; }
Public ReadOnly Property Pattern As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.GH_HatchProxy.Pattern"]
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace