Grasshopper API
GH_PreviewBoundary.Boundary Property
 Gets the boundary region.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Region Boundary { get; }
Public ReadOnly Property Boundary As Region
	Get
Property Value
Type: Region
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewBoundary.Boundary"]
See Also
Reference
GH_PreviewBoundary Class
Grasshopper.Kernel Namespace