Grasshopper API
AnnotationLeaderSettings.Attributes.ContentAngleType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LeaderContentAngleStyle? ContentAngleType { get; set; }
Public Property ContentAngleType As LeaderContentAngleStyle?
	Get
	Set
Property Value
Type: Nullable<LeaderContentAngleStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes.ContentAngleType"]
See Also
Reference
AnnotationLeaderSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace