Grasshopper API
AnnotationTextSettings.TextHorizontalAlignment Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextHorizontalAlignment? TextHorizontalAlignment { get; }
Public ReadOnly Property TextHorizontalAlignment As TextHorizontalAlignment?
	Get
Property Value
Type: Nullable<TextHorizontalAlignment>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.TextHorizontalAlignment"]
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace