Grasshopper API
GH_ParameterContext.RhinoDoc Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RhinoDoc RhinoDoc { get; }
Public ReadOnly Property RhinoDoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParameterContext.RhinoDoc"]
See Also
Reference
GH_ParameterContext Class
Grasshopper.Kernel Namespace