Grasshopper API
ObjectDraftingColor.Value.ByLayer Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingColor.Value ByLayer { get; }
Public Shared ReadOnly Property ByLayer As ObjectDraftingColor.Value
	Get
Property Value
Type: ObjectDraftingColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value.ByLayer"]
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace