Grasshopper API
AnnotationUnitsSettings.LinearResolution Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? LinearResolution { get; }
Public ReadOnly Property LinearResolution As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.LinearResolution"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace