Grasshopper API
ModelFont.TypeName Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelFont.TypeName"]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace