Grasshopper API
AnnotationUnitsSettings.Attributes.LengthDisplay Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LengthDisplay? LengthDisplay { get; set; }
Public Property LengthDisplay As LengthDisplay?
	Get
	Set
Property Value
Type: Nullable<LengthDisplay>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.LengthDisplay"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace