Grasshopper API
ModelTextureMapping.Attributes.Capped Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Capped { get; set; }
Public Property Capped As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.Capped"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace