Grasshopper API
GH_Predicate.TypeDescription Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string TypeDescription { get; }
Public ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.TypeDescription"]
Implements
IGH_Goo.TypeDescription
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace