Grasshopper API
ItemDisplayColor.Value.ByObject Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ItemDisplayColor.Value ByObject { get; }
Public Shared ReadOnly Property ByObject As ItemDisplayColor.Value
	Get
Property Value
Type: ItemDisplayColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ItemDisplayColor.Value.ByObject"]
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace