Grasshopper API
AnnotationLeaderSettings.Attributes.LandingLength Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? LandingLength { get; set; }
Public Property LandingLength As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes.LandingLength"]
See Also
Reference
AnnotationLeaderSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace