Grasshopper API
ModelSectionStyle.SectionFillRule Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionFillRule? SectionFillRule { get; }
Public ReadOnly Property SectionFillRule As ObjectSectionFillRule?
	Get
Property Value
Type: Nullable<ObjectSectionFillRule>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.SectionFillRule"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace