Grasshopper API
GH_PointCloud.Boundingbox Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override BoundingBox Boundingbox { get; }
Public Overrides ReadOnly Property Boundingbox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.Boundingbox"]
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace