Grasshopper API
AnnotationDimensionSettings.Attributes.RadialTextOrientation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextOrientation? RadialTextOrientation { get; set; }
Public Property RadialTextOrientation As TextOrientation?
	Get
	Set
Property Value
Type: Nullable<TextOrientation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.RadialTextOrientation"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace