Grasshopper API
ModelObject.ObjectTypeMask Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectType ObjectTypeMask { get; set; }
Public Shared Property ObjectTypeMask As ObjectType
	Get
	Set
Property Value
Type: ObjectType
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.ObjectTypeMask"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace