Grasshopper API
ModelTextureMapping.Channel Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? Channel { get; }
Public ReadOnly Property Channel As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Channel"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace