Grasshopper API
AnnotationDimensionSettings.RadialTextOrientation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextOrientation? RadialTextOrientation { get; }
Public ReadOnly Property RadialTextOrientation As TextOrientation?
	Get
Property Value
Type: Nullable<TextOrientation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.RadialTextOrientation"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace