Grasshopper API
Param_ModelAttributeKey.StateTags Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_StateTagList StateTags { get; }
Public Overrides ReadOnly Property StateTags As GH_StateTagList
	Get
Property Value
Type: GH_StateTagList
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_ModelAttributeKey.StateTags"]
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace