Grasshopper API
ModelEarthAnchorPoint.ElevationCoordinateSystem Property
 Gets the value indicating the zero level convention relating to a location on Earth
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public EarthCoordinateSystem? ElevationCoordinateSystem { get; }
Public ReadOnly Property ElevationCoordinateSystem As EarthCoordinateSystem?
	Get
Property Value
Type: Nullable<EarthCoordinateSystem>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.ElevationCoordinateSystem"]
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace