Grasshopper API
GH_TextEntity.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextEntity Value { get; set; }
Public Property Value As TextEntity
	Get
	Set
Property Value
Type: TextEntity
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_TextEntity.Value"]
See Also
Reference
GH_TextEntity Class
Grasshopper.Kernel.Types Namespace