Grasshopper API
GH_TextDot.GH_TextDotProxy.Point Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Point3d_Wrapper Point { get; }
Public ReadOnly Property Point As GH_Point3d_Wrapper
	Get
Property Value
Type: GH_Point3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_TextDot.GH_TextDotProxy.Point"]
See Also
Reference
GH_TextDot.GH_TextDotProxy Class
Grasshopper.Kernel.Types Namespace