Grasshopper API
ModelHatchPattern.Lines Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IReadOnlyList<ModelHatchLine> Lines { get; }
Public ReadOnly Property Lines As IReadOnlyList(Of ModelHatchLine)
	Get
Property Value
Type: IReadOnlyList<ModelHatchLine>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Lines"]
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace