Grasshopper API
Param_ModelDisplayMode.Icon Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ModelDisplayMode.Icon"]
See Also
Reference
Param_ModelDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace