Grasshopper API
GH_RenderArgs.ModelTransform Property
 Gets the current model transform.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Since: 8.0
Syntax
public Transform ModelTransform { get; }
Public ReadOnly Property ModelTransform As Transform
	Get
Property Value
Type: Transform
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.ModelTransform"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace