Grasshopper API
Param_ModelRenderSun.Hidden Property
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderSun.Hidden"]
Implements
IGH_PreviewObject.Hidden
See Also
Reference
Param_ModelRenderSun Class
Grasshopper.Rhinoceros.Render.Params Namespace