Grasshopper API
ObjectRenderMaterial.Value.Source Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectMaterialSource Source { get; }
Public ReadOnly Property Source As ObjectMaterialSource
	Get
Property Value
Type: ObjectMaterialSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value.Source"]
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace