Grasshopper API
ModelSectionStyle.BoundaryLinetype Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype BoundaryLinetype { get; }
Public ReadOnly Property BoundaryLinetype As ModelLinetype
	Get
Property Value
Type: ModelLinetype
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.BoundaryLinetype"]
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace