Grasshopper API
ModelTextureSlot.Attributes.Texture Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderTexture Texture { get; set; }
Public Property Texture As ModelRenderTexture
	Get
	Set
Property Value
Type: ModelRenderTexture
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Attributes.Texture"]
See Also
Reference
ModelTextureSlot.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace