Grasshopper API
ModelRenderSun.Azimuth Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Azimuth { get; }
Public ReadOnly Property Azimuth As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Azimuth"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace