Grasshopper API
ModelLinetype.CapStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LineCapStyle? CapStyle { get; }
Public ReadOnly Property CapStyle As LineCapStyle?
	Get
Property Value
Type: Nullable<LineCapStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.CapStyle"]
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace