Grasshopper API
Param_Predicate.StateTags Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_StateTagList StateTags { get; }
Public Overrides ReadOnly Property StateTags As GH_StateTagList
	Get
Property Value
Type: GH_StateTagList
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_Predicate.StateTags"]
See Also
Reference
Param_Predicate Class
Grasshopper.Kernel.Parameters Namespace