Grasshopper API
ModelRenderMaterial.Name Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ModelContentName Name { get; }
Public Overrides ReadOnly Property Name As ModelContentName
	Get
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderMaterial.Name"]
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace