Grasshopper API
GH_DocumentIO.LocalClipboardContent Property
 Gets the contents of the local clipboard.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string LocalClipboardContent { get; set; }
Public Property LocalClipboardContent As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentIO.LocalClipboardContent"]
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace