Grasshopper API
ModelViewport.Unset Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelViewport Unset { get; }
Public Shared ReadOnly Property Unset As ModelViewport
	Get
Property Value
Type: ModelViewport
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.Unset"]
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace