Grasshopper API
ModelUserText.IsEmpty Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsEmpty { get; }
Public ReadOnly Property IsEmpty As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUserText.IsEmpty"]
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace