Grasshopper API
GH_AnnotationBase.ReferenceID Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ReferenceID { get; set; }
Public Overrides Property ReferenceID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.ReferenceID"]
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace