Grasshopper API
ObjectRenderMaterial.Value.ByLayer Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectRenderMaterial.Value ByLayer { get; }
Public Shared ReadOnly Property ByLayer As ObjectRenderMaterial.Value
	Get
Property Value
Type: ObjectRenderMaterial.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRenderMaterial.Value.ByLayer"]
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace