Grasshopper API
AnnotationDimensionSettings.Attributes.TextAngleType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LeaderContentAngleStyle? TextAngleType { get; set; }
Public Property TextAngleType As LeaderContentAngleStyle?
	Get
	Set
Property Value
Type: Nullable<LeaderContentAngleStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.TextAngleType"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace