Grasshopper API
GH_BakeUtility.BakedCount Property
 Gets the number of successful baking operations.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int BakedCount { get; }
Public ReadOnly Property BakedCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_BakeUtility.BakedCount"]
See Also
Reference
GH_BakeUtility Class
Grasshopper.Kernel Namespace