Grasshopper API
ModelTextureMapping.UVWOffset Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? UVWOffset { get; }
Public ReadOnly Property UVWOffset As Vector3d?
	Get
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.UVWOffset"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace