Grasshopper API
ObjectDisplayColor.Value.ByMaterial Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDisplayColor.Value ByMaterial { get; }
Public Shared ReadOnly Property ByMaterial As ObjectDisplayColor.Value
	Get
Property Value
Type: ObjectDisplayColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value.ByMaterial"]
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace