Grasshopper API
ModelComponentContent.Attribs Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelComponentContent.Attributes Attribs { get; set; }
Protected Property Attribs As ModelComponentContent.Attributes
	Get
	Set
Property Value
Type: ModelComponentContent.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelComponentContent.Attribs"]
See Also
Reference
ModelComponentContent Class
Grasshopper.Rhinoceros Namespace