Grasshopper API
ModelLinetype.Attributes.JoinStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LineJoinStyle? JoinStyle { get; set; }
Public Property JoinStyle As LineJoinStyle?
	Get
	Set
Property Value
Type: Nullable<LineJoinStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes.JoinStyle"]
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace