Grasshopper API
ObjectSectionStyle.Value.ByParent Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectSectionStyle.Value ByParent { get; }
Public Shared ReadOnly Property ByParent As ObjectSectionStyle.Value
	Get
Property Value
Type: ObjectSectionStyle.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value.ByParent"]
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace