Grasshopper API
GH_PointCloud.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override PointCloud Value { get; set; }
Public Overrides Property Value As PointCloud
	Get
	Set
Property Value
Type: PointCloud
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.Value"]
See Also
Reference
GH_PointCloud Class
Grasshopper.Kernel.Types Namespace