Grasshopper API
AnnotationTextSettings.Attributes.MaskColor Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color? MaskColor { get; set; }
Public Property MaskColor As Color?
	Get
	Set
Property Value
Type: Nullable<Color>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes.MaskColor"]
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace