Grasshopper API
IGH_ContextualComponent.Archive Property
 Gets instance of embedded Grasshopper GH_Archive
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
GH_Archive Archive { get; }
ReadOnly Property Archive As GH_Archive
	Get
Property Value
Type: GH_Archive
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ContextualComponent.Archive"]
See Also
Reference
IGH_ContextualComponent Interface
Grasshopper.Kernel Namespace