Grasshopper API
ModelContent.Attributes.Id Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal Guid? Id { get; }
Protected Friend ReadOnly Property Id As Guid?
	Get
Property Value
Type: Nullable<Guid>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Attributes.Id"]
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace