Grasshopper API
ModelInstanceDefinition.Attributes.Units Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem.Value? Units { get; set; }
Public Property Units As ModelUnitSystem.Value?
	Get
	Set
Property Value
Type: Nullable<ModelUnitSystem.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes.Units"]
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace