Grasshopper API
GH_Hatch.BoundaryPlotColorSource Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ItemColorSource BoundaryPlotColorSource { get; set; }
Public Property BoundaryPlotColorSource As ItemColorSource
	Get
	Set
Property Value
Type: ItemColorSource
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BoundaryPlotColorSource"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace