Grasshopper API
GH_ComponentServer.NoLoadExtension Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string NoLoadExtension { get; }
Public Shared ReadOnly Property NoLoadExtension As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.NoLoadExtension"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace