Grasshopper API
ModelUnitSystem.Value.BaseSystem Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public UnitSystem BaseSystem { get; }
Public ReadOnly Property BaseSystem As UnitSystem
	Get
Property Value
Type: UnitSystem
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.BaseSystem"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace