Grasshopper API
Param_DisplayColorGradient.Hidden Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_DisplayColorGradient.Hidden"]
Implements
IGH_PreviewObject.Hidden
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace