Grasshopper API
ModelComponentContent.UserText Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUserText UserText { get; }
Public ReadOnly Property UserText As ModelUserText
	Get
Property Value
Type: ModelUserText
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelComponentContent.UserText"]
See Also
Reference
ModelComponentContent Class
Grasshopper.Rhinoceros Namespace