Grasshopper API
ModelContent.Name Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual ModelContentName Name { get; }
Public Overridable ReadOnly Property Name As ModelContentName
	Get
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Name"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace