Grasshopper API
ModelObject.ObjectType Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectType ObjectType { get; }
Public ReadOnly Property ObjectType As ObjectType
	Get
Property Value
Type: ObjectType
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.ObjectType"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace