Grasshopper API
CentralSettings.PanelDefaultFontFamily Property
 Gets or sets the font family name of the default font for panels.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string PanelDefaultFontFamily { get; set; }
Public Shared Property PanelDefaultFontFamily As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PanelDefaultFontFamily"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace