Grasshopper API
ModelLayer.Locked Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Locked { get; }
Public ReadOnly Property Locked As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Locked"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace