Grasshopper API
GH_TextDot.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override TextDot Value { get; set; }
Public Overrides Property Value As TextDot
	Get
	Set
Property Value
Type: TextDot
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_TextDot.Value"]
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace