Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T>.LabelStyle Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public SectionLabelStyle LabelStyle { get; }
Public ReadOnly Property LabelStyle As SectionLabelStyle
	Get
Property Value
Type: SectionLabelStyle
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy`1.LabelStyle"]
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace