Grasshopper API
Instances.ActiveDocument Property
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Document ActiveDocument { get; }
Public Shared ReadOnly Property ActiveDocument As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Instances.ActiveDocument"]
See Also
Reference
Instances Class
Grasshopper Namespace