Grasshopper API
Param_ModelView.ViewSource Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Param_ModelView.VSource ViewSource { get; set; }
Public Property ViewSource As Param_ModelView.VSource
	Get
	Set
Property Value
Type: Param_ModelView.VSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ModelView.ViewSource"]
See Also
Reference
Param_ModelView Class
Grasshopper.Rhinoceros.Display.Params Namespace