Grasshopper API
ModelInstanceDefinition.FilePath Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string FilePath { get; }
Public ReadOnly Property FilePath As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.FilePath"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace