Grasshopper API
IGH_ContextualParameter.AtLeast Property
 Minimum number of inputs to request
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
int AtLeast { get; }
ReadOnly Property AtLeast As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ContextualParameter.AtLeast"]
See Also
Reference
IGH_ContextualParameter Interface
Grasshopper.Kernel Namespace