Grasshopper API
ModelContent.Path Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContentName Path { get; }
Public ReadOnly Property Path As ModelContentName
	Get
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Path"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace