Grasshopper API
Param_Leader.Exposure Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_Leader.Exposure"]
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace