Grasshopper API
ModelContent.IsValidWhyNot Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override string IsValidWhyNot { get; }
Protected Overrides ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.IsValidWhyNot"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace