Grasshopper API
CentralSettings.InvalidBakeAllow Property
 Gets or sets the default choice for baking invalid objects.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool InvalidBakeAllow { get; set; }
Public Shared Property InvalidBakeAllow As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.InvalidBakeAllow"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace