Grasshopper API
ModelViewport.Attributes.DisplayMode Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode DisplayMode { get; set; }
Public Property DisplayMode As ModelDisplayMode
	Get
	Set
Property Value
Type: ModelDisplayMode
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.Attributes.DisplayMode"]
See Also
Reference
ModelViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace