Grasshopper API
ModelEarthAnchorPoint.SphereVParameter Property
 Gets the spherical V parameter.
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? SphereVParameter { get; }
Public ReadOnly Property SphereVParameter As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.SphereVParameter"]
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace