Grasshopper API
Param_ModelObject.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.Params.Param_ModelObject.ComponentGuid"]
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace