Grasshopper API
GH_AsynchFileData.HarvestThumbnail Property
 Gets or sets whether the thumbnail ought to be parsed. At the moment this only makes sense for GH/GHX files.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool HarvestThumbnail { get; set; }
Public Property HarvestThumbnail As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.HarvestThumbnail"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace