Grasshopper API
ObjectDisplay.Attributes.WireDensity Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? WireDensity { get; set; }
Public Property WireDensity As Integer?
	Get
	Set
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplay.Attributes.WireDensity"]
See Also
Reference
ObjectDisplay.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace