Grasshopper API
ModelTextureMapping.Attributes.LocalTransform Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Transform? LocalTransform { get; set; }
Public Property LocalTransform As Transform?
	Get
	Set
Property Value
Type: Nullable<Transform>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.LocalTransform"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace