Grasshopper API
ModelLinetype.JoinStyle Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LineJoinStyle? JoinStyle { get; }
Public ReadOnly Property JoinStyle As LineJoinStyle?
	Get
Property Value
Type: Nullable<LineJoinStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.JoinStyle"]
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace