Grasshopper API
ModelInstanceDefinition.Attributes.UrlDescription Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string UrlDescription { get; set; }
Public Property UrlDescription As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes.UrlDescription"]
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace