Grasshopper API
PageSettings.Attributes.Units Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem.Value? Units { get; set; }
Public Property Units As ModelUnitSystem.Value?
	Get
	Set
Property Value
Type: Nullable<ModelUnitSystem.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.Attributes.Units"]
See Also
Reference
PageSettings.Attributes Class
Grasshopper.Rhinoceros.Display Namespace