Grasshopper API
GH_AssemblyInfoStub.AssemblyDescription Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string AssemblyDescription { get; }
Public Overrides ReadOnly Property AssemblyDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfoStub.AssemblyDescription"]
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace