Grasshopper API
ObjectSectionStyle.Value.Source Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionAttributesSource Source { get; }
Public ReadOnly Property Source As ObjectSectionAttributesSource
	Get
Property Value
Type: ObjectSectionAttributesSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value.Source"]
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace