Grasshopper API
ModelTags.IsDefault Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsDefault { get; }
Public ReadOnly Property IsDefault As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelTags.IsDefault"]
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace