Grasshopper API
ModelObject.Layer Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLayer Layer { get; }
Public ReadOnly Property Layer As ModelLayer
	Get
Property Value
Type: ModelLayer
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Layer"]
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace