Grasshopper API
AnnotationToleranceSettings.ToleranceLowerValue Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? ToleranceLowerValue { get; }
Public ReadOnly Property ToleranceLowerValue As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.ToleranceLowerValue"]
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace