Grasshopper API
ModelAnnotationStyle.DimensionScale Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? DimensionScale { get; }
Public ReadOnly Property DimensionScale As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.DimensionScale"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace