Grasshopper API
ModelContent.IsReferencedData Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected bool IsReferencedData { get; }
Protected ReadOnly Property IsReferencedData As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.IsReferencedData"]
Implements
IGH_ReferencedData.IsReferencedData
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace