Grasshopper API
ModelRenderTexture.Attributes.RenderTexture Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RenderTexture RenderTexture { get; set; }
Public Property RenderTexture As RenderTexture
	Get
	Set
Property Value
Type: RenderTexture
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderTexture.Attributes.RenderTexture"]
See Also
Reference
ModelRenderTexture.Attributes Class
Grasshopper.Rhinoceros.Render Namespace