Grasshopper API
ModelUserText.IsDefaultOrEmpty Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsDefaultOrEmpty { get; }
Public ReadOnly Property IsDefaultOrEmpty As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUserText.IsDefaultOrEmpty"]
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace