Grasshopper API
GH_DetailView.IsGeometryLoaded Property
 Gets the load state of this detail view object. The detail view is considered to be loaded when the local detail view instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_DetailView.IsGeometryLoaded"]
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace