Grasshopper API
AnnotationTextSettings.Attributes.TextOrientation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextOrientation? TextOrientation { get; set; }
Public Property TextOrientation As TextOrientation?
	Get
	Set
Property Value
Type: Nullable<TextOrientation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes.TextOrientation"]
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace