Grasshopper API
GH_BakeUtility.BakedIds Property
 Gets all collected object ids.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Guid[] BakedIds { get; }
Public ReadOnly Property BakedIds As Guid()
	Get
Property Value
Type: Guid[]
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_BakeUtility.BakedIds"]
See Also
Reference
GH_BakeUtility Class
Grasshopper.Kernel Namespace