Grasshopper API
ModelStandardViewport.ViewportType Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ViewportType ViewportType { get; }
Public Overrides ReadOnly Property ViewportType As ViewportType
	Get
Property Value
Type: ViewportType
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelStandardViewport.ViewportType"]
See Also
Reference
ModelStandardViewport Class
Grasshopper.Rhinoceros.Display Namespace