Grasshopper API
GH_PointCloud.PointCloudProxy.ContainsHiddenFlags Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool ContainsHiddenFlags { get; }
Public ReadOnly Property ContainsHiddenFlags As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.PointCloudProxy.ContainsHiddenFlags"]
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace