Grasshopper API
AnnotationUnitsSettings.AngleFormat Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AngleDisplayFormat? AngleFormat { get; }
Public ReadOnly Property AngleFormat As AngleDisplayFormat?
	Get
Property Value
Type: Nullable<AngleDisplayFormat>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.AngleFormat"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace