Grasshopper API
ModelLinetype.WidthUnits Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem.Value? WidthUnits { get; }
Public ReadOnly Property WidthUnits As ModelUnitSystem.Value?
	Get
Property Value
Type: Nullable<ModelUnitSystem.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.WidthUnits"]
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace