Grasshopper API
ModelLineWidth.TypeDescription Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string TypeDescription { get; }
Public ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLineWidth.TypeDescription"]
Implements
IGH_Goo.TypeDescription
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace