Grasshopper API
ModelContent.Attribs Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected internal ModelContent.Attributes Attribs { get; set; }
Protected Friend Property Attribs As ModelContent.Attributes
	Get
	Set
Property Value
Type: ModelContent.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Attribs"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace