Grasshopper API
GH_ClippingPlane.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override ClippingPlaneSurface Value { get; set; }
Public Overrides Property Value As ClippingPlaneSurface
	Get
	Set
Property Value
Type: ClippingPlaneSurface
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.Value"]
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace