Grasshopper API
GH_DetailView.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override DetailView Value { get; set; }
Public Overrides Property Value As DetailView
	Get
	Set
Property Value
Type: DetailView
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_DetailView.Value"]
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace