Grasshopper API
ObjectSectionStyle.Source Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectSectionAttributesSource Source { get; }
Public ReadOnly Property Source As ObjectSectionAttributesSource
	Get
Property Value
Type: ObjectSectionAttributesSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Source"]
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace