Grasshopper API
AnnotationArrowSettings.FitArrow Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ArrowFit? FitArrow { get; }
Public ReadOnly Property FitArrow As ArrowFit?
	Get
Property Value
Type: Nullable<ArrowFit>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.FitArrow"]
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace