Grasshopper API
Param_Light.IsBakeCapable Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsBakeCapable { get; }
Public ReadOnly Property IsBakeCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_Light.IsBakeCapable"]
Implements
IGH_BakeAwareObject.IsBakeCapable
See Also
Reference
Param_Light Class
Grasshopper.Kernel.Parameters Namespace