Grasshopper API
GH_AngularDimension.Line2 Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Line Line2 { get; }
Public ReadOnly Property Line2 As Line
	Get
Property Value
Type: Line
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AngularDimension.Line2"]
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace