Grasshopper API
ObjectDisplay.WireDensity Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? WireDensity { get; }
Public ReadOnly Property WireDensity As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplay.WireDensity"]
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace