Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T>.ZAxis Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Vector3d_Wrapper ZAxis { get; }
Public ReadOnly Property ZAxis As GH_Vector3d_Wrapper
	Get
Property Value
Type: GH_Vector3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy`1.ZAxis"]
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace