Grasshopper API
GH_PersistentReferenceParam<T>.TypeName Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PersistentReferenceParam`1.TypeName"]
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace