Grasshopper API
ModelTextureMapping.Projection Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Projection? Projection { get; }
Public ReadOnly Property Projection As Projection?
	Get
Property Value
Type: Nullable<Projection>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Projection"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace