Grasshopper API
ObjectDrafting.Attributes.Linetype Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLinetype.Value? Linetype { get; set; }
Public Property Linetype As ObjectDraftingLinetype.Value?
	Get
	Set
Property Value
Type: Nullable<ObjectDraftingLinetype.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes.Linetype"]
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace