Grasshopper API
AnnotationArrowSettings.Attributes.FitArrow Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ArrowFit? FitArrow { get; set; }
Public Property FitArrow As ArrowFit?
	Get
	Set
Property Value
Type: Nullable<ArrowFit>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes.FitArrow"]
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace