Grasshopper API
GH_Material.RdkMaterialId Property
 Gets or sets the RDK material ID this material is associated with.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Guid RdkMaterialId { get; set; }
Public Property RdkMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.RdkMaterialId"]
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace