Grasshopper API
Param_Leader.Hidden Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_Leader.Hidden"]
Implements
IGH_PreviewObject.Hidden
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace