Grasshopper API
AnnotationUnitsSettings.Attributes.LengthZeroSuppression Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ZeroSuppression? LengthZeroSuppression { get; set; }
Public Property LengthZeroSuppression As ZeroSuppression?
	Get
	Set
Property Value
Type: Nullable<ZeroSuppression>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.LengthZeroSuppression"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace