Grasshopper API
ModelRenderSkylight.Attributes.Environment Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderEnvironment Environment { get; set; }
Public Property Environment As ModelRenderEnvironment
	Get
	Set
Property Value
Type: ModelRenderEnvironment
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSkylight.Attributes.Environment"]
See Also
Reference
ModelRenderSkylight.Attributes Class
Grasshopper.Rhinoceros.Render Namespace