Grasshopper API
GH_RenderArgs.MaterialNormal Property
Note: This API is now obsolete.
 Gets the material hint to use for unselected objects.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute("The render arguments no longer provide material hints")]
public RenderMaterial MaterialNormal { get; }
<ObsoleteAttribute("The render arguments no longer provide material hints")>
Public ReadOnly Property MaterialNormal As RenderMaterial
	Get
Property Value
Type: RenderMaterial
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.MaterialNormal"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace