Grasshopper API
Param_AnnotationUnitsSettings.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationUnitsSettings.ComponentGuid"]
See Also
Reference
Param_AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace