Grasshopper API
ModelSpaceViewport.Attribs Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelSpaceViewport.Attributes Attribs { get; set; }
Protected Property Attribs As ModelSpaceViewport.Attributes
	Get
	Set
Property Value
Type: ModelSpaceViewport.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelSpaceViewport.Attribs"]
See Also
Reference
ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display Namespace