Grasshopper API
GH_ExternalFileConflictDialog.InfoLabel Property
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public virtual Label InfoLabel { get; set; }
Public Overridable Property InfoLabel As Label
	Get
	Set
Property Value
Type: Label
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ExternalFileConflictDialog.InfoLabel"]
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace