Grasshopper API
ModelViewport.Attributes.ConstructionPlane Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelConstructionPlane ConstructionPlane { get; set; }
Public Property ConstructionPlane As ModelConstructionPlane
	Get
	Set
Property Value
Type: ModelConstructionPlane
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.Attributes.ConstructionPlane"]
See Also
Reference
ModelViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace