Grasshopper API
ObjectDrafting.Attributes.Order Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? Order { get; set; }
Public Property Order As Integer?
	Get
	Set
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Attributes.Order"]
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace