Grasshopper API
ObjectDraftingLinetype.Linetype Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype Linetype { get; }
Public ReadOnly Property Linetype As ModelLinetype
	Get
Property Value
Type: ModelLinetype
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype.Linetype"]
See Also
Reference
ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace