Grasshopper API
GH_TextDot.IsValid Property
 Gets the validity of this text dot. If the text dot is referenced but cannot be loaded, the text dot is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_TextDot.IsValid"]
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace