Grasshopper API
ModelLayer.LineWeight Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? LineWeight { get; }
Public ReadOnly Property LineWeight As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.LineWeight"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace