Grasshopper API
ModelContentName.Stem Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContentName Stem { get; }
Public ReadOnly Property Stem As ModelContentName
	Get
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContentName.Stem"]
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace