Grasshopper API
GH_Extrusion.GH_ExtrusionProxy.Solid Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Solid { get; }
Public ReadOnly Property Solid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Extrusion.GH_ExtrusionProxy.Solid"]
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace