Grasshopper API
ModelRenderEnvironment.Attributes.RenderEnvironment Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RenderEnvironment RenderEnvironment { get; set; }
Public Property RenderEnvironment As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderEnvironment.Attributes.RenderEnvironment"]
See Also
Reference
ModelRenderEnvironment.Attributes Class
Grasshopper.Rhinoceros.Render Namespace