Grasshopper API
ModelRenderSkylight.EnvironmentOverride Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? EnvironmentOverride { get; }
Public ReadOnly Property EnvironmentOverride As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSkylight.EnvironmentOverride"]
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace