Grasshopper API
Param_ItemDisplayColor.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ItemDisplayColor.ComponentGuid"]
See Also
Reference
Param_ItemDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace