Grasshopper API
DisplayColorGradient.TypeName Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.DisplayColorGradient.TypeName"]
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace