Grasshopper API
GH_Hatch.BoundaryPlotColor Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color BoundaryPlotColor { get; set; }
Public Property BoundaryPlotColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BoundaryPlotColor"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace