Grasshopper API
GH_SubD.TypeDescription Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeDescription { get; }
Public Overrides ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.TypeDescription"]
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace