Grasshopper API
ModelRenderSun.Longitude Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Longitude { get; }
Public ReadOnly Property Longitude As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Longitude"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace