Grasshopper API
ModelTextureMapping.Attributes.MappingType Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextureMappingType? MappingType { get; set; }
Public Property MappingType As TextureMappingType?
	Get
	Set
Property Value
Type: Nullable<TextureMappingType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.MappingType"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace