Grasshopper API
GH_Predicate.IsValid Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.IsValid"]
Implements
IGH_Goo.IsValid
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace