Grasshopper API
ModelUnitSystem.Value.Feet Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUnitSystem.Value Feet { get; }
Public Shared ReadOnly Property Feet As ModelUnitSystem.Value
	Get
Property Value
Type: ModelUnitSystem.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.Feet"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace