Grasshopper API
Param_Leader.ComponentGuid Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_Leader.ComponentGuid"]
See Also
Reference
Param_Leader Class
Grasshopper.Kernel.Parameters Namespace