Grasshopper API
ModelTextureMapping.TextureSpace Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextureSpace? TextureSpace { get; }
Public ReadOnly Property TextureSpace As TextureSpace?
	Get
Property Value
Type: Nullable<TextureSpace>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.TextureSpace"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace