Grasshopper API
CentralSettings.InvalidBakeAsk Property
 Gets or sets whether a warning ought to be displayed prior to baking invalid geometry. By default this is always TRUE when Grasshopper starts.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool InvalidBakeAsk { get; set; }
Public Shared Property InvalidBakeAsk As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.InvalidBakeAsk"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace