Grasshopper API
GH_AnnotationBase.Style Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelAnnotationStyle Style { get; set; }
Public Property Style As ModelAnnotationStyle
	Get
	Set
Property Value
Type: ModelAnnotationStyle
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.Style"]
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace