Grasshopper API
ModelMeshingParameters.DefaultRender Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelMeshingParameters DefaultRender { get; }
Public Shared ReadOnly Property DefaultRender As ModelMeshingParameters
	Get
Property Value
Type: ModelMeshingParameters
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelMeshingParameters.DefaultRender"]
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace