Grasshopper API
ModelAnnotationStyle.Attributes.UnitsSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationUnitsSettings UnitsSettings { get; set; }
Public Property UnitsSettings As AnnotationUnitsSettings
	Get
	Set
Property Value
Type: AnnotationUnitsSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes.UnitsSettings"]
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace