Grasshopper API
ModelUserText.Values Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IEnumerable<string> Values { get; }
Public ReadOnly Property Values As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUserText.Values"]
Implements
IReadOnlyDictionary<TKey, TValue>.Values
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace