Grasshopper API
ModelTextureSlot.Texture Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelRenderTexture Texture { get; }
Public ReadOnly Property Texture As ModelRenderTexture
	Get
Property Value
Type: ModelRenderTexture
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Texture"]
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace