Grasshopper API
ObjectDisplay.Attributes.Mode Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelDisplayMode Mode { get; set; }
Public Property Mode As ModelDisplayMode
	Get
	Set
Property Value
Type: ModelDisplayMode
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplay.Attributes.Mode"]
See Also
Reference
ObjectDisplay.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace