Grasshopper API
ModelTags.Count Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelTags.Count"]
Implements
IReadOnlyCollection<T>.Count
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace