Grasshopper API
ModelDataParam<T>.TypeName Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.ModelDataParam`1.TypeName"]
See Also
Reference
ModelDataParam<T> Class
Grasshopper.Rhinoceros.Params Namespace