Grasshopper API
CentralSettings.PreviewPointRadius Property
 Gets the default radius of the point objects given the current style.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static int PreviewPointRadius { get; }
Public Shared ReadOnly Property PreviewPointRadius As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PreviewPointRadius"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace