Grasshopper API
GH_SubD.IsValid Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.IsValid"]
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace