Grasshopper API
Param_ModelSpaceViewport.ViewportItem.DescriptiveName Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string DescriptiveName { get; }
Public ReadOnly Property DescriptiveName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ModelSpaceViewport.ViewportItem.DescriptiveName"]
See Also
Reference
Param_ModelSpaceViewport.ViewportItem Structure
Grasshopper.Rhinoceros.Display.Params Namespace