Grasshopper API
GH_SubD.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override SubD Value { get; set; }
Public Overrides Property Value As SubD
	Get
	Set
Property Value
Type: SubD
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SubD.Value"]
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace