Grasshopper API
IGH_ReferencedData.IsReferencedDataLoaded Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
bool IsReferencedDataLoaded { get; }
ReadOnly Property IsReferencedDataLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_ReferencedData.IsReferencedDataLoaded"]
See Also
Reference
IGH_ReferencedData Interface
Grasshopper.Kernel.Types Namespace