Grasshopper API
AnnotationDimensionSettings.FixedExtensionLength Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? FixedExtensionLength { get; }
Public ReadOnly Property FixedExtensionLength As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.FixedExtensionLength"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace