Grasshopper API
Param_ModelContent.TypeName Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeName { get; }
Public Overrides ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_ModelContent.TypeName"]
See Also
Reference
Param_ModelContent Class
Grasshopper.Rhinoceros.Params Namespace