Grasshopper API
CentralSettings.CanvasToolbar Property
 Gets or sets whether or not the canvas toolbar will be visible. This is a global setting.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool CanvasToolbar { get; set; }
Public Shared Property CanvasToolbar As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasToolbar"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace