Grasshopper API
AnnotationUnitsSettings.LengthZeroSuppression Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ZeroSuppression? LengthZeroSuppression { get; }
Public ReadOnly Property LengthZeroSuppression As ZeroSuppression?
	Get
Property Value
Type: Nullable<ZeroSuppression>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.LengthZeroSuppression"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace