Grasshopper API
GH_ParameterContext.IsScripted Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsScripted { get; }
Public ReadOnly Property IsScripted As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParameterContext.IsScripted"]
See Also
Reference
GH_ParameterContext Class
Grasshopper.Kernel Namespace