Grasshopper API
AnnotationDimensionSettings.FixedExtension Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? FixedExtension { get; }
Public ReadOnly Property FixedExtension As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.FixedExtension"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace