Grasshopper API
ObjectDisplayColor.Value.ByLayer Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDisplayColor.Value ByLayer { get; }
Public Shared ReadOnly Property ByLayer As ObjectDisplayColor.Value
	Get
Property Value
Type: ObjectDisplayColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value.ByLayer"]
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace