Grasshopper API
ModelRenderContent.Attribs Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelRenderContent.Attributes Attribs { get; set; }
Protected Property Attribs As ModelRenderContent.Attributes
	Get
	Set
Property Value
Type: ModelRenderContent.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderContent.Attribs"]
See Also
Reference
ModelRenderContent Class
Grasshopper.Rhinoceros.Render Namespace