Grasshopper API
ModelMeshingParameters.FastRender Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelMeshingParameters FastRender { get; }
Public Shared ReadOnly Property FastRender As ModelMeshingParameters
	Get
Property Value
Type: ModelMeshingParameters
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelMeshingParameters.FastRender"]
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace