Grasshopper API
ModelContent.Id Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Guid? Id { get; }
Public ReadOnly Property Id As Guid?
	Get
Property Value
Type: Nullable<Guid>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Id"]
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace