Grasshopper API
PageSettings.Attributes.PaperWidth Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? PaperWidth { get; set; }
Public Property PaperWidth As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.Attributes.PaperWidth"]
See Also
Reference
PageSettings.Attributes Class
Grasshopper.Rhinoceros.Display Namespace