Grasshopper API
Param_ModelConstructionPlane.IsBakeCapable Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsBakeCapable { get; }
Public ReadOnly Property IsBakeCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ModelConstructionPlane.IsBakeCapable"]
Implements
IGH_BakeAwareObject.IsBakeCapable
See Also
Reference
Param_ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display.Params Namespace