Grasshopper API
AnnotationArrow.ArrowType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ArrowType? ArrowType { get; }
Public ReadOnly Property ArrowType As ArrowType?
	Get
Property Value
Type: Nullable<ArrowType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrow.ArrowType"]
See Also
Reference
AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations Namespace