Grasshopper API
DisplayColorStop.TypeDescription Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeDescription { get; }
Public Overrides ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.DisplayColorStop.TypeDescription"]
See Also
Reference
DisplayColorStop Class
Grasshopper.Rhinoceros.Display Namespace