Grasshopper API
GH_TaskCapableComponent<T>.InstanceDescription Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string InstanceDescription { get; }
Public Overrides ReadOnly Property InstanceDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_TaskCapableComponent`1.InstanceDescription"]
Implements
IGH_InstanceDescription.InstanceDescription
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace