Grasshopper API
ModelViewport.DefaultAttributes Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override ModelData.Attributes DefaultAttributes { get; }
Protected Overrides ReadOnly Property DefaultAttributes As ModelData.Attributes
	Get
Property Value
Type: ModelData.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelViewport.DefaultAttributes"]
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace