Grasshopper API
ObjectDrafting.Linetype Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDraftingLinetype.Value? Linetype { get; }
Public ReadOnly Property Linetype As ObjectDraftingLinetype.Value?
	Get
Property Value
Type: Nullable<ObjectDraftingLinetype.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Linetype"]
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace