Grasshopper API
ModelLayer.Attributes.SectionStyle Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelSectionStyle SectionStyle { get; set; }
Public Property SectionStyle As ModelSectionStyle
	Get
	Set
Property Value
Type: ModelSectionStyle
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.SectionStyle"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace