Grasshopper API
AnnotationDimensionSettings.TextAngleType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LeaderContentAngleStyle? TextAngleType { get; }
Public ReadOnly Property TextAngleType As LeaderContentAngleStyle?
	Get
Property Value
Type: Nullable<LeaderContentAngleStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.TextAngleType"]
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace