Grasshopper API
GH_TextDot.GH_TextDotProxy.SecondaryText Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string SecondaryText { get; }
Public ReadOnly Property SecondaryText As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_TextDot.GH_TextDotProxy.SecondaryText"]
See Also
Reference
GH_TextDot.GH_TextDotProxy Class
Grasshopper.Kernel.Types Namespace