Grasshopper API
GH_ParameterContext.SolveIndex Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int SolveIndex { get; set; }
Public Property SolveIndex As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParameterContext.SolveIndex"]
See Also
Reference
GH_ParameterContext Class
Grasshopper.Kernel Namespace