Grasshopper API
ModelObject.Attributes.Url Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Url { get; set; }
Public Property Url As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.Url"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace