Grasshopper API
ModelContentName.Parent Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelContentName Parent { get; }
Public ReadOnly Property Parent As ModelContentName
	Get
Property Value
Type: ModelContentName
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContentName.Parent"]
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace