Grasshopper API
ModelRenderMaterial.Attributes.RenderMaterial Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RenderMaterial RenderMaterial { get; set; }
Public Property RenderMaterial As RenderMaterial
	Get
	Set
Property Value
Type: RenderMaterial
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderMaterial.Attributes.RenderMaterial"]
See Also
Reference
ModelRenderMaterial.Attributes Class
Grasshopper.Rhinoceros.Render Namespace