Grasshopper API
ModelPageViewport.PageNumber Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? PageNumber { get; }
Public ReadOnly Property PageNumber As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelPageViewport.PageNumber"]
See Also
Reference
ModelPageViewport Class
Grasshopper.Rhinoceros.Display Namespace