Grasshopper API
ObjectDrafting.Order Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? Order { get; }
Public ReadOnly Property Order As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDrafting.Order"]
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace