Grasshopper API
CentralSettings.TrackPluginLoading Property
 Gets or sets whether plugins are tracked during loading in order to detect plugins causing fatal crashes during load.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static bool TrackPluginLoading { get; set; }
Public Shared Property TrackPluginLoading As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.TrackPluginLoading"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace