Grasshopper API
ModelInstanceDefinition.Attribs Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelInstanceDefinition.Attributes Attribs { get; set; }
Protected Property Attribs As ModelInstanceDefinition.Attributes
	Get
	Set
Property Value
Type: ModelInstanceDefinition.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attribs"]
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace