Grasshopper API
GH_TextDot.IsGeometryLoaded Property
 Gets the load state of this text dot object. The text dot is considered to be loaded when the local text dot instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_TextDot.IsGeometryLoaded"]
See Also
Reference
GH_TextDot Class
Grasshopper.Kernel.Types Namespace