Grasshopper API
ModelSectionStyle.Attributes.BackgroundFillMode Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public SectionBackgroundFillMode? BackgroundFillMode { get; set; }
Public Property BackgroundFillMode As SectionBackgroundFillMode?
	Get
	Set
Property Value
Type: Nullable<SectionBackgroundFillMode>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.BackgroundFillMode"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace