Grasshopper API
ClippingDrawingSettings.Attributes.Text Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Text { get; set; }
Public Property Text As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes.Text"]
See Also
Reference
ClippingDrawingSettings.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace