Grasshopper API
GH_Document.RhinoDocument Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public RhinoDoc RhinoDocument { get; }
Public ReadOnly Property RhinoDocument As RhinoDoc
	Get
Property Value
Type: RhinoDoc
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.RhinoDocument"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace