Grasshopper API
AnnotationArrowSettings.ClippingArrow1 Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrow ClippingArrow1 { get; }
Public ReadOnly Property ClippingArrow1 As ClippingArrow
	Get
Property Value
Type: ClippingArrow
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.ClippingArrow1"]
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace