Grasshopper API
ModelTextureMapping.Attributes.Projection Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Projection? Projection { get; set; }
Public Property Projection As Projection?
	Get
	Set
Property Value
Type: Nullable<Projection>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.Projection"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace