Grasshopper API
ModelRenderSun.DaylightSavingEnabled Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? DaylightSavingEnabled { get; }
Public ReadOnly Property DaylightSavingEnabled As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.DaylightSavingEnabled"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace