Grasshopper API
ClippingDrawingSettings.Tangents Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Tangents { get; }
Public ReadOnly Property Tangents As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Tangents"]
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace