Grasshopper API
GH_Leader.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Leader Value { get; set; }
Public Property Value As Leader
	Get
	Set
Property Value
Type: Leader
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Leader.Value"]
See Also
Reference
GH_Leader Class
Grasshopper.Kernel.Types Namespace