Grasshopper API
GH_ComponentServer.IsLoading Property
 Gets whether the component server is currently executing its external-file load pass. True from entry to LoadExternalFiles until it returns.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsLoading { get; }
Public ReadOnly Property IsLoading As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.IsLoading"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace