Grasshopper API
ModelTextureMapping.XYZOffset Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? XYZOffset { get; }
Public ReadOnly Property XYZOffset As Vector3d?
	Get
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.XYZOffset"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace