Grasshopper API
ModelTextureMapping.UVWRotation Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? UVWRotation { get; }
Public ReadOnly Property UVWRotation As Vector3d?
	Get
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.UVWRotation"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace