Grasshopper API
ObjectRender.Attributes.MeshingParameters Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelMeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As ModelMeshingParameters
	Get
	Set
Property Value
Type: ModelMeshingParameters
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.Attributes.MeshingParameters"]
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace