Grasshopper API
ObjectRender.Attributes.ReceivesShadows Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? ReceivesShadows { get; set; }
Public Property ReceivesShadows As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.Attributes.ReceivesShadows"]
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace