Grasshopper API
ModelTextureMapping.LocalTransform Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Transform? LocalTransform { get; }
Public ReadOnly Property LocalTransform As Transform?
	Get
Property Value
Type: Nullable<Transform>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.LocalTransform"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace