Grasshopper API
ModelTextureMapping.IsValid Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.IsValid"]
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace