Grasshopper API
ModelInstanceDefinition.Attributes.UpdateType Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public InstanceDefinitionUpdateType? UpdateType { get; set; }
Public Property UpdateType As InstanceDefinitionUpdateType?
	Get
	Set
Property Value
Type: Nullable<InstanceDefinitionUpdateType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes.UpdateType"]
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace