Grasshopper API
ItemDisplayColor.Color Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelColor? Color { get; }
Public ReadOnly Property Color As ModelColor?
	Get
Property Value
Type: Nullable<ModelColor>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ItemDisplayColor.Color"]
See Also
Reference
ItemDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace