Grasshopper API
GH_AnnotationBase.IsValid Property
 Gets the validity of this dimension. If the dimension is referenced but cannot be loaded, then the dimension is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.IsValid"]
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace