Grasshopper API
ModelTextureMapping.Attributes.XYZSize Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Vector3d? XYZSize { get; set; }
Public Property XYZSize As Vector3d?
	Get
	Set
Property Value
Type: Nullable<Vector3d>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.XYZSize"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace