Grasshopper API
Param_ObjectDraftingLinetype.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectDraftingLinetype.ComponentGuid"]
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace