Grasshopper API
ModelTextureMapping.Attributes.Geometry Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GeometryBase Geometry { get; set; }
Public Property Geometry As GeometryBase
	Get
	Set
Property Value
Type: GeometryBase
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes.Geometry"]
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace