Grasshopper API
ModelFont.TypeDescription Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string TypeDescription { get; }
Public Overrides ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelFont.TypeDescription"]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace