Grasshopper API
ObjectDraftingLineWidth.Width Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Width { get; }
Public ReadOnly Property Width As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Width"]
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace