Grasshopper API
ModelLinetype.Attributes.Width Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Width { get; set; }
Public Property Width As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes.Width"]
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace