Grasshopper API
ModelObject.Attributes.Layer Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLayer Layer { get; set; }
Public Property Layer As ModelLayer
	Get
	Set
Property Value
Type: ModelLayer
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelObject.Attributes.Layer"]
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace