Grasshopper API
GH_Extrusion.GH_ExtrusionProxy.ProfileCount Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int ProfileCount { get; }
Public ReadOnly Property ProfileCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Extrusion.GH_ExtrusionProxy.ProfileCount"]
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace