Grasshopper API
ItemDisplayColor.Source Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ItemColorSource Source { get; }
Public ReadOnly Property Source As ItemColorSource
	Get
Property Value
Type: ItemColorSource
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ItemDisplayColor.Source"]
See Also
Reference
ItemDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace