Grasshopper API
GH_AngularDimension.Offset Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double Offset { get; }
Public ReadOnly Property Offset As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AngularDimension.Offset"]
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace