Grasshopper API
ModelEarthAnchorPoint.Attributes.ModelCompass Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Plane? ModelCompass { get; set; }
Public Property ModelCompass As Plane?
	Get
	Set
Property Value
Type: Nullable<Plane>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes.ModelCompass"]
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace