Grasshopper API
Param_EarthAnchorPoint.Exposure Property
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.Params.Param_EarthAnchorPoint.Exposure"]
See Also
Reference
Param_EarthAnchorPoint Class
Grasshopper.Rhinoceros.Model.Params Namespace