Grasshopper API
ModelConstructionPlane.ThickLineFrequency Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? ThickLineFrequency { get; }
Public ReadOnly Property ThickLineFrequency As Integer?
	Get
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelConstructionPlane.ThickLineFrequency"]
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace