Grasshopper API
PageSettings.Units Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelUnitSystem.Value? Units { get; }
Public ReadOnly Property Units As ModelUnitSystem.Value?
	Get
Property Value
Type: Nullable<ModelUnitSystem.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.Units"]
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace