Grasshopper API
AnnotationToleranceSettings.Attributes.AlternateToleranceResolution Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int? AlternateToleranceResolution { get; set; }
Public Property AlternateToleranceResolution As Integer?
	Get
	Set
Property Value
Type: Nullable<Int32>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.Attributes.AlternateToleranceResolution"]
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace