Grasshopper API
GH_Predicate.TypeName Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string TypeName { get; }
Public ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.TypeName"]
Implements
IGH_Goo.TypeName
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace