Grasshopper API
GH_Hatch.IsGeometryLoaded Property
 Gets the load state of this hatch object. The hatch is considered to be loaded when the local hatch instance is not null.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.IsGeometryLoaded"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace