Grasshopper API
ModelData.Attribs Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected ModelData.Attributes Attribs { get; set; }
Protected Property Attribs As ModelData.Attributes
	Get
	Set
Property Value
Type: ModelData.Attributes
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelData.Attribs"]
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace