Grasshopper API
AnnotationUnitsSettings.Attributes.AngleFormat Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AngleDisplayFormat? AngleFormat { get; set; }
Public Property AngleFormat As AngleDisplayFormat?
	Get
	Set
Property Value
Type: Nullable<AngleDisplayFormat>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.AngleFormat"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace