Grasshopper API
GH_Predicate.Empty Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static GH_Predicate Empty { get; }
Public Shared ReadOnly Property Empty As GH_Predicate
	Get
Property Value
Type: GH_Predicate
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Predicate.Empty"]
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace