Grasshopper API
GH_AnnotationBase.GH_AnnotationBaseProxy<T>.Style Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Style { get; }
Public ReadOnly Property Style As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_AnnotationBase.GH_AnnotationBaseProxy`1.Style"]
See Also
Reference
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Grasshopper.Kernel.Types Namespace