Grasshopper API
ObjectDraftingColor.Value.ByDisplay Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDraftingColor.Value ByDisplay { get; }
Public Shared ReadOnly Property ByDisplay As ObjectDraftingColor.Value
	Get
Property Value
Type: ObjectDraftingColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor.Value.ByDisplay"]
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace