Grasshopper API
ModelTextureSlot.Amount Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Amount { get; }
Public ReadOnly Property Amount As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelTextureSlot.Amount"]
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace