Grasshopper API
PageSettings.PaperName Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string PaperName { get; }
Public ReadOnly Property PaperName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.PageSettings.PaperName"]
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace