Grasshopper API
ObjectDisplay.Attributes.Color Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ObjectDisplayColor.Value? Color { get; set; }
Public Property Color As ObjectDisplayColor.Value?
	Get
	Set
Property Value
Type: Nullable<ObjectDisplayColor.Value>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplay.Attributes.Color"]
See Also
Reference
ObjectDisplay.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace