Grasshopper API
AnnotationUnitsSettings.Attributes.ZeroSuppression Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ZeroSuppression? ZeroSuppression { get; set; }
Public Property ZeroSuppression As ZeroSuppression?
	Get
	Set
Property Value
Type: Nullable<ZeroSuppression>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes.ZeroSuppression"]
See Also
Reference
AnnotationUnitsSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace