Grasshopper API
Param_TextDot.Exposure Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_TextDot.Exposure"]
See Also
Reference
Param_TextDot Class
Grasshopper.Kernel.Parameters Namespace