Grasshopper API
ModelConstructionPlane.IsReferencedGeometry Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
internal bool IsReferencedGeometry { get; }
Friend ReadOnly Property IsReferencedGeometry As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelConstructionPlane.IsReferencedGeometry"]
Implements
IGH_GeometricGoo.IsReferencedGeometry
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace