Grasshopper API
ModelAnnotationStyle.LeaderSettings Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public AnnotationLeaderSettings LeaderSettings { get; }
Public ReadOnly Property LeaderSettings As AnnotationLeaderSettings
	Get
Property Value
Type: AnnotationLeaderSettings
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.LeaderSettings"]
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace