Grasshopper API
GH_Hatch.BackgroundPlotColor Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Color BackgroundPlotColor { get; set; }
Public Property BackgroundPlotColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Hatch.BackgroundPlotColor"]
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace