Grasshopper API
Param_ModelUnitSystem.ComponentGuid Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_ModelUnitSystem.ComponentGuid"]
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace