Grasshopper API
AnnotationTextSettings.Attributes.FitText Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextFit? FitText { get; set; }
Public Property FitText As TextFit?
	Get
	Set
Property Value
Type: Nullable<TextFit>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes.FitText"]
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace