Grasshopper API
Folders.AppDataFolder Property
 Gets the appdata folder for Grasshopper.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static string AppDataFolder { get; }
Public Shared ReadOnly Property AppDataFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.AppDataFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace