Grasshopper API
ModelRenderSun.Attributes.Altitude Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Altitude { get; set; }
Public Property Altitude As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes.Altitude"]
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace