Grasshopper API
AnnotationUnitsSettings.LengthDisplay Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LengthDisplay? LengthDisplay { get; }
Public ReadOnly Property LengthDisplay As LengthDisplay?
	Get
Property Value
Type: Nullable<LengthDisplay>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.LengthDisplay"]
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace