Grasshopper API
GH_PointCloud.PointCloudProxy.HiddenPointCount Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public int HiddenPointCount { get; }
Public ReadOnly Property HiddenPointCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCloud.PointCloudProxy.HiddenPointCount"]
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace