Grasshopper API
ModelUnitSystem.Value.None Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ModelUnitSystem.Value None { get; }
Public Shared ReadOnly Property None As ModelUnitSystem.Value
	Get
Property Value
Type: ModelUnitSystem.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Value.None"]
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace