Grasshopper API
ModelUnitSystem.Factor Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double Factor { get; }
Public ReadOnly Property Factor As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelUnitSystem.Factor"]
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace