Grasshopper API
AnnotationToleranceSettings.ToleranceFormat Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ToleranceDisplayFormat? ToleranceFormat { get; }
Public ReadOnly Property ToleranceFormat As ToleranceDisplayFormat?
	Get
Property Value
Type: Nullable<ToleranceDisplayFormat>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.ToleranceFormat"]
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace