Grasshopper API
GH_ClippingPlane.IsValid Property
 Gets the validity of this clipping plane. If the clipping plane is referenced but cannot be loaded, the clipping plane is not valid.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.IsValid"]
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace