Grasshopper API
ClippingDrawingSettings.Dimensions Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? Dimensions { get; }
Public ReadOnly Property Dimensions As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Dimensions"]
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace