Grasshopper API
GH_Extrusion.Value Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override Extrusion Value { get; set; }
Public Overrides Property Value As Extrusion
	Get
	Set
Property Value
Type: Extrusion
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Extrusion.Value"]
See Also
Reference
GH_Extrusion Class
Grasshopper.Kernel.Types Namespace