Grasshopper API
AnnotationDimensionSettings.Attributes.RadialTextLocation Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public TextLocation? RadialTextLocation { get; set; }
Public Property RadialTextLocation As TextLocation?
	Get
	Set
Property Value
Type: Nullable<TextLocation>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes.RadialTextLocation"]
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace