Grasshopper API
ModelEarthAnchorPoint.Attributes.Latitude Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Latitude { get; set; }
Public Property Latitude As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes.Latitude"]
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace