Grasshopper API
ModelLayer.HiddenOnNewDetail Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? HiddenOnNewDetail { get; }
Public ReadOnly Property HiddenOnNewDetail As Boolean?
	Get
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.HiddenOnNewDetail"]
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace