Grasshopper API
Param_ObjectDisplay.Exposure Property
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.Params.Param_ObjectDisplay.Exposure"]
See Also
Reference
Param_ObjectDisplay Class
Grasshopper.Rhinoceros.Display.Params Namespace