Grasshopper API
Param_ModelTextureMapping.ClippingBox Property
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.Params.Param_ModelTextureMapping.ClippingBox"]
Implements
IGH_PreviewObject.ClippingBox
See Also
Reference
Param_ModelTextureMapping Class
Grasshopper.Rhinoceros.Render.Params Namespace