Grasshopper API
GH_Dimension.GH_DimensionProxy.Measure Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Measure { get; }
Public ReadOnly Property Measure As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Dimension.GH_DimensionProxy.Measure"]
See Also
Reference
GH_Dimension.GH_DimensionProxy Class
Grasshopper.Kernel.Types Namespace