Grasshopper API
ModelSectionStyle.Attributes.HatchPattern Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelHatchPattern HatchPattern { get; set; }
Public Property HatchPattern As ModelHatchPattern
	Get
	Set
Property Value
Type: ModelHatchPattern
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.HatchPattern"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace