Grasshopper API
ObjectRender.Attributes.CastsShadows Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool? CastsShadows { get; set; }
Public Property CastsShadows As Boolean?
	Get
	Set
Property Value
Type: Nullable<Boolean>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ObjectRender.Attributes.CastsShadows"]
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace