Grasshopper API
ModelLayer.Attributes.Linetype Property
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelLinetype Linetype { get; set; }
Public Property Linetype As ModelLinetype
	Get
	Set
Property Value
Type: ModelLinetype
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Model.ModelLayer.Attributes.Linetype"]
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace