Grasshopper API
Param_Predicate.Negate Property
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool Negate { get; set; }
Public Property Negate As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_Predicate.Negate"]
See Also
Reference
Param_Predicate Class
Grasshopper.Kernel.Parameters Namespace