Grasshopper API
ObjectDraftingLineWidth.Value.Width Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double Width { get; }
Public ReadOnly Property Width As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth.Value.Width"]
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace