Grasshopper API
ModelContent.Attributes.Tags Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ModelTags Tags { get; set; }
Public Property Tags As ModelTags
	Get
	Set
Property Value
Type: ModelTags
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelContent.Attributes.Tags"]
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace