Grasshopper API
GH_AssemblyInfoStub.AuthorContact Property
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override string AuthorContact { get; }
Public Overrides ReadOnly Property AuthorContact As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfoStub.AuthorContact"]
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace