Grasshopper API
Param_MatchText.MatchingMode Property
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_PatternMatching.MatchingMode MatchingMode { get; set; }
Public Property MatchingMode As GH_PatternMatching.MatchingMode
	Get
	Set
Property Value
Type: GH_PatternMatching.MatchingMode
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Params.Param_MatchText.MatchingMode"]
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace