Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T>.XAxis Property
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_Vector3d_Wrapper XAxis { get; }
Public ReadOnly Property XAxis As GH_Vector3d_Wrapper
	Get
Property Value
Type: GH_Vector3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy`1.XAxis"]
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace