Grasshopper API
ModelSectionStyle.Attributes.BoundaryLineWeight Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? BoundaryLineWeight { get; set; }
Public Property BoundaryLineWeight As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes.BoundaryLineWeight"]
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace