Grasshopper API
AnnotationLeaderSettings.CurveType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public LeaderCurveStyle? CurveType { get; }
Public ReadOnly Property CurveType As LeaderCurveStyle?
	Get
Property Value
Type: Nullable<LeaderCurveStyle>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.CurveType"]
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace