Grasshopper API
ModelView.IsReferencedGeometry Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
internal bool IsReferencedGeometry { get; }
Friend ReadOnly Property IsReferencedGeometry As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ModelView.IsReferencedGeometry"]
Implements
IGH_GeometricGoo.IsReferencedGeometry
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace