Grasshopper API
ObjectDisplayColor.Value.ByParent Property
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectDisplayColor.Value ByParent { get; }
Public Shared ReadOnly Property ByParent As ObjectDisplayColor.Value
	Get
Property Value
Type: ObjectDisplayColor.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Display.ObjectDisplayColor.Value.ByParent"]
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace