Grasshopper API
ModelRenderSun.DateTime Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public DateTime? DateTime { get; }
Public ReadOnly Property DateTime As DateTime?
	Get
Property Value
Type: Nullable<DateTime>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.DateTime"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace