Grasshopper API
ClippingArrow.Attributes.ArrowType Property
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public ClippingArrowType? ArrowType { get; set; }
Public Property ArrowType As ClippingArrowType?
	Get
	Set
Property Value
Type: Nullable<ClippingArrowType>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Annotations.ClippingArrow.Attributes.ArrowType"]
See Also
Reference
ClippingArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace