Grasshopper API
ModelRenderSun.Intensity Property
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public double? Intensity { get; }
Public ReadOnly Property Intensity As Double?
	Get
Property Value
Type: Nullable<Double>
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Render.ModelRenderSun.Intensity"]
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace