Grasshopper API
ModelFont.IsInstalled Property
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool IsInstalled { get; }
Public ReadOnly Property IsInstalled As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.ModelFont.IsInstalled"]
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace