Grasshopper API
ObjectSectionStyle.Value.BySectioner Property
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static ObjectSectionStyle.Value BySectioner { get; }
Public Shared ReadOnly Property BySectioner As ObjectSectionStyle.Value
	Get
Property Value
Type: ObjectSectionStyle.Value
[Missing <value> documentation for "P:Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle.Value.BySectioner"]
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace