Grasshopper API
GH_DocUndoEventArgs Properties
The GH_DocUndoEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Operation
 Gets the type of undo operation that caused this event.
Record
 Gets the UndoRecord pertaining to this event. Not every Event type has a single record associated with it so be sure to test for null.
Top
See Also
Reference
GH_DocUndoEventArgs Class
Grasshopper.Kernel Namespace