Grasshopper API
Param_AnnotationToleranceSettings Properties
The Param_AnnotationToleranceSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace