Grasshopper API
Attributes Properties
The ModelViewport.Attributes type exposes the following members.
Properties
Name | Description
ConstructionPlane
DisplayMode
UserText
View
Top
See Also
Reference
ModelViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace