Grasshopper API
ModelHatchPattern Properties
The ModelHatchPattern type exposes the following members.
Properties
Name | Description
FillType
Lines
Name |  (Overrides ModelContent.Name.)
Units
Unset
Top
See Also
Reference
ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting Namespace