Grasshopper API
Scale Properties
The Scale type exposes the following members.
Properties
Name | Description
Name
ScaleXFactor
ScaleYFactor
ScaleZFactor
ScalingFrame
Top
See Also
Reference
Scale Class
Grasshopper.Kernel.Types.Transforms Namespace