Grasshopper API
IGH_Structure Properties
The IGH_Structure type exposes the following members.
Properties
Name | Description
Branch[GH_Path]
 Gets a limited access pointer to the data list associated with a certain path.
Branch[Int32]
 Gets a limited access pointer to the data list at the specified index.
DataCount
 Gets the total number of data items stored in all paths.
IsEmpty
 Gets the Empty state of the structure. If the structure is Empty when it contains no paths and no branches.
Path
 Gets the data path at the specified index.
PathCount
 Gets the number of paths defined in this structure.
Paths
 Gets a list of all the paths in this structure.
StructureProxy
 Gets a proxy list of all the data-arrays in this structure
TopologyDescription
 Gets a description of the topology of the structure. Useful for debugging purposes.
Top
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace