Grasshopper API
GH_Parser Properties
The GH_Parser type exposes the following members.
Properties
Name | Description
Whitespace
 Gets an array of characters that are considered to be whitespace. At the moment, this array contains the space char and the tab char, it does not contain feeds or breaks.
Top
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace