Grasshopper API
Param_ModelAttributeKey Properties
The Param_ModelAttributeKey type exposes the following members.
Properties
Name | Description
BaseProperty
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
StateTags |  (Overrides GH_Param<T>.StateTags.)
Top
See Also
Reference
Param_ModelAttributeKey Class
Grasshopper.Rhinoceros.Params Namespace