Grasshopper API
GH_TextBoxInputBase Properties
The GH_TextBoxInputBase type exposes the following members.
Properties
Name | Description
Font
 Gets or sets the Font to use in this control.
IsTextInput
 Gets whether the text input box is currently on screen.
Top
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace