Grasshopper API
Param_PageSettings Properties
The Param_PageSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_PageSettings Class
Grasshopper.Rhinoceros.Display.Params Namespace