Grasshopper API
GH_Format Properties
The GH_Format type exposes the following members.
Properties
Name | Description
Content
Style
Top
See Also
Reference
GH_Format Class
Grasshopper.Documentation Namespace