Grasshopper API
GH_FontServer Properties
The GH_FontServer type exposes the following members.
Properties
Name | Description
Console
 FontFamily.GenericMonospace, 10pt, regular
ConsoleAdjusted
 FontFamily.GenericMonospace, 10pt, regular, adjusted to counter UI scaling.
ConsoleSmall
 FontFamily.GenericMonospace, 8pt, regular
ConsoleSmallAdjusted
 FontFamily.GenericMonospace, 8pt, regular, adjusted to counter UI scaling.
FamilyConsole
 Gets or sets the FontFamily used for monospaced fonts in Grasshopper.
FamilyScript
 Gets or sets the FontFamily used for scripted fonts in Grasshopper.
FamilyStandard
 Gets or sets the FontFamily used for standard fonts in Grasshopper.
Large
 SystemFonts.CaptionFont, 10pt, bold
LargeAdjusted
 SystemFonts.CaptionFont, 10pt, bold, adjusted for logical pixel size.
Script
 FontFamily.GenericSansSerif, 10pt, italic
ScriptSmall
 FontFamily.GenericSansSerif, 8pt, italic
Small
 SystemFonts.CaptionFont, 6pt, regular
Standard
 SystemFonts.CaptionFont, 8pt, regular
StandardAdjusted
 SystemFonts.CaptionFont, 8pt, regular, adjusted for logical pixel size.
StandardBold
 SystemFonts.CaptionFont, 8pt, bold
StandardItalic
 SystemFonts.CaptionFont, 8pt, italic
Top
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace