Grasshopper API
GH_HatchProxy Properties
The GH_Hatch.GH_HatchProxy type exposes the following members.
Properties
Name | Description
BasePoint
ObjectID
Pattern
PatternRotation
PatternScale
Top
See Also
Reference
GH_Hatch.GH_HatchProxy Class
Grasshopper.Kernel.Types Namespace