Grasshopper API
Param_DateTimeFormat Properties
The Param_DateTimeFormat type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_DateTimeFormat Class
Grasshopper.Rhinoceros.Annotations.Params Namespace