Grasshopper API
GH_RectangleProxy Properties
The GH_Rectangle.GH_RectangleProxy type exposes the following members.
Properties
Name | Description
Area
Circumference
Height
Origin
Width
XAxis
YAxis
ZAxis
Top
See Also
Reference
GH_Rectangle.GH_RectangleProxy Class
Grasshopper.Kernel.Types Namespace