Grasshopper API
GH_Structure<T> Properties
The GH_Structure<T> generic type exposes the following members.
Properties
Name | Description
Branch[GH_Path]
 Gets a limited access pointer to the data list associated with a certain path.
Branch[Int32]
 Gets a limited access pointer to the data list at the specified index
Branches
 Gets a list of all the data-arrays in this structure
DataCount
 Gets the total number of data items stored in all paths.
DataItem[Int32]
 Gets the item at a given offset. The structure is treated as a linear list in this case. If index is out of range, null is returned. For repeated indexed retrieval, consider using a For Each loop since the enumerator is more efficient.
DataItem[GH_Path, Int32]
 Gets a direct pointer to a data item under a specific path and index.
DataList[GH_Path]
 Gets a direct pointer to the list of data under a specific path.
DataList[Int32]
 Gets a direct pointer to the list of data under the specified index.
FirstItem
 Gets the first item in the structure. If no such item exists, null is returned.
IsEmpty
 Gets the Empty state of the structure. If the structure is Empty it contains no paths and no branches.
LastItem
 Gets the last item in the structure. If no such item exists, null is returned.
NonNulls
 Get an enumerator for this structure that allow linear iteration over the data hierarchy while skipping all Null entries. This Enumerator has been optimized, do not cache instances of it.
Path
 Gets the data path at the specified index.
PathCount
 Gets the number of paths defined in this structure.
Paths
 Gets a list of all the paths in this structure.
StructureProxy
 Gets a proxy list of all the data-arrays in this structure.
TopologyDescription
 Gets a description of the topology of the structure. Useful for debugging purposes.
Top
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace