Grasshopper API
Param_ObjectDraftingColor Properties
The Param_ObjectDraftingColor type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting.Params Namespace