Grasshopper API
ModelRenderTexture Properties
The ModelRenderTexture type exposes the following members.
Properties
Name | Description
TypeName |  (Overrides ModelRenderContent.TypeName.)
Top
See Also
Reference
ModelRenderTexture Class
Grasshopper.Rhinoceros.Render Namespace