Grasshopper API
GH_LinkedParamAttributes Properties
The GH_LinkedParamAttributes type exposes the following members.
Properties
Name | Description
HasInputGrip |  (Overrides GH_Attributes<T>.HasInputGrip.)
HasOutputGrip |  (Overrides GH_Attributes<T>.HasOutputGrip.)
Top
See Also
Reference
GH_LinkedParamAttributes Class
Grasshopper.Kernel.Attributes Namespace