Grasshopper API
Attributes Properties
The ModelRenderEnvironment.Attributes type exposes the following members.
Properties
Name | Description
RenderEnvironment
Top
See Also
Reference
ModelRenderEnvironment.Attributes Class
Grasshopper.Rhinoceros.Render Namespace