Grasshopper API
GH_ExternalFile Properties
The GH_ExternalFile type exposes the following members.
Properties
Name | Description
FileHash
 Gets the file hash.
FileName
 Gets the file name (without the extension).
FilePath
 Gets the file path.
FileSize
 Gets the file size (in bytes).
FileType
 Gets the file type as indicated by the extension.
Top
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace