Grasshopper API
Param_AnnotationDimensionSettings Properties
The Param_AnnotationDimensionSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace