Grasshopper API
GH_DocumentServer Properties
The GH_DocumentServer type exposes the following members.
Properties
Name | Description
Document
 Gets the document at the given index.
DocumentCount
 Gets the number of documents stored in the global list.
DocumentNames
 Gets a string collection containing all the names of the documents in the global list.
ModifiedDocumentCount
 Gets the total number of modified (unsaved) documents.
Top
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace