Grasshopper API
GH_Guid Properties
The GH_Guid type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Guids are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Guid Class
Grasshopper.Kernel.Types Namespace