Grasshopper API
GH_UserObject Properties
The GH_UserObject type exposes the following members.
Properties
Name | Description
BaseGuid
 Gets or sets the ComponentID of the IGH_DocumentObject that functions as the base class for this User Object.
Data
 Gets or sets the serialized data. This data is used to deserialize a new instance of the base class.
Description
 Gets or sets the Instance Description override for this User Object.
Exposure
 Gets or sets the Exposure of this User Object.
Guid
 Gets or sets the Guid of this User Object. The Guid is created anew during construction and is not stored in the User Object File. You should never have to set this field.
Icon
 Gets or sets the icon associated with this User Object. If the icon hasn't been overridden, then a Default icon is returned.
Path
 Gets or sets the file path this User Object is loaded from or saved to.
Top
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace