Grasshopper API
IGH_ValueProxy Properties
The IGH_ValueProxy type exposes the following members.
Properties
Name | Description
IsParsable
 Gets a value indicating whether or not the type can be instantiated from a String
IsValid
 Gets a value indicating whether or not the current value is valid
ProxyName
 Gets a human-friendly name description of the template type
ProxyType
 Gets the System.Type description of the template type
ProxyValue
 Gets an instance of the local template type object
UserString
 Gets or sets the user-defined string that describes this proxy This only really makes sense if the Proxy is Parsable.
Top
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace