Grasshopper API
AnnotationLeaderSettings Properties
The AnnotationLeaderSettings type exposes the following members.
Properties
Name | Description
ContentAngleType
CurveType
HasLanding
LandingLength
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
See Also
Reference
AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations Namespace