Grasshopper API
Param_ItemDisplayColor Properties
The Param_ItemDisplayColor type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ItemDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace