Grasshopper API
AnnotationArrow Properties
The AnnotationArrow type exposes the following members.
Properties
Name | Description
ArrowType
Top
See Also
Reference
AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations Namespace