Grasshopper API
GH_ClippingPlaneProxy<T> Properties
The GH_ClippingPlane.GH_ClippingPlaneProxy<T> generic type exposes the following members.
Properties
Name | Description
AnnotationStyle
CustomDepth
Depth
LabelStyle
ObjectID
Origin
XAxis
YAxis
ZAxis
Top
See Also
Reference
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Grasshopper.Kernel.Types Namespace