Grasshopper API
Identity Properties
The Identity type exposes the following members.
Properties
Name | Description
Name
Top
See Also
Reference
Identity Class
Grasshopper.Kernel.Types.Transforms Namespace