Grasshopper API
GH_MenuTextBox Properties
The GH_MenuTextBox type exposes the following members.
Properties
Name | Description
OriginalText
 Gets or sets the original text that was visible when the control was first displayed.
Text
 Gets or sets the current text.
TextBoxItem
 Gets the text box control embedded in the menu.
Width
 Gets or sets the width of the control.
Top
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace