Grasshopper API
IGH_GooProxy Properties
The IGH_GooProxy type exposes the following members.
Properties
Name | Description
IsParsable
 Gets a value indicating whether or not the type can be instantiated from a String.
ProxyOwner
 Gets the piece of Grasshopper data that spawned this proxy.
UserString
 Gets or sets the user-defined string that describes this proxy. This only really makes sense if the Proxy is Parsable.
Valid
 Gets a value indicating whether this proxy represents valid data.
Top
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace