Grasshopper API
GH_DetailView Properties
The GH_DetailView type exposes the following members.
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this detail view object. The detail view is considered to be loaded when the local detail view instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this detail view. If the detail view is referenced but cannot be loaded, the detail view is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Viewport
Top
See Also
Reference
GH_DetailView Class
Grasshopper.Kernel.Types Namespace