Grasshopper API
GH_MouseTracker Properties
The GH_MouseTracker type exposes the following members.
Properties
Name | Description
Duration
 Gets the timespan that has passed between the oldest and youngest recorded frames. This is not the same as the time that has passed since recording began.
Frame
 Gets the position (in control coordinates) of the frame at the given index.
FrameCount
 Gets the number of recorded frames.
MaximumDuration
 Gets or sets the maximum allowed duration of the entire record. When new frames are recorded, old frames that are more distant than MaximumDuration will be dropped. The default duration is 10 seconds.
MaximumFrameCount
 Gets or sets the maximum number of frames to keep in history. If more frames are added, the oldest ones will be dropped. The default is 16,384 frames.
NewestFrame
 Gets the most recent frame in recorded history.
OldestFrame
 Gets the oldest frame in recorded history.
TemporalAccuracy
 Gets or sets the maximum temporal accuracy. Frames that are closer together than the accuracy will not be recorded. The default accuracy equals 5ms.
Top
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace