Grasshopper API
GH_PersistentParam<T> Properties
The GH_PersistentParam<T> generic type exposes the following members.
Properties
Name | Description
DataType
 Gets the type of data stored in this parameter.
 (Overrides GH_Param<T>.DataType.)
PersistentData
 Gets the persistent data stored in this parameter. If you modify the persistent data, be sure to call the: OnObjectChanged(GH_ObjectEventType.PersistentData) event.
PersistentDataCount
 Gets the number of persistent data items stored in this parameter.
Top
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace