Grasshopper API
GH_TooltipDisplayEventArgs Properties
The GH_TooltipDisplayEventArgs type exposes the following members.
Properties
Name | Description
Control
 Gets the control for whom the tooltip is about to be displayed.
Description
 Gets or sets the description of the tooltip. This field is optional.
Diagram
 Gets or sets the image that is displayed in the details section of the tooltip. This field is optional, but when it is defined, the Description property is ignored.
Icon
 Gets or sets the icon that is displayed in the upper left hand corner of the tooltip. This field is optional.
Point
 Gets the point in control coordinates for the tooltip locus.
Region
 Gets or sets the active region (in control coordinates) for this tooltip. Once a tooltip is shown inside the region, the tooltip will 'stick' to the mouse for as long as the mouse remains within this region. By default the region is set to Rectangle.Empty, which indicates that region tracking is not used for this tooltip.
Text
 Gets or sets the text of the tooltip. If you do not set the Text property, you must set the Title property or the tooltip will not be shown.
Title
 Gets or sets the title of the tooltip. If you do not set the Title property, you must set the Text property or the tooltip will not be shown.
Valid
 Gets whether there is currently enough data to display a tooltip.
Top
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace