Grasshopper API
ModelTextureMapping Properties
The ModelTextureMapping type exposes the following members.
Properties
Name | Description
Capped
Channel
ClippingBox
Geometry
IsValid |  (Overrides ModelContent.IsValid.)
LocalTransform
MappingType
Projection
TextureSpace
TypeName |  (Overrides ModelData.TypeName.)
Unset
UVWOffset
UVWRepeat
UVWRotation
XYZOffset
XYZRotation
XYZSize
Top
See Also
Reference
ModelTextureMapping Class
Grasshopper.Rhinoceros.Render Namespace