Grasshopper API
Attributes Properties
The ModelRenderMaterial.Attributes type exposes the following members.
Properties
Name | Description
RenderMaterial
Top
See Also
Reference
ModelRenderMaterial.Attributes Class
Grasshopper.Rhinoceros.Render Namespace