Grasshopper API
GH_ComponentParamServer Properties
The GH_ComponentParamServer type exposes the following members.
Properties
Name | Description
Input
 Gets or sets the input list of parameters. Do not insert or remove parameters from this list, use the dedicated functions instead.
InputWidth
 Gets the width of the largest input parameter.
OnlyTreeAndListParameters
 Returns True if every input parameter is either a list or a tree parameter.
OnlyTreeParameters
 Returns True if every input parameter is a tree parameter.
Output
 Gets or sets the output list of parameters. Do not insert or remove parameters from this list, use the dedicated functions instead.
OutputWidth
 Gets the width of the largest output parameter.
Owner
 Gets the owner component of this instance
Top
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace