Grasshopper API
GH_TagArtist Properties
The GH_TagArtist type exposes the following members.
Properties
Name | Description
ID
 Gets the ID of this TagArtist object.
Top
See Also
Reference
GH_TagArtist Class
Grasshopper.GUI.Canvas.TagArtists Namespace