Grasshopper API
GH_LexerCombo Properties
The GH_LexerCombo type exposes the following members.
Properties
Name | Description
Source
 Gets or sets the lexer object that represents the source of a lexical operation.
Target
 Gets or sets the lexer object that represents the target of a lexical operation.
Top
See Also
Reference
GH_LexerCombo Class
Grasshopper.Kernel.Data Namespace