Grasshopper API
GH_Param<T> Properties
The GH_Param<T> generic type exposes the following members.
Properties
Name | Description
Access
 Gets or sets the Access level for this parameter.
DataMapping
 Gets or sets the data mapping of this Parameter.
DataType
 Type is either Void if there are no sources or Remote. Derived classes should expand on this.
HasProxySources
 Gets a value indicating whether or not this parameter maintains proxy sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
InstanceDescription
 Gets the description of this instance. The default description is about the amount and source of the local values.
 (Overrides GH_InstanceDescription.InstanceDescription.)
IsDataProvider |  (Overrides GH_ActiveObject.IsDataProvider.)
IsPrincipal
 Gets whether this parameter is a principal parameter. Principal parameters are maintained by components and are not part of the IGH_Param interface.
Kind
 Gets the parameter kind. The kind is evaluated lazily and cached.
Optional
 Gets or sets whether or not this parameter is considered optional by the owner component. Empty, non-optional parameters prevent the component from being solved.
ProcessorTime |  (Overrides GH_ActiveObject.ProcessorTime.)
ProxySourceCount
 Gets the number of proxy sources for this parameter. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Recipients
 Gets a list of all the recipients of this parameter. I.e. a recipient has this parameter as one of the sources. The Recipient list is maintained by the parameter, do not modify it yourself.
Reverse
 Gets or sets the data reverse modifier of this parameter.
Simplify
 Gets or sets the simplify modifier for this parameter.
SourceCount
 Gets the number of sources for this parameter.
Sources
 Gets a list of source parameters. Do not modify this list, if you wish to add or remove sources, use dedicated functions like AddSource() and RemoveSource() instead.
StateTags
 Gets all the StateTags that are associated with this parameter. A state tag is a visual feedback icon that represents specific internal settings.
Type
 Gets the Framework Type descriptor for the stored Data.
TypeName
 Calls TypeName() on the first instance of T it can find. This is either an item in the volatile list, or a newly constructed instance.
VolatileData
VolatileDataCount
WireDisplay
 Gets or sets the wire display style for this parameter. Wire display only affects the wires connected to the parameter input.
Top
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace