Grasshopper API
GH_DocSettingsEventArgs Properties
The GH_DocSettingsEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Kind
 Gets the type of setting that was changed.
Top
See Also
Reference
GH_DocSettingsEventArgs Class
Grasshopper.Kernel Namespace