Grasshopper API
GH_Slider Properties
The GH_Slider type exposes the following members.
Properties
Name | Description
ControlEdgeColour
 Gets or sets the EdgeColor for this slider control.
ControlShadowColour
 Gets or sets the Shadow colour for this control.
DecimalPlaces
 Gets or sets the number of decimal places allowed for Floating Point Sliders.
DrawControlBorder
 Gets or sets whether the border of the slider should be drawn.
DrawControlShadows
 Gets or sets whether the drop shadows of the slider should be drawn.
FormatMask
 Gets or sets the string format mask to use for the display. Should contain at least one "{0}" element.
GripBottomColour
 Gets or sets the fill colour for the bottom edge of the slider grip.
GripDisplay
 Gets or sets how the slider grip (or thumb) is drawn.
GripEdgeColour
 Gets or sets the edge colour for the slider grip.
GripTopColour
 Gets or sets the fill colour for the top edge of the slider grip.
Maximum
 Gets or sets the upper numeric limit for the slider range.
Minimum
 Gets or sets the lower numeric limit for the slider range.
RailBrightColour
 Gets or sets the edge colour for the bright parts of the rail.
RailDarkColour
 Gets or sets the edge colour for the dark parts of the rail.
RailDisplay
 Gets or sets how the slider rail (or track) is drawn.
RailEmptyColour
 Gets or sets the fill colour for the empty portion of the rail.
RailFullColour
 Gets or sets the fill colour for the full portion of the rail.
ShadowSize
 Gets or sets the size of the border shadow along all edges of the box.
TextColour
 Gets or sets the fill colour for the slider text.
TickCount
 Gets or sets the number of ticks.
TickDisplay
 Gets or sets how the slider ticks are drawn.
TickFrequency
 Gets or sets the frequency of large ticks vs small ticks.
Type
 Gets or sets the numeric type of this slider.
Value
 Gets or sets the numeric value for the slider range.
Top
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace