Grasshopper API
Attributes Properties
The ModelComponentContent.Attributes type exposes the following members.
Properties
Name | Description
UserText
Top
See Also
Reference
ModelComponentContent.Attributes Class
Grasshopper.Rhinoceros Namespace