Grasshopper API
Complex Properties
The Complex type exposes the following members.
Properties
Name | Description
Argument
 Gets or sets the complex argument.
ComplexUnit
Imaginary
 Gets or sets the imaginary component of the Complex number.
Infinity
IsReal
 Gets whether this complex number only has a real component.
IsRealNonNegative
 Gets whether this complex number only has a positive real component.
IsValid
 Gets the validity of this number.
IsZero
 Gets whether or not this complex number equals {0.0; 0.0}
NaN
NegativeInfinity
Real
 Gets or sets the real component of the Complex number.
Zero
Top
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace