Grasshopper API
GH_ColourSwatchEventArgs Properties
The GH_ColourSwatchEventArgs type exposes the following members.
Properties
Name | Description
Colour
Top
See Also
Reference
GH_ColourSwatchEventArgs Class
Grasshopper.GUI Namespace