Grasshopper API
GH_OrdinateDimension Properties
The GH_OrdinateDimension type exposes the following members.
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
See Also
Reference
GH_OrdinateDimension Class
Grasshopper.Kernel.Types Namespace