Grasshopper API
GH_NumberSliderSnappingEditor Properties
The GH_NumberSliderSnappingEditor type exposes the following members.
Properties
Name | Description
SnapLines
Top
See Also
Reference
GH_NumberSliderSnappingEditor Class
Grasshopper.GUI Namespace