Grasshopper API
ModelRenderSun Properties
The ModelRenderSun type exposes the following members.
Properties
Name | Description
Altitude
Azimuth
DateTime
DaylightSavingEnabled
DaylightSavingMinutes
Direction
Enabled
Intensity
Latitude
Longitude
Manual
North
TimeZone
Top
See Also
Reference
ModelRenderSun Class
Grasshopper.Rhinoceros.Render Namespace