Grasshopper API
Attributes Properties
The ModelLinetype.Attributes type exposes the following members.
Properties
Name | Description
CapStyle
JoinStyle
Segments
TaperPoints
Width
WidthUnits
Top
See Also
Reference
ModelLinetype.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace