Grasshopper API
GH_Variant Properties
The GH_Variant type exposes the following members.
Properties
Name | Description
_Bool
 Gets the contents of this Variant as a bool.
_Complex
 Gets the contents of this Variant as a complex number.
_Double
 Gets the contents of this Variant as a double. If the Variant is of type Integer this cast will also work.
_Int
 Gets the contents of this Variant as an integer.
_Plane
 Gets the contents of this Variant as a Plane.
_Point
 Gets the contents of this Variant as a Point.
_String
 Gets the contents of this Variant as a String. This function will work for all Variant types.
_Vector
 Gets the contents of this Variant as a Vector.
IsNumeric
 Gets a value indicating whether or not the Variant is a numeric type. Only Doubles and Integers are considered to be Numeric.
Type
 Gets the Type of this Variant.
Top
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace