Grasshopper API
GH_ColourCube Properties
The GH_ColourCube type exposes the following members.
Properties
Name | Description
BackFace
 Gets a graphics path describing the back face of the cube. Caller is responsible for disposing of this path instance.
BottomFace
 Gets a graphics path describing the bottom face of the cube. Caller is responsible for disposing of this path instance.
C0
 Gets the first point in the corner point list.
C1
 Gets the second point in the corner point list.
C2
 Gets the third point in the corner point list.
C3
 Gets the fourth point in the corner point list.
C4
 Gets the fifth point in the corner point list.
C5
 Gets the sixth point in the corner point list.
C6
 Gets the seventh point in the corner point list.
C7
 Gets the eighth point in the corner point list.
Grip
 Gets the rectangle that describes the slice grip.
LeftFace
 Gets a graphics path describing the left face of the cube. Caller is responsible for disposing of this path instance.
Pivot
 Gets the point that describes the center of the pivot on the slice.
S0
 Gets the first point in the shadow point list. This point is coincident with C0.
S1
 Gets the second point in the shadow point list. This is the corner of the drop-shadow on the bottom face.
S2
 Gets the third point in the shadow point list. This point is the kink of the drop-shadow on the edge connecting C2 and C3.
S3
 Gets the fourth point in the shadow point list. This point is coincident with C7.
S4
 Gets the fifth point in the shadow point list. This point is coincident with C4.
Shadow
 Gets a graphics path describing the outline of the drop shadow. Caller is responsible for disposing of this path instance.
Silhouette
 Gets a graphics path describing the silhouette of the cube. Caller is responsible for disposing of this path instance.
Slice
 Gets the rectangle that describes the cutting slide through the current colour space.
Top
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace