Grasshopper API
GH_RuntimeFile Properties
The GH_RuntimeFile type exposes the following members.
Properties
Name | Description
Content
 Gets the data associated with a certain key. For every time the key appears in the file, an array of content strings will be returned.
Keys
 Gets a list of all the keys present in the File.
Path
 Gets the path of this help file.
Tags
 Gets a collection of all the pre-defined keywords. Use IsKeyword(string) if you want to know whether a string equals a keyword. It's both faster and more reliable than comparing against this collection.
Top
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace