Grasshopper API
GH_CanvasObjectMouseDownEventArgs Properties
The GH_CanvasObjectMouseDownEventArgs type exposes the following members.
Properties
Name | Description
Canvas
Document
Object
Top
See Also
Reference
GH_CanvasObjectMouseDownEventArgs Class
Grasshopper.GUI Namespace