Grasshopper API
Value Properties
The ObjectSectionStyle.Value type exposes the following members.
Properties
Name | Description
ByLayer
ByObject
ByParent
BySectioner
SectionStyle
Source
Top
See Also
Reference
ObjectSectionStyle.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace