Grasshopper API
Param_ObjectDraftingLinetype Properties
The Param_ObjectDraftingLinetype type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace