Grasshopper API
Attributes Properties
The AnnotationLeaderSettings.Attributes type exposes the following members.
Properties
Name | Description
ContentAngleType
CurveType
HasLanding
LandingLength
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
See Also
Reference
AnnotationLeaderSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace