Grasshopper API
GH_RenderArgs Properties
The GH_RenderArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the rhino document from whence the render originated.
MaterialNormal |  Obsolete.
 Gets the material hint to use for unselected objects.
MaterialSelected |  Obsolete.
 Gets the material hint to use for selected objects.
ModelTransform
 Gets the current model transform.
PluginId
 Gets the render plugin id that is about to render this geometry.
Viewport
 Gets the viewport details involved in this rendering.
ViewportName
 Gets the viewport name involved in this rendering.
Top
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace