Grasshopper API
ModelLayer Properties
The ModelLayer type exposes the following members.
Properties
Name | Description
DisplayColor
DraftingColor
Hidden
HiddenOnModel
HiddenOnNewDetail
Linetype
LineWeight
Locked
Material
SectionStyle
Unset
Top
See Also
Reference
ModelLayer Class
Grasshopper.Rhinoceros.Model Namespace