Grasshopper API
GH_LockedAction Properties
The GH_LockedAction type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_LockedAction Class
Grasshopper.Kernel.Undo.Actions Namespace