Grasshopper API
GH_CursorServer Properties
The GH_CursorServer type exposes the following members.
Properties
Name | Description
Count
 Gets the number of cached cursors.
Top
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace