Grasshopper API
GH_Grip Properties
The GH_Grip type exposes the following members.
Properties
Name | Description
ColourLeft
 Gets the colour to the left of this grip.
ColourRight
 Gets the colour to the right of this grip.
GripId
 Gets the Grip ID.
IsValid
 Gets whether this grip is valid. A valid grip must have a non-empty Id and a non-NaN parameter.
Parameter
 Gets or sets the numeric parameter of the grip.
Selected
 Gets or sets whether this grip is selected. Selection state is not (de)serialized.
Type
 Gets whether the colour across this grip is smooth.
Top
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace