Grasshopper API
ObjectDrafting Properties
The ObjectDrafting type exposes the following members.
Properties
Name | Description
Color
LineScale
Linetype
LineWidth
Order
Top
See Also
Reference
ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting Namespace