Grasshopper API
SliderSnapRange Properties
The SliderSnapRange type exposes the following members.
Properties
Name | Description
IsSingleton
Max
Min
Top
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace