Grasshopper API
GH_Border Properties
The GH_Border type exposes the following members.
Properties
Name | Description
Region
 Gets the shape of the border.
Size_Cursor
 Gets the cursor associated with this border.
Topology
 Gets the type of border.
Top
See Also
Reference
GH_Border Class
Grasshopper.GUI.Canvas Namespace