Grasshopper API
ModelObject Properties
The ModelObject type exposes the following members.
Properties
Name | Description
Display
Drafting
IsValid |  (Overrides ModelContent.IsValid.)
Layer
ObjectType
Render
SectionStyle
TypeName |  (Overrides ModelData.TypeName.)
Url
Visibility
Top
See Also
Reference
ModelObject Class
Grasshopper.Rhinoceros.Model Namespace