Grasshopper API
ModelValue Properties
The ModelValue type exposes the following members.
Properties
Name | Description
IsValidWhyNot
TypeDescription
Top
See Also
Reference
ModelValue Class
Grasshopper.Rhinoceros Namespace