Grasshopper API
DataTree<T> Properties
The DataTree<T> generic type exposes the following members.
Properties
Name | Description
BranchCount
 Gets the number of branches defined in this tree.
Branches
 Gets a list of all the data-arrays in this tree
DataCount
 Gets the total number of data items (including nulls) stored in all branches.
Item
 Gets or set the data item at the specified path and index.
Paths
 Gets a list of all the branch paths in this tree.
TopologyDescription
 Gets a description of the topology of the tree. Useful for debugging purposes.
Top
See Also
Reference
DataTree<T> Class
Grasshopper Namespace