Grasshopper API
GH_Lexer Properties
The GH_Lexer type exposes the following members.
Properties
Name | Description
IsItem
 Gets a value indicating whether or not the item portion of the lexer has been set.
IsPath
 Gets a value indicating whether or not the path portion of the lexer has been set.
Item
 Gets the item string that was extracted from the mask. The default is "append"
Mask
 Gets the original string that represents the user input for this lexer.
Path
 Gets the list of path strings that was extracted from the mask. If the mask hasn't been parsed yet, it will be parsed now. If the returned list is still nothing, parsing failed.
Top
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace