Grasshopper API
GH_RuleRange Properties
The GH_RuleRange type exposes the following members.
Properties
Name | Description
Kind
Notation
Top
See Also
Reference
GH_RuleRange Class
Grasshopper.Kernel.Data Namespace