Grasshopper API
GH_Text Properties
The GH_Text type exposes the following members.
Properties
Name | Description
Text
 Gets the text string.
Top
See Also
Reference
GH_Text Class
Grasshopper.Documentation Namespace