Grasshopper API
ModelRenderEnvironment Properties
The ModelRenderEnvironment type exposes the following members.
Properties
Name | Description
TypeName |  (Overrides ModelRenderContent.TypeName.)
Top
See Also
Reference
ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render Namespace