Grasshopper API
GH_Goo<T> Properties
The GH_Goo<T> generic type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether or not the current value is valid.
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
TypeDescription
 Gets a description of the type of the implementation.
TypeName
 Gets the name of the type of the implementation.
Value
 Gets or sets the internal data.
Top
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace