Grasshopper API
ModelFont Properties
The ModelFont type exposes the following members.
Properties
Name | Description
FamilyName
InstalledFamilies
InstalledFonts
IsInstalled
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
ModelFont Class
Grasshopper.Rhinoceros Namespace