Grasshopper API
GH_VectorForce Properties
The GH_VectorForce type exposes the following members.
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Chord
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Top
See Also
Reference
GH_VectorForce Class
Grasshopper.Kernel.Types Namespace