Grasshopper API
GH_PingDocumentEventArgs Properties
The GH_PingDocumentEventArgs type exposes the following members.
Properties
Name | Description
Document
 If you're a GH_Document that owns this object, you must fill out this field. This is the only way for objects to know which document they belong to.
Top
See Also
Reference
GH_PingDocumentEventArgs Class
Grasshopper.Kernel Namespace