Grasshopper API
GH_DebugDescriptionWriter Properties
The GH_DebugDescriptionWriter type exposes the following members.
Properties
Name | Description
Depth
 Gets the depth of the current writer. Depth is represented by whitespace in front of each line.
Top
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace