Grasshopper API
ModelViewport Properties
The ModelViewport type exposes the following members.
Properties
Name | Description
Attribs
DefaultAttributes |  (Overrides ModelData.DefaultAttributes.)
DisplayMode
Space
Unset
ViewportType
Top
See Also
Reference
ModelViewport Class
Grasshopper.Rhinoceros.Display Namespace