Grasshopper API
GH_DocContextEventArgs Properties
The GH_DocContextEventArgs type exposes the following members.
Properties
Name | Description
Context
 Gets the value of the document context flag at the time the event was raised, it may have been changed in between by other event handlers.
Document
 Gets the document that raised the event.
Top
See Also
Reference
GH_DocContextEventArgs Class
Grasshopper.Kernel Namespace