Grasshopper API
Value Properties
The ObjectDraftingLineWidth.Value type exposes the following members.
Properties
Name | Description
ByLayer
ByParent
Source
Width
Top
See Also
Reference
ObjectDraftingLineWidth.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace