Grasshopper API
GH_AnnotationBase Properties
The GH_AnnotationBase type exposes the following members.
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this annotation object. The annotation is considered to be loaded when the local annotation instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this dimension. If the dimension is referenced but cannot be loaded, then the dimension is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
Overrides
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
Style
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
ValueType
Top
See Also
Reference
GH_AnnotationBase Class
Grasshopper.Kernel.Types Namespace