Grasshopper API
Attributes Properties
The ModelRenderContent.Attributes type exposes the following members.
Properties
Name | Description
RenderContent
Top
See Also
Reference
ModelRenderContent.Attributes Class
Grasshopper.Rhinoceros.Render Namespace