Grasshopper API
Param_MeshParameters Properties
The Param_MeshParameters type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace