Grasshopper API
GH_SolutionSpan Properties
The GH_SolutionSpan type exposes the following members.
Properties
Name | Description
EndTime
 Gets the time at which this solution was finished.
StartTime
 Gets the time at which this solution was started.
Top
See Also
Reference
GH_SolutionSpan Structure
Grasshopper.Kernel Namespace