Grasshopper API
Attributes Properties
The ModelTextureSlot.Attributes type exposes the following members.
Properties
Name | Description
Amount
Color
Enabled
Number
Texture
Top
See Also
Reference
ModelTextureSlot.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace