Grasshopper API
Value Properties
The ObjectDraftingColor.Value type exposes the following members.
Properties
Name | Description
ByDisplay
ByLayer
ByParent
Color
Source
Top
See Also
Reference
ObjectDraftingColor.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace