Grasshopper API
ModelRenderMaterial Properties
The ModelRenderMaterial type exposes the following members.
Properties
Name | Description
Name |  (Overrides ModelContent.Name.)
TypeName |  (Overrides ModelRenderContent.TypeName.)
Unset
Top
See Also
Reference
ModelRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace