Grasshopper API
ModelDetailViewport Properties
The ModelDetailViewport type exposes the following members.
Properties
Name | Description
ViewportType |  (Overrides ModelViewport.ViewportType.)
Top
See Also
Reference
ModelDetailViewport Class
Grasshopper.Rhinoceros.Display Namespace