Grasshopper API
ObjectDraftingLinetype Properties
The ObjectDraftingLinetype type exposes the following members.
Properties
Name | Description
Linetype
Source
Top
See Also
Reference
ObjectDraftingLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace