Grasshopper API
GH_CodeStringSegment Properties
The GH_CodeStringSegment type exposes the following members.
Properties
Name | Description
IsCode
String
StringValue
Top
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace