Grasshopper API
ModelView Properties
The ModelView type exposes the following members.
Properties
Name | Description
IsReferencedGeometry
IsValid
ReferenceID
Title
Top
See Also
Reference
ModelView Class
Grasshopper.Rhinoceros.Display Namespace