Grasshopper API
ModelSpaceViewport Properties
The ModelSpaceViewport type exposes the following members.
Properties
Name | Description
Attribs
Space |  (Overrides ModelViewport.Space.)
Top
See Also
Reference
ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display Namespace