Grasshopper API
ModelEarthAnchorPoint Properties
The ModelEarthAnchorPoint type exposes the following members.
Properties
Name | Description
Elevation
 Gets a point elevation on earth, in meters.
ElevationCoordinateSystem
 Gets the value indicating the zero level convention relating to a location on Earth
Latitude
 Gets a point latitude on earth, in degrees. [-90, +90]
Longitude
 Gets a point longitude on earth, in degrees. [-180, +180]
ModelCompass
 Gets the corresponding compass plane in model coordinates
Top
See Also
Reference
ModelEarthAnchorPoint Class
Grasshopper.Rhinoceros.Model Namespace