Grasshopper API
GH_PlaneProxy Properties
The GH_Plane.GH_PlaneProxy type exposes the following members.
Properties
Name | Description
Origin
XAxis
YAxis
ZAxis
Top
See Also
Reference
GH_Plane.GH_PlaneProxy Class
Grasshopper.Kernel.Types Namespace