Grasshopper API
ModelTextureSlot Properties
The ModelTextureSlot type exposes the following members.
Properties
Name | Description
Amount
Color
Enabled
Number
Texture
Top
See Also
Reference
ModelTextureSlot Class
Grasshopper.Rhinoceros.Render Namespace