Grasshopper API
Attributes Properties
The ModelRenderSkylight.Attributes type exposes the following members.
Properties
Name | Description
Enabled
Environment
EnvironmentOverride
Top
See Also
Reference
ModelRenderSkylight.Attributes Class
Grasshopper.Rhinoceros.Render Namespace