Grasshopper API
Param_ModelHatchLine Properties
The Param_ModelHatchLine type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting.Params Namespace