Grasshopper API
GH_CurveProxy Properties
The GH_Curve.GH_CurveProxy type exposes the following members.
Properties
Name | Description
Closed
Deformable
Domain
Length
Linear
ObjectID
Periodic
Planar
Type
Top
See Also
Reference
GH_Curve.GH_CurveProxy Class
Grasshopper.Kernel.Types Namespace