Grasshopper API
GH_SettingsServer Properties
The GH_SettingsServer type exposes the following members.
Properties
Name | Description
Count
 Gets the total number of settings stored in this database.
DatabaseName
 Gets the name of this settings database.
Top
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace