Grasshopper API
GH_ExtrusionProxy Properties
The GH_Extrusion.GH_ExtrusionProxy type exposes the following members.
Properties
Name | Description
Area
CapCount
ObjectID
ProfileCount
Solid
Volume
Top
See Also
Reference
GH_Extrusion.GH_ExtrusionProxy Class
Grasshopper.Kernel.Types Namespace