Grasshopper API
GH_SamplingSphere Properties
The GH_SamplingSphere type exposes the following members.
Properties
Name | Description
SampleCount
 Gets the total number of samples contained in this sampling grid.
Size
 Gets the size of this sample grid.
Top
See Also
Reference
GH_SamplingSphere Class
Grasshopper.GUI Namespace