Grasshopper API
GH_WireAction Properties
The GH_WireAction type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_WireAction Class
Grasshopper.Kernel.Undo.Actions Namespace