Grasshopper API
AnnotationTextSettings Properties
The AnnotationTextSettings type exposes the following members.
Properties
Name | Description
DrawForward
DrawTextMask
FitText
Font
LineSpaceScale
MaskColor
MaskColorSource
MaskFrame
MaskOffset
TextGap
TextHeight
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
UseKerning
Top
See Also
Reference
AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations Namespace