Grasshopper API
ModelLinetype Properties
The ModelLinetype type exposes the following members.
Properties
Name | Description
CapStyle
JoinStyle
Name |  (Overrides ModelContent.Name.)
Segments
TaperPoints
Unset
Width
WidthUnits
Top
See Also
Reference
ModelLinetype Class
Grasshopper.Rhinoceros.Drafting Namespace