Grasshopper API
Value Properties
The ObjectDraftingLinetype.Value type exposes the following members.
Properties
Name | Description
ByLayer
ByParent
Continuous
Linetype
Source
Top
See Also
Reference
ObjectDraftingLinetype.Value Structure
Grasshopper.Rhinoceros.Drafting Namespace