Grasshopper API
GH_DigitScrollerEventArgs Properties
The GH_DigitScrollerEventArgs type exposes the following members.
Properties
Name | Description
Intermediate
 Gets a value indicating whether the change was an intermediate one.
Scroller
 Gets the instance of the scroller that raised the event.
Value
 Gets the new value of the slider. This value is cached, so even if the slider subsequently updates, this property remains constant.
Top
See Also
Reference
GH_DigitScrollerEventArgs Class
Grasshopper.GUI.Base Namespace