Grasshopper API
GH_Viewport Properties
The GH_Viewport type exposes the following members.
Properties
Name | Description
ControlMidPoint
 Gets the point in the exact center of the viewport in control coordinates.
Diagonal
 Gets the length of the diagonal of the viewport in canvas coordinates.
Height
 Gets or sets the height of the viewport. Typically this is tied to the dimensions of the canvas. Height is not allowed to go below 5 pixels.
MidPoint
 Gets or sets the canvas coordinate that is directly underneath the center of the viewport.
ScreenPort
 Gets the dimensions of the viewport in control coordinates.
Size
 Gets or sets the size of the viewport. The size is typically tied to the dimensions of the Canvas.
Target
 Gets or sets the location of the target pixel. The target represents where the canvas origin is drawn.
TargetRatio
 Gets or sets the target ratio with respect to the viewport dimensions. This is a useful tool to prevent weird view changes during a canvas resize.
Tx
 Gets or sets the x-component of the target pixel. The target represents where the canvas origin is drawn.
Ty
 Gets or sets the y-component of the target pixel. The target represents where the canvas origin is drawn.
VisibleRegion
 Gets the rectangle in canvas coordinates that is visible in the control.
Width
 Gets or sets the width of the viewport. Typically this is tied to the dimensions of the canvas. Width is not allowed to go below 5 pixels.
Zoom
 Gets or sets the Zoom factor of the viewport. Please assign only sensible values.
Zoom[Boolean]
 Sets the zoom of the viewport with a view anchor.
ZoomInverse
 Gets the inverse of the zoom.
Top
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace