Grasshopper API
Attributes Properties
The ObjectDisplay.Attributes type exposes the following members.
Properties
Name | Description
Color
Mode
WireDensity
Top
See Also
Reference
ObjectDisplay.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace