Grasshopper API
Param_ObjectVisibility Properties
The Param_ObjectVisibility type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectVisibility Class
Grasshopper.Rhinoceros.Display.Params Namespace