Grasshopper API
GH_FieldElement Properties
The GH_FieldElement type exposes the following members.
Properties
Name | Description
BoundingBox
ClippingBox
ElementGuid
IsLimited
Limits
Top
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace