Grasshopper API
Param_ModelRenderSun Properties
The Param_ModelRenderSun type exposes the following members.
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsPreviewCapable
Top
See Also
Reference
Param_ModelRenderSun Class
Grasshopper.Rhinoceros.Render.Params Namespace