Grasshopper API
GH_RotationalTuningData<T> Properties
The GH_RotationalTuningData<T> generic type exposes the following members.
Properties
Name | Description
Frame
 Gets the frame at the given index.
FrameCount
 Gets the total number of recorded frames.
InitialValue
 Gets the initial value.
Pivot
 Gets or sets the rotational pivot. You only need to set this if the pivot changes.
Top
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace