Grasshopper API
Value Properties
The ObjectRenderMaterial.Value type exposes the following members.
Properties
Name | Description
ByLayer
ByParent
Default
Material
Source
Top
See Also
Reference
ObjectRenderMaterial.Value Structure
Grasshopper.Rhinoceros.Render Namespace