Grasshopper API
GH_GeometricGooWrapper Properties
The GH_GeometricGooWrapper type exposes the following members.
Properties
Name | Description
Boundingbox
InternalGoo
IsGeometryLoaded
IsReferencedGeometry
IsValid
IsValidWhyNot
ReferenceID
TypeDescription
TypeName
Top
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace