Grasshopper API
IGH_DocumentObject Properties
The IGH_DocumentObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes that are associated with this object. Only set custom attributes if you know what you are doing.
ComponentGuid
 Returns a consistent ID for this object type. Every object must supply a unique and unchanging ID that is used to identify objects of the same type.
Exposure
 Gets the exposure of this object in the Graphical User Interface.
Icon_24x24
 The icon associated with this object.
Icon_24x24_Locked
 The greyscale icon of this object.
IconDisplayMode
 Gets the current display mode of the object.
Obsolete
 Gets whether this object is Obsolete.
Top
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace