Grasshopper API
GH_IconLabel Properties
The GH_IconLabel type exposes the following members.
Properties
Name | Description
LabelIcon
Top
See Also
Reference
GH_IconLabel Class
Grasshopper.GUI Namespace