Grasshopper API
Param_ModelLineWidth Properties
The Param_ModelLineWidth type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting.Params Namespace