Grasshopper API
GH_SubDProxy Properties
The GH_SubD.GH_SubDProxy type exposes the following members.
Properties
Name | Description
Area
EdgeCount
FaceCount
ObjectID
Solid
VertexCount
Volume
Top
See Also
Reference
GH_SubD.GH_SubDProxy Class
Grasshopper.Kernel.Types Namespace