Grasshopper API
IGH_PreviewData Properties
The IGH_PreviewData type exposes the following members.
Properties
Name | Description
ClippingBox
 Gets the clipping box for this data. The clipping box is typically the same as the boundingbox.
Top
See Also
Reference
IGH_PreviewData Interface
Grasshopper.Kernel Namespace