Grasshopper API
Generic Properties
The Generic type exposes the following members.
Properties
Name | Description
Name
Transform
Top
See Also
Reference
Generic Class
Grasshopper.Kernel.Types.Transforms Namespace