Grasshopper API
GH_Link Properties
The GH_Link type exposes the following members.
Properties
Name | Description
Destination
 Gets the link target.
IsSharedLink
 Gets whether this link is a shared link. A shared link should not have text but it should have a non-empty LinkId.
LinkId
 Gets the link ID. The link ID is only used for shared links.
Target
 Gets the link type.
Text
 Gets the list text.
Tooltip
 Gets the link tooltip text.
Top
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace