Grasshopper API
GH_Material_Proxy Properties
The GH_Material.GH_Material_Proxy type exposes the following members.
Properties
Name | Description
Diffuse
Emission
IsRDKMaterial
Shine
Specular
Transparency
Top
See Also
Reference
GH_Material.GH_Material_Proxy Class
Grasshopper.Kernel.Types Namespace