Grasshopper API
GH_IndexRuleSet Properties
The GH_IndexRuleSet type exposes the following members.
Properties
Name | Description
Count
 Gets the number of rules defined in this collection.
Rule
 Gets the rule at the specified index.
Top
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace