Grasshopper API
ModelTags Properties
The ModelTags type exposes the following members.
Properties
Name | Description
Count
IsDefault
IsDefaultOrEmpty
IsEmpty
Top
See Also
Reference
ModelTags Structure
Grasshopper.Rhinoceros Namespace