Grasshopper API
ITransform Properties
The ITransform type exposes the following members.
Properties
Name | Description
Name
Top
See Also
Reference
ITransform Interface
Grasshopper.Kernel.Types.Transforms Namespace