Grasshopper API
IGH_ContextualComponent Properties
The IGH_ContextualComponent type exposes the following members.
Properties
Name | Description
Archive
 Gets instance of embedded Grasshopper GH_Archive
Top
See Also
Reference
IGH_ContextualComponent Interface
Grasshopper.Kernel Namespace