Grasshopper API
AnnotationToleranceSettings Properties
The AnnotationToleranceSettings type exposes the following members.
Properties
Name | Description
AlternateToleranceResolution
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
Top
See Also
Reference
AnnotationToleranceSettings Class
Grasshopper.Rhinoceros.Annotations Namespace