Grasshopper API
IGH_UndoAction Properties
The IGH_UndoAction type exposes the following members.
Properties
Name | Description
ExpiresDisplay
 Gets the display expiration flag for this event. If True, the Rhino viewports will be redrawn once the entire undo record has been completed. If ExpiresSolution is set to true, ExpriresDisplay is implied.
ExpiresSolution
 Gets the solution expiration flag for this event. If True, the solution needs to be recalculated once the entire undo record has been completed.
State
 Gets the current state of the undo action.
Top
See Also
Reference
IGH_UndoAction Interface
Grasshopper.Kernel.Undo Namespace