Grasshopper API
Param_ModelRenderTexture Properties
The Param_ModelRenderTexture type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelRenderTexture Class
Grasshopper.Rhinoceros.Render.Params Namespace