Grasshopper API
GH_Path Properties
The GH_Path type exposes the following members.
Properties
Name | Description
Indices
 Gets or sets the entire index space; the path that identifies an element in structure space. You should not change the index space when the path is used inside a structure since it will invalidate the sort order. If you don't know what you're doing, for Pete's sake don't touch this.
Length
 Returns the number of dimensions in the path.
Valid
 Gets whether this path is valid. Invalid paths either have no elements or negative elements.
Top
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace