Grasshopper API
GH_PreviewBoundary Properties
The GH_PreviewBoundary type exposes the following members.
Properties
Name | Description
Boundary
 Gets the boundary region.
Limits
 Gets the limits of the boundary.
Points
 Gets the array of points this boundary was made from.
Top
See Also
Reference
GH_PreviewBoundary Class
Grasshopper.Kernel Namespace