Grasshopper API
GH_BakeUtility Properties
The GH_BakeUtility type exposes the following members.
Properties
Name | Description
BakedCount
 Gets the number of successful baking operations.
BakedIds
 Gets all collected object ids.
InvalidCount
 Gets the number of invalid objects encountered.
Top
See Also
Reference
GH_BakeUtility Class
Grasshopper.Kernel Namespace