Grasshopper API
GH_TextDotProxy Properties
The GH_TextDot.GH_TextDotProxy type exposes the following members.
Properties
Name | Description
ObjectID
Point
SecondaryText
Text
Top
See Also
Reference
GH_TextDot.GH_TextDotProxy Class
Grasshopper.Kernel.Types Namespace