Grasshopper API
GH_TaskCapableComponent<T> Properties
The GH_TaskCapableComponent<T> generic type exposes the following members.
Properties
Name | Description
CancelToken
InPreSolve
 Is set to True by the framework right before a "use tasks" pass is made on SolveIntance calls. When True, SolveInstance should be using Tasks to start calculations on input data. When False, SolveInstance should be setting the output data by either using the result of a task or directly computing the results.
InstanceDescription |  (Overrides GH_Component.InstanceDescription.)
TaskList
UseTasks
 Returns True if the component is set to support tasks. Components can have this feature turned on/off. Note that even if UseTasks returns True, there is a chance that a multipass task based solution may not be invoked depending on if multiple calls need to be made during enumeration. You must pay attention to the value of InPreSolve during SolveInstance. The set version of this property can be called by the framework if we want to provide a technique to globally turn on/off task support for all components in a definition.
Top
See Also
Reference
GH_TaskCapableComponent<T> Class
Grasshopper.Kernel Namespace