Grasshopper API
Param_EarthAnchorPoint Properties
The Param_EarthAnchorPoint type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_EarthAnchorPoint Class
Grasshopper.Rhinoceros.Model.Params Namespace