Grasshopper API
Param_ObjectSectionStyle Properties
The Param_ObjectSectionStyle type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting.Params Namespace