Grasshopper API
IGH_ActiveObject Properties
The IGH_ActiveObject type exposes the following members.
Properties
Name | Description
IsDataProvider
 Gets whether or not this object is capable of emitting data.
Locked
 Gets or sets the locked flag of this object. Locked objects are ignored during solutions.
MutableNickName
 Gets or sets a value that enables Nick name changes through the menu. The default is TRUE.
Phase
 Gets the solution phase in which this object is currently stuck.
ProcessorTime
 Gets the most recent measured processor time.
RuntimeMessageLevel
 Gets the worst-case level of all messages. I.e. if only warnings have been recorded, the level will be ::warning. If even a single error exists, the level will be ::error.
Top
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace