Grasshopper API
IGH_BakeAwareObject Properties
The IGH_BakeAwareObject type exposes the following members.
Properties
Name | Description
IsBakeCapable
 Gets a value indicating whether or not the object can potentially Bake data in its current state.
Top
See Also
Reference
IGH_BakeAwareObject Interface
Grasshopper.Kernel Namespace