Grasshopper API
IGH_FieldElement Properties
The IGH_FieldElement type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the visual boundingbox of all the geometry used to represent this element in 3D.
ElementGuid
 Gets the element Guid for this element.
IsLimited
 Gets or sets whether this element affects a limited region.
Limits
 Gets or sets the limits of this region. Unless IsLimited equals true, the Limits property is ignored.
Top
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace