Grasshopper API
IGH_DataAccess Properties
The IGH_DataAccess type exposes the following members.
Properties
Name | Description
Iteration
 Gets the current iteration count. The first time the SolveInstance() function is called on a component during a solution the Iteration counter will be zero. It will be incremented by one for every subsequent call.
Top
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace