Grasshopper API
GH_HorizontalSeparator Properties
The GH_HorizontalSeparator type exposes the following members.
Properties
Name | Description
DisplayMode
 Gets or sets the separator display mode.
Top
See Also
Reference
GH_HorizontalSeparator Class
Grasshopper.GUI Namespace