Grasshopper API
GH_PersistentDataAction<T> Properties
The GH_PersistentDataAction<T> generic type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_PersistentDataAction<T> Class
Grasshopper.Kernel.Undo.Actions Namespace