Grasshopper API
GH_ColourPicker Properties
The GH_ColourPicker type exposes the following members.
Properties
Name | Description
AllowNumericInput
 Gets or sets whether this colour picker pops up a textbox on channel slider double clicks.
Colour
 Gets or sets the colour currently specified in the picker.
DesiredHeight
 Gets the ideal height for this control given the current width and UI settings.
ShowAlphaSlider
 Gets or sets whether the alpha channel slider is included.
ShowChannelSliders
 Gets or sets whether the channel sliders are included.
Top
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace