Grasshopper API
Param_ClippingDrawingSettings Properties
The Param_ClippingDrawingSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting.Params Namespace