Grasshopper API
GH_Component Properties
The GH_Component type exposes the following members.
Properties
Name | Description
ClippingBox
 Gets the clipping box for all preview geometry drawn by this component and all associated parameters.
HelpDescription
 Override this method if you want the help topic content to be more than the Component description.
Hidden
 Gets or sets the hidden flag for this component. Does not affect Hidden flags on parameters associated with this component.
InConstructor
 Gets the constructor flag for this instance. If InConstructor = True, it means the component is still registering parameters and the layout is not yet complete.
InstanceDescription |  (Overrides GH_InstanceDescription.InstanceDescription.)
IsBakeCapable
IsDataProvider
 Components are never Data providers. Only the output parameters can be considered to be providers.
 (Overrides GH_ActiveObject.IsDataProvider.)
IsPreviewCapable
 If a single parameter is PreviewCapable, so is the component. Override this property if you need special Preview flags.
IsValidPrincipalParameterIndex
 Gets whether the MasterParameterIndex property identifies a valid parameter.
Locked
 Gets or sets the Locked state for this Component. This also sets locked states for all input and output parameters.
 (Overrides GH_ActiveObject.Locked.)
Message
 Gets or sets a custom message to be displayed underneath the component. This message is not serialized and should be assigned on every solution anew.
Params
 Gets the parameter manager object for this component.
PrincipalParameterIndex
 Gets or sets the principal parameter index override. Negative indices or indices larger than or equal to the input parameter count will be ignored and regular principal parameter detection will kick in.
ProcessorTime
 Gets the total processor time (profiler) spend by this component and all input parameters.
 (Overrides GH_ActiveObject.ProcessorTime.)
RunCount
 Gets a value indicating how many times the SolveInstance method was called on this component during the last solution. This property will return -1 if no valid runcount is available.
RuntimeMessageLevel
 Returns the worst case runtime warning level of me and all my parameters
 (Overrides GH_ActiveObject.RuntimeMessageLevel.)
Top
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace