Grasshopper API
GH_TagArtist_WirePainter Properties
The GH_TagArtist_WirePainter type exposes the following members.
Properties
Name | Description
WirePainter_ID
Top
See Also
Reference
GH_TagArtist_WirePainter Class
Grasshopper.GUI.Canvas.TagArtists Namespace