Grasshopper API
GH_FormShepard Properties
The GH_FormShepard type exposes the following members.
Properties
Name | Description
Sheep
Top
See Also
Reference
GH_FormShepard Class
Grasshopper.GUI Namespace