Grasshopper API
Attributes Properties
The AnnotationArrowSettings.Attributes type exposes the following members.
Properties
Name | Description
Arrow1
Arrow2
ArrowSize
ClippingArrow1
ClippingArrow2
ClippingArrowSize
DimensionInline
FitArrow
LeaderArrow
LeaderArrowSize
Top
See Also
Reference
AnnotationArrowSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace