Grasshopper API
GH_OutputParamManager Properties
The GH_Component.GH_OutputParamManager type exposes the following members.
Properties
Name | Description
Param
 Gets the output parameter at the given index.
 (Overrides GH_ParamManager.Param.)
ParamCount
 Returns the number of output parameters already part of this component.
 (Overrides GH_ParamManager.ParamCount.)
Top
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace