Grasshopper API
GH_Dimension Properties
The GH_Dimension type exposes the following members.
Properties
Name | Description
Value
ValueType |  (Overrides GH_AnnotationBase.ValueType.)
Top
See Also
Reference
GH_Dimension Class
Grasshopper.Kernel.Types Namespace