Grasshopper API
GH_PreviewMeshArgs Properties
The GH_PreviewMeshArgs type exposes the following members.
Properties
Name | Description
Material
 Gets the material in which meshes ought to be drawn.
MeshingParameters
 Gets the meshing parameters which ought to be used for meshing breps and surfaces. If this property returns a null reference, meshes are supposed to be omitted.
Pipeline
 Gets the Display Pipeline we're currently drawing with.
Viewport
 Gets the Viewport in which we're currently drawing.
Top
See Also
Reference
GH_PreviewMeshArgs Class
Grasshopper.Kernel Namespace