Grasshopper API
GH_Circle Properties
The GH_Circle type exposes the following members.
Properties
Name | Description
Boundingbox
 Gets the boundingbox for this geometry.
 (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsValid
 Gets the validity of this instance. Circles are valid when their base planes are valid and when the radius is larger than zero.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Circle Class
Grasshopper.Kernel.Types Namespace