Grasshopper API
GH_Item Properties
The GH_Item type exposes the following members.
Properties
Name | Description
_bool
 Returns the internal data of this item cast to a Boolean. If the data is not stored as a Boolean, a conversion exception might be thrown.
_boundingbox
 Returns the internal data of this item cast to a BoundingBox. If the data is not stored as a BoundingBox, a conversion exception might be thrown.
_byte
 Returns the internal data of this item cast to a Byte. If the data is not stored as a Byte, a conversion exception might be thrown.
_bytearray
 Returns the internal data of this item cast to a Byte array. If the data is not stored as a Byte array, a conversion exception might be thrown.
_date
 Returns the internal data of this item cast to a DateTime. If the data is not stored as a DateTime, a conversion exception might be thrown.
_decimal
 Returns the internal data of this item cast to a Decimal. If the data is not stored as a Decimal, a conversion exception might be thrown.
_double
 Returns the internal data of this item cast to a Double. If the data is not stored as a Double, a conversion exception might be thrown.
_doublearray
 Returns the internal data of this item cast to a Byte array. If the data is not stored as a Byte array, a conversion exception might be thrown.
_drawing_bitmap
 Returns the internal data of this item cast to a Bitmap. If the data is not stored as a Bitmap, a conversion exception might be thrown.
_drawing_color
 Returns the internal data of this item cast to a Color. If the data is not stored as a Color, a conversion exception might be thrown.
_drawing_point
 Returns the internal data of this item cast to a Point. If the data is not stored as a Point, a conversion exception might be thrown.
_drawing_pointf
 Returns the internal data of this item cast to a PointF. If the data is not stored as a PointF, a conversion exception might be thrown.
_drawing_rectangle
 Returns the internal data of this item cast to a Rectangle. If the data is not stored as a Rectangle, a conversion exception might be thrown.
_drawing_rectanglef
 Returns the internal data of this item cast to a RectangleF. If the data is not stored as a RectangleF, a conversion exception might be thrown.
_drawing_size
 Returns the internal data of this item cast to a Size. If the data is not stored as a Size, a conversion exception might be thrown.
_drawing_sizef
 Returns the internal data of this item cast to a SizeF. If the data is not stored as a SizeF, a conversion exception might be thrown.
_guid
 Returns the internal data of this item cast to a Guid. If the data is not stored as a Guid, a conversion exception might be thrown.
_int32
 Returns the internal data of this item cast to an Int32. If the data is not stored as an Int32, a conversion exception might be thrown.
_int64
 Returns the internal data of this item cast to an Int64. If the data is not stored as an Int64, a conversion exception might be thrown.
_interval1d
 Returns the internal data of this item cast to an Interval1D. If the data is not stored as an Interval1D, a conversion exception might be thrown.
_interval2d
 Returns the internal data of this item cast to an Interval2D. If the data is not stored as an Interval2D, a conversion exception might be thrown.
_line
 Returns the internal data of this item cast to a Line. If the data is not stored as a Line, a conversion exception might be thrown.
_plane
 Returns the internal data of this item cast to a Plane. If the data is not stored as a Plane, a conversion exception might be thrown.
_point2d
 Returns the internal data of this item cast to a Point2D. If the data is not stored as a Point2D, a conversion exception might be thrown.
_point3d
 Returns the internal data of this item cast to a Point3D. If the data is not stored as a Point3D, a conversion exception might be thrown.
_point4d
 Returns the internal data of this item cast to a Point4D. If the data is not stored as a Point4D, a conversion exception might be thrown.
_single
 Returns the internal data of this item cast to a Single. If the data is not stored as a Single, a conversion exception might be thrown.
_string
 Returns the internal data of this item cast to a String. If the data is not stored as a String, a conversion exception might be thrown.
_version
 Returns the internal data of this item cast to a Version. If the data is not stored as a Version, a conversion exception might be thrown.
HasIndex
 Gets the index existence implication. The item is considered to have an index qualifier if the index value is larger than or equal to zero.
HasName
 Gets the name validity of this item. The item is considered to have an invalid name if string.IsNullOrEmpty(name)
HasType
 Gets the type set validity of this item. The item is considered to have a type if type != GH_Types.unset
Index
 Gets or sets the index of an item. Typically, indices are set at construction and do not change. If you change indices after construction, you could corrupt an archive.
InternalData
 Retrieves the internal data of this item. No type casting is performed.
Name
 Gets or sets the name of this item. Typically, names are set at construction and do not change. If you change names after construction, you could corrupt an archive.
Type
 Gets the type of this item. Type flags are set during construction and cannot be altered.
Top
See Also
Reference
GH_Item Class
GH_IO.Types Namespace