Grasshopper API
GH_UndoServer Properties
The GH_UndoServer type exposes the following members.
Properties
Name | Description
FirstRedoName
 Gets the name of the last item in the redo stack (the first item to be redone).
FirstUndoName
 Gets the name of the last item in the undo stack (the first item to be undone).
MaxRecords
 Gets or sets the maximum number of undo records that can be stored.
RedoCount
 Number of redo records currently in the stack.
RedoGuids
 Gets a sorted list of all the redo Guids in this server.
RedoNames
 Gets a sorted list of all the redo Guids in this server.
UndoCount
 Number of undo records currently in the stack.
UndoGuids
 Gets a sorted list of all the undo Guids in this server.
UndoNames
 Gets a sorted list of all the undo Guids in this server.
Top
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace