Grasshopper API
ModelContentParam<T> Properties
The ModelContentParam<T> generic type exposes the following members.
Properties
Name | Description
IsBakeCapable
StateTags |  (Overrides GH_Param<T>.StateTags.)
Top
See Also
Reference
ModelContentParam<T> Class
Grasshopper.Rhinoceros.Params Namespace