Grasshopper API
Param_ObjectDisplay Properties
The Param_ObjectDisplay type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectDisplay Class
Grasshopper.Rhinoceros.Display.Params Namespace