Grasshopper API
IGH_PreviewObject Properties
The IGH_PreviewObject type exposes the following members.
Properties
Name | Description
ClippingBox
 Gets the clipping box for this object. The clipping box is typically the union of the boundingboxes of all the geometry that is drawn by this object.
Hidden
 Gets or sets a value indicating whether or not this object is currently drawing preview flags.
IsPreviewCapable
 Gets a value indicating whether or not this object (in its current state) can draw geometric previews at all.
Top
See Also
Reference
IGH_PreviewObject Interface
Grasshopper.Kernel Namespace