Grasshopper API
IGH_Component Properties
The IGH_Component type exposes the following members.
Properties
Name | Description
InConstructor
 Gets the constructor flag for this instance. If InConstructor = True, it means the component is still registering parameters and the layout is not yet complete.
IsValidMasterParameterIndex
 Gets whether the MasterParameterIndex property identifies a valid parameter.
MasterParameterIndex
 Gets or sets the master parameter index override. Negative indices or indices larger than or equal to the input parameter count will be ignored and regular master parameter detection will kick in.
Message
 Gets or sets a custom message to be displayed underneath the component.
Params
 Gets the Params object that managed input and output parameters.
RunCount
 Gets a value indicating how many times the SolveInstance method was called on this component during the last solution. This property will return -1 if no valid runcount is available.
Top
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace