Grasshopper API
GH_NamedView Properties
The GH_NamedView type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the name of the view.
Point
 Gets or sets the anchor point of the named view.
Type
 Gets or sets a value indicating whether the anchor point represents the target or the center.
Zoom
 Gets or sets the zoom factor of the named view.
Top
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace