Grasshopper API
GH_RuleComplex Properties
The GH_RuleComplex type exposes the following members.
Properties
Name | Description
Kind
Notation
Top
See Also
Reference
GH_RuleComplex Class
Grasshopper.Kernel.Data Namespace