Grasshopper API
GH_MeshFace Properties
The GH_MeshFace type exposes the following members.
Properties
Name | Description
IsValid
 Test for validity. No negative indices are allowed and only C and D are allowed to be identical.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_MeshFace Class
Grasshopper.Kernel.Types Namespace