Grasshopper API
GH_DataMatchingAction Properties
The GH_DataMatchingAction type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_DataMatchingAction Class
Grasshopper.Kernel.Undo.Actions Namespace