Grasshopper API
GH_WireSettings Properties
The GH_WireSettings type exposes the following members.
Properties
Name | Description
DefaultColour
 Gets or sets the colour to use for standard wires.
EmptyColour
 Gets or sets the colour to use for empty wires.
SelectedColour0
 Gets or sets the colour of a wire at the selected extreme.
SelectedColour1
 Gets or sets the colour of a wire at the unselected extreme.
Top
See Also
Reference
GH_WireSettings Class
Grasshopper.GUI.Theme Namespace