Grasshopper API
ID Properties
The ID type exposes the following members.
Properties
Name | Description
Hash
 Gets the hash code.
HasIndex
 Gets whether the index has been set.
HasName
 Gets whether the name has been set. Every valid ID must have a name.
Index
 Gets the index of this ID, if there is no valid index then -1 is returned.
Name
 Gets the name of this ID.
Top
See Also
Reference
ID Structure
GH_IO.Serialization Namespace