Grasshopper API
Value Properties
The ItemDisplayColor.Value type exposes the following members.
Properties
Name | Description
ByLayer
ByObject
ByParent
Color
Source
Top
See Also
Reference
ItemDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace