Grasshopper API
ObjectDisplay Properties
The ObjectDisplay type exposes the following members.
Properties
Name | Description
Color
WireDensity
Top
See Also
Reference
ObjectDisplay Class
Grasshopper.Rhinoceros.Display Namespace