Grasshopper API
GH_DocModifiedEventArgs Properties
The GH_DocModifiedEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Modified
 Gets the value of the document Modified flag at the time the event was raised, it may have been changed in between by other event handlers.
Top
See Also
Reference
GH_DocModifiedEventArgs Class
Grasshopper.Kernel Namespace