Grasshopper API
Param_AnnotationLeaderSettings Properties
The Param_AnnotationLeaderSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationLeaderSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace