Grasshopper API
GH_GradientChangedEventArgs Properties
The GH_GradientChangedEventArgs type exposes the following members.
Properties
Name | Description
Gradient
 Gets the gradient that raised this event.
Intermediate
 Gets whether this event is intermediate. I.e. whether it will be followed by another, similar event.
Top
See Also
Reference
GH_GradientChangedEventArgs Class
Grasshopper.GUI.Gradient Namespace