Grasshopper API
GH_IndexRange Properties
The GH_IndexRange type exposes the following members.
Properties
Name | Description
Index0
 Gets the first index in the range.
Index1
 Gets the last index in the range.
InvalidRange
 Gets the predefined invalid range.
IsSingular
 Gets whether the range has zero length.
IsValid
 Gets whether this range is valid.
Length
 Gets the length of the range.
MaxValue
Top
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace