Grasshopper API
GH_FontList Properties
The GH_FontList type exposes the following members.
Properties
Name | Description
DisplayText
 Gets or sets the placeholder string.
Filter
 Gets or sets the filter string. You must call RecreateFontList() before the new font list is created.
FontFamily
 Gets or sets the selected font family.
FontSize
 Gets or sets the font size.
FontStyle
 Gets or sets the font style for all families.
Top
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace