Grasshopper API
Instances Properties
The Instances type exposes the following members.
Properties
Name | Description
ActiveCanvas
 Gets the currently active Grasshopper canvas (if any)
ActiveDocument
ActiveRhinoDoc
AutoHideBanner
 Gets or sets a value indicating whether the banner ought to be hidden automatically when loading completes.
AutoShowBanner
 Gets or sets a value indicating whether or not the banner will be displayed during the ComponentServer Loading process.
ComponentServer
 Gets the ComponentServer instance cached by the Instance Server. The ComponentServer will be instantiated the first time this property accessed. This is a rather involved process during which the Grasshopper Banner will be displayed.
CursorServer
 Gets the CursorServer instance cached by the Instance Server. The CursorServer will be instantiated the first time this property is accessed.
DocumentAssociationServer
 Gets the Document Association Server instance cached by the Instance Server. The Document Association Server will be instantiated the first time this property accessed.
DocumentEditor
 Gets the DocumentEditor of Grasshopper.
DocumentServer
 Gets the DocumentServer instance cached by the Instance Server. The DocumentServer will be instantiated the first time this property accessed.
EtoDocumentEditor
GrasshopperPluginId
 Gets the ID of the Grasshopper Plugin.
IsComponentServer
 Gets whether the Component server has been set.
IsCursorServer
 Gets whether the Cursor server has been set.
IsDocumentAssociationServer
 Gets whether the Document Association server has been set.
IsDocumentEditor
 Gets whether the Document Editor has been set.
IsDocumentEditorOnTopOfViewports
 Gets whether the Grasshopper document editor (or any of its child forms) is obscuring a significant part of the Rhino viewports.
IsDocumentServer
 Gets whether the Document server has been set.
IsMarkovChain
 Gets a value indicating whether or not the MarkovChain has already been initialized.
IsMruServer
 Gets a value indicating whether or not the MRU server has been initialized.
IsRemotePanelVisible
 Gets whether the Remote Control Panel is currently visible.
MarkovChain
 Gets the MarkovChain instance cached by the Instance Server. The Markov chain will be instantiated if it hasn't been already.
MruServer
 Gets the MRU_Server instance cached by the Instance Server. The MRU_Server will be instantiated the first time this property accessed.
RcpPanel
 Gets the active document RCP panel instance.
RunningHeadless
Settings
 Represents the default settings database. Feel free to add your own settings to this database.
Top
See Also
Reference
Instances Class
Grasshopper Namespace