Grasshopper API
GH_Point Properties
The GH_Point type exposes the following members.
Properties
Name | Description
Boundingbox
ClippingBox
IsGeometryLoaded
IsReferencedGeometry
IsValid
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
ReferenceData
 Gets or sets the reference data of this point geometry.
ReferenceID
TypeDescription
TypeName
Value
Top
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace