Grasshopper API
GH_Capsule Properties
The GH_Capsule type exposes the following members.
Properties
Name | Description
Box
 Gets the outline box for this Capsule.
Box_Content
 Gets the content box for this Capsule. Text and icons are drawn inside this box.
Font
 Gets or sets the Font to use for text rendering.
Highlight
 Gets the highlight size for this Capsule. Zero or negative means there is no highlight.
HighlightShape
 Gets the graphics path that describes the highlight bar shape of the capsule.
InputGrips
 Gets the list of locally defined input grip locations.
JaggedLeft
 Gets whether the left edge of this capsule is jagged.
JaggedRight
 Gets whether the right edge of this capsule is jagged.
MaxRadius
 Gets the largest radius defined for this capsule.
OutlineShape
 Gets the graphics path that describes the outer edge of the capsule.
OutputGrips
 Gets the list of locally defined output grip locations.
Palette
 Gets or sets the palette for this Capsule.
Radius
 Gets the radius of the rounded corners of this Capsule.
RenderEngine
 Gets the RenderEngine associated with this capsule. You typically don't need to go this far, just use one of the Render() overloads on GH_Capsule directly.
Text
 Gets or sets the text to render in the content box.
TextOrientation
 Gets or sets the orientation of the text within the content box.
Top
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace