Grasshopper API
ModelUserText Properties
The ModelUserText type exposes the following members.
Properties
Name | Description
Count
IsDefault
IsDefaultOrEmpty
IsEmpty
Item[Int32]
Item[String]
Keys
Values
Top
See Also
Reference
ModelUserText Structure
Grasshopper.Rhinoceros Namespace