Grasshopper API
Attributes Properties
The ModelTextureMapping.Attributes type exposes the following members.
Properties
Name | Description
Capped
Channel
Geometry
LocalTransform
MappingType
Projection
TextureSpace
UVWOffset
UVWRepeat
UVWRotation
XYZOffset
XYZRotation
XYZSize
Top
See Also
Reference
ModelTextureMapping.Attributes Class
Grasshopper.Rhinoceros.Render Namespace