Grasshopper API
GH_DataModificationAction Properties
The GH_DataModificationAction type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_DataModificationAction Class
Grasshopper.Kernel.Undo.Actions Namespace