Grasshopper API
GH_PointProxy Properties
The GH_Point.GH_PointProxy type exposes the following members.
Properties
Name | Description
Distance
Referenced
ReferenceID
ReferenceType
TParameterRatio
UVParameterRatio
X
Y
Z
Top
See Also
Reference
GH_Point.GH_PointProxy Class
Grasshopper.Kernel.Types Namespace