Grasshopper API
Index3d<T> Properties
The Index3d<T> generic type exposes the following members.
Properties
Name | Description
GlobalIndex
 Gets the item index within the tree global list.
Item
 Gets the actual item.
LocalIndex
 Gets the index within the node index list.
Node
 Gets the node of the tree in which this element is stored.
Top
See Also
Reference
Index3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace