Grasshopper API
Attributes Properties
The ModelEarthAnchorPoint.Attributes type exposes the following members.
Properties
Name | Description
Elevation
ElevationCoordinateSystem
Latitude
Longitude
ModelCompass
Top
See Also
Reference
ModelEarthAnchorPoint.Attributes Class
Grasshopper.Rhinoceros.Model Namespace