Grasshopper API
Attributes Properties
The ModelPageViewport.Attributes type exposes the following members.
Properties
Name | Description
PageNumber
PageSettings
Top
See Also
Reference
ModelPageViewport.Attributes Class
Grasshopper.Rhinoceros.Display Namespace