Grasshopper API
GH_CanvasValidator Properties
The GH_CanvasValidator type exposes the following members.
Properties
Name | Description
Canvas
 Gets the canvas this validator is associated with.
Document
 Gets the document (if it exists) that is currently loaded in the canvas.
Top
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace