Grasshopper API
Attributes Properties
The ModelAnnotationStyle.Attributes type exposes the following members.
Properties
Name | Description
ArrowSettings
DimensionScale
DimensionSettings
LeaderSettings
TextSettings
ToleranceSettings
UnitsSettings
Top
See Also
Reference
ModelAnnotationStyle.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace