Grasshopper API
Attributes Properties
The ModelLayer.Attributes type exposes the following members.
Properties
Name | Description
DisplayColor
DraftingColor
Hidden
HiddenOnModel
HiddenOnNewDetail
Linetype
LineWeight
Locked
Material
Top
See Also
Reference
ModelLayer.Attributes Class
Grasshopper.Rhinoceros.Model Namespace