Grasshopper API
GH_Animator<T> Properties
The GH_Animator<T> generic type exposes the following members.
Properties
Name | Description
Interpolation
 Gets or sets the interpolation mode. Changing the mode during an animation will result in discontinuous motion.
Phase
 Gets the current animation phase.
ValueA
 Gets or sets the start value of the animation. This value is set from within the constructor though you can change it at any time.
ValueB
 Gets or sets the end value of the animation. This value is set from within the constructor though you can change it at any time.
Top
See Also
Reference
GH_Animator<T> Class
Grasshopper.GUI Namespace