Grasshopper API
Param_ModelMeshingParameters Properties
The Param_ModelMeshingParameters type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelMeshingParameters Class
Grasshopper.Rhinoceros.Params Namespace