Grasshopper API
Attributes Properties
The ModelObject.Attributes type exposes the following members.
Properties
Name | Description
Display
Drafting
Frame
Layer
Render
SectionStyle
Url
Visibility
Top
See Also
Reference
ModelObject.Attributes Class
Grasshopper.Rhinoceros.Model Namespace