Grasshopper API
Value Properties
The ObjectDisplayColor.Value type exposes the following members.
Properties
Name | Description
ByLayer
ByMaterial
ByParent
Color
Source
Top
See Also
Reference
ObjectDisplayColor.Value Structure
Grasshopper.Rhinoceros.Display Namespace