Grasshopper API
Attributes Properties
The ObjectVisibility.Attributes type exposes the following members.
Properties
Name | Description
Hidden
Locked
Viewport
Top
See Also
Reference
ObjectVisibility.Attributes Structure
Grasshopper.Rhinoceros.Display Namespace