Grasshopper API
GH_Author Properties
The GH_Author type exposes the following members.
Properties
Name | Description
Address
Company
Copyright
EMail
IsEmpty
 Gets whether any of the fields have been assigned.
Name
Phone
Website
Top
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace