Grasshopper API
GH_DocumentIO Properties
The GH_DocumentIO type exposes the following members.
Properties
Name | Description
DisableOverwriteProtection
 Gets or sets whether the file overwrite protection dialog ought to be shown during risky saves.
Document
 Gets or sets the internal document.
IsDocument
 Gets a value indicating whether or not this instance of GH_DocumentIO contains an internal document.
LocalClipboardContent
 Gets the contents of the local clipboard.
Top
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace