Grasshopper API
Attributes Properties
The ObjectRender.Attributes type exposes the following members.
Properties
Name | Description
CastsShadows
Material
MeshingParameters
ReceivesShadows
TextureMappings
Top
See Also
Reference
ObjectRender.Attributes Structure
Grasshopper.Rhinoceros.Render Namespace