Grasshopper API
ModelConstructionPlane Properties
The ModelConstructionPlane type exposes the following members.
Properties
Name | Description
GridSpacing
IsReferencedGeometry
IsValid
LineCount
Plane
ReferenceID
SnapSpacing
ThickLineFrequency
Title
Top
See Also
Reference
ModelConstructionPlane Class
Grasshopper.Rhinoceros.Display Namespace