Grasshopper API
GH_AngularDimension Properties
The GH_AngularDimension type exposes the following members.
Properties
Name | Description
Arc
DimlinePoint
Line1
Line2
Offset
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
See Also
Reference
GH_AngularDimension Class
Grasshopper.Kernel.Types Namespace