Grasshopper API
GH_ColourPickerBase Properties
The GH_ColourPickerBase type exposes the following members.
Properties
Name | Description
AutoSize
 Gets or sets a value indicating whether the width and height of the Bounds are adjusted to fit the UI.
BackColour
 Gets or sets the background colour of the picker.
BaseColour
 Gets the original base colour for this picker. Use SetupColourPicker to assign this colour.
Bounds
 Gets or sets the Bounds for this control.
ColourSpace
 Gets the Colour space mode used in this picker.
DesiredHeight
 Gets the ideal height for this colour picker given it's width and UI settings.
DrawAlphaSlider
 Gets or sets whether or not the alpha slider is included in the UI.
DrawBackground
 Gets or sets whether the background of the picker is drawn.
DrawChannelSliders
 Gets or sets whether or not the three basic channel sliders are included in the UI.
DropperPreviewBox
 Gets the rectangle in which the eye-dropped preview will be drawn.
Font
 Gets or sets the Font used in this Colour Picker. Do not Dispose the Font returned by this property.
IsTextInput
 Gets whether any of the slider is currently displaying a text input box.
Padding
 Gets or sets the Padding for this control.
PickColour
 Gets the picked colour.
SRCSpaceBox
 Gets the rectangle containing the eye-dropper function.
Top
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace