Grasshopper API
IGH_Author Properties
The IGH_Author type exposes the following members.
Properties
Name | Description
Address
 Gets the address of the author.
Company
 Gets the Company name of the author.
Copyright
 Gets the copyright message for these details.
Email
 Gets the email of the author.
IsEmpty
 Gets whether any data has been assigned to this object.
Name
 Gets the name of the author.
Phone
 Gets the phone number of the author.
Website
 Gets the website of the author.
Top
See Also
Reference
IGH_Author Interface
Grasshopper.Kernel Namespace