Grasshopper API
ModelUnitSystem Properties
The ModelUnitSystem type exposes the following members.
Properties
Name | Description
ActiveSpace
BaseSystem
Factor
IsValid |  (Overrides ModelValue.IsValid.)
MetersPerUnit
Name
Top
See Also
Reference
ModelUnitSystem Class
Grasshopper.Rhinoceros Namespace