Grasshopper API
Attributes Properties
The ModelHatchLine.Attributes type exposes the following members.
Properties
Name | Description
Angle
Base
Offset
Segments
Top
See Also
Reference
ModelHatchLine.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace