Grasshopper API
GH_ParamServerEventArgs Properties
The GH_ParamServerEventArgs type exposes the following members.
Properties
Name | Description
OriginalArguments
 Gets access to the original parameter event arguments.
Parameter
 Gets the parameter that caused the original event.
ParameterIndex
 Gets the index of the parameter that caused the original event.
ParameterSide
 Gets the side of the parameter that caused the original event.
Server
 Gets the GH_ComponentParamServer object that raised the event.
Top
See Also
Reference
GH_ParamServerEventArgs Class
Grasshopper.Kernel Namespace