Grasshopper API
GH_DocEnabledEventArgs Properties
The GH_DocEnabledEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Enabled
 Gets the value of the document Enabled flag at the time the event was raised, it may have been changed in between by other event handlers.
Top
See Also
Reference
GH_DocEnabledEventArgs Class
Grasshopper.Kernel Namespace