Grasshopper API
GH_AnnotationBaseProxy<T> Properties
The GH_AnnotationBase.GH_AnnotationBaseProxy<T> generic type exposes the following members.
Properties
Name | Description
AnnotationStyle
AnnotationType
ObjectID
PlainText
Top
See Also
Reference
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Grasshopper.Kernel.Types Namespace