Grasshopper API
Param_ModelTextureSlot Properties
The Param_ModelTextureSlot type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
See Also
Reference
Param_ModelTextureSlot Class
Grasshopper.Rhinoceros.Render.Params Namespace