Grasshopper API
GH_Hatch Properties
The GH_Hatch type exposes the following members.
Properties
Name | Description
BackgroundColor
BackgroundPlotColor
BoundaryColor
BoundaryColorSource
BoundaryPlotColor
BoundaryPlotColorSource
BoundaryPlotWeightMillimeters
BoundaryVisible
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this hatch object. The hatch is considered to be loaded when the local hatch instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this hatch. If the hatch is referenced but cannot be loaded, the hatch is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
Pattern
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
See Also
Reference
GH_Hatch Class
Grasshopper.Kernel.Types Namespace