Grasshopper API
ViewportItem Properties
The Param_ModelSpaceViewport.ViewportItem type exposes the following members.
Properties
Name | Description
DescriptiveName
Top
See Also
Reference
Param_ModelSpaceViewport.ViewportItem Structure
Grasshopper.Rhinoceros.Display.Params Namespace