Grasshopper API
GH_Time Properties
The GH_Time type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Datetime is valid if it's not equal to DateTime.MaxValue
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Time Class
Grasshopper.Kernel.Types Namespace