Grasshopper API
Param_AnnotationTextSettings Properties
The Param_AnnotationTextSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationTextSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace