Grasshopper API
GH_FadeAnimation Properties
The GH_FadeAnimation type exposes the following members.
Properties
Name | Description
Duration
 Gets or sets the duration (in milliseconds) for ZUI animations. Negative durations are not allowed. The default is 350 milliseconds.
FadeAlpha
 Gets the blend alpha byte for the current state. 0 means fully hidden, 255 means fully shown.
FadeFactor
 Gets the blend factor for the current state. 0.0 means fully hidden, 1.0 means fully shown.
IsFinished
 Gets a value indicating whether this animator has finished animating.
Phase
 Gets the current animation phase.
Threshold
 Gets or sets the threshold value for the fade animation trigger.
TriggerUpdate
 Gets or sets whether this animator triggers canvas updates.
Top
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace