Grasshopper API
Param_AnnotationUnitsSettings Properties
The Param_AnnotationUnitsSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace