Grasshopper API
GH_CanvasDocumentChangedEventArgs Properties
The GH_CanvasDocumentChangedEventArgs type exposes the following members.
Properties
Name | Description
NewDocument
 Gets the document which has just been loaded into the canvas.
OldDocument
 Gets the document which was previously loaded into the canvas.
Top
See Also
Reference
GH_CanvasDocumentChangedEventArgs Class
Grasshopper.GUI.Canvas Namespace