Grasshopper API
ModelComponentContent Properties
The ModelComponentContent type exposes the following members.
Properties
Name | Description
Attribs
UserText
Top
See Also
Reference
ModelComponentContent Class
Grasshopper.Rhinoceros Namespace