Grasshopper API
AnnotationDimensionSettings Properties
The AnnotationDimensionSettings type exposes the following members.
Properties
Name | Description
BaselineSpacing
CentermarkSize
CentermarkStyle
DecimalSeparator
DimensionLineExtension
ExtensionLineExtension
ExtensionLineOffset
FixedExtension
FixedExtensionLength
RadialTextAngleType
RadialTextLocation
RadialTextOrientation
SuppressExtension1
SuppressExtension2
TextAngleType
TextLocation
TextOrientation
Top
See Also
Reference
AnnotationDimensionSettings Class
Grasshopper.Rhinoceros.Annotations Namespace