Grasshopper API
GH_MeshFaceProxy Properties
The GH_MeshFace.GH_MeshFaceProxy type exposes the following members.
Properties
Name | Description
A
B
C
D
Kind
Top
See Also
Reference
GH_MeshFace.GH_MeshFaceProxy Class
Grasshopper.Kernel.Types Namespace