Grasshopper API
GH_ScrollBarVerticalBase Properties
The GH_ScrollBarVerticalBase type exposes the following members.
Properties
Name | Description
Content
 Gets or sets the height of the content
ContentOffset
 Gets the vertical offset (in pixels) of the scrolled content.
Display
 Gets or sets the height of the display area.
Minimum
 Gets or sets the minimum height of the scrollbar.
Offset
 Gets the offset of the scroller.
OffsetNormalised
 Gets or sets the normalised offset of the scroller.
Top
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace