Grasshopper API
Param_ModelHatchPattern Properties
The Param_ModelHatchPattern type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelHatchPattern Class
Grasshopper.Rhinoceros.Drafting.Params Namespace