Grasshopper API
Attributes Properties
The ModelSectionStyle.Attributes type exposes the following members.
Properties
Name | Description
BackgroundFillColor
BackgroundFillMode
BackgroundFillPrintColor
BoundaryColor
BoundaryLinetype
BoundaryLineWeight
BoundaryPrintColor
HatchPattern
HatchPatternColor
HatchPatternLineWeight
HatchPatternPrintColor
HatchRotation
HatchScale
IsBoundaryVisible
SectionFillRule
Top
See Also
Reference
ModelSectionStyle.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace