Grasshopper API
GH_DigitScrollerBase Properties
The GH_DigitScrollerBase type exposes the following members.
Properties
Name | Description
AllowRadixDrag
 Gets or sets a value indicating whether the radix is allowed to be dragged around.
AllowTextInput
 Gets or sets whether text input is allowed by double click.
AmplifyMotion
 Gets or sets a value indicating whether vertical mouse drags should be amplified as the mouse moves further and further.
BackgroundGradient
 Gets or sets the background Gradient. If the gradient is not null, it overrides the background colours.
BottomColour
 Gets or sets the colour used along the bottom edge of the control.
Bounds
 Gets or sets the Bounds for this scroller.
 (Overrides GH_TextBoxInputBase.Bounds.)
DecimalPlaces
 Gets or sets the number of decimal places available in this scroller. Unlike Radix, this property maintains the decimal position of the value represented by this scroller.
DigitAlign
 Gets or sets the digit align mode.
Digits
 Gets or sets the number of digits available in this scroller.
DrawBackground
 Gets or sets whether the background is drawn in this control.
DrawBorder
 Gets or sets whether the border is drawn in this control.
DrawShadows
 Gets or sets whether shadows are drawn in this control.
EdgeColour
 Gets or sets the edge colour of the control.
Epsilon
 Gets the smallest possible change in the value.
Font
 Gets or sets the Font for this scroller.
 (Overrides GH_TextBoxInputBase.Font.)
MaximumValue
 Gets or sets the upper bound of the scroll value.
MinimumValue
 Gets or sets the lower bound of the scroll value.
Prefix
 Gets or sets the prefix text to be displayed on the scroller.
PrefixBox
 Gets the box containing the prefix string. If there is no prefix the PrefixBox will be Rectangle.Empty
Radix
 Gets or sets the radix index of this scroller.
RadixBox
 Gets the Radix box for this control, if there is no radix box, Rectangle.Empty will be returned.
RailColour
 Gets or sets the colour used for the rail line.
RaiseEvents
 Gets or sets whether this scroller raises the ValueChanged event.
ScrollBoxes
 Gets all scroll boxes (from left to right) for this control, not including the radix box.
ShadowColour
 Gets or sets the colour used for the shadows.
ShadowSize
 Gets or sets the size of the drop shadow along all four edges.
SignBox
 Gets the Sign box for this control.
Suffix
 Gets or sets the suffix text to be displayed on the scroller.
SuffixBox
 Gets the box containing the suffix string. If there is no suffix the PrefixBox will have zero width
TextColour
 Gets or sets the colour used for the text inside the scrolls.
TopColour
 Gets or sets the colour used along the top edge of the control.
Value
 Gets or sets the value displayed in this scroller.
Top
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace