Grasshopper API
GH_ExpressionParser Properties
The GH_ExpressionParser type exposes the following members.
Properties
Name | Description
ThrowExceptions
Variables
Top
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace