Grasshopper API
GH_DocObjectEventArgs Properties
The GH_DocObjectEventArgs type exposes the following members.
Properties
Name | Description
Attributes
 Gets all the attributes that are associated with all objects in the event.
Document
 Gets the document that raised the event.
Object
 Gets the object to which this event pertains.
ObjectCount
 Gets the number of objects in this event.
Objects
 Gets a readonly list of the objects to which this event pertains.
Top
See Also
Reference
GH_DocObjectEventArgs Class
Grasshopper.Kernel Namespace