Grasshopper API
GH_PointCharge Properties
The GH_PointCharge type exposes the following members.
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Charge
Decay
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Location
Top
See Also
Reference
GH_PointCharge Class
Grasshopper.Kernel.Types Namespace