Grasshopper API
Param_AnnotationArrowSettings Properties
The Param_AnnotationArrowSettings type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations.Params Namespace