Grasshopper API
GH_DocumentTree Properties
The GH_DocumentTree type exposes the following members.
Properties
Name | Description
FlatCollection
 Gets a flat collection of all documents. The most subsidiary documents are at the start of the collection.
Root
 Gets the root node for this document.
RootDocument
 Gets the document inside the root node of this tree.
Top
See Also
Reference
GH_DocumentTree Class
Grasshopper.Kernel Namespace