Grasshopper API
GH_Matrix Properties
The GH_Matrix type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Integers are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Matrix Class
Grasshopper.Kernel.Types Namespace