Grasshopper API
Param_ObjectRender Properties
The Param_ObjectRender type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectRender Class
Grasshopper.Rhinoceros.Render.Params Namespace