Grasshopper API
ModelContentName Properties
The ModelContentName type exposes the following members.
Properties
Name | Description
IsDefault
IsDefaultOrEmpty
IsEmpty
Parent
Separator
Stem
Top
See Also
Reference
ModelContentName Structure
Grasshopper.Rhinoceros Namespace