Grasshopper API
GH_GraphicsUtil Properties
The GH_GraphicsUtil type exposes the following members.
Properties
Name | Description
UiScale
 Gets the screen-scaling factor for the entire system. Use the UiAdjust methods in the Grasshopper top level namespace (Global_Proc module) to modify integer and single values.
Top
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace