Grasshopper API
GH_TreeIndex Properties
The GH_TreeIndex type exposes the following members.
Properties
Name | Description
Item
 Gets or sets the item index.
Path
 Gets or sets the Path identifier.
Top
See Also
Reference
GH_TreeIndex Structure
Grasshopper.Kernel.Data Namespace