Grasshopper API
GH_PanelEditorControl Properties
The GH_PanelEditorControl type exposes the following members.
Properties
Name | Description
PanelContent
 Gets or sets the panel text on display.
PanelProperties
 Gets or sets the panel properties on display.
Top
See Also
Reference
GH_PanelEditorControl Class
Grasshopper.GUI Namespace