Grasshopper API
GH_ScriptVariant Properties
The GH_ScriptVariant type exposes the following members.
Properties
Name | Description
Boolean
DateTime
Double
Integer
Object
Plane
Point
String
Type
Vector
Top
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace