Grasshopper API
GH_GeometricGoo<T> Properties
The GH_GeometricGoo<T> generic type exposes the following members.
Properties
Name | Description
Boundingbox
 Gets the boundingbox for this geometry.
IsGeometryLoaded
 Gets a value indicating whether or not this geometry is currently loaded (assuming it is referenced). Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
IsReferencedGeometry
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
IsValid
 Gets a value indicating whether or not the current value is valid.
 (Overrides GH_Goo<T>.IsValid.)
ReferenceID
 Gets or sets the Guid of the object that is referenced. Not all IGH_GeometricGoo implementations support referenced geometry. The default implementation is to always return Guid.Empty.
Value
 Gets or sets the value of this type. Note that if the type has a ReferenceID this value might get destroyed in the future.
 (Overrides GH_Goo<T>.Value.)
Top
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace