Grasshopper API
Param_AngularDimension Properties
The Param_AngularDimension type exposes the following members.
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsBakeCapable
IsPreviewCapable
Top
See Also
Reference
Param_AngularDimension Class
Grasshopper.Kernel.Parameters Namespace