Grasshopper API
GH_VectorProxy Properties
The GH_Vector.GH_VectorProxy type exposes the following members.
Properties
Name | Description
IsParsable |  (Overrides GH_GooProxy.IsParsable.)
Length
X
Y
Z
Top
See Also
Reference
GH_Vector.GH_VectorProxy Class
Grasshopper.Kernel.Types Namespace