Grasshopper API
Translation Properties
The Translation type exposes the following members.
Properties
Name | Description
Name
TranslationVector
Top
See Also
Reference
Translation Class
Grasshopper.Kernel.Types.Transforms Namespace