Grasshopper API
GH_GeometryGroup Properties
The GH_GeometryGroup type exposes the following members.
Properties
Name | Description
Boundingbox
ClippingBox
IsGeometryLoaded
IsReferencedGeometry
IsValid
IsValidWhyNot
Name
Objects
ReferenceID
TypeDescription
TypeName
Top
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace