Grasshopper API
GH_ConnectivityDisparity Properties
The GH_ConnectivityDisparity type exposes the following members.
Properties
Name | Description
SubNodes
 Gets a proxy for all the Nodes in the Subset diagram.
SubSet
 Gets a pointer to the subset diagram stored in this disparity class.
TopNodes
 Gets a proxy for all the Nodes in the Top Level diagram.
TopSet
 Gets a pointer to the complete diagram stored in this disparity class.
Top
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace