Grasshopper API
GH_StateTag Properties
The GH_StateTag type exposes the following members.
Properties
Name | Description
Description
Icon
Name
Stage
 Gets or sets the stage rectangle for this tag.
StateDescription
 Gets or sets the state description for this tag.
Top
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace