Grasshopper API
Attributes Properties
The ModelHatchPattern.Attributes type exposes the following members.
Properties
Name | Description
Lines
Units
Top
See Also
Reference
ModelHatchPattern.Attributes Class
Grasshopper.Rhinoceros.Drafting Namespace