Grasshopper API
GH_FileSystemEventServer Properties
The GH_FileSystemEventServer type exposes the following members.
Properties
Name | Description
AllPaths
 Gets a list of all the paths currently under surveillance.
Top
See Also
Reference
GH_FileSystemEventServer Class
Grasshopper.Kernel Namespace