Grasshopper API
GH_LonLatCoordinate Properties
The GH_LonLatCoordinate type exposes the following members.
Properties
Name | Description
IsValid
IsValidWhyNot
Latitude
 Gets or sets the longitude (in degrees) of the location.
Longitude
 Gets or sets the longitude (in degrees) of the location.
SphereUParameter
 Gets the spherical U parameter.
SphereVParameter
 Gets the spherical V parameter.
TypeDescription
TypeName
Top
See Also
Reference
GH_LonLatCoordinate Class
Grasshopper.Kernel.Types Namespace