Grasshopper API
IGH_GeometricGoo Properties
The IGH_GeometricGoo type exposes the following members.
Properties
Name | Description
Boundingbox
 Gets the (cached) boundingbox for this geometry. Not all geometry types cache boundingbox results.
IsGeometryLoaded
 Gets a value indicating whether or not this geometry is currently loaded (assuming it is referenced). Not all IGH_GeometricGoo implementations support referenced geometry.
IsReferencedGeometry
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
ReferenceID
 Gets or sets the Guid of the object that is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
Top
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace