Grasshopper API
IGH_TypeHint Properties
The IGH_TypeHint type exposes the following members.
Properties
Name | Description
HintID
 Unique ID for every type of Hint.
TypeName
 Name of target Type
Top
See Also
Reference
IGH_TypeHint Interface
Grasshopper.Kernel.Parameters Namespace