Grasshopper API
IGH_ReferencedData Properties
The IGH_ReferencedData type exposes the following members.
Properties
Name | Description
IsReferencedData
IsReferencedDataLoaded
Top
See Also
Reference
IGH_ReferencedData Interface
Grasshopper.Kernel.Types Namespace