Grasshopper API
IGH_SettingCategory Properties
The IGH_SettingCategory type exposes the following members.
Properties
Name | Description
Description
 Category description.
Icon
 Category icon. Image should be 48x48 pixels.
Name
 Category name (not case sensitive). Use dots to separate subcategories.
Parent
 Gets the name of the parent category. If the category is supposed to be top-level, this property will return null or a String.Empty.
Top
See Also
Reference
IGH_SettingCategory Interface
Grasshopper.GUI Namespace