Grasshopper API
GH_PreviewWireArgs Properties
The GH_PreviewWireArgs type exposes the following members.
Properties
Name | Description
Color
 Gets the color in which wires ought to be drawn.
Pipeline
 Gets the Display Pipeline we're currently drawing with.
Thickness
 Gets the thickness in which wires ought to be drawn.
Viewport
 Gets the Viewport in which we're currently drawing.
Top
See Also
Reference
GH_PreviewWireArgs Class
Grasshopper.Kernel Namespace