Grasshopper API
GH_PageSettings Properties
The GH_PageSettings type exposes the following members.
Properties
Name | Description
DrawGrid
 Gets or sets whether the grid ought to be drawn.
DrawPage
 Gets or sets whether the page ought to be drawn.
DrawShadow
 Gets or sets whether the page shadow ought to be drawn. If the page is not drawn, neither is the page shadow, irregardless of this property.
EdgeColour
 Gets or sets the page edge colour to be used.
FillColour
 Gets or sets the page fill colour to be used.
GridColour
 Gets or sets the page grid colour to be used.
GridHeight
 Gets or sets the height of a page grid cell.
GridPattern
 Gets or sets the dash pattern to apply to grid lines. Leave null or empty for a solid line.
GridWidth
 Gets or sets the width of a page grid cell.
ShadowColour
 Gets or set the page shadow colour to be used.
ShadowSize
 Gets or sets the size of the page shadow.
Top
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace