Grasshopper API
PageSettings Properties
The PageSettings type exposes the following members.
Properties
Name | Description
PaperHeight
PaperName
PaperWidth
Units
Top
See Also
Reference
PageSettings Class
Grasshopper.Rhinoceros.Display Namespace