Grasshopper API
GH_FontPicker Properties
The GH_FontPicker type exposes the following members.
Properties
Name | Description
SelectedFont
Top
See Also
Reference
GH_FontPicker Class
Grasshopper.GUI Namespace