Grasshopper API
GH_RuleSequence Properties
The GH_RuleSequence type exposes the following members.
Properties
Name | Description
Kind
Notation
Top
See Also
Reference
GH_RuleSequence Class
Grasshopper.Kernel.Data Namespace