Grasshopper API
GH_AutoSaveSettings Properties
The GH_AutoSaveSettings type exposes the following members.
Properties
Name | Description
EnableAutoSave
SaveOnDataFlattening
SaveOnDocumentUnload
SaveOnObjectAdded
SaveOnObjectChange
SaveOnObjectRemoved
SaveOnWireEvent
Top
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace