Grasshopper API
Param_Centermark Properties
The Param_Centermark type exposes the following members.
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
Icon |  (Overrides GH_DocumentObject.Icon.)
IsBakeCapable
IsPreviewCapable
Top
See Also
Reference
Param_Centermark Class
Grasshopper.Kernel.Parameters Namespace