Grasshopper API
GH_Leader Properties
The GH_Leader type exposes the following members.
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_AnnotationBase.ValueType.)
Top
See Also
Reference
GH_Leader Class
Grasshopper.Kernel.Types Namespace