Grasshopper API
Attributes Properties
The ClippingArrow.Attributes type exposes the following members.
Properties
Name | Description
ArrowType
Top
See Also
Reference
ClippingArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace