Grasshopper API
Attributes Properties
The AnnotationTextSettings.Attributes type exposes the following members.
Properties
Name | Description
DrawForward
DrawTextMask
FitText
Font
MaskColor
MaskColorSource
MaskFrame
MaskOffset
TextGap
TextHeight
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
See Also
Reference
AnnotationTextSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace