Grasshopper API
GH_ImageSettings Properties
The GH_Canvas.GH_ImageSettings type exposes the following members.
Properties
Name | Description
BackColour
 Gets or sets the background colour to use for the high-resolution rendering.
Extension
 Gets or sets the image extension of the target image.
FileName
 Gets or sets the filename of the target image.
Folder
 Gets or sets the folder in which the target image will be saved.
TileSize
 Gets the default tile size for high-resolution export. This is a constant value.
Zoom
 Gets or sets the zoom at which to export the high-resolution image.
Top
See Also
Reference
GH_Canvas.GH_ImageSettings Class
Grasshopper.GUI.Canvas Namespace