Grasshopper API
GH_ObjectChangedEventArgs Properties
The GH_ObjectChangedEventArgs type exposes the following members.
Properties
Name | Description
CustomType
 Gets the customised type description of this event. This field is only set when the Type is GH_ObjectEventType.Custom.
Sender
 Gets the object which raised this event.
Tag
 Gets the tag for this event.
Type
 Gets the type of this event.
Top
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace