Grasshopper API
IGH_Tooltip Properties
The IGH_Tooltip type exposes the following members.
Properties
Name | Description
Description
 Gets or sets the tooltip Description. The Description is optional and is displayed in the same area as the TooltipDiagram image.
Diagram
 Sets the tooltip diagram image. The diagram image is optional and is displayed in the same area as the ToolTipDescription text.
Icon
 Sets the Tooltip Icon image.
Palette
 Gets or sets the tooltip colour palette.
Text
 Gets or sets the tooltip Text.
Title
 Gets or sets the tooltip Title.
Top
See Also
Reference
IGH_Tooltip Interface
Grasshopper.GUI Namespace