Grasshopper API
PointCloudProxy Properties
The GH_PointCloud.PointCloudProxy type exposes the following members.
Properties
Name | Description
ContainsColors
ContainsHiddenFlags
ContainsNormals
ContainsValues
HiddenPointCount
ObjectID
PointCount
Top
See Also
Reference
GH_PointCloud.PointCloudProxy Class
Grasshopper.Kernel.Types Namespace