Grasshopper API
GH_SurfaceProxy Properties
The GH_Surface.GH_SurfaceProxy type exposes the following members.
Properties
Name | Description
Area
Closed
Deformable
EdgeCount
LoopCount
ObjectID
Periodic
Planar
Singular
Solid
Trimmed
VertexCount
Volume
Top
See Also
Reference
GH_Surface.GH_SurfaceProxy Class
Grasshopper.Kernel.Types Namespace