Grasshopper API
GH_DimensionProxy Properties
The GH_Dimension.GH_DimensionProxy type exposes the following members.
Properties
Name | Description
Measure
Top
See Also
Reference
GH_Dimension.GH_DimensionProxy Class
Grasshopper.Kernel.Types Namespace