Grasshopper API
Projection Properties
The Projection type exposes the following members.
Properties
Name | Description
Name
ProjectionPlane
Top
See Also
Reference
Projection Class
Grasshopper.Kernel.Types.Transforms Namespace