Grasshopper API
GH_UndoAction Properties
The GH_UndoAction type exposes the following members.
Properties
Name | Description
ExpiresDisplay
 Override this property if you want the Rhino viewport display to refresh upon undo completion.
ExpiresSolution
 Override this property if you want the Grasshopper solution to refresh upon undo completion.
State
Top
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace