Grasshopper API
GH_DisplayExpiredEventArgs Properties
The GH_DisplayExpiredEventArgs type exposes the following members.
Properties
Name | Description
ForceRedraw
Top
See Also
Reference
GH_DisplayExpiredEventArgs Class
Grasshopper.Kernel Namespace