Grasshopper API
ObjectRenderMaterial Properties
The ObjectRenderMaterial type exposes the following members.
Properties
Name | Description
Material
Source
Top
See Also
Reference
ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render Namespace