Grasshopper API
GH_InputParamManager Properties
The GH_Component.GH_InputParamManager type exposes the following members.
Properties
Name | Description
Param
 Gets the input parameter at the given index.
 (Overrides GH_ParamManager.Param.)
ParamCount
 Returns the number of input parameters already part of this component.
 (Overrides GH_ParamManager.ParamCount.)
Top
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace