Grasshopper API
GH_FontScroller Properties
The GH_FontScroller type exposes the following members.
Properties
Name | Description
PostPaintDelegate
Top
See Also
Reference
GH_FontScroller Class
Grasshopper.GUI Namespace