Grasshopper API
AnnotationDateTimeFormat Properties
The AnnotationDateTimeFormat type exposes the following members.
Properties
Name | Description
DisplayName
Top
See Also
Reference
AnnotationDateTimeFormat Class
Grasshopper.Rhinoceros.Annotations Namespace