Grasshopper API
GH_CanvasViewportChangedEventArgs Properties
The GH_CanvasViewportChangedEventArgs type exposes the following members.
Properties
Name | Description
Canvas
 Gets the Canvas whose viewport was changed.
Viewport
 Gets the new Viewport.
Top
See Also
Reference
GH_CanvasViewportChangedEventArgs Class
Grasshopper.GUI.Canvas Namespace