Grasshopper API
Param_MatchText Properties
The Param_MatchText type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
MatchingMode
Negate
StateTags |  (Overrides GH_Param<T>.StateTags.)
TypeName |  (Overrides GH_Param<T>.TypeName.)
Top
See Also
Reference
Param_MatchText Class
Grasshopper.Rhinoceros.Params Namespace