Grasshopper API
GH_DragInfo Properties
The GH_DragInfo type exposes the following members.
Properties
Name | Description
Box_Drag
 Gets the dimensions of the box as a result of the dragging op.
Box_Start
 Gets the dimensions of the drag box prior to dragging.
Constraint
 Gets or sets the directional constraint for the drag operation.
Point_Drag
 Gets the cursor location at the current moment.
Point_Start
 Gets the cursor location at the start of the drag.
Region
 Gets or sets the drag limits. If the region is Rectangle.Empty then the region is ignored. For valid results the Region should be larger than the dimensions of the drag box.
Top
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace