Grasshopper API
Param_ModelUnitSystem Properties
The Param_ModelUnitSystem type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelUnitSystem Class
Grasshopper.Rhinoceros.Params Namespace