Grasshopper API
GH_DeveloperDetails Properties
The GH_DeveloperDetails type exposes the following members.
Properties
Name | Description
DefaultDeveloperContact
 Gets the default developer contact details.
DeveloperContact
 Gets or sets the local developer contact info (e-mail). By default, the developer email is DefaultDeveloperContact; This email address is used in the Message Report viewer when sending a support e-mail.
Top
See Also
Reference
GH_DeveloperDetails Class
GH_IO.UserInterface Namespace