Grasshopper API
GH_ContentCollection Properties
The GH_ContentCollection type exposes the following members.
Properties
Name | Description
Content
Count
Item
Top
See Also
Reference
GH_ContentCollection Class
Grasshopper.Documentation Namespace