Grasshopper API
GH_CustomEventServer Properties
The GH_CustomEventServer type exposes the following members.
Properties
Name | Description
Enabled
 Gets or sets the enabled state flag for this event watcher.
GuidTable
 Gets direct access to the internal guid table. The table contains pairs of object Ids and runtime serial numbers.
GuidTableCount
 Gets the number of stored ids in the Guid Table.
Top
See Also
Reference
GH_CustomEventServer Class
Grasshopper.Kernel Namespace