Grasshopper API
GH_RuleGroup Properties
The GH_RuleGroup type exposes the following members.
Properties
Name | Description
Kind
Notation
Top
See Also
Reference
GH_RuleGroup Class
Grasshopper.Kernel.Data Namespace