Grasshopper API
Attributes Properties
The ModelRenderSun.Attributes type exposes the following members.
Properties
Name | Description
Altitude
Azimuth
DateTime
DaylightSavingEnabled
DaylightSavingMinutes
Direction
Enabled
Intensity
Latitude
Longitude
Manual
North
TimeZone
Top
See Also
Reference
ModelRenderSun.Attributes Class
Grasshopper.Rhinoceros.Render Namespace