Grasshopper API
GH_AssemblyFolderInfo Properties
The GH_AssemblyFolderInfo type exposes the following members.
Properties
Name | Description
SearchOption
 Gets the search option to use when looking for GHA files in this folder.
Top
See Also
Reference
GH_AssemblyFolderInfo Structure
Grasshopper.Kernel Namespace