Grasshopper API
ModelRenderContent Properties
The ModelRenderContent type exposes the following members.
Properties
Name | Description
Attribs
TypeName |  (Overrides ModelData.TypeName.)
Top
See Also
Reference
ModelRenderContent Class
Grasshopper.Rhinoceros.Render Namespace