Grasshopper API
GH_ExternalFileConflictDialog Properties
The GH_ExternalFileConflictDialog type exposes the following members.
Properties
Name | Description
FilePathA
FilePathB
InfoLabel
LoadFileCode
Top
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace