Grasshopper API
GH_SpinForce Properties
The GH_SpinForce type exposes the following members.
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Decay
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Plane
Radius
Strength
Top
See Also
Reference
GH_SpinForce Class
Grasshopper.Kernel.Types Namespace