Grasshopper API
ModelData Properties
The ModelData type exposes the following members.
Properties
Name | Description
Attribs
DefaultAttributes
IsValidWhyNot
TypeDescription
Top
See Also
Reference
ModelData Class
Grasshopper.Rhinoceros Namespace