Grasshopper API
GH_CircleProxy Properties
The GH_Circle.GH_CircleProxy type exposes the following members.
Properties
Name | Description
Area
Center
Circumference
Normal
Radius
Top
See Also
Reference
GH_Circle.GH_CircleProxy Class
Grasshopper.Kernel.Types Namespace