Grasshopper API
GH_Culture Properties
The GH_Culture type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Guids are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Culture Class
Grasshopper.Kernel.Types Namespace