Grasshopper API
GH_Field Properties
The GH_Field type exposes the following members.
Properties
Name | Description
ClippingBox
Elements
 Gets the list of elements of this field.
IsValid
IsValidWhyNot
TypeDescription
TypeName
Top
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace