Grasshopper API
Param_ModelDisplayMode Properties
The Param_ModelDisplayMode type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace