Grasshopper API
GH_GeometricFont Properties
The GH_GeometricFont type exposes the following members.
Properties
Name | Description
Char0
 Gets the default geometry for '0'. Caller is responsible for disposing the path.
Char1
 Gets the default geometry for '1'. Caller is responsible for disposing the path.
Char2
 Gets the default geometry for '2'. Caller is responsible for disposing the path.
Char3
 Gets the default geometry for '3'. Caller is responsible for disposing the path.
Char4
 Gets the default geometry for '4'. Caller is responsible for disposing the path.
Char5
 Gets the default geometry for '5'. Caller is responsible for disposing the path.
Char6
 Gets the default geometry for '6'. Caller is responsible for disposing the path.
Char7
 Gets the default geometry for '7'. Caller is responsible for disposing the path.
Char8
 Gets the default geometry for '8'. Caller is responsible for disposing the path.
Char9
 Gets the default geometry for '9'. Caller is responsible for disposing the path.
CharBracketClose
 Gets the default geometry for '}'. Caller is responsible for disposing the path.
CharBracketOpen
 Gets the default geometry for '{'. Caller is responsible for disposing the path.
CharDash
 Gets the default geometry for '-'. Caller is responsible for disposing the path.
CharSemiColon
 Gets the default geometry for ';'. Caller is responsible for disposing the path.
Top
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace