Grasshopper API
GH_SolutionEventArgs Properties
The GH_SolutionEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event, should be the same as the "sender" parameter in the event handler.
Duration
 Gets the duration for this solution. The duration is a more accurate measure than EndTime-StartTime.
StartTime
 Gets the time when the current solution began.
Top
See Also
Reference
GH_SolutionEventArgs Class
Grasshopper.Kernel Namespace