Grasshopper API
GH_RadialDimension Properties
The GH_RadialDimension type exposes the following members.
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
See Also
Reference
GH_RadialDimension Class
Grasshopper.Kernel.Types Namespace