Grasshopper API
GH_MemoryBitmap Properties
The GH_MemoryBitmap type exposes the following members.
Properties
Name | Description
HasAlphaChannel
 Gets a value indicating whether or not the local image has an alpha channel defined.
Height
 Gets the height (in pixels) of the local image.
SizeOf
 Gets the size (in bytes) of the local image.
Width
 Gets the width (in pixels) of the local image.
Top
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace