Grasshopper API
GH_State Properties
The GH_State type exposes the following members.
Properties
Name | Description
Data[Guid]
 Gets the state data stored under the specified ID
Data[Int32]
 Gets the state data stored under the specified index
LastModified
 Gets the date at which this state was last modified.
Name
 Gets or sets the name of this state.
StateCount
 Gets the number of items stored in the state database.
StateData
 Gets a pointer to the internal database of states.
Top
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace