Grasshopper API
ModelAnnotationStyle Properties
The ModelAnnotationStyle type exposes the following members.
Properties
Name | Description
ArrowSettings
DimensionScale
DimensionSettings
LeaderSettings
TextSettings
ToleranceSettings
UnitsSettings
Unset
Top
See Also
Reference
ModelAnnotationStyle Class
Grasshopper.Rhinoceros.Annotations Namespace