Grasshopper API
Param_ModelSpaceViewport Properties
The Param_ModelSpaceViewport type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelSpaceViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace