Grasshopper API
IGH_Rule Properties
The IGH_Rule type exposes the following members.
Properties
Name | Description
Kind
 Gets the type of rule.
Notation
 Gets the string notation (representation) for this rule.
Top
See Also
Reference
IGH_Rule Interface
Grasshopper.Kernel.Data Namespace