Grasshopper API
Versioning Properties
The Versioning type exposes the following members.
Properties
Name | Description
BuildDate
 Gets the build date string. This is the visible release iteration tag. Typically the BuildDate is just the date (MMMM-dd, yyyy), but it may carry a prefix or suffix for special builds.
Version
 Gets the version of the current build of Grasshopper.
VersionString
 Gets the version of the current build of Grasshopper.
Top
See Also
Reference
Versioning Class
Grasshopper Namespace