Grasshopper API
GH_StructurePath Properties
The GH_StructurePath type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Integers are always valid
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_Goo<T>.Value.)
Top
See Also
Reference
GH_StructurePath Class
Grasshopper.Kernel.Types Namespace