Grasshopper API
Param_DisplayColorStop Properties
The Param_DisplayColorStop type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
See Also
Reference
Param_DisplayColorStop Class
Grasshopper.Rhinoceros.Display.Params Namespace