Grasshopper API
GH_Arc Properties
The GH_Arc type exposes the following members.
Properties
Name | Description
Boundingbox
 Gets the boundingbox for this geometry.
 (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsValid
 Gets the validity of this instance.
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Arc Class
Grasshopper.Kernel.Types Namespace