Grasshopper API
GH_DocDiagramPainter Properties
The GH_DocDiagramPainter type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the 2D domain of the diagram in canvas coordinates.
DrawingBox
 Gets the 2D domain of the diagram in image coordinates.
IgnoreSelectedStates
 Gets or sets the Ignore Selected State flag. When set to True, selected objects are not drawn in a different colour.
Image
 Gets the diagram image (only available after a call to PaintDiagram().
Size
 Gets the width and height (in pixels) of this diagram image.
Zoom
 Gets the zoom factor for this diagram.
Top
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace