Grasshopper API
GH_Tooltip Properties
The GH_Tooltip type exposes the following members.
Properties
Name | Description
Tag
 Gets or sets the tag object for the tooltip
TooltipForm
 Gets the internal instance of GH_TooltipForm.
Top
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace