Grasshopper API
GH_MaterialPreviewControl Properties
The GH_MaterialPreviewControl type exposes the following members.
Properties
Name | Description
Colour
 Gets or sets the colour of this preview.
Selected
 Gets or sets the Selected state of this preview. Selected previews have thick borders drawn around them.
SelectOnClick
 Gets or sets whether this control can be selected.
Top
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace