Grasshopper API
IGH_StateTag Properties
The IGH_StateTag type exposes the following members.
Properties
Name | Description
Description
 Gets the description of this state tag.
Icon
 Gets the 16 by 16 pixel icon associated with this state tag.
Name
 Gets the name field of this state tag.
Stage
 Gets or sets the Stage rectangle for this state tag. Stages are assigned during Attribute Layout operations by owner objects.
StateDescription
 Gets or sets the state description of this tag. The state description appears in the Tooltip info field.
Top
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace