Grasshopper API
GH_Material Properties
The GH_Material type exposes the following members.
Properties
Name | Description
IsValid |  (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
RdkMaterialId
 Gets or sets the RDK material ID this material is associated with.
RdkMaterialRmtl
 Gets or sets the RDK material RMTL file path.
RdkMaterialXml
 Gets or sets the RDK material Xml string.
Type
 Gets the implied type based on what fields have been assigned.
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace