Grasshopper API
Param_ModelLinetype Properties
The Param_ModelLinetype type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelLinetype Class
Grasshopper.Rhinoceros.Drafting.Params Namespace