Grasshopper API
Attributes Properties
The ModelInstanceDefinition.Attributes type exposes the following members.
Properties
Name | Description
FilePath
Objects
Units
UpdateType
Url
UrlDescription
Top
See Also
Reference
ModelInstanceDefinition.Attributes Class
Grasshopper.Rhinoceros.Model Namespace