Grasshopper API
GH_BrepProxy Properties
The GH_Brep.GH_BrepProxy type exposes the following members.
Properties
Name | Description
Area
EdgeCount
FaceCount
LoopCount
Manifold
ObjectID
Solid
VertexCount
Volume
Top
See Also
Reference
GH_Brep.GH_BrepProxy Class
Grasshopper.Kernel.Types Namespace