Grasshopper API
GH_ObjectWrapper Properties
The GH_ObjectWrapper type exposes the following members.
Properties
Name | Description
ClippingBox
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_ObjectWrapper Class
Grasshopper.Kernel.Types Namespace