Grasshopper API
Attributes Properties
The ModelNamedConstructionPlane.Attributes type exposes the following members.
Properties
Name | Description
CPlane
Top
See Also
Reference
ModelNamedConstructionPlane.Attributes Class
Grasshopper.Rhinoceros.Display Namespace