Grasshopper API
GH_Gradient Properties
The GH_Gradient type exposes the following members.
Properties
Name | Description
Grip
 Gets or sets the grip at the given index.
GripCount
 Gets the number of grips in this gradient.
Linear
 Gets or sets whether the colours are interpolated linearly between grips.
Locked
 Gets or sets whether this gradient is locked. A locked gradient cannot be modified by the user.
SelectedGrip
 Gets or sets the selected grip.
Top
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace