Grasshopper API
GH_ZuiAction Properties
The GH_ZuiAction type exposes the following members.
Properties
Name | Description
Name
TooltipEnabled
Top
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace