Grasshopper API
Value Properties
The ModelUnitSystem.Value type exposes the following members.
Properties
Name | Description
ActiveSpace
BaseSystem
Factor
Feet
Inches
Meters
MetersPerUnit
Millimeters
ModelUnits
Name
None
PageUnits
Symbol
Unset
Top
See Also
Reference
ModelUnitSystem.Value Structure
Grasshopper.Rhinoceros Namespace