Grasshopper API
GH_Theme Properties
The GH_Theme type exposes the following members.
Properties
Name | Description
BackGround
 Gets the theme background settings.
DefaultTheme
Objects
 Gets the theme objects and ZUI settings.
Page
 Gets the theme page and grid settings.
Palettes
 Gets the theme palette settings.
Wires
 Gets the theme wire settings.
Top
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace