Grasshopper API
Param_ModelFont Properties
The Param_ModelFont type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
See Also
Reference
Param_ModelFont Class
Grasshopper.Rhinoceros.Params Namespace