Grasshopper API
IGH_UpgradeObject Properties
The IGH_UpgradeObject type exposes the following members.
Properties
Name | Description
UpgradeFrom
 Gets the ComponentGuid of the old object (the object to be updated).
UpgradeTo
 Gets the ComponentGuid of the new object (the object that will be inserted).
Version
 Return a DateTime object that indicates when this upgrade mechanism was written, so that it becomes possible to distinguish competing upgrade mechanisms.
Top
See Also
Reference
IGH_UpgradeObject Interface
Grasshopper.Kernel Namespace