Grasshopper API
GH_PreviewExpiredEventArgs Properties
The GH_PreviewExpiredEventArgs type exposes the following members.
Properties
Name | Description
ForceRedraw
Top
See Also
Reference
GH_PreviewExpiredEventArgs Class
Grasshopper.Kernel Namespace