Grasshopper API
GH_DocumentEventServer Properties
The GH_DocumentEventServer type exposes the following members.
Properties
Name | Description
Enabled
 Gets or sets the enabled state flag for this event watcher.
GuidTableRefCount
 Gets the number of stored ids in the Guid Table.
Top
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace