Grasshopper API
GH_GenericObjectAction Properties
The GH_GenericObjectAction type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_GenericObjectAction Class
Grasshopper.Kernel.Undo.Actions Namespace