Grasshopper API
Param_ModelSectionStyle Properties
The Param_ModelSectionStyle type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting.Params Namespace