Grasshopper API
GH_LineProxy Properties
The GH_Line.GH_LineProxy type exposes the following members.
Properties
Name | Description
Ax
Ay
Az
Bx
By
Bz
Length
Top
See Also
Reference
GH_Line.GH_LineProxy Class
Grasshopper.Kernel.Types Namespace