Grasshopper API
ModelSectionStyle Properties
The ModelSectionStyle type exposes the following members.
Properties
Name | Description
BackgroundFillColor
BackgroundFillMode
BackgroundFillPrintColor
BoundaryColor
BoundaryLinetype
BoundaryLineWeight
BoundaryPrintColor
HatchPattern
HatchPatternColor
HatchPatternLineWeight
HatchPatternPrintColor
HatchRotation
HatchScale
IsBoundaryVisible
Name |  (Overrides ModelContent.Name.)
SectionFillRule
Top
See Also
Reference
ModelSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace