Grasshopper API
GH_ConnectivityDiagram Properties
The GH_ConnectivityDiagram type exposes the following members.
Properties
Name | Description
Node
 Get the connectivity node with the specified ID.
NodeCount
 Gets the number of connectivity nodes in this diagram.
Nodes
 Gets a proxy for all the Nodes in this diagram.
Top
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace