Grasshopper API
AnnotationArrowSettings Properties
The AnnotationArrowSettings type exposes the following members.
Properties
Name | Description
Arrow1
Arrow2
ArrowSize
DimensionInline
FitArrow
LeaderArrow
LeaderArrowSize
Top
See Also
Reference
AnnotationArrowSettings Class
Grasshopper.Rhinoceros.Annotations Namespace