Grasshopper API
ModelMeshingParameters Properties
The ModelMeshingParameters type exposes the following members.
Properties
Name | Description
DefaultAnalysis
DefaultRender
FastRender
QualityRender
Unset
Top
See Also
Reference
ModelMeshingParameters Class
Grasshopper.Rhinoceros Namespace