Grasshopper API
Param_ObjectDrafting Properties
The Param_ObjectDrafting type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectDrafting Class
Grasshopper.Rhinoceros.Drafting.Params Namespace