Grasshopper API
VersionNumber Properties
The VersionNumber type exposes the following members.
Properties
Name | Description
BuildBranch
 Gets the build branch component of this instance.
IsValid
 True when all information in the VersionNumber has valid values.
Major
 Gets the major version number component of this instance.
MaxMajorVersionNumber
 The largest possible valid value of VersionNumber.MajorVersionNumber.
MaxMinorVersionNumber
 The largest possible valid value of VersionNumber.MinorVersionNumber.
MaxValid
 The largest possible valid VersionNumber.
MaxValidBuildBranch
 Represents the largest possible valid value of VersionNumber.BuildBranch. This field is read-only.
MaxValidTime
 The largest possible valid value of VersionNumber.Time. This field is read-only.
MinMajorVersionNumber
 The smallest possible valid value of VersionNumber.MajorVersionNumber.
MinMinorVersionNumber
 The smallest possible valid value of VersionNumber.MinorVersionNumber.
Minor
 Gets the minor version number component of this instance.
MinValid
 The smallest possible valid VersionNumber.
MinValidBuildBranch
 Represents the smallest possible valid value of VersionNumber.BuildBranch. This field is read-only.
MinValidTime
 The smallest possible valid value of VersionNumber.Time. This field is read-only.
Time
 Gets the version time component of this instance.
Unset
 The Unset VersionNumber. VersionNumber.Unset.IsValid is false.
UnsetBuildBranch
 The value of an Unset VersionNumber.BuildBranch.
UnsetTime
 The value of an Unset VersionNumber.Time.
Top
See Also
Reference
VersionNumber Structure
GH_IO Namespace