Grasshopper API
ModelDisplayMode Properties
The ModelDisplayMode type exposes the following members.
Properties
Name | Description
Unset
Top
See Also
Reference
ModelDisplayMode Class
Grasshopper.Rhinoceros.Display Namespace