Grasshopper API
GH_Boolean Properties
The GH_Boolean type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Booleans are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Boolean Class
Grasshopper.Kernel.Types Namespace