Grasshopper API
GH_Topic Properties
The GH_Topic type exposes the following members.
Properties
Name | Description
Description
SafeDescription
Top
See Also
Reference
GH_Topic Class
Grasshopper.Documentation Namespace