Grasshopper API
GH_IndexRanges Properties
The GH_IndexRanges type exposes the following members.
Properties
Name | Description
Count
 Gets the number of ranges stored in this collection.
Range
 Gets the range at the given index.
Top
See Also
Reference
GH_IndexRanges Class
Grasshopper.Kernel.Data Namespace