Grasshopper API
IGH_SettingFrontend Properties
The IGH_SettingFrontend type exposes the following members.
Properties
Name | Description
Category
 Category of this setting.
Keywords
 Optional keywords for this setting.
Name
 Name of this setting.
Top
See Also
Reference
IGH_SettingFrontend Interface
Grasshopper.GUI Namespace