Grasshopper API
GH_SolutionExpiredEventArgs Properties
The GH_SolutionExpiredEventArgs type exposes the following members.
Properties
Name | Description
Recompute
Top
See Also
Reference
GH_SolutionExpiredEventArgs Class
Grasshopper.Kernel Namespace