Grasshopper API
Param_ModelContent Properties
The Param_ModelContent type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
TypeName |  (Overrides GH_PersistentReferenceParam<T>.TypeName.)
Top
See Also
Reference
Param_ModelContent Class
Grasshopper.Rhinoceros.Params Namespace