Grasshopper API
Param_ObjectDisplayMode Properties
The Param_ObjectDisplayMode type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectDisplayMode Class
Grasshopper.Rhinoceros.Display.Params Namespace