Grasshopper API
GH_TooltipComponent Properties
The GH_TooltipComponent type exposes the following members.
Properties
Name | Description
Delay
 Gets or sets the delay (in milliseconds) for this tooltip to appear.
Enabled
 Gets or sets the Enabled flag.
Tag
 Provides an easy way to store information on this Tooltip.
Target
 Gets or sets the control this tooltip is tied to.
Top
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace