Grasshopper API
Attributes Properties
The ModelRenderTexture.Attributes type exposes the following members.
Properties
Name | Description
RenderTexture
Top
See Also
Reference
ModelRenderTexture.Attributes Class
Grasshopper.Rhinoceros.Render Namespace