Grasshopper API
GH_Attributes<T> Properties
The GH_Attributes<T> generic type exposes the following members.
Properties
Name | Description
AllowMessageBalloon
 Gets a value indicating whether these attributes allow warning and error balloons to be drawn on top of them.
Bounds
 Gets the rectangle that contains the active content of the attributes. Typically the Contents determine the active area for menus, tooltips etc. Attributes are not supposed to draw objects beyond the Bounds.
DocObject
 Gets the owner object of these attributes.
GetTopLevel
 Gets the top-level attributes of the attribute stack these attributes belong to.
HasInputGrip
 Gets a value indicating whether or not these attributes have an input grip.
HasOutputGrip
 Gets a value indicating whether or not these attributes have an output grip.
InputGrip
 Gets the input grip location for these attributes. If HasInputGrip equals False, this point is meaningless.
InstanceGuid
 Gets the instance ID of the document object that owns these attributes.
IsTopLevel
 Gets whether these attributes are top_level (i.e. no Parent attributes)
OutputGrip
 Gets the output grip location for these attributes. If HasOutputGrip equals False, this point is meaningless.
Owner
 Gets the type-safe owner object of these attributes. This property is identical to the DocObject property.
Parent
 Gets or sets the parent attributes. Top level attributes do not have parents.
PathName
 Get a description of the location of these attributes within the local attribute stack.
Pivot
 Gets or sets the pivot for these attributes. The pivot controls the general placement of the attributes. If you want to move the attributes, change the pivot location.
Selected
 Gets or sets the selected state of the top-level attributes.
TooltipEnabled
 Gets the tooltip enabled value. If False, no further tooltip functions will be called.
Top
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace