Grasshopper API
IGH_TagArtist Properties
The IGH_TagArtist type exposes the following members.
Properties
Name | Description
ID
 Gets the ID of this Tag Artist object.
Top
See Also
Reference
IGH_TagArtist Interface
Grasshopper.GUI.Canvas.TagArtists Namespace