Grasshopper API
GH_Integer Properties
The GH_Integer type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Integers are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Integer Class
Grasshopper.Kernel.Types Namespace