Grasshopper API
GH_ResizeBorder Properties
The GH_ResizeBorder type exposes the following members.
Properties
Name | Description
Anchor
 Gets or sets the anchor point for sizing operations. This point is determined automatically when you call Setup(), however you can alter it afterwards if you want.
Top
See Also
Reference
GH_ResizeBorder Class
Grasshopper.GUI.Canvas Namespace