Grasshopper API
IGH_Goo Properties
The IGH_Goo type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether or not the current value is valid.
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
TypeDescription
 Gets a description of the type of the implementation.
TypeName
 Gets the name of the type of the implementation.
Top
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace