Grasshopper API
GH_Paragraph Properties
The GH_Paragraph type exposes the following members.
Properties
Name | Description
Content
Top
See Also
Reference
GH_Paragraph Class
Grasshopper.Documentation Namespace