Grasshopper API
GH_ObjectSettings Properties
The GH_ObjectSettings type exposes the following members.
Properties
Name | Description
GroupColour
 Gets or sets the default fill colour for group objects.
PanelColour
 Gets or sets the default fill colour for panel objects.
ZuiEdgeColour
 Gets or sets the edge colour for ZUI elements.
ZuiFillColour
 Gets or sets the fill colour for ZUI elements.
Top
See Also
Reference
GH_ObjectSettings Class
Grasshopper.GUI.Theme Namespace