Grasshopper API
UVInterval Properties
The UVInterval type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether or not this UVInterval is valid.
U
 Gets or sets the U interval.
U0
 Gets or sets the T0 value of the U domain.
U1
 Gets or sets the T1 value of the U domain.
V
 Gets or sets the V interval.
V0
 Gets or sets the T0 value of the V domain.
V1
 Gets or sets the T1 value of the V domain.
Top
See Also
Reference
UVInterval Structure
Grasshopper.Kernel.Types Namespace