Grasshopper API
Attributes Properties
The PageSettings.Attributes type exposes the following members.
Properties
Name | Description
PaperHeight
PaperName
PaperWidth
Units
Top
See Also
Reference
PageSettings.Attributes Class
Grasshopper.Rhinoceros.Display Namespace