Grasshopper API
Attributes Properties
The AnnotationArrow.Attributes type exposes the following members.
Properties
Name | Description
ArrowType
Top
See Also
Reference
AnnotationArrow.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace