Grasshopper API
ModelDataParam<T> Properties
The ModelDataParam<T> generic type exposes the following members.
Properties
Name | Description
Icon |  (Overrides GH_DocumentObject.Icon.)
TypeName |  (Overrides GH_Param<T>.TypeName.)
Top
See Also
Reference
ModelDataParam<T> Class
Grasshopper.Rhinoceros.Params Namespace