Grasshopper API
ModelLineWidth Properties
The ModelLineWidth type exposes the following members.
Properties
Name | Description
TypeDescription |  (Overrides GH_Number.TypeDescription.)
TypeName |  (Overrides GH_Number.TypeName.)
Top
See Also
Reference
ModelLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace