Grasshopper API
GH_DigitNumber Properties
The GH_DigitNumber type exposes the following members.
Properties
Name | Description
DigitCount
 Gets or sets the amount of digits in this number.
Epsilon
 Gets the smallest possible change.
IsPrimaryDigitSignificant
 Gets whether the primary digit at the given index is significant.
IsSecondaryDigitSignificant
 Gets whether the secondary digit at the given index is significant.
Maximum
 Gets the maximum value allowed in this number.
Minimum
 Gets the minimum value allowed in this number.
Offset
 Gets the offset between the primary and secondary digits.
PrimaryDigits
 Gets the internal list of primary digits. Do not modify this list.
PrimaryPositive
 Gets or sets a value indicating whether the number is positive.
Radix
 Gets or sets the radix point index. A negative radix index disables the radix point, zero is not a valid index.
RadixIndex
 Gets the mapped radix.
SecondaryDigits
 Gets the internal list of secondary digits. Do not modify this list.
SecondaryPositive
 Gets a value indicating whether the secondary number is positive.
Value
 Gets or sets the value of this number.
Top
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace