Grasshopper API
ObjectRender Properties
The ObjectRender type exposes the following members.
Properties
Name | Description
CastsShadows
Material
ReceivesShadows
TextureMappings
Top
See Also
Reference
ObjectRender Class
Grasshopper.Rhinoceros.Render Namespace