Grasshopper API
GH_GlossaryItem Properties
The GH_GlossaryItem type exposes the following members.
Properties
Name | Description
Author
 Gets the author of this glossary entry. This field is optional and may not be defined.
Contact
 Gets the contact information for the glossary entry author. This field is optional and may not be defined.
Descriptions
 Gets the description (definition) for this glossary entry.
Path
 Gets the source file for this glossary entry.
Pronunciation
 Gets the pronunciation guide to the word. This field is optional and may not be defined.
Synonyms
 Gets the synonyms for this glossary entry.
Word
 Gets the word this glossary entry is about.
Top
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace