Grasshopper API
Param_AnnotationClippingArrow Properties
The Param_AnnotationClippingArrow type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationClippingArrow Class
Grasshopper.Rhinoceros.Annotations.Params Namespace