Grasshopper API
ModelInstanceDefinition Properties
The ModelInstanceDefinition type exposes the following members.
Properties
Name | Description
FilePath
IsValid |  (Overrides ModelContent.IsValid.)
Objects
Unset
UpdateType
Url
UrlDescription
Top
See Also
Reference
ModelInstanceDefinition Class
Grasshopper.Rhinoceros.Model Namespace