Grasshopper API
GH_DocFilePathEventArgs Properties
The GH_DocFilePathEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised this event.
NewFilePath
 Gets the new filepath, the one currently assigned to this document.
OldFilePath
 Gets the old filepath, prior to the change that triggered this event.
Top
See Also
Reference
GH_DocFilePathEventArgs Class
Grasshopper.Kernel Namespace