Grasshopper API
ModelPageViewport Properties
The ModelPageViewport type exposes the following members.
Properties
Name | Description
PageNumber
Space |  (Overrides ModelViewport.Space.)
ViewportType |  (Overrides ModelViewport.ViewportType.)
Top
See Also
Reference
ModelPageViewport Class
Grasshopper.Rhinoceros.Display Namespace