Grasshopper API
GH_FontControl Properties
The GH_FontControl type exposes the following members.
Properties
Name | Description
AllowFamilyOverride
AllowSizeOverride
AllowStyleOverride
Top
See Also
Reference
GH_FontControl Class
Grasshopper.GUI Namespace