Grasshopper API
GH_PaletteSettings Properties
The GH_PaletteSettings type exposes the following members.
Properties
Name | Description
ErrorSelected
 Gets or sets the palette style for selected Error palettes.
ErrorStandard
 Gets or sets the palette style for unselected Error palettes.
HiddenSelected
 Gets or sets the palette style for selected Hidden palettes.
HiddenStandard
 Gets or sets the palette style for unselected Hidden palettes.
LockedSelected
 Gets or sets the palette style for selected Locked palettes.
LockedStandard
 Gets or sets the palette style for unselected Locked palettes.
NormalSelected
 Gets or sets the palette style for selected Normal palettes.
NormalStandard
 Gets or sets the palette style for unselected Normal palettes.
WarningSelected
 Gets or sets the palette style for selected Warning palettes.
WarningStandard
 Gets or sets the palette style for unselected Warning palettes.
Top
See Also
Reference
GH_PaletteSettings Class
Grasshopper.GUI.Theme Namespace