Grasshopper API
GH_Convert Properties
The GH_Convert type exposes the following members.
Properties
Name | Description
CultureTable
 Gets the cached culture table. Do not modify this dictionary unless you know what you are doing.
Top
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace