Grasshopper API
GH_RemoveObjectAction Properties
The GH_RemoveObjectAction type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_RemoveObjectAction Class
Grasshopper.Kernel.Undo.Actions Namespace