Grasshopper API
GH_BackgroundSettings Properties
The GH_BackgroundSettings type exposes the following members.
Properties
Name | Description
Colour1
 First background colour. Depending on the background style, this colour is used in different ways.
Colour2
 Second background colour. Depending on the background style, this colour is used in different ways.
Hatch
 Background hatch brush style. This property is only used if BackgroundStyle is set to GH_ThemeBackgroundStyle.Hatch.
Style
 Canvas monochromatic flag. If True, the canvas background is a solid colour.
Top
See Also
Reference
GH_BackgroundSettings Class
Grasshopper.GUI.Theme Namespace