Grasshopper API
GH_SettingsCategory Properties
The GH_SettingsCategory type exposes the following members.
Properties
Name | Description
Description
Icon
Name
Parent
Top
See Also
Reference
GH_SettingsCategory Class
Grasshopper.GUI Namespace