Grasshopper API
GH_InstanceReferenceProxy Properties
The GH_InstanceReference.GH_InstanceReferenceProxy type exposes the following members.
Properties
Name | Description
Definition
ObjectID
Top
See Also
Reference
GH_InstanceReference.GH_InstanceReferenceProxy Class
Grasshopper.Kernel.Types Namespace