Grasshopper API
GH_TextEntity Properties
The GH_TextEntity type exposes the following members.
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_AnnotationBase.ValueType.)
Top
See Also
Reference
GH_TextEntity Class
Grasshopper.Kernel.Types Namespace