Grasshopper API
GH_MeshProxy Properties
The GH_Mesh.GH_MeshProxy type exposes the following members.
Properties
Name | Description
Area
EdgeCount
FaceCount
Manifold
ObjectID
Solid
VertexCount
Volume
Top
See Also
Reference
GH_Mesh.GH_MeshProxy Class
Grasshopper.Kernel.Types Namespace