Grasshopper API
Attributes Properties
The AnnotationToleranceSettings.Attributes type exposes the following members.
Properties
Name | Description
AlternateToleranceResolution
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
Top
See Also
Reference
AnnotationToleranceSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace