Grasshopper API
Param_AnnotationArrow Properties
The Param_AnnotationArrow type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_AnnotationArrow Class
Grasshopper.Rhinoceros.Annotations.Params Namespace