Grasshopper API
ObjectDraftingLineWidth Properties
The ObjectDraftingLineWidth type exposes the following members.
Properties
Name | Description
Source
Width
Top
See Also
Reference
ObjectDraftingLineWidth Class
Grasshopper.Rhinoceros.Drafting Namespace