Grasshopper API
Param_Predicate Properties
The Param_Predicate type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Negate
StateTags |  (Overrides GH_Param<T>.StateTags.)
Top
See Also
Reference
Param_Predicate Class
Grasshopper.Kernel.Parameters Namespace