Grasshopper API
MissingObjectItem Properties
The GH_YakDownloadFormEto.MissingObjectItem type exposes the following members.
Properties
Name | Description
Id
Name
Version
Top
See Also
Reference
GH_YakDownloadFormEto.MissingObjectItem Class
Grasshopper.GUI Namespace