Grasshopper API
GH_LinearDimension Properties
The GH_LinearDimension type exposes the following members.
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
See Also
Reference
GH_LinearDimension Class
Grasshopper.Kernel.Types Namespace