Grasshopper API
GH_ComponentAttributes Properties
The GH_ComponentAttributes type exposes the following members.
Properties
Name | Description
ContentBox
 Gets the bounds of the component area of the attributes.
HasInputGrip |  (Overrides GH_Attributes<T>.HasInputGrip.)
HasOutputGrip |  (Overrides GH_Attributes<T>.HasOutputGrip.)
PathName |  (Overrides GH_Attributes<T>.PathName.)
Top
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace