Grasshopper API
Attributes Properties
The ObjectDrafting.Attributes type exposes the following members.
Properties
Name | Description
Color
LineScale
Linetype
LineWidth
Order
Top
See Also
Reference
ObjectDrafting.Attributes Structure
Grasshopper.Rhinoceros.Drafting Namespace