Grasshopper API
GH_PreviewUtil Properties
The GH_PreviewUtil type exposes the following members.
Properties
Name | Description
Enabled
 Gets or sets the enabled state of this Preview util.
WireColour
 Gets or sets the colour to use for Preview geometry.
Top
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace