Grasshopper API
ItemDisplayColor Properties
The ItemDisplayColor type exposes the following members.
Properties
Name | Description
Color
Source
Top
See Also
Reference
ItemDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace