Grasshopper API
GH_GHALoadingEventArgs Properties
The GH_GHALoadingEventArgs type exposes the following members.
Properties
Name | Description
Assembly
 Gets the assembly that was loaded from the GHA file.
FileName
 Gets the location of the gha file.
Icon
 Gets the official icon of the GHA file.
Id
 Gets the Id of the GHA file.
LoadingMechanism
 Gets the mechanism that was used to load the file.
Name
 Gets the official name of the GHA file.
Top
See Also
Reference
GH_GHALoadingEventArgs Class
Grasshopper.Kernel Namespace