Grasshopper API
GH_ClippingPlane Properties
The GH_ClippingPlane type exposes the following members.
Properties
Name | Description
AnnotationStyle
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this clipping plane. The clipping plane is considered to be loaded when the local clipping plane instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this clipping plane. If the clipping plane is referenced but cannot be loaded, the clipping plane is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
LabelStyle
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
See Also
Reference
GH_ClippingPlane Class
Grasshopper.Kernel.Types Namespace