Grasshopper API
GH_InstanceReference Properties
The GH_InstanceReference type exposes the following members.
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
InstanceDefinition
IsGeometryLoaded
 Gets the load state of this instance reference object. The instance reference is considered to be loaded when the local instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsReferencedGeometry
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
 (Overrides GH_GeometricGoo<T>.IsReferencedGeometry.)
IsValid
 Gets the validity of this instance reference. If the instance reference is referenced but cannot be loaded, the instance reference is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ModelTransform
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_InstanceReference Class
Grasshopper.Kernel.Types Namespace