Grasshopper API
ObjectVisibility Properties
The ObjectVisibility type exposes the following members.
Properties
Name | Description
Hidden
Locked
Viewport
Top
See Also
Reference
ObjectVisibility Class
Grasshopper.Rhinoceros.Display Namespace