Grasshopper API
GH_CanvasDropTargetValidator Properties
The GH_CanvasDropTargetValidator type exposes the following members.
Properties
Name | Description
DropDelegate
 Gets or sets the delegate to be invoked when a component is dropped inside the dropregion.
DropID
 Gets or sets the ID for the allowed component.
DropRegion
 Gets or sets the dropregion for this validator. Regions are cloned so you can dispose of the original immedately after assignment.
DropText
 Gets or sets the text to display.
Top
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace