Grasshopper API
Param_ModelStandardViewport Properties
The Param_ModelStandardViewport type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelStandardViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace