Grasshopper API
GH_PathOffset Properties
The GH_PathOffset type exposes the following members.
Properties
Name | Description
ItemOffset
 Gets or sets the relative offset for branch items.
ItemWrap
 Gets or sets the ItemWrap flag.
PathOffset
 Gets access to the relative offsets for path indices.
PathWrap
 Gets or sets the PathWrap flag.
Top
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace