Grasshopper API
GH_DocumentTreeNode Properties
The GH_DocumentTreeNode type exposes the following members.
Properties
Name | Description
Document
 Gets the document at this node.
SubNodes
 Gets a collection of subnodes.
Top
See Also
Reference
GH_DocumentTreeNode Class
Grasshopper.Kernel Namespace