Grasshopper API
ModelRenderSkylight Properties
The ModelRenderSkylight type exposes the following members.
Properties
Name | Description
Enabled
Environment
EnvironmentOverride
Top
See Also
Reference
ModelRenderSkylight Class
Grasshopper.Rhinoceros.Render Namespace