Grasshopper API
GH_AddObjectAction Properties
The GH_AddObjectAction type exposes the following members.
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
See Also
Reference
GH_AddObjectAction Class
Grasshopper.Kernel.Undo.Actions Namespace