Grasshopper API
ModelHatchLine Properties
The ModelHatchLine type exposes the following members.
Properties
Name | Description
Angle
Base
Offset
Segments
Top
See Also
Reference
ModelHatchLine Class
Grasshopper.Rhinoceros.Drafting Namespace