Grasshopper API
GH_ColourPickerEventArgs Properties
The GH_ColourPickerEventArgs type exposes the following members.
Properties
Name | Description
Colour
 Gets the new value of the colour picker. This value is cached, so even if the picker subsequently updates, this property remains constant.
ColourPicker
 Gets the instance of the picker that raised the event.
Intermediate
 Gets a value indicating whether the change was an intermediate one.
Original
 Gets the original value of the colour picker. This value is cached, so even if the picker subsequently updates, this property remains constant.
Top
See Also
Reference
GH_ColourPickerEventArgs Class
Grasshopper.GUI.Base Namespace