Grasshopper API
Param_ObjectRenderMaterial Properties
The Param_ObjectRenderMaterial type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectRenderMaterial Class
Grasshopper.Rhinoceros.Render.Params Namespace