Grasshopper API
Param_ModelLayer Properties
The Param_ModelLayer type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelLayer Class
Grasshopper.Rhinoceros.Model.Params Namespace