Grasshopper API
GH_AssemblyInfoStub Properties
The GH_AssemblyInfoStub type exposes the following members.
Properties
Name | Description
AssemblyDescription |  (Overrides GH_AssemblyInfo.AssemblyDescription.)
AssemblyIcon |  (Overrides GH_AssemblyInfo.AssemblyIcon.)
AssemblyName |  (Overrides GH_AssemblyInfo.AssemblyName.)
AssemblyVersion |  (Overrides GH_AssemblyInfo.AssemblyVersion.)
AuthorContact |  (Overrides GH_AssemblyInfo.AuthorContact.)
AuthorName |  (Overrides GH_AssemblyInfo.AuthorName.)
Id |  (Overrides GH_AssemblyInfo.Id.)
Top
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace