Grasshopper API
GH_Interval Properties
The GH_Interval type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. Intervals are invalid if either of the extremes is a #NaN.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Interval Class
Grasshopper.Kernel.Types Namespace