Grasshopper API
IGH_TooltipAwareObject Properties
The IGH_TooltipAwareObject type exposes the following members.
Properties
Name | Description
TooltipEnabled
 Gets the tooltip enabled value. If False, no further tooltip functions will be called.
Top
See Also
Reference
IGH_TooltipAwareObject Interface
Grasshopper.GUI.Canvas Namespace