Grasshopper API
GH_VerticalScrollBar Properties
The GH_VerticalScrollBar type exposes the following members.
Properties
Name | Description
Grip
 Gets the actual dimensions of the scroll bar grip.
GripRegion
 Gets the grip region for this scroll bar. The Grip Region is the area in which the grip can be found. It is essentially the Client area minus the padding.
ImpliedVerticalOffset
 Gets or sets the offset of the target region as implied by the scroll ratio. If you set this value, the ratio is reverse engineered.
ScreenHeight
 Gets or sets the height of the screen area (the visible area)
TargetHeight
 Gets or sets the height of the target area (the area being scrolled)
TargetRatio
 Gets or sets the scroll ration. If the scroll ratio is changed, the OnScrollRatioChanged event will be raised.
Top
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace