Grasshopper API
GH_RuleAnyNumbers Properties
The GH_RuleAnyNumbers type exposes the following members.
Properties
Name | Description
Kind
Notation
Top
See Also
Reference
GH_RuleAnyNumbers Class
Grasshopper.Kernel.Data Namespace