Grasshopper API
GH_Alias Properties
The GH_Alias type exposes the following members.
Properties
Name | Description
Alias
 Gets or sets the alias string.
Target
 Gets or sets the alias target.
Top
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace