Grasshopper API
GH_Predicate Properties
The GH_Predicate type exposes the following members.
Properties
Name | Description
Description
Empty
False
IsValid
IsValidWhyNot
Missing
Present
True
TypeDescription
TypeName
Top
See Also
Reference
GH_Predicate Class
Grasshopper.Kernel.Types Namespace