Grasshopper API
ObjectDisplayColor Properties
The ObjectDisplayColor type exposes the following members.
Properties
Name | Description
Color
Source
Top
See Also
Reference
ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display Namespace