Grasshopper API
Attributes Properties
The ModelContent.Attributes type exposes the following members.
Properties
Name | Description
Name
 The last component of the element Path.
Notes
Parent
 Path of the parent element in 'Root::Parent' format if nested.
Path
 Full content path in 'Root::Parent::Name' format if is nested.
Tags
Top
See Also
Reference
ModelContent.Attributes Class
Grasshopper.Rhinoceros Namespace