Grasshopper API
ObjectDraftingColor Properties
The ObjectDraftingColor type exposes the following members.
Properties
Name | Description
Color
Source
Top
See Also
Reference
ObjectDraftingColor Class
Grasshopper.Rhinoceros.Drafting Namespace