Grasshopper API
Param_DisplayColorGradient Properties
The Param_DisplayColorGradient type exposes the following members.
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
Icon |  (Overrides GH_DocumentObject.Icon.)
IsPreviewCapable
Top
See Also
Reference
Param_DisplayColorGradient Class
Grasshopper.Rhinoceros.Display.Params Namespace