Grasshopper API
GH_QuickImageEditor Properties
The GH_QuickImageEditor type exposes the following members.
Properties
Name | Description
CanvasImage
 Gets or sets the canvas image.
FrameCrop
 Gets or sets the cropping rectangle.
FrameFocus
 Gets or sets the rectangle of the focus frame.
FrameViewport
 Gets or sets the rectangle of the viewport frame.
ViewportImage
 Gets or sets the viewport image.
ViewportName
 Gets or sets the viewport name to include. If the name string is null or empty, the active viewport is used.
Top
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace