Grasshopper API
GH_ConnectivityNode Properties
The GH_ConnectivityNode type exposes the following members.
Properties
Name | Description
NodeID
 Gets the InstanceID of the Parameter that this node represents.
NodeIn
 Gets the list of IDs that are connected to the input of this node.
NodeOut
 Gets the list of IDs that are connected to the input of this node.
Top
See Also
Reference
GH_ConnectivityNode Class
Grasshopper.Kernel Namespace