Grasshopper API
Attributes Properties
The AnnotationDimensionSettings.Attributes type exposes the following members.
Properties
Name | Description
BaselineSpacing
CentermarkSize
CentermarkStyle
DecimalSeparator
DimensionLineExtension
ExtensionLineExtension
ExtensionLineOffset
FixedExtension
FixedExtensionLength
RadialTextAngleType
RadialTextLocation
RadialTextOrientation
SuppressExtension1
SuppressExtension2
TextAngleType
TextLocation
TextOrientation
Top
See Also
Reference
AnnotationDimensionSettings.Attributes Class
Grasshopper.Rhinoceros.Annotations Namespace