Grasshopper API
Param_ObjectDisplayColor Properties
The Param_ObjectDisplayColor type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ObjectDisplayColor Class
Grasshopper.Rhinoceros.Display.Params Namespace