Grasshopper API
GH_ParameterContext Properties
The GH_ParameterContext type exposes the following members.
Properties
Name | Description
IsScripted
Name
RhinoDoc
SolveIndex
Top
See Also
Reference
GH_ParameterContext Class
Grasshopper.Kernel Namespace