Grasshopper API
GH_SliderEventArgs Properties
The GH_SliderEventArgs type exposes the following members.
Properties
Name | Description
Intermediate
 Gets a value indicating whether the change was an intermediate one.
Slider
 Gets the instance of the slider that raised the event.
Value
 Gets the new value of the slider. This value is cached, so even if the slider subsequently updates, this property remains constant.
Top
See Also
Reference
GH_SliderEventArgs Class
Grasshopper.GUI.Base Namespace