Grasshopper API
GH_ResizableAttributes<T> Properties
The GH_ResizableAttributes<T> generic type exposes the following members.
Properties
Name | Description
MaximumSize
MinimumSize
SizingBorders
Top
See Also
Reference
GH_ResizableAttributes<T> Class
Grasshopper.Kernel.Attributes Namespace