Grasshopper API
GH_CanvasWireValidator Properties
The GH_CanvasWireValidator type exposes the following members.
Properties
Name | Description
WireDelegate
 Gets or sets the delegate to be invoked when a wire is created.
WireMotionText
 Gets or sets the text to draw at the wire interior.
WireSource
 Gets or sets the wire source filter.
WireSourceText
 Gets or sets the text to draw at the wire source location.
WireTarget
 Gets or sets the wire target filter.
WireTargetText
 Gets or sets the text to draw at the wire target location.
Top
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace