Grasshopper API
Param_ModelPageViewport Properties
The Param_ModelPageViewport type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelPageViewport Class
Grasshopper.Rhinoceros.Display.Params Namespace