Grasshopper API
GH_Chunk Properties
The GH_Chunk type exposes the following members.
Properties
Name | Description
Archive
 Gets a pointer to the archive that owns the Root of the tree this chunk belongs to.
ArchiveLocation
 Gets a string representing the URI with which the archive is associated. The location may be a null string.
ChunkCount
 Gets the number of child chunks contained in this chunk. The set of all child chunks is referred to as a 'litter'.
Chunks
 Gets a pointer to the internal list of child chunks. Do not access this list unless you know what you are doing.
HasComments
 Gets a value that indicates whether or not comments have been stored in this chunk.
HasIndex
 Gets the index existence implication. The item is considered to have an index qualifier if the index value is larger than or equal to zero.
HasName
 Gets the name validity of this item. The item is considered to have an invalid name if string.IsNullOrEmpty(name)
Index
 Gets the index of this chunk. The index is set by the owner of this chunk. Indices smaller than zero imply no index has been set. The combination of name+index is always unique among a set of chunks in the same litter.
ItemCount
 Gets the number of items contained in this chunk.
Items
 Gets a pointer to the internal list of items. Do not access this list unless you know what you are doing.
Name
 Gets the name of this chunk. The name is set by the owner of this chunk. Names must be at least 1 character long. The combination of name+index is always unique among a set of chunks in a single litter.
Top
See Also
Reference
GH_Chunk Class
GH_IO.Serialization Namespace