Grasshopper API
GH_RuleAnyNumber Properties
The GH_RuleAnyNumber type exposes the following members.
Properties
Name | Description
Kind
Notation
Top
See Also
Reference
GH_RuleAnyNumber Class
Grasshopper.Kernel.Data Namespace