Grasshopper API
GH_LineCharge Properties
The GH_LineCharge type exposes the following members.
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Charge
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Segment
Top
See Also
Reference
GH_LineCharge Class
Grasshopper.Kernel.Types Namespace