Grasshopper API
GH_MeshingParameters Properties
The GH_MeshingParameters type exposes the following members.
Properties
Name | Description
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_MeshingParameters Class
Grasshopper.Kernel.Types Namespace