Grasshopper API
GH_StateServer Properties
The GH_StateServer type exposes the following members.
Properties
Name | Description
Names
 Gets a list of all the state names in this server.
Owner
 Gets the document that owns this server.
Top
See Also
Reference
GH_StateServer Class
Grasshopper.Kernel Namespace