Grasshopper API
IGH_ZuiAction Properties
The IGH_ZuiAction type exposes the following members.
Properties
Name | Description
Name
 Gets the display name for this action. Keep it short and sweet.
Top
See Also
Reference
IGH_ZuiAction Interface
Grasshopper.Kernel Namespace