Grasshopper API
Attributes Properties
The ModelNamedView.Attributes type exposes the following members.
Properties
Name | Description
View
Top
See Also
Reference
ModelNamedView.Attributes Class
Grasshopper.Rhinoceros.Display Namespace