Grasshopper API
GH_Transform Properties
The GH_Transform type exposes the following members.
Properties
Name | Description
CompoundTransforms
 Gets the internal set of transforms. If you modify the compound transformations, you must call ClearCaches().
IsValid |  (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_Goo<T>.Value.)
Top
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace