Grasshopper API
Orientation Properties
The Orientation type exposes the following members.
Properties
Name | Description
Name
SourceFrame
TargetFrame
Top
See Also
Reference
Orientation Class
Grasshopper.Kernel.Types.Transforms Namespace