Grasshopper API
GH_CodeString Properties
The GH_CodeString type exposes the following members.
Properties
Name | Description
Segments
Top
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace