Grasshopper API
ModelContent Properties
The ModelContent type exposes the following members.
Properties
Name | Description
Attribs
Id
IsReferencedData
IsReferencedDataLoaded
IsValid |  (Overrides ModelData.IsValid.)
IsValidWhyNot |  (Overrides ModelData.IsValidWhyNot.)
Name
Notes
Parent
Path
Tags
Top
See Also
Reference
ModelContent Class
Grasshopper.Rhinoceros Namespace