Grasshopper API
GH_RotationalFrame Properties
The GH_RotationalFrame type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the local angle of the rotation event.
Pivot
 Gets or sets the pivot of the event.
Point
 Gets or sets the location of the rotation event.
Time
 Gets or sets the time when the event was recorded.
Top
See Also
Reference
GH_RotationalFrame Structure
Grasshopper.GUI Namespace