Grasshopper API
GH_TreeRules Properties
The GH_TreeRules type exposes the following members.
Properties
Name | Description
HasItemRule
 Gets whether this rule set has a defined index rule.
HasPathRules
 Gets whether this rule set has any path rules.
PathRuleCount
 Gets the number of defined path rules.
Top
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace