Grasshopper API
DisplayColorGradient Properties
The DisplayColorGradient type exposes the following members.
Properties
Name | Description
ClippingBox
IsValid
 Gets the validity of this instance.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
DisplayColorGradient Class
Grasshopper.Rhinoceros.Display Namespace