Grasshopper API
Node3d<T> Properties
The Node3d<T> generic type exposes the following members.
Properties
Name | Description
Center
 Gets the center of the spatial region of this node. If the node contains no children the center is always in the middle of the Region. If the node does contain child-nodes, the center may be anywhere within the region.
ChildCount
 Gets the number of defined child nodes. Leaf nodes have no children. Root and twig nodes can have anywhere between 1 and 8 children.
ChildNode
 Gets the child node at the given index.
ContentAverage
 Returns the average coordinate of all items in this node. If this node does not contain any items, Point3d.Unset is returned.
ContentBoundingBox
 Returns the boundingbox of all items in this node. If this node does not contain any items, BoundingBox.Empty is returned.
IndicesLocal
 Gets the list of item indices that are contained within this node.
IndicesRecursive
 Gets the list of item indices that are contained within this node and any child nodes.
IsLeaf
 Gets whether this node is a leaf node. Leaf nodes have no child nodes.
IsMutable
 Gets whether this tree is mutable. You can only add items to mutable trees. We don't recommend removing items from unmutable trees, though that shouldn't necessarily lead to problems. Trees become unmutable after a call to ShrinkRegions(), CollapseNodes() or OptimizeTree().
IsRoot
 Gets whether this node is a root node. Root nodes have no parent node and depth zero.
IsTwig
 Gets whether this node is a twig node. Twig nodes have both parents and at least one child.
ItemCount
 Gets the total number of items stored directly in this node.
ItemsGlobal
 Gets the list of all items stored inside this entire tree. Do not modify this collection unless you know what you are doing.
ItemsLocal
 Gets a list of all the items stored directly in this node. This list is constructed every time you access this property, so keep it down to a minimum.
Limit
 Gets the subdivision limit for this tree. This limit can only be set once when you create a new tree. It is fixed forever after.
MemoryConsumption
 Gets the estimated memory consumption of the (sub)tree structure. Items inside the global list are not included in this estimate.
NextNode
 Gets the logical neighbour to the right of this node. There is no spatial relationships between logical neighbours, this is purely an iteration aid.
NodeDepth
 Gets the recursive depth of this node. The tree root is at depth zero. The first subdivision is at depth one, and so on and so forth.
ParentNode
 Gets the immediate parent of this node. Root nodes have no parent.
Region
 Gets the spatial region of this node.
RootNode
 Gets the ultimate root node for this tree.
WeightedSubdivision
 Gets or sets whether subdivision is weighted based on content averages. Setting this value will only affect future subdivisions, not existing ones.
Top
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace