Grasshopper API
ObjectSectionStyle Properties
The ObjectSectionStyle type exposes the following members.
Properties
Name | Description
SectionStyle
Source
Top
See Also
Reference
ObjectSectionStyle Class
Grasshopper.Rhinoceros.Drafting Namespace