Grasshopper API
GH_RuleNumber Properties
The GH_RuleNumber type exposes the following members.
Properties
Name | Description
Kind
Notation
Top
See Also
Reference
GH_RuleNumber Class
Grasshopper.Kernel.Data Namespace