Grasshopper API
GH_IconPicker Properties
The GH_IconPicker type exposes the following members.
Properties
Name | Description
Icon
 Gets or sets the icon to be displayed in this picker.
IconChanged
 Gets a value indicating whether or not the icon has been changed.
Top
See Also
Reference
GH_IconPicker Class
Grasshopper.GUI Namespace