Grasshopper API
GH_PaletteStyle Properties
The GH_PaletteStyle type exposes the following members.
Properties
Name | Description
Edge
 Gets or sets the edge of this style.
Fill
 Gets or sets the fill of this style.
Text
 Gets or sets the text of this style.
Top
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace