Grasshopper API
ModelStandardViewport Properties
The ModelStandardViewport type exposes the following members.
Properties
Name | Description
Space |  (Overrides ModelSpaceViewport.Space.)
ViewportType |  (Overrides ModelViewport.ViewportType.)
Top
See Also
Reference
ModelStandardViewport Class
Grasshopper.Rhinoceros.Display Namespace