Grasshopper API
GH_SignatureException Properties
The GH_SignatureException type exposes the following members.
Properties
Name | Description
Message |  (Overrides Exception.Message.)
Top
See Also
Reference
GH_SignatureException Class
Grasshopper.Kernel.Expressions Namespace