Grasshopper API
GH_Message Properties
The GH_Message type exposes the following members.
Properties
Name | Description
Message
 Gets the text content of this message.
Type
 Gets the type of this message.
Top
See Also
Reference
GH_Message Class
GH_IO.Serialization Namespace