Grasshopper API
RhMesherSettings_Proxy Properties
The GH_MeshingParameters.RhMesherSettings_Proxy type exposes the following members.
Properties
Name | Description
AngleTolerance
AspectRatio
GridMaxCount
GridMinCount
IsParsable |  (Overrides GH_GooProxy.IsParsable.)
JaggedSeams
MaxEdgeLength
MinEdgeLength
Refine
SimplePlanes
Tolerance
Top
See Also
Reference
GH_MeshingParameters.RhMesherSettings_Proxy Class
Grasshopper.Kernel.Types Namespace