Grasshopper API
GH_HiddenAction Properties
The GH_HiddenAction type exposes the following members.
Properties
Name | Description
ExpiresDisplay |  (Overrides GH_UndoAction.ExpiresDisplay.)
Top
See Also
Reference
GH_HiddenAction Class
Grasshopper.Kernel.Undo.Actions Namespace