Grasshopper API
Param_ModelRenderEnvironment Properties
The Param_ModelRenderEnvironment type exposes the following members.
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
See Also
Reference
Param_ModelRenderEnvironment Class
Grasshopper.Rhinoceros.Render.Params Namespace