Grasshopper API
GH_StateTagList Properties
The GH_StateTagList type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the boundingbox of all StateTags.
Top
See Also
Reference
GH_StateTagList Class
Grasshopper.Kernel Namespace