Grasshopper API
GH_Centermark Properties
The GH_Centermark type exposes the following members.
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
See Also
Reference
GH_Centermark Class
Grasshopper.Kernel.Types Namespace