Grasshopper API
Param_ModelTextureMapping Properties
The Param_ModelTextureMapping type exposes the following members.
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsPreviewCapable
Top
See Also
Reference
Param_ModelTextureMapping Class
Grasshopper.Rhinoceros.Render.Params Namespace