Grasshopper API
Rotation Properties
The Rotation type exposes the following members.
Properties
Name | Description
Name
RotationAngle
RotationAxis
RotationCenter
Top
See Also
Reference
Rotation Class
Grasshopper.Kernel.Types.Transforms Namespace