Grasshopper API
AnnotationUnitsSettings Properties
The AnnotationUnitsSettings type exposes the following members.
Properties
Name | Description
AngleFormat
AngleResolution
AngleRoundoff
AngleZeroSuppression
LengthDisplay
LengthFactor
LengthPrefix
LengthResolution
LengthRoundoff
LengthSuffix
LengthZeroSuppression
StackFractionFormat
StackHeightScale
Top
See Also
Reference
AnnotationUnitsSettings Class
Grasshopper.Rhinoceros.Annotations Namespace