Grasshopper API
GH_Canvas Properties
The GH_Canvas type exposes the following members.
Properties
Name | Description
ActiveInteraction
 Gets or sets the currently active interaction object.
ActiveObject
 Gets or sets the currently active object.
ActiveWidget
 Gets or sets the currently active widget.
CursorCanvasPosition
 Gets the location of the cursor in Canvas coordinates.
CursorControlPosition
 Gets the location of the cursor in Control coordinates.
DisplayVoronoiWarning
 Gets or sets whether the Voronoi Over-dose warning message is displayed. This property is set once at Grasshopper startup to True.
Document
 Gets or sets the document currently loaded in this canvas.
DrawingMode
 Gets the current drawing mode for this canvas.
HasControlWithFocus
 Gets whether or not this canvas has a child control on it with focus.
IsActiveInteraction
 Gets a value indicating whether or not there is an interaction object loaded in this canvas.
IsActiveObject
 Gets a value indicating whether or not an object is currently activated.
IsActiveWidget
 Gets a value indicating whether or not a widget is currently activated.
IsDocument
 Gets a value indicating whether or not a document is currently loaded in this canvas.
MarkovSuggestions
ModifiersEnabled
 Gets or sets the modifiers enabled flag. When modifiers are disabled, only zooming and panning is still allowed.
NavigationPanDown
 Gets or sets the special key for panning down.
NavigationPanLeft
 Gets or sets the special key for panning left.
NavigationPanPixels
 Gets or sets the number of pixels for each pan operation.
NavigationPanRight
 Gets or sets the special key for panning right.
NavigationPanUp
 Gets or sets the special key for panning up.
NavigationZoomFactor
 Gets or sets the zoom factor for navigation zoom operations.
NavigationZoomIn
 Gets or sets the special key for zooming in.
NavigationZoomOut
 Gets or sets the special key for zooming in.
Painter
 Gets the painter object that handles most of the drawing logic for this canvas.
Painting
 Gets whether this canvas is currently busy painting itself.
RecordPreviewBoundary
TagArtistIDs
 Gets all the TagArtist IDs in this Canvas.
ThumbnailSize
 Gets the thumbnail size for documents.
TooltipDelay
 Gets the delay (in milliseconds) required for a tooltip popup. This delay is a user setting stored under the Canvas:TooltipDelay field of the core settings.
Validator
 Provides access to all the validators associated with this canvas.
Viewport
 Gets the viewport that determines the panning and zooming for this canvas.
Widgets
 Gets a list of all the widgets on this canvas.
ZoomFadeHigh
 Gets the ZUI fade alpha value for the high zoom level threshold. This static field gets set on every Canvas paint start. The high threshold is typically used for ZUI elements that only appear when zoomed in.
ZoomFadeLow
 Gets the ZUI fade alpha value for the low zoom level threshold. This static field gets set on every Canvas paint start. The low threshold is typically used for fading of icons and object names.
ZoomFadeMedium
 Gets the ZUI fade alpha value for the medium zoom level threshold. This static field gets set on every Canvas paint start. The medium threshold is typically used for non-informative UI elements such as highlights.
Top
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace