Grasshopper API
GH_Interval2DProxy Properties
The GH_Interval2D.GH_Interval2DProxy type exposes the following members.
Properties
Name | Description
Area
U0
U1
UIsIncreasing
UIsNormalized
ULength
UMiddle
V0
V1
VIsIncreasing
VIsNormalized
VLength
VMiddle
Top
See Also
Reference
GH_Interval2D.GH_Interval2DProxy Class
Grasshopper.Kernel.Types Namespace