Grasshopper API
GH_GooProxy<T> Properties
The GH_GooProxy<T> generic type exposes the following members.
Properties
Name | Description
TypeDescription
TypeName
Valid
 Gets a value indicating whether this proxy represents valid data.
Top
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace