Grasshopper API
ClippingDrawingSettings Properties
The ClippingDrawingSettings type exposes the following members.
Properties
Name | Description
Annotations
AttributesSource
Background
Dimensions
Dots
Hidden
LabelStyle
Leaders
SectionHatch
SectionSurface
Silhouette
Tangents
Text
Top
See Also
Reference
ClippingDrawingSettings Class
Grasshopper.Rhinoceros.Drafting Namespace