Grasshopper API
GH_Number Properties
The GH_Number type exposes the following members.
Properties
Name | Description
IsValid
 Gets the validity of this instance. If the number is NaN, then it is considered invalid
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Number Class
Grasshopper.Kernel.Types Namespace