Grasshopper API
GH_PersistentReferenceParam<T> Properties
The GH_PersistentReferenceParam<T> generic type exposes the following members.
Properties
Name | Description
Icon |  (Overrides GH_DocumentObject.Icon.)
TypeName |  (Overrides GH_Param<T>.TypeName.)
Top
See Also
Reference
GH_PersistentReferenceParam<T> Class
Grasshopper.Kernel Namespace