Grasshopper API
GH_BoxProxy Properties
The GH_Box.GH_BoxProxy type exposes the following members.
Properties
Name | Description
Area
ObjectID
Origin
Volume
XAxis
XSize
YAxis
YSize
ZAxis
ZSize
Top
See Also
Reference
GH_Box.GH_BoxProxy Class
Grasshopper.Kernel.Types Namespace