Grasshopper API
Param_ModelObject Properties
The Param_ModelObject type exposes the following members.
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsPreviewCapable
Top
See Also
Reference
Param_ModelObject Class
Grasshopper.Rhinoceros.Model.Params Namespace