Grasshopper API
GH_Version Structure
 Basic version type. Contains Major, Minor and Revision fields.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_Version
Public Structure GH_Version
The GH_Version type exposes the following members.
Constructors
Name | Description
GH_Version(GH_Version)
 Copy constructor. Duplicate an existing version structure.
GH_Version(Int32, Int32, Int32)
 Default constructor. Create a new version from specified fields.
Top
Methods
Name | Description
Equals
 Performs value equality comparison.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Returns the hash code for this instance.
 (Overrides ValueType.GetHashCode().)
ToString
 Default formatter for Version data: M.m.RRRR Revision section is padded with zeroes until it is at least 4 digits long.
 (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Equality
 Compares two version structures for equality.
GreaterThan
 Compares versions for larger than relationships.
GreaterThanOrEqual
 Compares versions for larger than or equal to relationships.
Inequality
 Compares two version structures for inequality.
LessThan
 Compares versions for smaller than relationships.
LessThanOrEqual
 Compares versions for smaller than or equal to relationships.
Top
Fields
Name | Description
major
 Major component of version structure.
minor
 Minor component of version structure.
revision
 Revision component of version structure.
Top
See Also
Reference
GH_IO.Types Namespace