Grasshopper API
GH_ArchiveMessageViewer Class
 Viewer/Browser that displays a list of archive messages.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 GH_IO.UserInterface.GH_ArchiveMessageViewer
 Namespace: GH_IO.UserInterface
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public class GH_ArchiveMessageViewer : Form
Public Class GH_ArchiveMessageViewer
	Inherits Form
The GH_ArchiveMessageViewer type exposes the following members.
Constructors
Name | Description
GH_ArchiveMessageViewer
 Constructor.
Top
Methods
Name | Description
Dispose
 Clean up any resources being used.
 (Overrides Form.Dispose(Boolean).)
SetArchive
 Set a new archive. The messages in this archive will be displayed on the form.
Top
Extension Methods
Name | Description
ToEto() | Overloaded. (Defined by EtoExtensions.)
ToEto() | Overloaded. (Defined by EtoExtensions.)
Top
See Also
Reference
GH_IO.UserInterface Namespace