Grasshopper API
GH_Message Class
 Represents an archive log message. Messages are collected during read/write operations.
Inheritance Hierarchy
System.Object
 GH_IO.Serialization.GH_Message
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public class GH_Message
Public Class GH_Message
The GH_Message type exposes the following members.
Constructors
Name | Description
GH_Message()
 Fake constructor to avoid new instances being created by a PropertyGrid.
GH_Message(String)
 Create a new message of type GH_Message_Type.info
GH_Message(String, GH_Message_Type)
 Create a new message.
Top
Properties
Name | Description
Message
 Gets the text content of this message.
Type
 Gets the type of this message.
Top
See Also
Reference
GH_IO.Serialization Namespace