Grasshopper API
GH_Chunk.ChunkKeyedCollection Class
 Represents a collection of chunks with associated IDs
Inheritance Hierarchy
System.Object
 GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public class ChunkKeyedCollection : IEnumerable<GH_Chunk>,
	IEnumerable
Public Class ChunkKeyedCollection
	Implements IEnumerable(Of GH_Chunk), IEnumerable
The GH_Chunk.ChunkKeyedCollection type exposes the following members.
Constructors
Name | Description
GH_Chunk.ChunkKeyedCollection
 Create a new collection.
Top
Properties
Name | Description
Count
 Returns the amount in the collection.
Top
Methods
Name | Description
Add
 Adds a new chunk.
Clear
 Removes all chunks from the collection.
GetEnumerator
 Gets an enumerator that iterates over all chunks in the collection.
Remove(GH_Chunk)
 Removes a chunk.
Remove(ID)
 Removes an ID.
TryGetValue
 Try and find the chunk that belongs to a given ID.
Top
See Also
Reference
GH_IO.Serialization Namespace