Grasshopper API
GH_IXmlSupport Interface
 Interface which declares all methods required for objects that can be (de)serialized to and from an Xml archive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public interface GH_IXmlSupport
Public Interface GH_IXmlSupport
The GH_IXmlSupport type exposes the following members.
Methods
Name | Description
Read
 Called when an object is required to deserialize itself.
Write
 Called when an object is required to serialize itself.
Top
See Also
Reference
GH_IO.Serialization Namespace