Grasshopper API
GH_Message_Type Enumeration
 Message type flag.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public enum GH_Message_Type
Public Enumeration GH_Message_Type
Members
Member name | Value | Description
info | 0 |  Indicates a message represents information.
warning | 1 |  Indicates the message represents a warning. Warnings are not severe enough to be regarded as IO errors.
error | 2 |  Indicates the message represents an error. Errors mean (de)serialization failed (partially).
See Also
Reference
GH_IO.Serialization Namespace