Grasshopper API
GH_LooseChunk Class
 A utility class for creating partial archives.
Inheritance Hierarchy
System.Object
 GH_IO.Serialization.GH_Chunk
 GH_IO.Serialization.GH_LooseChunk
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public class GH_LooseChunk : GH_Chunk
Public Class GH_LooseChunk
	Inherits GH_Chunk
The GH_LooseChunk type exposes the following members.
Constructors
Name | Description
GH_LooseChunk(String)
 Create a new loose chunk. A loose chunk does not have an owner archive and thus cannot store runtime messages.
GH_LooseChunk(String, Int32)
 Create a new loose chunk. A loose chunk does not have an owner archive and thus cannot store runtime messages.
Top
Properties
Name | Description
Top
Methods
Name | Description
Deserialize_Binary
 Deserializes a byte array.
Deserialize_Xml
 Deserializes an Xml string.
Serialize_Binary
 Serializes the data tree into a byte array.
Serialize_Xml
 Serializes the data tree into an Xml string.
Top
Fields
Name | Description
Top
See Also
Reference
GH_IO.Serialization Namespace