Grasshopper API
GH_IBinarySupport Interface
 Interface which declares all methods required for objects that can be (de)serialized to and from a binary archive.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public interface GH_IBinarySupport
Public Interface GH_IBinarySupport
The GH_IBinarySupport type exposes the following members.
Methods
Name | Description
Read
 Called when an object is required to deserialize itself.
Write
 Called when an object is required to serialize itself.
Top
See Also
Reference
GH_IO.Serialization Namespace