Grasshopper API
GH_DeveloperDetails Class
 Constains a set of static fields and properties regarding developer contact details.
Inheritance Hierarchy
System.Object
 GH_IO.UserInterface.GH_DeveloperDetails
 Namespace: GH_IO.UserInterface
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public abstract class GH_DeveloperDetails
Public MustInherit Class GH_DeveloperDetails
The GH_DeveloperDetails type exposes the following members.
Properties
Name | Description
DefaultDeveloperContact
 Gets the default developer contact details.
DeveloperContact
 Gets or sets the local developer contact info (e-mail). By default, the developer email is DefaultDeveloperContact; This email address is used in the Message Report viewer when sending a support e-mail.
Top
See Also
Reference
GH_IO.UserInterface Namespace