Grasshopper API
GH_Point4D Structure
 Represents a 4D point coordinate with double precision floating point components.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_Point4D
Public Structure GH_Point4D
The GH_Point4D type exposes the following members.
Constructors
Name | Description
GH_Point4D
 Constructor.
Top
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
Fields
Name | Description
w
 W coordinate of point.
x
 X coordinate of point.
y
 Y coordinate of point.
z
 Z coordinate of point.
Top
See Also
Reference
GH_IO.Types Namespace