Grasshopper API
GH_Interval1D Structure
 Represents two double precision floating point values.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_Interval1D
Public Structure GH_Interval1D
The GH_Interval1D type exposes the following members.
Constructors
Name | Description
GH_Interval1D
 Constructor.
Top
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
Fields
Name | Description
a
 Start of interval.
b
 End of interval.
Top
See Also
Reference
GH_IO.Types Namespace