Grasshopper API
GH_Point2D Structure
 Represents a 2D point coordinate with double precision floating point components.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_Point2D
Public Structure GH_Point2D
The GH_Point2D type exposes the following members.
Constructors
Name | Description
GH_Point2D
 Constructor.
Top
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
Fields
Name | Description
x
 X coordinate of point.
y
 Y coordinate of point.
Top
See Also
Reference
GH_IO.Types Namespace