Grasshopper API
GH_Plane Structure
 Represents a 3D plane system, defined by origin point and {X,Y} axis directions.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_Plane
Public Structure GH_Plane
The GH_Plane type exposes the following members.
Constructors
Name | Description
GH_Plane(GH_Point3D, GH_Point3D, GH_Point3D)
 Constructor.
GH_Plane(Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Constructor.
Top
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
Fields
Name | Description
Origin
 Origin point of plane.
XAxis
 X axis vector of plane.
YAxis
 Y axis vector of plane.
Top
See Also
Reference
GH_IO.Types Namespace