Grasshopper API
GH_Interval2D Structure
 Represents two double precision domains.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_Interval2D
Public Structure GH_Interval2D
The GH_Interval2D type exposes the following members.
Constructors
Name | Description
GH_Interval2D(GH_Interval1D, GH_Interval1D)
 Constructor.
GH_Interval2D(Double, Double, Double, Double)
 Constructor.
Top
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
Fields
Name | Description
u
 One dimensional component in U direction.
v
 One dimensional component in V direction.
Top
See Also
Reference
GH_IO.Types Namespace