Grasshopper API
VersionNumber.Branch Enumeration
 Build branch, set by the build process.
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public enum Branch
Public Enumeration Branch
Members
Member name | Value | Description
Unset | 0 |  Uninitialized value.
Developer | 1 |  Private developer build; should never be released to the public.
Trunk | 2 |  Mainline trunk build. May be released to the public.
ReleaseCandidate | 3 |  Release candidate build. Will be released to the public.
Release | 4 |  Final Release build. Will be released to the public.
See Also
Reference
GH_IO Namespace