Grasshopper API
GH_Line Structure
 Represents a 3D line segment, denoted by start and endpoints.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_Line
Public Structure GH_Line
The GH_Line type exposes the following members.
Constructors
Name | Description
GH_Line(GH_Point3D, GH_Point3D)
 Constructor.
GH_Line(Double, Double, Double, Double, Double, Double)
 Constructor.
Top
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
Fields
Name | Description
A
 Start of line.
B
 End of line.
Top
See Also
Reference
GH_IO.Types Namespace