Grasshopper API
GH_BoundingBox Structure
 Represents a 3D bounding box, denoted by two points.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct GH_BoundingBox
Public Structure GH_BoundingBox
The GH_BoundingBox type exposes the following members.
Constructors
Name | Description
GH_BoundingBox(GH_Point3D, GH_Point3D)
 Constructor.
GH_BoundingBox(Double, Double, Double, Double, Double, Double)
 Constructor.
Top
Methods
Name | Description
ToString
 Converts this structure to a human-readable string.
 (Overrides ValueType.ToString().)
Top
Fields
Name | Description
Max
 Maximum corner of box.
Min
 Minimum corner of box.
Top
See Also
Reference
GH_IO.Types Namespace