Grasshopper API
GH_Compression Class
 Provides static methods for compression of byte-arrays.
Inheritance Hierarchy
System.Object
 GH_IO.Serialization.GH_Compression
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public sealed class GH_Compression
Public NotInheritable Class GH_Compression
The GH_Compression type exposes the following members.
Methods
Name | Description
Compress
 Compress an array of bytes using the Deflate algorithm.
Decompress
 Decompress an array of bytes using the Deflate algorithm.
Top
See Also
Reference
GH_IO.Serialization Namespace