Grasshopper API
VersionNumber Structure
 Represents a product version number that encodes major, minor, time and build branch information. as major.minor.yyddd.hhmmb where: yy = year of build - 2000 ddd = year day of build (1-366) hh = hour of build mm = minute of build b = branch of build
 Namespace: GH_IO
 Assembly: GH_IO (in GH_IO.dll)
Syntax
[SerializableAttribute]
public struct VersionNumber : IComparable,
	IComparable<VersionNumber>
<SerializableAttribute>
Public Structure VersionNumber
	Implements IComparable, IComparable(Of VersionNumber)
The VersionNumber type exposes the following members.
Constructors
Name | Description
VersionNumber(Version)
 Construct VersionNumber based on existing System.Version class.
VersionNumber(Int32, Int32, DateTime, VersionNumber.Branch)
 Initializes a new instance of the VersionNumber structure to the version specified by the parameters.
VersionNumber(Int32, Int32, Int32, Int32)
 Initializes a new instance of the VersionNumber structure to the version specified by the version quartet values.
Top
Properties
Name | Description
BuildBranch
 Gets the build branch component of this instance.
IsValid
 True when all information in the VersionNumber has valid values.
Major
 Gets the major version number component of this instance.
MaxMajorVersionNumber
 The largest possible valid value of VersionNumber.MajorVersionNumber.
MaxMinorVersionNumber
 The largest possible valid value of VersionNumber.MinorVersionNumber.
MaxValid
 The largest possible valid VersionNumber.
MaxValidBuildBranch
 Represents the largest possible valid value of VersionNumber.BuildBranch. This field is read-only.
MaxValidTime
 The largest possible valid value of VersionNumber.Time. This field is read-only.
MinMajorVersionNumber
 The smallest possible valid value of VersionNumber.MajorVersionNumber.
MinMinorVersionNumber
 The smallest possible valid value of VersionNumber.MinorVersionNumber.
Minor
 Gets the minor version number component of this instance.
MinValid
 The smallest possible valid VersionNumber.
MinValidBuildBranch
 Represents the smallest possible valid value of VersionNumber.BuildBranch. This field is read-only.
MinValidTime
 The smallest possible valid value of VersionNumber.Time. This field is read-only.
Time
 Gets the version time component of this instance.
Unset
 The Unset VersionNumber. VersionNumber.Unset.IsValid is false.
UnsetBuildBranch
 The value of an Unset VersionNumber.BuildBranch.
UnsetTime
 The value of an Unset VersionNumber.Time.
Top
Methods
Name | Description
CompareTo(Object)
 Compares the value of this instance to a specified VersionNumber value and returns an integer that indicates whether this instance is earlier than, the same as, or later than the specified VersionNumber value.
CompareTo(VersionNumber)
 Compares the value of this instance to a specified VersionNumber value and returns an integer that indicates whether this instance is earlier than, the same as, or later than the specified VersionNumber value.
ToString
 Converts the value of the current VersionNumber object to its equivalent string representation major.minor.yyddd.hhmmb. (Overrides ValueType.ToString().)
 (Overrides ValueType.ToString().)
ToVersion
 Convert this VersionNumber class to System.Version()
TryParse(String, VersionNumber)
 Converts the specified string representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
TryParse(Version, VersionNumber)
 Attempt so convert the System.Version representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
Top
See Also
Reference
GH_IO Namespace