Grasshopper API
GH_Extrusion.GH_ExtrusionProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Extrusion>
 Grasshopper.Kernel.Types.GH_Extrusion.GH_ExtrusionProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_ExtrusionProxy : GH_GooProxy<GH_Extrusion>
Public Class GH_ExtrusionProxy
	Inherits GH_GooProxy(Of GH_Extrusion)
The GH_Extrusion.GH_ExtrusionProxy type exposes the following members.
Constructors
Name | Description
GH_Extrusion.GH_ExtrusionProxy
Initializes a new instance of the GH_Extrusion.GH_ExtrusionProxy class
Top
Properties
Name | Description
Area
CapCount
ObjectID
ProfileCount
Solid
Volume
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace