Grasshopper API
GH_StateTag.DrawCallback Delegate
 Drawing delegate.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected delegate void DrawCallback(
	Graphics graphics,
	double alpha
)
Protected Delegate Sub DrawCallback (
	graphics As Graphics,
	alpha As Double
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
alpha
Type: System.Double
Floating point alpha blend (0~255).
See Also
Reference
Grasshopper.Kernel Namespace