Grasshopper API
CentralSettings.CanvasFancyWiresChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasFancyWiresChangedEventHandler()
Public Delegate Sub CanvasFancyWiresChangedEventHandler
See Also
Reference
Grasshopper Namespace