Grasshopper API
Param_Predicate Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<GH_Predicate>
 Grasshopper.Kernel.Parameters.Param_Predicate
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_Predicate : GH_Param<GH_Predicate>
Public NotInheritable Class Param_Predicate
	Inherits GH_Param(Of GH_Predicate)
The Param_Predicate type exposes the following members.
Constructors
Name | Description
Param_Predicate
Initializes a new instance of the Param_Predicate class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Negate
StateTags |  (Overrides GH_Param<T>.StateTags.)
Top
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_Param<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
Read |  (Overrides GH_Param<T>.Read(GH_IReader).)
RemoveEffects |  (Overrides GH_Param<T>.RemoveEffects().)
Write |  (Overrides GH_Param<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Parameters Namespace