Grasshopper API
GH_FontServer.ScriptFamilyChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ScriptFamilyChangedEventHandler()
Public Delegate Sub ScriptFamilyChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace