Grasshopper API
CentralSettings.RibbonSeparatorsChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void RibbonSeparatorsChangedEventHandler()
Public Delegate Sub RibbonSeparatorsChangedEventHandler
See Also
Reference
Grasshopper Namespace