Grasshopper API
GH_AnnotationBase Class
 Represents an implementation of a Rhino annotation base class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Dimension
 Grasshopper.Kernel.Types.GH_Leader
 Grasshopper.Kernel.Types.GH_TextEntity
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class GH_AnnotationBase : GH_GeometricGoo<AnnotationBase>,
	IGH_PreviewData, IGH_BakeAwareData
Public MustInherit Class GH_AnnotationBase
	Inherits GH_GeometricGoo(Of AnnotationBase)
	Implements IGH_PreviewData, IGH_BakeAwareData
The GH_AnnotationBase type exposes the following members.
Constructors
Name | Description
GH_AnnotationBase()
 Default constructor, creates an invalid annotation.
GH_AnnotationBase(AnnotationBase)
 Create a duplicate of an existing annotation.
GH_AnnotationBase(GH_AnnotationBase)
 Create a duplicate of another GH_AnnotationBase. This constructor also copies reference data.
GH_AnnotationBase(Guid)
 Create a new referenced annotation that references a Rhino dimension with the specified ID.
GH_AnnotationBase(ObjRef)
Initializes a new instance of the GH_AnnotationBase class
GH_AnnotationBase(AnnotationBase, ModelAnnotationStyle)
 Create a duplicate of an existing annotation.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this annotation object. The annotation is considered to be loaded when the local annotation instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this dimension. If the dimension is referenced but cannot be loaded, then the dimension is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
Overrides
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
Style
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
ValueType
Top
Methods
Name | Description
BakeGeometry
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the annotation is referenced, the local instance of the annotation is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateAnnotation
 Create a duplicate of this annotation.
DuplicateGeometry
 Create a duplicate of this annotation.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the annotation is referenced and not yet loaded, attempts to load the leader.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the dimension using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace