Grasshopper API
ObjectSectionStyle Class
 Represents a Rhino object section style.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Drafting.ObjectSectionStyle
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectSectionStyle : ModelValue
Public NotInheritable Class ObjectSectionStyle
	Inherits ModelValue
The ObjectSectionStyle type exposes the following members.
Constructors
Name | Description
ObjectSectionStyle()
Initializes a new instance of the ObjectSectionStyle class
ObjectSectionStyle(ObjectSectionStyle.Value)
Initializes a new instance of the ObjectSectionStyle class
Top
Properties
Name | Description
SectionStyle
Source
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Top
Operators
Name | Description
Implicit(ObjectSectionStyle to ObjectSectionStyle.Value)
Implicit(ObjectSectionStyle.Value to ObjectSectionStyle)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace