Grasshopper API
ObjectDisplayColor Class
 Represents a Rhino object display color.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Display.ObjectDisplayColor
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectDisplayColor : ModelValue
Public NotInheritable Class ObjectDisplayColor
	Inherits ModelValue
The ObjectDisplayColor type exposes the following members.
Constructors
Name | Description
ObjectDisplayColor()
Initializes a new instance of the ObjectDisplayColor class
ObjectDisplayColor(ObjectDisplayColor.Value)
Initializes a new instance of the ObjectDisplayColor class
Top
Properties
Name | Description
Color
Source
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Top
Operators
Name | Description
Implicit(ObjectDisplayColor to ObjectDisplayColor.Value)
Implicit(ObjectDisplayColor.Value to ObjectDisplayColor)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace