Grasshopper API
Param_EarthAnchorPoint Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelEarthAnchorPoint>
 Grasshopper.Kernel.GH_PersistentParam<ModelEarthAnchorPoint>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelEarthAnchorPoint>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelEarthAnchorPoint>
 Grasshopper.Rhinoceros.Model.Params.Param_EarthAnchorPoint
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_EarthAnchorPoint : ModelContentParam<ModelEarthAnchorPoint>
Public NotInheritable Class Param_EarthAnchorPoint
	Inherits ModelContentParam(Of ModelEarthAnchorPoint)
The Param_EarthAnchorPoint type exposes the following members.
Constructors
Name | Description
Param_EarthAnchorPoint
Initializes a new instance of the Param_EarthAnchorPoint class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Model.Params Namespace