Grasshopper API
ModelRenderSun.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelContent.Attributes,
	IEquatable<ModelRenderSun.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelContent.Attributes
	Implements IEquatable(Of ModelRenderSun.Attributes)
The ModelRenderSun.Attributes type exposes the following members.
Constructors
Name | Description
ModelRenderSun.Attributes
Initializes a new instance of the ModelRenderSun.Attributes class
Top
Properties
Name | Description
Altitude
Azimuth
DateTime
DaylightSavingEnabled
DaylightSavingMinutes
Direction
Enabled
Intensity
Latitude
Longitude
Manual
North
TimeZone
Top
Methods
Name | Description
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace