Grasshopper API
GH_Document.UndoStateChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void UndoStateChangedEventHandler(
	Object sender,
	GH_DocUndoEventArgs e
)
Public Delegate Sub UndoStateChangedEventHandler (
	sender As Object,
	e As GH_DocUndoEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocUndoEventArgs
See Also
Reference
Grasshopper.Kernel Namespace