Grasshopper API
IGH_TaskCapableComponent Interface
 GH_Component that can choose to support the use of Tasks to compute solutions When UseTasks returns true, the component has it's SolveInstance enumeration called twice. The first pass (InPreSolve=True) is intended solely for collecting data and starting calculation tasks. The second pass (InPreSolve=False) takes results or the tasks and sets the output.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public interface IGH_TaskCapableComponent : IGH_Component
Public Interface IGH_TaskCapableComponent
	Inherits IGH_Component
The IGH_TaskCapableComponent type exposes the following members.
Properties
Name | Description
InPreSolve
 Is set to True by the framework right before a "use tasks" pass is made on SolveIntance calls. When True, SolveInstance should be using Tasks to start calculations on input data. When False, SolveInstance should be setting the output data by either using the result of a task or directly computing the results.
UseTasks
 Returns True if the component is set to support tasks. Components can have this feature turned on/off. Note that even if UseTasks returns True, there is a chance that a multipass task based solution may not be invoked depending on if multiple calls need to be made during enumeration. You must pay attention to the value of InPreSolve during SolveInstance. The set version of this property can be called by the framework if we want to provide a technique to globally turn on/off task support for all components in a definition.
Top
Methods
Name | Description
RequestTaskCancellation
 Called by the framework when solving has been interrupted and tasks do not need to complete.
Top
See Also
Reference
Grasshopper.Kernel Namespace