Grasshopper API
GH_Structure<T>.ConversionDelegate<Tfrom, Tto> Delegate
 Represents a conversion between two types of IGH_Goo.
 Namespace: Grasshopper.Kernel.Data
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate Tto ConversionDelegate<Tfrom, Tto>(
	Tfrom data
)
where Tfrom : IGH_Goo
where Tto : IGH_Goo
Public Delegate Function ConversionDelegate(Of Tfrom As IGH_Goo, Tto As IGH_Goo) (
	data As Tfrom
) As Tto
Parameters
data
Type: Tfrom
Data to convert.
Type Parameters
Tfrom
Type to convert from.
Tto
Type to convert to.
Return Value
Type: Tto
Convered data.
See Also
Reference
Grasshopper.Kernel.Data Namespace