Grasshopper API
GH_Light Class
 Represents an implementation of a Rhino Light class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Light>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Light>
 Grasshopper.Kernel.Types.GH_Light
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_Light : GH_GeometricGoo<Light>,
	IGH_PreviewData, IGH_BakeAwareData
Public Class GH_Light
	Inherits GH_GeometricGoo(Of Light)
	Implements IGH_PreviewData, IGH_BakeAwareData
The GH_Light type exposes the following members.
Constructors
Name | Description
GH_Light()
 Default constructor, creates an new light
GH_Light(GH_Light)
 Create a duplicate of another GH_Light. This constructor also copies reference data.
GH_Light(Guid)
 Create a new referenced light that references a Rhino light with the specified ID.
GH_Light(Light)
 Create a duplicate of an existing light.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this light object. The light is considered to be loaded when the local light instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this light. If the light is referenced but cannot be loaded, then the light is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the light is referenced, the local instance of the light is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this light.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateLight
 Create a duplicate of this light.
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the light is referenced and not yet loaded, attempts to load the light.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the dimension using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace