Grasshopper API
ModelLineWidth Class
 Represents a Rhino model print width in mm.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.Drafting.ModelLineWidth
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelLineWidth : IGH_Goo,
	IEquatable<ModelLineWidth>
Public NotInheritable Class ModelLineWidth
	Implements IGH_Goo, IEquatable(Of ModelLineWidth)
The ModelLineWidth type exposes the following members.
Constructors
Name | Description
ModelLineWidth()
Initializes a new instance of the ModelLineWidth class
ModelLineWidth(Double)
Initializes a new instance of the ModelLineWidth class
Top
Properties
Name | Description
Default
Hairline
IsValid
IsValidWhyNot
None
NoPrint
TypeDescription
TypeName
Value
Top
Methods
Name | Description
Cast
CastFrom
CastTo<T>
Duplicate
EmitProxy
Equals(ModelLineWidth)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Read
ScriptVariable
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace