Grasshopper API
GH_ColourPicker.ColourChangedEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ColourChangedEventHandler(
	Object sender,
	GH_ColourPickerEventArgs e
)
Public Delegate Sub ColourChangedEventHandler (
	sender As Object,
	e As GH_ColourPickerEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Base.GH_ColourPickerEventArgs
See Also
Reference
Grasshopper.GUI Namespace