Grasshopper API
ModelContentParam<T> Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
 Grasshopper.Kernel.GH_PersistentReferenceParam<T>
 Grasshopper.Rhinoceros.Params.ModelContentParam<T>
 More...
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelContentParam<T> : GH_PersistentReferenceParam<T>,
	IGH_BakeAwareObject
where T : class, IGH_ModelContentData
Public MustInherit Class ModelContentParam(Of T As {Class, IGH_ModelContentData})
	Inherits GH_PersistentReferenceParam(Of T)
	Implements IGH_BakeAwareObject
Type Parameters
T
The ModelContentParam<T> type exposes the following members.
Constructors
Name | Description
ModelContentParam<T>
Initializes a new instance of the ModelContentParam<T> class
Top
Properties
Name | Description
IsBakeCapable
StateTags |  (Overrides GH_Param<T>.StateTags.)
Top
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_PersistentParam<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
Menu_AppendConnectRecipients |  (Overrides GH_Param<T>.Menu_AppendConnectRecipients(ToolStripDropDown).)
Menu_AppendInternaliseData |  (Overrides GH_PersistentParam<T>.Menu_AppendInternaliseData(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
RemoteIdExpired
SelectedContent
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
 Grasshopper.Kernel.GH_PersistentReferenceParam<T>
 Grasshopper.Rhinoceros.Params.ModelContentParam<T>
 Grasshopper.Rhinoceros.Annotations.Params.Param_ModelAnnotationStyle
 Grasshopper.Rhinoceros.Display.Params.Param_ModelDisplayMode
 Grasshopper.Rhinoceros.Display.Params.Param_ModelPageViewport
 Grasshopper.Rhinoceros.Display.Params.Param_ModelSpaceViewport
 Grasshopper.Rhinoceros.Display.Params.Param_ModelStandardViewport
 Grasshopper.Rhinoceros.Display.Params.Param_ObjectDisplayMode
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelHatchPattern
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelLinetype
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelSectionStyle
 Grasshopper.Rhinoceros.Model.Params.Param_EarthAnchorPoint
 Grasshopper.Rhinoceros.Model.Params.Param_ModelInstanceDefinition
 Grasshopper.Rhinoceros.Model.Params.Param_ModelLayer
 Grasshopper.Rhinoceros.Model.Params.Param_ModelObject
 Grasshopper.Rhinoceros.Params.Param_ModelContent
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderEnvironment
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderMaterial
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderSun
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderTexture
 Grasshopper.Rhinoceros.Render.Params.Param_ModelTextureMapping