Grasshopper API
ObjectDrafting.Attributes Structure
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Attributes : GH_ISerializable,
	IEquatable<ObjectDrafting.Attributes>
Public Structure Attributes
	Implements GH_ISerializable, IEquatable(Of ObjectDrafting.Attributes)
The ObjectDrafting.Attributes type exposes the following members.
Properties
Name | Description
Color
LineScale
Linetype
LineWidth
Order
Top
Methods
Name | Description
Equals(ObjectDrafting.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace