Grasshopper API
ModelPageViewport.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelPageViewport.Attributes
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelViewport.Attributes,
	IEquatable<ModelPageViewport.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelViewport.Attributes
	Implements IEquatable(Of ModelPageViewport.Attributes)
The ModelPageViewport.Attributes type exposes the following members.
Constructors
Name | Description
ModelPageViewport.Attributes
Initializes a new instance of the ModelPageViewport.Attributes class
Top
Properties
Name | Description
PageNumber
PageSettings
Top
Methods
Name | Description
ToDetails |  (Overrides ModelViewport.Attributes.ToDetails().)
ToModelData |  (Overrides ModelViewport.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace