Grasshopper API
ChildSlotNameComparer Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.Render.ChildSlotNameComparer
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class ChildSlotNameComparer : IComparer<RenderContent>
Public Class ChildSlotNameComparer
	Implements IComparer(Of RenderContent)
The ChildSlotNameComparer type exposes the following members.
Constructors
Name | Description
ChildSlotNameComparer
Initializes a new instance of the ChildSlotNameComparer class
Top
Methods
Name | Description
Compare
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace