Grasshopper API
Instances.CanvasCreatedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasCreatedEventHandler(
	GH_Canvas canvas
)
Public Delegate Sub CanvasCreatedEventHandler (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper Namespace