Grasshopper API
ObjectDraftingLinetype.Value Structure
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IEquatable<ObjectDraftingLinetype.Value>,
	IComparable<ObjectDraftingLinetype.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IEquatable(Of ObjectDraftingLinetype.Value),
	IComparable(Of ObjectDraftingLinetype.Value), IComparable
The ObjectDraftingLinetype.Value type exposes the following members.
Constructors
Name | Description
ObjectDraftingLinetype.Value(ModelLinetype)
Initializes a new instance of the ObjectDraftingLinetype.Value class
ObjectDraftingLinetype.Value(ObjectLinetypeSource)
Initializes a new instance of the ObjectDraftingLinetype.Value class
ObjectDraftingLinetype.Value(ObjectLinetypeSource, ModelLinetype)
Initializes a new instance of the ObjectDraftingLinetype.Value class
Top
Properties
Name | Description
ByLayer
ByParent
Continuous
Linetype
Source
Top
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingLinetype.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingLinetype.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Implicit(ModelLinetype to ObjectDraftingLinetype.Value)
Implicit(ObjectLinetypeSource to ObjectDraftingLinetype.Value)
Implicit(ObjectDraftingLinetype.Value to ModelLinetype)
Implicit(ObjectDraftingLinetype.Value to ObjectLinetypeSource)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace