Grasshopper API
CentralSettings.AuthorPhoneChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AuthorPhoneChangedEventHandler()
Public Delegate Sub AuthorPhoneChangedEventHandler
See Also
Reference
Grasshopper Namespace