Grasshopper API
GH_DigitScroller.ValueChangedEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ValueChangedEventHandler(
	Object sender,
	GH_DigitScrollerEventArgs e
)
Public Delegate Sub ValueChangedEventHandler (
	sender As Object,
	e As GH_DigitScrollerEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Base.GH_DigitScrollerEventArgs
See Also
Reference
Grasshopper.GUI Namespace