Grasshopper API
ClippingDrawingSettings.AttributeSource Enumeration
 Defines the source of attributes for the clipping drawing settings.
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public enum AttributeSource
Public Enumeration AttributeSource
Members
Member name | Value | Description
ByOutputLayers | 0
BySourceLayers | 1
ByInputObjects | 2
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace