Grasshopper API
GH_Slider.ValueChangedEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ValueChangedEventHandler(
	Object sender,
	GH_SliderEventArgs e
)
Public Delegate Sub ValueChangedEventHandler (
	sender As Object,
	e As GH_SliderEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Base.GH_SliderEventArgs
See Also
Reference
Grasshopper.GUI Namespace