Grasshopper API
AnnotationArrow.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationArrow.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<AnnotationArrow.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of AnnotationArrow.Attributes)
The AnnotationArrow.Attributes type exposes the following members.
Constructors
Name | Description
AnnotationArrow.Attributes
Initializes a new instance of the AnnotationArrow.Attributes class
Top
Properties
Name | Description
ArrowBlock
ArrowType
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From(ArrowType)
From(ModelInstanceDefinition)
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelData.Attributes.ToString().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace