Grasshopper API
GH_ComponentParamServer.ParameterSourcesChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ParameterSourcesChangedEventHandler(
	Object sender,
	GH_ParamServerEventArgs e
)
Public Delegate Sub ParameterSourcesChangedEventHandler (
	sender As Object,
	e As GH_ParamServerEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_ParamServerEventArgs
See Also
Reference
Grasshopper.Kernel Namespace