Grasshopper API
Param_ModelLineWidth Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelLineWidth>
 Grasshopper.Kernel.GH_PersistentParam<ModelLineWidth>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelLineWidth
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelLineWidth : GH_PersistentParam<ModelLineWidth>
Public NotInheritable Class Param_ModelLineWidth
	Inherits GH_PersistentParam(Of ModelLineWidth)
The Param_ModelLineWidth type exposes the following members.
Constructors
Name | Description
Param_ModelLineWidth
Initializes a new instance of the Param_ModelLineWidth class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
Fields
Name | Description
Values
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace