Grasshopper API
ObjectVisibility.Attributes Structure
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Attributes : GH_ISerializable,
	IEquatable<ObjectVisibility.Attributes>
Public Structure Attributes
	Implements GH_ISerializable, IEquatable(Of ObjectVisibility.Attributes)
The ObjectVisibility.Attributes type exposes the following members.
Properties
Name | Description
Hidden
Locked
Viewport
Top
Methods
Name | Description
Equals(ObjectVisibility.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace