Grasshopper API
ModelHatchPattern Class
 Represents a Rhino model hatch pattern. Wraps the functionality of the HatchPattern type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Drafting.ModelHatchPattern
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelHatchPattern : ModelComponentContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelHatchPattern
	Inherits ModelComponentContent
	Implements IGH_BakeAwareData
The ModelHatchPattern type exposes the following members.
Constructors
Name | Description
ModelHatchPattern()
Initializes a new instance of the ModelHatchPattern class
ModelHatchPattern(ModelHatchPattern.Attributes)
Initializes a new instance of the ModelHatchPattern class
ModelHatchPattern(Guid)
Initializes a new instance of the ModelHatchPattern class
ModelHatchPattern(HatchPattern)
Initializes a new instance of the ModelHatchPattern class
Top
Properties
Name | Description
FillType
Lines
Name |  (Overrides ModelContent.Name.)
Units
Unset
Top
Methods
Name | Description
Cast
ToAttributes
Top
Operators
Name | Description
Implicit(ModelHatchPattern.Attributes to ModelHatchPattern)
Implicit(HatchPattern to ModelHatchPattern)
Implicit(String to ModelHatchPattern)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace