Grasshopper API
GH_FontScroller.PostPaint Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PostPaint(
	Graphics graphics
)
Public Delegate Sub PostPaint (
	graphics As Graphics
)
Parameters
graphics
Type: System.Drawing.Graphics
See Also
Reference
Grasshopper.GUI Namespace