Grasshopper API
Param_AnnotationLeaderSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationLeaderSettings>
 Grasshopper.Rhinoceros.Params.ModelDataParam<AnnotationLeaderSettings>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationLeaderSettings
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationLeaderSettings : ModelDataParam<AnnotationLeaderSettings>
Public NotInheritable Class Param_AnnotationLeaderSettings
	Inherits ModelDataParam(Of AnnotationLeaderSettings)
The Param_AnnotationLeaderSettings type exposes the following members.
Constructors
Name | Description
Param_AnnotationLeaderSettings
Initializes a new instance of the Param_AnnotationLeaderSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace