Grasshopper API
GH_OrdinateDimension Class
 Represents an implementation of a Rhino ordinate dimension.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Dimension
 Grasshopper.Kernel.Types.GH_OrdinateDimension
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_OrdinateDimension : GH_Dimension
Public Class GH_OrdinateDimension
	Inherits GH_Dimension
The GH_OrdinateDimension type exposes the following members.
Constructors
Name | Description
GH_OrdinateDimension()
 Default constructor, creates an invalid ordinate dimension.
GH_OrdinateDimension(GH_OrdinateDimension)
 Create a duplicate of another GH_OrdinateDimension. This constructor also copies reference data.
GH_OrdinateDimension(Guid)
 Create a new referenced ordinate dimension that references a Rhino dimension with the specified ID.
GH_OrdinateDimension(OrdinateDimension)
 Create a duplicate of an existing ordinate dimension.
GH_OrdinateDimension(OrdinateDimension, ModelAnnotationStyle)
 Create a duplicate of an existing ordinate dimension.
Top
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateOrdinateDimension
 Create a duplicate of this ordinate dimension.
ToString
 Format the dimension using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace