Grasshopper API
ObjectRender.Attributes Structure
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Attributes : GH_ISerializable,
	IEquatable<ObjectRender.Attributes>
Public Structure Attributes
	Implements GH_ISerializable, IEquatable(Of ObjectRender.Attributes)
The ObjectRender.Attributes type exposes the following members.
Properties
Name | Description
CastsShadows
Material
MeshingParameters
ReceivesShadows
TextureMappings
Top
Methods
Name | Description
Equals(ObjectRender.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace