Grasshopper API
Param_ModelSpaceViewport.ViewportItem Structure
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct ViewportItem
Public Structure ViewportItem
The Param_ModelSpaceViewport.ViewportItem type exposes the following members.
Properties
Name | Description
DescriptiveName
Top
Fields
Name | Description
ModelSpaceViewport
Name
Page
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace