Grasshopper API
ModelEarthAnchorPoint Class
 Represents a Rhino Earth anchor point. Wraps the functionality of the EarthAnchorPoint type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelEarthAnchorPoint : ModelContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelEarthAnchorPoint
	Inherits ModelContent
	Implements IGH_BakeAwareData
The ModelEarthAnchorPoint type exposes the following members.
Constructors
Name | Description
ModelEarthAnchorPoint()
Initializes a new instance of the ModelEarthAnchorPoint class
ModelEarthAnchorPoint(ModelEarthAnchorPoint.Attributes)
Initializes a new instance of the ModelEarthAnchorPoint class
ModelEarthAnchorPoint(EarthAnchorPoint)
Initializes a new instance of the ModelEarthAnchorPoint class
Top
Properties
Name | Description
Elevation
 Gets a point elevation on earth, in meters.
ElevationCoordinateSystem
 Gets the value indicating the zero level convention relating to a location on Earth
Latitude
 Gets a point latitude on earth, in degrees. [-90, +90]
Longitude
 Gets a point longitude on earth, in degrees. [-180, +180]
ModelCompass
 Gets the corresponding compass plane in model coordinates
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
TooltipString |  (Overrides ModelContent.TooltipString().)
ToString |  (Overrides ModelContent.ToString().)
Top
Operators
Name | Description
Implicit(ModelEarthAnchorPoint.Attributes to ModelEarthAnchorPoint)
Implicit(EarthAnchorPoint to ModelEarthAnchorPoint)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace