Grasshopper API
CentralSettings.LoadProtectionChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void LoadProtectionChangedEventHandler(
	string pluginName
)
Public Delegate Sub LoadProtectionChangedEventHandler (
	pluginName As String
)
Parameters
pluginName
Type: System.String
See Also
Reference
Grasshopper Namespace