Grasshopper API
CentralSettings.CanvasObjectIconsChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasObjectIconsChangedEventHandler()
Public Delegate Sub CanvasObjectIconsChangedEventHandler
See Also
Reference
Grasshopper Namespace