Grasshopper API
GH_AutoSaveSettings.SaveOnDocumentUnloadChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SaveOnDocumentUnloadChangedEventHandler()
Public Delegate Sub SaveOnDocumentUnloadChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace