Grasshopper API
ModelStandardViewport Class
 Represents a Rhino standard modeling viewport. Wraps the main viewport of a modeling RhinoView instance.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelViewport
 Grasshopper.Rhinoceros.Display.ModelSpaceViewport
 Grasshopper.Rhinoceros.Display.ModelStandardViewport
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelStandardViewport : ModelSpaceViewport
Public NotInheritable Class ModelStandardViewport
	Inherits ModelSpaceViewport
The ModelStandardViewport type exposes the following members.
Constructors
Name | Description
ModelStandardViewport()
Initializes a new instance of the ModelStandardViewport class
ModelStandardViewport(ModelStandardViewport.Attributes)
Initializes a new instance of the ModelStandardViewport class
ModelStandardViewport(Guid)
Initializes a new instance of the ModelStandardViewport class
ModelStandardViewport(RhinoViewport)
Initializes a new instance of the ModelStandardViewport class
Top
Properties
Name | Description
Space |  (Overrides ModelSpaceViewport.Space.)
ViewportType |  (Overrides ModelViewport.ViewportType.)
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelSpaceViewport.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelStandardViewport.Attributes to ModelStandardViewport)
Implicit(RhinoViewport to ModelStandardViewport)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace