Grasshopper API
CentralSettings.PreviewPlaneRadiusChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PreviewPlaneRadiusChangedEventHandler()
Public Delegate Sub PreviewPlaneRadiusChangedEventHandler
See Also
Reference
Grasshopper Namespace