Grasshopper API
CentralSettings.CanvasToolbarChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasToolbarChangedEventHandler()
Public Delegate Sub CanvasToolbarChangedEventHandler
See Also
Reference
Grasshopper Namespace