Grasshopper API
CentralSettings.ComponentCascadeMenusChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ComponentCascadeMenusChangedEventHandler()
Public Delegate Sub ComponentCascadeMenusChangedEventHandler
See Also
Reference
Grasshopper Namespace