Grasshopper API
GH_Centermark Class
 Represents an implementation of a Rhino centermark.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Dimension
 Grasshopper.Kernel.Types.GH_Centermark
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_Centermark : GH_Dimension
Public Class GH_Centermark
	Inherits GH_Dimension
The GH_Centermark type exposes the following members.
Constructors
Name | Description
GH_Centermark()
 Default constructor, creates an invalid centermark.
GH_Centermark(Centermark)
 Create a duplicate of an existing centermark.
GH_Centermark(GH_Centermark)
 Create a duplicate of another GH_Centermark. This constructor also copies reference data.
GH_Centermark(Guid)
 Create a new referenced centermark that references a Rhino centermark with the specified ID.
GH_Centermark(Centermark, ModelAnnotationStyle)
 Create a duplicate of an existing centermark.
Top
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateCentermark
 Create a duplicate of this centermark.
ToString
 Format the centermark using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace