Grasshopper API
Param_DateTimeFormat Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationDateTimeFormat>
 Grasshopper.Kernel.GH_PersistentParam<AnnotationDateTimeFormat>
 Grasshopper.Rhinoceros.Annotations.Params.Param_DateTimeFormat
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_DateTimeFormat : GH_PersistentParam<AnnotationDateTimeFormat>
Public NotInheritable Class Param_DateTimeFormat
	Inherits GH_PersistentParam(Of AnnotationDateTimeFormat)
The Param_DateTimeFormat type exposes the following members.
Constructors
Name | Description
Param_DateTimeFormat
Initializes a new instance of the Param_DateTimeFormat class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace