Grasshopper API
ModelAnnotationStyle.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelAnnotationStyle.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelAnnotationStyle.Attributes)
The ModelAnnotationStyle.Attributes type exposes the following members.
Constructors
Name | Description
ModelAnnotationStyle.Attributes
Initializes a new instance of the ModelAnnotationStyle.Attributes class
Top
Properties
Name | Description
ArrowSettings
DimensionScale
DimensionSettings
LeaderSettings
TextSettings
ToleranceSettings
UnitsSettings
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
Operators
Name | Description
Implicit(String to ModelAnnotationStyle.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace