Grasshopper API
GH_Document.EnabledChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void EnabledChangedEventHandler(
	Object sender,
	GH_DocEnabledEventArgs e
)
Public Delegate Sub EnabledChangedEventHandler (
	sender As Object,
	e As GH_DocEnabledEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocEnabledEventArgs
See Also
Reference
Grasshopper.Kernel Namespace