Grasshopper API
CentralSettings.TemplateFileChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void TemplateFileChangedEventHandler()
Public Delegate Sub TemplateFileChangedEventHandler
See Also
Reference
Grasshopper Namespace