Grasshopper API
ObjectVisibility Class
 Represents a Rhino object visibility attributes.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Display.ObjectVisibility
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectVisibility : ModelValue
Public NotInheritable Class ObjectVisibility
	Inherits ModelValue
The ObjectVisibility type exposes the following members.
Constructors
Name | Description
ObjectVisibility()
Initializes a new instance of the ObjectVisibility class
ObjectVisibility(ObjectVisibility.Attributes)
Initializes a new instance of the ObjectVisibility class
Top
Properties
Name | Description
Hidden
Locked
Viewport
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToDetails
Top
Operators
Name | Description
Implicit(ObjectVisibility.Attributes to ObjectVisibility)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace