Grasshopper API
GH_Document.SolutionEndEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SolutionEndEventHandler(
	Object sender,
	GH_SolutionEventArgs e
)
Public Delegate Sub SolutionEndEventHandler (
	sender As Object,
	e As GH_SolutionEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_SolutionEventArgs
See Also
Reference
Grasshopper.Kernel Namespace