Grasshopper API
ObjectSectionStyle.Value Structure
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IStructuralEquatable,
	IEquatable<ObjectSectionStyle.Value>, IComparable<ObjectSectionStyle.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IStructuralEquatable, IEquatable(Of ObjectSectionStyle.Value),
	IComparable(Of ObjectSectionStyle.Value), IComparable
The ObjectSectionStyle.Value type exposes the following members.
Constructors
Name | Description
ObjectSectionStyle.Value(ModelSectionStyle)
Initializes a new instance of the ObjectSectionStyle.Value class
ObjectSectionStyle.Value(ObjectSectionAttributesSource)
Initializes a new instance of the ObjectSectionStyle.Value class
ObjectSectionStyle.Value(ObjectSectionAttributesSource, ModelSectionStyle)
Initializes a new instance of the ObjectSectionStyle.Value class
Top
Properties
Name | Description
ByLayer
ByObject
ByParent
BySectioner
SectionStyle
Source
Top
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectSectionStyle.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectSectionStyle.Value)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetHashCode(IEqualityComparer)
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Implicit(ModelSectionStyle to ObjectSectionStyle.Value)
Implicit(ObjectSectionAttributesSource to ObjectSectionStyle.Value)
Implicit(ObjectSectionStyle.Value to ModelSectionStyle)
Implicit(ObjectSectionStyle.Value to ObjectSectionAttributesSource)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace