Grasshopper API
ModelUnitSystem.Value Structure
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IEquatable<ModelUnitSystem.Value>,
	IComparable<ModelUnitSystem.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IEquatable(Of ModelUnitSystem.Value),
	IComparable(Of ModelUnitSystem.Value), IComparable
The ModelUnitSystem.Value type exposes the following members.
Constructors
Name | Description
ModelUnitSystem.Value(LengthUnit)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(ActiveSpace, String)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(UnitSystem, String)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(UnitSystem, String, Double)
Initializes a new instance of the ModelUnitSystem.Value class
ModelUnitSystem.Value(ModelUnitSystem.Value, String, Nullable<Double>)
Initializes a new instance of the ModelUnitSystem.Value class
Top
Properties
Name | Description
ActiveSpace
BaseSystem
Factor
Feet
Inches
Meters
MetersPerUnit
Millimeters
ModelUnits
Name
None
PageUnits
Symbol
Unset
Top
Methods
Name | Description
AdjustDocumentUnitSystem
CompareTo(Object)
CompareTo(ModelUnitSystem.Value)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ModelUnitSystem.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToLengthUnit
ToNonCustomUnitSystem
ToString |  (Overrides ValueType.ToString().)
ToUnitSystem
Top
Operators
Name | Description
Equality
Inequality
Top
Fields
Name | Description
_Factor
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace