Grasshopper API
Param_ObjectRenderMaterial Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectRenderMaterial>
 Grasshopper.Kernel.GH_PersistentParam<ObjectRenderMaterial>
 Grasshopper.Rhinoceros.Render.Params.Param_ObjectRenderMaterial
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectRenderMaterial : GH_PersistentParam<ObjectRenderMaterial>
Public NotInheritable Class Param_ObjectRenderMaterial
	Inherits GH_PersistentParam(Of ObjectRenderMaterial)
The Param_ObjectRenderMaterial type exposes the following members.
Constructors
Name | Description
Param_ObjectRenderMaterial
Initializes a new instance of the Param_ObjectRenderMaterial class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace