Grasshopper API
EtoExtensions.EtoWin32Window Class
Inheritance Hierarchy
System.Object
 Grasshopper.EtoExtensions.EtoWin32Window
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class EtoWin32Window : IWin32Window
Public Class EtoWin32Window
	Implements IWin32Window
The EtoExtensions.EtoWin32Window type exposes the following members.
Properties
Name | Description
Handle
Top
Extension Methods
Name | Description
ToEtoWindow |  (Defined by EtoExtensions.)
Top
See Also
Reference
Grasshopper Namespace