Grasshopper API
GH_YakDownloadFormEto Class
Inheritance Hierarchy
Dialog
 Grasshopper.GUI.GH_YakDownloadFormEto
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class GH_YakDownloadFormEto : Dialog
Public NotInheritable Class GH_YakDownloadFormEto
	Inherits Dialog
The GH_YakDownloadFormEto type exposes the following members.
Constructors
Name | Description
GH_YakDownloadFormEto
Initializes a new instance of the GH_YakDownloadFormEto class
Top
See Also
Reference
Grasshopper.GUI Namespace