Grasshopper API
GH_Document.SolutionStartEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SolutionStartEventHandler(
	Object sender,
	GH_SolutionEventArgs e
)
Public Delegate Sub SolutionStartEventHandler (
	sender As Object,
	e As GH_SolutionEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_SolutionEventArgs
See Also
Reference
Grasshopper.Kernel Namespace