Grasshopper API
Param_ModelHatchPattern Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelHatchPattern>
 Grasshopper.Kernel.GH_PersistentParam<ModelHatchPattern>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelHatchPattern>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelHatchPattern>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelHatchPattern
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelHatchPattern : ModelContentParam<ModelHatchPattern>
Public NotInheritable Class Param_ModelHatchPattern
	Inherits ModelContentParam(Of ModelHatchPattern)
The Param_ModelHatchPattern type exposes the following members.
Constructors
Name | Description
Param_ModelHatchPattern
Initializes a new instance of the Param_ModelHatchPattern class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace