Grasshopper API
GH_Predicate Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Predicate
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class GH_Predicate : IGH_Goo
Public NotInheritable Class GH_Predicate
	Implements IGH_Goo
The GH_Predicate type exposes the following members.
Constructors
Name | Description
GH_Predicate
Initializes a new instance of the GH_Predicate class
Top
Properties
Name | Description
Description
Empty
False
IsValid
IsValidWhyNot
Missing
Present
True
TypeDescription
TypeName
Top
Methods
Name | Description
Cast
CastTo<T>
Duplicate
EmitProxy
Format
Invoke
Negate
Read
ScriptVariable
ToString |  (Overrides Object.ToString().)
TryCastTo<T>
Write
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace