Grasshopper API
GH_ComponentServer.GHAFileLoadedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void GHAFileLoadedEventHandler(
	Object sender,
	GH_GHALoadingEventArgs e
)
Public Delegate Sub GHAFileLoadedEventHandler (
	sender As Object,
	e As GH_GHALoadingEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_GHALoadingEventArgs
See Also
Reference
Grasshopper.Kernel Namespace