Grasshopper API
ObjectDraftingColor.Value Structure
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IEquatable<ObjectDraftingColor.Value>,
	IComparable<ObjectDraftingColor.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IEquatable(Of ObjectDraftingColor.Value),
	IComparable(Of ObjectDraftingColor.Value), IComparable
The ObjectDraftingColor.Value type exposes the following members.
Constructors
Name | Description
ObjectDraftingColor.Value(ModelColor)
Initializes a new instance of the ObjectDraftingColor.Value class
ObjectDraftingColor.Value(ObjectPlotColorSource)
Initializes a new instance of the ObjectDraftingColor.Value class
ObjectDraftingColor.Value(ObjectPlotColorSource, ModelColor)
Initializes a new instance of the ObjectDraftingColor.Value class
Top
Properties
Name | Description
ByDisplay
ByLayer
ByParent
Color
Source
Top
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingColor.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingColor.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Implicit(ModelColor to ObjectDraftingColor.Value)
Implicit(ObjectPlotColorSource to ObjectDraftingColor.Value)
Implicit(ObjectDraftingColor.Value to ModelColor)
Implicit(ObjectDraftingColor.Value to ObjectPlotColorSource)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace