Grasshopper API
Param_ObjectSectionStyle Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectSectionStyle>
 Grasshopper.Kernel.GH_PersistentParam<ObjectSectionStyle>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectSectionStyle
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectSectionStyle : GH_PersistentParam<ObjectSectionStyle>
Public NotInheritable Class Param_ObjectSectionStyle
	Inherits GH_PersistentParam(Of ObjectSectionStyle)
The Param_ObjectSectionStyle type exposes the following members.
Constructors
Name | Description
Param_ObjectSectionStyle
Initializes a new instance of the Param_ObjectSectionStyle class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace