Grasshopper API
AnnotationUnitsSettings Class
 Represents annotation units settings.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationUnitsSettings : ModelData
Public NotInheritable Class AnnotationUnitsSettings
	Inherits ModelData
The AnnotationUnitsSettings type exposes the following members.
Constructors
Name | Description
AnnotationUnitsSettings()
Initializes a new instance of the AnnotationUnitsSettings class
AnnotationUnitsSettings(AnnotationUnitsSettings.Attributes)
Initializes a new instance of the AnnotationUnitsSettings class
AnnotationUnitsSettings(DimensionStyle)
Initializes a new instance of the AnnotationUnitsSettings class
Top
Properties
Name | Description
AngleFormat
AngleResolution
AngleRoundoff
AngleZeroSuppression
LengthDisplay
LengthFactor
LengthPrefix
LengthResolution
LengthRoundoff
LengthSuffix
LengthZeroSuppression
StackFractionFormat
StackHeightScale
Top
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
Operators
Name | Description
Explicit(AnnotationUnitsSettings to DimensionStyle)
Implicit(AnnotationUnitsSettings.Attributes to AnnotationUnitsSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace