Grasshopper API
GH_PointCloud Class
 Represents a point cloud.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<PointCloud>
 Grasshopper.Kernel.Types.GH_GeometricGoo<PointCloud>
 Grasshopper.Kernel.Types.GH_PointCloud
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_PointCloud : GH_GeometricGoo<PointCloud>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_PointCloud
	Inherits GH_GeometricGoo(Of PointCloud)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_PointCloud type exposes the following members.
Constructors
Name | Description
GH_PointCloud()
 Default constructor, creates an invalid curve.
GH_PointCloud(GH_PointCloud)
 Create a duplicate of another GH_PointCloud. This constructor also copies reference data.
GH_PointCloud(Guid)
 Create a new referenced curve that references a Rhino curve object with the specified ID.
GH_PointCloud(PointCloud)
 Create a duplicate of an existing point-cloud.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this curve object. The curve is considered to be loaded when the local OnCurve instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this curve. If the curve is referenced but cannot be loaded, the curve is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the curve is referenced, the local instance of the curve is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this curve.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicatePointCloud
 Create a duplicate of this curve.
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the curve is referenced and not yet loaded, attempts to load the curve.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the curve using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace