Grasshopper API
IGH_ReferencedData Interface
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public interface IGH_ReferencedData : IGH_Goo
Public Interface IGH_ReferencedData
	Inherits IGH_Goo
The IGH_ReferencedData type exposes the following members.
Properties
Name | Description
IsReferencedData
IsReferencedDataLoaded
Top
Methods
Name | Description
LoadReferencedData
UnloadReferencedData
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace