Grasshopper API
ModelRenderSun Class
 Represents a Rhino sun. Wraps the functionality of the Sun type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Render.ModelRenderSun
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelRenderSun : ModelContent,
	IGH_PreviewData
Public NotInheritable Class ModelRenderSun
	Inherits ModelContent
	Implements IGH_PreviewData
The ModelRenderSun type exposes the following members.
Constructors
Name | Description
ModelRenderSun
Initializes a new instance of the ModelRenderSun class
Top
Properties
Name | Description
Altitude
Azimuth
DateTime
DaylightSavingEnabled
DaylightSavingMinutes
Direction
Enabled
Intensity
Latitude
Longitude
Manual
North
TimeZone
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelRenderSun.Attributes to ModelRenderSun)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace