Grasshopper API
GH_AngularDimension Class
 Represents an implementation of a Rhino angular dimension.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Dimension
 Grasshopper.Kernel.Types.GH_AngularDimension
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_AngularDimension : GH_Dimension
Public Class GH_AngularDimension
	Inherits GH_Dimension
The GH_AngularDimension type exposes the following members.
Constructors
Name | Description
GH_AngularDimension()
 Default constructor, creates an invalid angular dimension.
GH_AngularDimension(AngularDimension)
 Create a duplicate of an existing angular dimension.
GH_AngularDimension(GH_AngularDimension)
 Create a duplicate of another GH_AngularDimension. This constructor also copies reference data.
GH_AngularDimension(Guid)
 Create a new referenced angular dimension that references a Rhino dimension with the specified ID.
GH_AngularDimension(AngularDimension, ModelAnnotationStyle)
 Create a duplicate of an existing angular dimension.
Top
Properties
Name | Description
Arc
DimlinePoint
Line1
Line2
Offset
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
DuplicateAngularDimension
 Create a duplicate of this angular dimension.
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
ToString
 Format the dimension using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace