Grasshopper API
ModelRenderMaterial Class
 Represents a Rhino render material. Wraps the functionality of the RenderMaterial type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Render.ModelRenderContent
 Grasshopper.Rhinoceros.Render.ModelRenderMaterial
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelRenderMaterial : ModelRenderContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelRenderMaterial
	Inherits ModelRenderContent
	Implements IGH_BakeAwareData
The ModelRenderMaterial type exposes the following members.
Constructors
Name | Description
ModelRenderMaterial()
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(ModelRenderMaterial.Attributes)
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(Guid)
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(Material)
Initializes a new instance of the ModelRenderMaterial class
ModelRenderMaterial(RenderMaterial)
Initializes a new instance of the ModelRenderMaterial class
Top
Properties
Name | Description
Name |  (Overrides ModelContent.Name.)
TypeName |  (Overrides ModelRenderContent.TypeName.)
Unset
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelRenderMaterial.Attributes to ModelRenderMaterial)
Implicit(ColorRGBA to ModelRenderMaterial)
Implicit(Material to ModelRenderMaterial)
Implicit(RenderMaterial to ModelRenderMaterial)
Implicit(String to ModelRenderMaterial)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace