Grasshopper API
Param_ModelRenderMaterial Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelRenderMaterial>
 Grasshopper.Kernel.GH_PersistentParam<ModelRenderMaterial>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelRenderMaterial>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelRenderMaterial>
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderMaterial
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelRenderMaterial : ModelContentParam<ModelRenderMaterial>
Public NotInheritable Class Param_ModelRenderMaterial
	Inherits ModelContentParam(Of ModelRenderMaterial)
The Param_ModelRenderMaterial type exposes the following members.
Constructors
Name | Description
Param_ModelRenderMaterial
Initializes a new instance of the Param_ModelRenderMaterial class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace