Grasshopper API
GH_LinearDimension Class
 Represents an implementation of a Rhino linear dimension.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Dimension
 Grasshopper.Kernel.Types.GH_LinearDimension
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_LinearDimension : GH_Dimension
Public Class GH_LinearDimension
	Inherits GH_Dimension
The GH_LinearDimension type exposes the following members.
Constructors
Name | Description
GH_LinearDimension()
 Default constructor, creates an invalid linear dimension.
GH_LinearDimension(GH_LinearDimension)
 Create a duplicate of another GH_LinearDimension. This constructor also copies reference data.
GH_LinearDimension(Guid)
 Create a new referenced linear dimension that references a Rhino dimension with the specified ID.
GH_LinearDimension(LinearDimension)
 Create a duplicate of an existing linear dimension.
GH_LinearDimension(LinearDimension, ModelAnnotationStyle)
 Create a duplicate of an existing linear dimension.
Top
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateLinearDimension
 Create a duplicate of this linear dimension.
ToString
 Format the dimension using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace