Grasshopper API
GH_PreviewBoundary Class
 A closed boundary for filtering previewed objects.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_PreviewBoundary
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_PreviewBoundary : GH_ISerializable
Public Class GH_PreviewBoundary
	Implements GH_ISerializable
The GH_PreviewBoundary type exposes the following members.
Constructors
Name | Description
GH_PreviewBoundary
 Create a new preview boundary.
Top
Properties
Name | Description
Boundary
 Gets the boundary region.
Limits
 Gets the limits of the boundary.
Points
 Gets the array of points this boundary was made from.
Top
Methods
Name | Description
IsVisible
 Gets whether a specific object is visible within this boundary.
Read
Write
Top
See Also
Reference
Grasshopper.Kernel Namespace