Grasshopper API
Param_ObjectDraftingLinetype Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectDraftingLinetype>
 Grasshopper.Kernel.GH_PersistentParam<ObjectDraftingLinetype>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectDraftingLinetype
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectDraftingLinetype : GH_PersistentParam<ObjectDraftingLinetype>
Public NotInheritable Class Param_ObjectDraftingLinetype
	Inherits GH_PersistentParam(Of ObjectDraftingLinetype)
The Param_ObjectDraftingLinetype type exposes the following members.
Constructors
Name | Description
Param_ObjectDraftingLinetype
Initializes a new instance of the Param_ObjectDraftingLinetype class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace