Grasshopper API
GH_FontServer.ConsoleFamilyChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ConsoleFamilyChangedEventHandler()
Public Delegate Sub ConsoleFamilyChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace