Grasshopper API
CentralSettings.TooltipWiggleRadiusChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void TooltipWiggleRadiusChangedEventHandler()
Public Delegate Sub TooltipWiggleRadiusChangedEventHandler
See Also
Reference
Grasshopper Namespace