Grasshopper API
ObjectDisplay Class
 Represents a Rhino object display attributes.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Display.ObjectDisplay
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectDisplay : ModelValue
Public NotInheritable Class ObjectDisplay
	Inherits ModelValue
The ObjectDisplay type exposes the following members.
Constructors
Name | Description
ObjectDisplay()
Initializes a new instance of the ObjectDisplay class
ObjectDisplay(ObjectDisplay.Attributes)
Initializes a new instance of the ObjectDisplay class
Top
Properties
Name | Description
Color
WireDensity
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToDetails
Top
Operators
Name | Description
Implicit(ObjectDisplay.Attributes to ObjectDisplay)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace