Grasshopper API
CentralSettings.PruderyLevelChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PruderyLevelChangedEventHandler()
Public Delegate Sub PruderyLevelChangedEventHandler
See Also
Reference
Grasshopper Namespace