Grasshopper API
DisplayColorGradient Class
 Represents a gradient colour stop. Wraps the functionality of the ColorGradient type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<ColorGradient>
 Grasshopper.Rhinoceros.Display.DisplayColorGradient
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class DisplayColorGradient : GH_Goo<ColorGradient>,
	IGH_PreviewData
Public NotInheritable Class DisplayColorGradient
	Inherits GH_Goo(Of ColorGradient)
	Implements IGH_PreviewData
The DisplayColorGradient type exposes the following members.
Constructors
Name | Description
DisplayColorGradient()
 Blank constructor
DisplayColorGradient(ColorGradient)
Initializes a new instance of the DisplayColorGradient class
DisplayColorGradient(DisplayColorGradient)
Initializes a new instance of the DisplayColorGradient class
Top
Properties
Name | Description
ClippingBox
IsValid
 Gets the validity of this instance.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateColourGradient
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace