Grasshopper API
CentralSettings.PreviewGumballsChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PreviewGumballsChangedEventHandler()
Public Delegate Sub PreviewGumballsChangedEventHandler
See Also
Reference
Grasshopper Namespace