Grasshopper API
GH_YakDownloadFormEto.MissingObjectItem Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_YakDownloadFormEto.MissingObjectItem
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class MissingObjectItem
Public NotInheritable Class MissingObjectItem
The GH_YakDownloadFormEto.MissingObjectItem type exposes the following members.
Constructors
Name | Description
GH_YakDownloadFormEto.MissingObjectItem
Initializes a new instance of the GH_YakDownloadFormEto.MissingObjectItem class
Top
Properties
Name | Description
Id
Name
Version
Top
See Also
Reference
Grasshopper.GUI Namespace