Grasshopper API
ClippingDrawingSettings Class
 Represents some of the clipping drawing settings.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ClippingDrawingSettings : ModelData
Public NotInheritable Class ClippingDrawingSettings
	Inherits ModelData
The ClippingDrawingSettings type exposes the following members.
Constructors
Name | Description
ClippingDrawingSettings()
Initializes a new instance of the ClippingDrawingSettings class
ClippingDrawingSettings(ClippingDrawingSettings.Attributes)
Initializes a new instance of the ClippingDrawingSettings class
Top
Properties
Name | Description
Annotations
AttributesSource
Background
Dimensions
Dots
Hidden
LabelStyle
Leaders
SectionHatch
SectionSurface
Silhouette
Tangents
Text
Top
Methods
Name | Description
ToAttributes
Top
Operators
Name | Description
Implicit(ClippingDrawingSettings.Attributes to ClippingDrawingSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace