Grasshopper API
ObjectDraftingLineWidth Class
 Represents a Rhino object drafintg linetype.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectDraftingLineWidth : ModelValue
Public NotInheritable Class ObjectDraftingLineWidth
	Inherits ModelValue
The ObjectDraftingLineWidth type exposes the following members.
Constructors
Name | Description
ObjectDraftingLineWidth()
Initializes a new instance of the ObjectDraftingLineWidth class
ObjectDraftingLineWidth(ObjectDraftingLineWidth.Value)
Initializes a new instance of the ObjectDraftingLineWidth class
Top
Properties
Name | Description
Source
Width
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
Top
Operators
Name | Description
Implicit(ObjectDraftingLineWidth to ObjectDraftingLineWidth.Value)
Implicit(ObjectDraftingLineWidth.Value to ObjectDraftingLineWidth)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace