Grasshopper API
GH_Canvas.CanvasPostPaintWidgetsEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasPostPaintWidgetsEventHandler(
	GH_Canvas sender
)
Public Delegate Sub CanvasPostPaintWidgetsEventHandler (
	sender As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace