Grasshopper API
GH_BakeUtility Class
 A utility class for baking. We heavily recommend you use this for any baking, as it handles invalid objects correctly.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_BakeUtility
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_BakeUtility
Public Class GH_BakeUtility
The GH_BakeUtility type exposes the following members.
Constructors
Name | Description
GH_BakeUtility
 Create a new baker.
Top
Properties
Name | Description
BakedCount
 Gets the number of successful baking operations.
BakedIds
 Gets all collected object ids.
InvalidCount
 Gets the number of invalid objects encountered.
Top
Methods
Name | Description
BakeObject
 Try and bake a single object.
BakeObjects
 Bake a bunch of objects.
Top
See Also
Reference
Grasshopper.Kernel Namespace