Grasshopper API
CentralSettings.AuthorAddressChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AuthorAddressChangedEventHandler()
Public Delegate Sub AuthorAddressChangedEventHandler
See Also
Reference
Grasshopper Namespace