Grasshopper API
GH_Document.GH_ActiveObjectFilter Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate bool GH_ActiveObjectFilter(
	IGH_ActiveObject iObj
)
Public Delegate Function GH_ActiveObjectFilter (
	iObj As IGH_ActiveObject
) As Boolean
Parameters
iObj
Type: Grasshopper.Kernel.IGH_ActiveObject
Return Value
Type: Boolean
See Also
Reference
Grasshopper.Kernel Namespace