Grasshopper API
Param_ModelObject Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelObject>
 Grasshopper.Kernel.GH_PersistentParam<ModelObject>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelObject>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelObject>
 Grasshopper.Rhinoceros.Model.Params.Param_ModelObject
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelObject : ModelContentParam<ModelObject>,
	IGH_PreviewObject
Public NotInheritable Class Param_ModelObject
	Inherits ModelContentParam(Of ModelObject)
	Implements IGH_PreviewObject
The Param_ModelObject type exposes the following members.
Constructors
Name | Description
Param_ModelObject
Initializes a new instance of the Param_ModelObject class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsPreviewCapable
Top
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Model.Params Namespace