Grasshopper API
CentralSettings.LoadMechanismChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void LoadMechanismChangedEventHandler(
	string pluginName
)
Public Delegate Sub LoadMechanismChangedEventHandler (
	pluginName As String
)
Parameters
pluginName
Type: System.String
See Also
Reference
Grasshopper Namespace