Grasshopper API
GH_Canvas.CanvasPrePaintWiresEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasPrePaintWiresEventHandler(
	GH_Canvas sender
)
Public Delegate Sub CanvasPrePaintWiresEventHandler (
	sender As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace