Grasshopper API
PageSettings Class
 Represents settings for a page layout.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Display.PageSettings
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class PageSettings : ModelData
Public NotInheritable Class PageSettings
	Inherits ModelData
The PageSettings type exposes the following members.
Constructors
Name | Description
PageSettings()
Initializes a new instance of the PageSettings class
PageSettings(PageSettings.Attributes)
Initializes a new instance of the PageSettings class
Top
Properties
Name | Description
PaperHeight
PaperName
PaperWidth
Units
Top
Methods
Name | Description
ToAttributes
Top
Operators
Name | Description
Implicit(PageSettings.Attributes to PageSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace