Grasshopper API
ModelTextureSlot.Attributes Structure
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Attributes : GH_ISerializable,
	IEquatable<ModelTextureSlot.Attributes>
Public Structure Attributes
	Implements GH_ISerializable, IEquatable(Of ModelTextureSlot.Attributes)
The ModelTextureSlot.Attributes type exposes the following members.
Properties
Name | Description
Amount
Color
Enabled
Number
Texture
Top
Methods
Name | Description
Equals(ModelTextureSlot.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace