Grasshopper API
GH_Canvas.DocumentObjectMouseDownEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void DocumentObjectMouseDownEventHandler(
	Object sender,
	GH_CanvasObjectMouseDownEventArgs e
)
Public Delegate Sub DocumentObjectMouseDownEventHandler (
	sender As Object,
	e As GH_CanvasObjectMouseDownEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.GH_CanvasObjectMouseDownEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace