Grasshopper API
ModelInstanceDefinition.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelInstanceDefinition.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelInstanceDefinition.Attributes)
The ModelInstanceDefinition.Attributes type exposes the following members.
Constructors
Name | Description
ModelInstanceDefinition.Attributes
Initializes a new instance of the ModelInstanceDefinition.Attributes class
Top
Properties
Name | Description
FilePath
Objects
Units
UpdateType
Url
UrlDescription
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
Operators
Name | Description
Implicit(String to ModelInstanceDefinition.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace