Grasshopper API
GH_WireType Enumeration
 Enumerates the different kinds of connecting wires.
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public enum GH_WireType
Public Enumeration GH_WireType
Members
Member name | Value | Description
dynamic | 0 |  Dynamic indicates the wire is in the process of being made.
generic | 2 |  Generic connector wire. Can't go wrong with generic.
faint | 3 |  Similar to generic, but less pronounced.
null | 4 |  Wire with null data transfer.
item | 5 |  Wire with a single data transfer.
list | 6 |  Wire with a single list transfer.
tree | 7 |  Wire with multiple list transfer.
dynamicAlternative1 | 8 |  Wire type used by copyname=true wires.
See Also
Reference
Grasshopper.GUI.Canvas Namespace