Grasshopper API
GH_ColourPickerBase.InvalidatedEventHandler Delegate
 Namespace: Grasshopper.GUI.Base
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void InvalidatedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub InvalidatedEventHandler (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI.Base Namespace