Grasshopper API
ModelUserText Structure
 Represents an immutable collection of string/string pairs.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct ModelUserText : GH_ISerializable,
	IReadOnlyList<KeyValuePair<string, string>>, IReadOnlyDictionary<string, string>,
	IEquatable<ModelUserText>, IStructuralEquatable
Public Structure ModelUserText
	Implements GH_ISerializable, IReadOnlyList(Of KeyValuePair(Of String, String)),
	IReadOnlyDictionary(Of String, String), IEquatable(Of ModelUserText),
	IStructuralEquatable
The ModelUserText type exposes the following members.
Constructors
Name | Description
ModelUserText
Initializes a new instance of the ModelUserText class
Top
Properties
Name | Description
Count
IsDefault
IsDefaultOrEmpty
IsEmpty
Item[Int32]
Item[String]
Keys
Values
Top
Methods
Name | Description
ContainsKey
EnsureRange(IEnumerable<KeyValuePair<String, String>>)
EnsureRange(IEnumerable<String>)
Equals(ModelUserText)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetEnumerator
GetHashCode |  (Overrides ValueType.GetHashCode().)
MergeRange(IEnumerable<KeyValuePair<String, String>>)
MergeRange(IEnumerable<String>)
RemoveRange(IEnumerable<KeyValuePair<String, String>>)
RemoveRange(IEnumerable<String>)
TryGetValue
UpdateRange(IEnumerable<KeyValuePair<String, String>>)
UpdateRange(IEnumerable<String>)
Top
Operators
Name | Description
Addition(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
Addition(ModelUserText, IEnumerable<String>)
BitwiseAnd(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
BitwiseAnd(ModelUserText, IEnumerable<String>)
BitwiseOr(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
BitwiseOr(ModelUserText, IEnumerable<String>)
Equality
Inequality
Subtraction(ModelUserText, IEnumerable<KeyValuePair<String, String>>)
Subtraction(ModelUserText, IEnumerable<String>)
Top
Fields
Name | Description
Empty
Top
Remarks
 Key comparison is not case sensitive.
See Also
Reference
Grasshopper.Rhinoceros Namespace