Grasshopper API
Param_ObjectRender Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectRender>
 Grasshopper.Rhinoceros.Params.ModelDataParam<ObjectRender>
 Grasshopper.Rhinoceros.Render.Params.Param_ObjectRender
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectRender : ModelDataParam<ObjectRender>
Public NotInheritable Class Param_ObjectRender
	Inherits ModelDataParam(Of ObjectRender)
The Param_ObjectRender type exposes the following members.
Constructors
Name | Description
Param_ObjectRender
Initializes a new instance of the Param_ObjectRender class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace