Grasshopper API
GH_TaskCapableComponent<T> Class
 Abstract implementation of IGH_TaskCapableComponent. Inherit from this class instead of implementing IGH_TaskCapableComponent directly.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Component
 Grasshopper.Kernel.GH_TaskCapableComponent<T>
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class GH_TaskCapableComponent<T> : GH_Component,
	IGH_TaskCapableComponent
Public MustInherit Class GH_TaskCapableComponent(Of T)
	Inherits GH_Component
	Implements IGH_TaskCapableComponent
Type Parameters
T
The GH_TaskCapableComponent<T> type exposes the following members.
Properties
Name | Description
CancelToken
InPreSolve
 Is set to True by the framework right before a "use tasks" pass is made on SolveIntance calls. When True, SolveInstance should be using Tasks to start calculations on input data. When False, SolveInstance should be setting the output data by either using the result of a task or directly computing the results.
InstanceDescription |  (Overrides GH_Component.InstanceDescription.)
TaskList
UseTasks
 Returns True if the component is set to support tasks. Components can have this feature turned on/off. Note that even if UseTasks returns True, there is a chance that a multipass task based solution may not be invoked depending on if multiple calls need to be made during enumeration. You must pay attention to the value of InPreSolve during SolveInstance. The set version of this property can be called by the framework if we want to provide a technique to globally turn on/off task support for all components in a definition.
Top
Methods
Name | Description
AfterSolveInstance |  (Overrides GH_Component.AfterSolveInstance().)
AppendAdditionalMenuItems |  (Overrides GH_Component.AppendAdditionalMenuItems(ToolStripDropDown).)
GetSolveResults
 Call this method to await the associated task and retrieve its data.
OnUseTasksClicked
Read |  (Overrides GH_Component.Read(GH_IReader).)
RequestTaskCancellation
 Called by the framework when solving has been interrupted and tasks do not need to complete.
Write |  (Overrides GH_Component.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace