Grasshopper API
GH_Canvas.Document_ObjectsAddedEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void Document_ObjectsAddedEventHandler(
	GH_Document sender,
	GH_DocObjectEventArgs e
)
Public Delegate Sub Document_ObjectsAddedEventHandler (
	sender As GH_Document,
	e As GH_DocObjectEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.GH_Document
e
Type: Grasshopper.Kernel.GH_DocObjectEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace