Grasshopper API
GH_Hatch.GH_HatchProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Hatch>
 Grasshopper.Kernel.Types.GH_Hatch.GH_HatchProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_HatchProxy : GH_GooProxy<GH_Hatch>
Public Class GH_HatchProxy
	Inherits GH_GooProxy(Of GH_Hatch)
The GH_Hatch.GH_HatchProxy type exposes the following members.
Constructors
Name | Description
GH_Hatch.GH_HatchProxy
Initializes a new instance of the GH_Hatch.GH_HatchProxy class
Top
Properties
Name | Description
BasePoint
ObjectID
Pattern
PatternRotation
PatternScale
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace