Grasshopper API
AnnotationLeaderSettings.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<AnnotationLeaderSettings.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of AnnotationLeaderSettings.Attributes)
The AnnotationLeaderSettings.Attributes type exposes the following members.
Constructors
Name | Description
AnnotationLeaderSettings.Attributes
Initializes a new instance of the AnnotationLeaderSettings.Attributes class
Top
Properties
Name | Description
ContentAngleType
CurveType
HasLanding
LandingLength
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace