Grasshopper API
Param_PageSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<PageSettings>
 Grasshopper.Kernel.GH_PersistentParam<PageSettings>
 Grasshopper.Rhinoceros.Display.Params.Param_PageSettings
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_PageSettings : GH_PersistentParam<PageSettings>
Public NotInheritable Class Param_PageSettings
	Inherits GH_PersistentParam(Of PageSettings)
The Param_PageSettings type exposes the following members.
Constructors
Name | Description
Param_PageSettings
Initializes a new instance of the Param_PageSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace