Grasshopper API
ModelFont Class
 Represents a typography font. Wraps the functionality of the Font type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Font>
 Grasshopper.Rhinoceros.ModelFont
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelFont : GH_Goo<Font>,
	IEquatable<ModelFont>
Public NotInheritable Class ModelFont
	Inherits GH_Goo(Of Font)
	Implements IEquatable(Of ModelFont)
The ModelFont type exposes the following members.
Constructors
Name | Description
ModelFont()
Initializes a new instance of the ModelFont class
ModelFont(Font)
Initializes a new instance of the ModelFont class
ModelFont(String)
Initializes a new instance of the ModelFont class
Top
Properties
Name | Description
FamilyName
InstalledFamilies
InstalledFonts
IsInstalled
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
Cast
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
Equals(ModelFont)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
IsFamilyNameInstalled
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Operators
Name | Description
Implicit(Font to ModelFont)
Implicit(String to ModelFont)
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace