Grasshopper API
AnnotationArrowSettings.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<AnnotationArrowSettings.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of AnnotationArrowSettings.Attributes)
The AnnotationArrowSettings.Attributes type exposes the following members.
Constructors
Name | Description
AnnotationArrowSettings.Attributes
Initializes a new instance of the AnnotationArrowSettings.Attributes class
Top
Properties
Name | Description
Arrow1
Arrow2
ArrowSize
ClippingArrow1
ClippingArrow2
ClippingArrowSize
DimensionInline
FitArrow
LeaderArrow
LeaderArrowSize
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace