Grasshopper API
ModelTextureMapping.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelTextureMapping.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelTextureMapping.Attributes)
The ModelTextureMapping.Attributes type exposes the following members.
Constructors
Name | Description
ModelTextureMapping.Attributes
Initializes a new instance of the ModelTextureMapping.Attributes class
Top
Properties
Name | Description
Capped
Channel
Geometry
LocalTransform
MappingType
Projection
TextureSpace
UVWOffset
UVWRepeat
UVWRotation
XYZOffset
XYZRotation
XYZSize
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
Operators
Name | Description
Implicit(String to ModelTextureMapping.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace