Grasshopper API
ModelNamedConstructionPlane Class
 Represents a Rhino named construction plane. Wraps a ConstructionPlane instance in the named construction planes table.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelNamedConstructionPlane
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Since: 8.19
Syntax
public sealed class ModelNamedConstructionPlane : ModelContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelNamedConstructionPlane
	Inherits ModelContent
	Implements IGH_BakeAwareData
The ModelNamedConstructionPlane type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelNamedConstructionPlane.Attributes to ModelNamedConstructionPlane)
Implicit(ConstructionPlane to ModelNamedConstructionPlane)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace