Grasshopper API
Param_ModelRenderTexture Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelRenderTexture>
 Grasshopper.Kernel.GH_PersistentParam<ModelRenderTexture>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelRenderTexture>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelRenderTexture>
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderTexture
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelRenderTexture : ModelContentParam<ModelRenderTexture>
Public NotInheritable Class Param_ModelRenderTexture
	Inherits ModelContentParam(Of ModelRenderTexture)
The Param_ModelRenderTexture type exposes the following members.
Constructors
Name | Description
Param_ModelRenderTexture
Initializes a new instance of the Param_ModelRenderTexture class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace