Grasshopper API
CentralSettings.AuthorNameChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AuthorNameChangedEventHandler()
Public Delegate Sub AuthorNameChangedEventHandler
See Also
Reference
Grasshopper Namespace