Grasshopper API
ModelSpaceViewport.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelSpaceViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelDetailViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelStandardViewport.Attributes
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class Attributes : ModelViewport.Attributes
Public MustInherit Class Attributes
	Inherits ModelViewport.Attributes
The ModelSpaceViewport.Attributes type exposes the following members.
Constructors
Name | Description
ModelSpaceViewport.Attributes
Initializes a new instance of the ModelSpaceViewport.Attributes class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace