Grasshopper API
ModelObject.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Model.ModelObject.Attributes
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelObject.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelObject.Attributes)
The ModelObject.Attributes type exposes the following members.
Constructors
Name | Description
ModelObject.Attributes
Initializes a new instance of the ModelObject.Attributes class
Top
Properties
Name | Description
Display
Drafting
Frame
Layer
Render
SectionStyle
Url
Visibility
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace