Grasshopper API
GH_SliderBase.TextInputHandler Delegate
 Delegate used during Text Input handling.
 Namespace: Grasshopper.GUI.Base
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void TextInputHandler(
	GH_SliderBase slider,
	string text
)
Public Delegate Sub TextInputHandler (
	slider As GH_SliderBase,
	text As String
)
Parameters
slider
Type: Grasshopper.GUI.Base.GH_SliderBase
text
Type: System.String
See Also
Reference
Grasshopper.GUI.Base Namespace