Grasshopper API
Param_ModelFont Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelFont>
 Grasshopper.Kernel.GH_PersistentParam<ModelFont>
 Grasshopper.Rhinoceros.Params.Param_ModelFont
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_ModelFont : GH_PersistentParam<ModelFont>
Public Class Param_ModelFont
	Inherits GH_PersistentParam(Of ModelFont)
The Param_ModelFont type exposes the following members.
Constructors
Name | Description
Param_ModelFont
Initializes a new instance of the Param_ModelFont class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
Methods
Name | Description
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
Menu_CustomMultiValueItem |  (Overrides GH_PersistentParam<T>.Menu_CustomMultiValueItem().)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace