Grasshopper API
EtoExtensions Class
Inheritance Hierarchy
System.Object
 Grasshopper.EtoExtensions
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class EtoExtensions
<ExtensionAttribute>
Public NotInheritable Class EtoExtensions
The EtoExtensions type exposes the following members.
Methods
Name | Description
ToEto(Bitmap) |  Obsolete.
ToEto(Color)
ToEto(Control)
ToEto(Font)
ToEto(Form)
ToEto(Point)
ToEto(PointF)
ToEto(Size)
ToEto(SizeF)
ToEtoWindow
ToSD(Color)
ToSD(Font)
ToSD(Point)
ToSD(PointF)
ToSD(Rectangle)
ToSD(Size)
ToSD(SizeF)
ToSwf
ToWin32Window
Top
See Also
Reference
Grasshopper Namespace