Grasshopper API
ClippingDrawingSettings.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings.Attributes
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<ClippingDrawingSettings.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of ClippingDrawingSettings.Attributes)
The ClippingDrawingSettings.Attributes type exposes the following members.
Constructors
Name | Description
ClippingDrawingSettings.Attributes
Initializes a new instance of the ClippingDrawingSettings.Attributes class
Top
Properties
Name | Description
Annotations
AttributesSource
Background
Dimensions
Dots
Hidden
LabelStyle
Leaders
SectionHatch
SectionSurface
Silhouette
Tangents
Text
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace