Grasshopper API
GH_InstanceReference Class
 Represents block instance reference. Wraps the functionality of the InstanceReferenceGeometry type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<InstanceReferenceGeometry>
 Grasshopper.Kernel.Types.GH_GeometricGoo<InstanceReferenceGeometry>
 Grasshopper.Kernel.Types.GH_InstanceReference
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_InstanceReference : GH_GeometricGoo<InstanceReferenceGeometry>,
	IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData
Public Class GH_InstanceReference
	Inherits GH_GeometricGoo(Of InstanceReferenceGeometry)
	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData
The GH_InstanceReference type exposes the following members.
Constructors
Name | Description
GH_InstanceReference()
 Default constructor.
GH_InstanceReference(GH_InstanceReference)
 Create a duplicate of another instance reference.
GH_InstanceReference(Guid)
 Create a new instance reference to a Rhino instance reference object with the specified ID.
GH_InstanceReference(InstanceReferenceGeometry)
 Create a new instance reference with the specified instance-reference-geometry.
GH_InstanceReference(Transform)
 Create a transformed empty instance reference.
GH_InstanceReference(InstanceReferenceGeometry, ModelInstanceDefinition)
 Create a new instance reference with the specified instance-reference-geometry and instance-definition.
GH_InstanceReference(Transform, ModelInstanceDefinition)
 Create a transformed instance reference of the specified instance-definition.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
InstanceDefinition
IsGeometryLoaded
 Gets the load state of this instance reference object. The instance reference is considered to be loaded when the local instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsReferencedGeometry
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
 (Overrides GH_GeometricGoo<T>.IsReferencedGeometry.)
IsValid
 Gets the validity of this instance reference. If the instance reference is referenced but cannot be loaded, the instance reference is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ModelTransform
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the instance reference is referenced, the local instance of the instance reference is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this GH_InstanceReference.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateInstanceReference
 Create a duplicate of this GH_InstanceReference.
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the instance reference is referenced and not yet loaded, attempts to load the instance reference.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the instance reference using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace