Grasshopper API
ObjectRenderMaterial Class
 Represents a Rhino object material.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Render.ObjectRenderMaterial
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectRenderMaterial : ModelValue
Public NotInheritable Class ObjectRenderMaterial
	Inherits ModelValue
The ObjectRenderMaterial type exposes the following members.
Constructors
Name | Description
ObjectRenderMaterial()
Initializes a new instance of the ObjectRenderMaterial class
ObjectRenderMaterial(ObjectRenderMaterial.Value)
Initializes a new instance of the ObjectRenderMaterial class
Top
Properties
Name | Description
Material
Source
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Top
Operators
Name | Description
Implicit(ObjectRenderMaterial to ObjectRenderMaterial.Value)
Implicit(ObjectRenderMaterial.Value to ObjectRenderMaterial)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace