Grasshopper API
GH_Leader Class
 Represents an implementation of a Rhino leader.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Leader
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_Leader : GH_AnnotationBase
Public Class GH_Leader
	Inherits GH_AnnotationBase
The GH_Leader type exposes the following members.
Constructors
Name | Description
GH_Leader()
 Default constructor, creates an invalid leader.
GH_Leader(GH_Leader)
 Create a duplicate of another GH_Leader. This constructor also copies reference data.
GH_Leader(Guid)
 Create a new referenced leader that references a Rhino leader with the specified ID.
GH_Leader(Leader)
 Create a duplicate of an existing leader.
GH_Leader(Leader, ModelAnnotationStyle)
 Create a duplicate of an existing annotation.
Top
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_AnnotationBase.ValueType.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_AnnotationBase.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateLeader
 Create a duplicate of this leader.
ToString
 Format the leader using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace