Grasshopper API
Param_ModelInstanceDefinition Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelInstanceDefinition>
 Grasshopper.Kernel.GH_PersistentParam<ModelInstanceDefinition>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelInstanceDefinition>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelInstanceDefinition>
 Grasshopper.Rhinoceros.Model.Params.Param_ModelInstanceDefinition
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelInstanceDefinition : ModelContentParam<ModelInstanceDefinition>,
	IGH_PreviewObject
Public NotInheritable Class Param_ModelInstanceDefinition
	Inherits ModelContentParam(Of ModelInstanceDefinition)
	Implements IGH_PreviewObject
The Param_ModelInstanceDefinition type exposes the following members.
Constructors
Name | Description
Param_ModelInstanceDefinition
Initializes a new instance of the Param_ModelInstanceDefinition class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsPreviewCapable
Top
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Model.Params Namespace