Grasshopper API
ModelDisplayMode.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Display.ModelDisplayMode.Attributes
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelContent.Attributes,
	IEquatable<ModelDisplayMode.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelContent.Attributes
	Implements IEquatable(Of ModelDisplayMode.Attributes)
The ModelDisplayMode.Attributes type exposes the following members.
Constructors
Name | Description
ModelDisplayMode.Attributes
Initializes a new instance of the ModelDisplayMode.Attributes class
Top
Properties
Name | Description
Top
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace