Grasshopper API
ModelRenderContent.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderEnvironment.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderMaterial.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderTexture.Attributes
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class Attributes : ModelContent.Attributes,
	IEquatable<ModelRenderContent.Attributes>
Public MustInherit Class Attributes
	Inherits ModelContent.Attributes
	Implements IEquatable(Of ModelRenderContent.Attributes)
The ModelRenderContent.Attributes type exposes the following members.
Constructors
Name | Description
ModelRenderContent.Attributes()
Initializes a new instance of the ModelRenderContent.Attributes class
ModelRenderContent.Attributes(RenderContent)
Initializes a new instance of the ModelRenderContent.Attributes class
Top
Properties
Name | Description
RenderContent
Top
Methods
Name | Description
Equals(Object, IEqualityComparer) |  (Overrides ModelContent.Attributes.Equals(Object, IEqualityComparer).)
GetHashCode(IEqualityComparer) |  (Overrides ModelContent.Attributes.GetHashCode(IEqualityComparer).)
ReadData |  (Overrides ModelContent.Attributes.ReadData(GH_IReader).)
SubClone |  (Overrides ModelData.Attributes.SubClone().)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
WriteData |  (Overrides ModelContent.Attributes.WriteData(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace