Grasshopper API
PageSettings.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Display.PageSettings.Attributes
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<PageSettings.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of PageSettings.Attributes)
The PageSettings.Attributes type exposes the following members.
Constructors
Name | Description
PageSettings.Attributes
Initializes a new instance of the PageSettings.Attributes class
Top
Properties
Name | Description
PaperHeight
PaperName
PaperWidth
Units
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelData.Attributes.ToString().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace