Grasshopper API
AnnotationTextSettings.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<AnnotationTextSettings.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of AnnotationTextSettings.Attributes)
The AnnotationTextSettings.Attributes type exposes the following members.
Constructors
Name | Description
AnnotationTextSettings.Attributes
Initializes a new instance of the AnnotationTextSettings.Attributes class
Top
Properties
Name | Description
DrawForward
DrawTextMask
FitText
Font
LineSpaceScale
MaskColor
MaskColorSource
MaskFrame
MaskOffset
TextGap
TextHeight
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
UseKerning
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace