Grasshopper API
ModelTextureMapping Class
 Represents a Rhino model texture mapping. Wraps the functionality of the TextureMapping type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Render.ModelTextureMapping
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelTextureMapping : ModelComponentContent,
	IGH_PreviewData, IGH_PreviewMeshData
Public NotInheritable Class ModelTextureMapping
	Inherits ModelComponentContent
	Implements IGH_PreviewData, IGH_PreviewMeshData
The ModelTextureMapping type exposes the following members.
Constructors
Name | Description
ModelTextureMapping()
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(ModelTextureMapping.Attributes)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(Guid)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(TextureMapping)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(TextureMapping, Int32)
Initializes a new instance of the ModelTextureMapping class
ModelTextureMapping(TextureMapping, Int32, Transform)
Initializes a new instance of the ModelTextureMapping class
Top
Properties
Name | Description
Capped
Channel
ClippingBox
Geometry
IsValid |  (Overrides ModelContent.IsValid.)
LocalTransform
MappingType
Projection
TextureSpace
TypeName |  (Overrides ModelData.TypeName.)
Unset
UVWOffset
UVWRepeat
UVWRotation
XYZOffset
XYZRotation
XYZSize
Top
Methods
Name | Description
Cast
DrawViewportMeshes
DrawViewportWires
ToAttributes
Top
Operators
Name | Description
Implicit(ModelTextureMapping.Attributes to ModelTextureMapping)
Implicit(String to ModelTextureMapping)
Implicit(TextureMapping to ModelTextureMapping)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace