Grasshopper API
GH_AutoSaveSettings.SaveOnWireEventChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SaveOnWireEventChangedEventHandler()
Public Delegate Sub SaveOnWireEventChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace