Grasshopper API
ObjectDraftingLineWidth.Value Structure
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IEquatable<ObjectDraftingLineWidth.Value>,
	IComparable<ObjectDraftingLineWidth.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IEquatable(Of ObjectDraftingLineWidth.Value),
	IComparable(Of ObjectDraftingLineWidth.Value), IComparable
The ObjectDraftingLineWidth.Value type exposes the following members.
Constructors
Name | Description
ObjectDraftingLineWidth.Value(Double)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
ObjectDraftingLineWidth.Value(ObjectPlotWeightSource)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
ObjectDraftingLineWidth.Value(ObjectPlotWeightSource, Double)
Initializes a new instance of the ObjectDraftingLineWidth.Value class
Top
Properties
Name | Description
ByLayer
ByParent
Source
Width
Top
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDraftingLineWidth.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDraftingLineWidth.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Implicit(Double to ObjectDraftingLineWidth.Value)
Implicit(ObjectPlotWeightSource to ObjectDraftingLineWidth.Value)
Implicit(ObjectDraftingLineWidth.Value to ObjectPlotWeightSource)
Implicit(ObjectDraftingLineWidth.Value to Double)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace