Grasshopper API
AnnotationArrowSettings Class
 Represents an annotation base arrowhead settings.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationArrowSettings : ModelData
Public NotInheritable Class AnnotationArrowSettings
	Inherits ModelData
The AnnotationArrowSettings type exposes the following members.
Constructors
Name | Description
AnnotationArrowSettings()
Initializes a new instance of the AnnotationArrowSettings class
AnnotationArrowSettings(AnnotationArrowSettings.Attributes)
Initializes a new instance of the AnnotationArrowSettings class
AnnotationArrowSettings(DimensionStyle)
Initializes a new instance of the AnnotationArrowSettings class
Top
Properties
Name | Description
Arrow1
Arrow2
ArrowSize
ClippingArrow1
ClippingArrow2
ClippingArrowSize
DimensionInline
FitArrow
LeaderArrow
LeaderArrowSize
Top
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
Operators
Name | Description
Explicit(AnnotationArrowSettings to DimensionStyle)
Implicit(AnnotationArrowSettings.Attributes to AnnotationArrowSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace