Grasshopper API
GH_ClippingPlane Class
 Represents an implementation of a Rhino clipping plane.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<ClippingPlaneSurface>
 Grasshopper.Kernel.Types.GH_GeometricGoo<ClippingPlaneSurface>
 Grasshopper.Kernel.Types.GH_ClippingPlane
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_ClippingPlane : GH_GeometricGoo<ClippingPlaneSurface>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_ClippingPlane
	Inherits GH_GeometricGoo(Of ClippingPlaneSurface)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_ClippingPlane type exposes the following members.
Constructors
Name | Description
GH_ClippingPlane()
 Default constructor, creates an invalid clipping plane.
GH_ClippingPlane(ClippingPlaneSurface)
 Create a duplicate of an existing clipping plane.
GH_ClippingPlane(GH_ClippingPlane)
 Create a duplicate of another GH_ClippingPlane. This constructor also copies reference data.
GH_ClippingPlane(Guid)
 Create a new referenced clipping plane that references a clipping plane in a Rhino document with a specified ID.
Top
Properties
Name | Description
AnnotationStyle
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this clipping plane. The clipping plane is considered to be loaded when the local clipping plane instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this clipping plane. If the clipping plane is referenced but cannot be loaded, the clipping plane is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
LabelStyle
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the clipping plane is referenced, the local instance of the clipping plane is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateClippingPlane
 Create a duplicate of this clipping plane.
DuplicateGeometry
 Create a duplicate of this clipping plane.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the clipping plane is referenced and not yet loaded, attempts to load the clipping plane.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the clipping plane using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace