Grasshopper API
GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void MaterialImagePostPaintEventHandler(
	Bitmap image
)
Public Delegate Sub MaterialImagePostPaintEventHandler (
	image As Bitmap
)
Parameters
image
Type: System.Drawing.Bitmap
See Also
Reference
Grasshopper.GUI Namespace