Grasshopper API
Param_AnnotationTextSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationTextSettings>
 Grasshopper.Rhinoceros.Params.ModelDataParam<AnnotationTextSettings>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationTextSettings
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationTextSettings : ModelDataParam<AnnotationTextSettings>
Public NotInheritable Class Param_AnnotationTextSettings
	Inherits ModelDataParam(Of AnnotationTextSettings)
The Param_AnnotationTextSettings type exposes the following members.
Constructors
Name | Description
Param_AnnotationTextSettings
Initializes a new instance of the Param_AnnotationTextSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace