Grasshopper API
Param_ModelTextureSlot Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelTextureSlot>
 Grasshopper.Kernel.GH_PersistentParam<ModelTextureSlot>
 Grasshopper.Rhinoceros.Render.Params.Param_ModelTextureSlot
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_ModelTextureSlot : GH_PersistentParam<ModelTextureSlot>
Public Class Param_ModelTextureSlot
	Inherits GH_PersistentParam(Of ModelTextureSlot)
The Param_ModelTextureSlot type exposes the following members.
Constructors
Name | Description
Param_ModelTextureSlot
Initializes a new instance of the Param_ModelTextureSlot class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
Methods
Name | Description
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace