Grasshopper API
GH_Gradient.SelectionChangedEventHandler Delegate
 Namespace: Grasshopper.GUI.Gradient
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SelectionChangedEventHandler(
	Object sender,
	GH_GradientChangedEventArgs e
)
Public Delegate Sub SelectionChangedEventHandler (
	sender As Object,
	e As GH_GradientChangedEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Gradient.GH_GradientChangedEventArgs
See Also
Reference
Grasshopper.GUI.Gradient Namespace