Grasshopper API
GH_Canvas.ViewportChangedEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ViewportChangedEventHandler(
	Object sender,
	GH_CanvasViewportChangedEventArgs e
)
Public Delegate Sub ViewportChangedEventHandler (
	sender As Object,
	e As GH_CanvasViewportChangedEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Canvas.GH_CanvasViewportChangedEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace