Grasshopper API
ClippingArrow Class
 Represents an clipping plane arrowhead type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.ClippingArrow
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ClippingArrow : ModelData
Public NotInheritable Class ClippingArrow
	Inherits ModelData
The ClippingArrow type exposes the following members.
Constructors
Name | Description
ClippingArrow()
Initializes a new instance of the ClippingArrow class
ClippingArrow(ClippingArrow.Attributes)
Initializes a new instance of the ClippingArrow class
ClippingArrow(ClippingArrowType)
Initializes a new instance of the ClippingArrow class
Top
Properties
Name | Description
ArrowType
Top
Methods
Name | Description
Cast
Top
Operators
Name | Description
Implicit(ClippingArrow.Attributes to ClippingArrow)
Implicit(ClippingArrowType to ClippingArrow)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace