Grasshopper API
Instances.CanvasDestroyedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasDestroyedEventHandler(
	GH_Canvas canvas
)
Public Delegate Sub CanvasDestroyedEventHandler (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper Namespace