Grasshopper API
Param_AnnotationClippingArrow Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ClippingArrow>
 Grasshopper.Kernel.GH_PersistentParam<ClippingArrow>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationClippingArrow
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationClippingArrow : GH_PersistentParam<ClippingArrow>
Public NotInheritable Class Param_AnnotationClippingArrow
	Inherits GH_PersistentParam(Of ClippingArrow)
The Param_AnnotationClippingArrow type exposes the following members.
Constructors
Name | Description
Param_AnnotationClippingArrow
Initializes a new instance of the Param_AnnotationClippingArrow class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace