Grasshopper API
Param_ObjectVisibility Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectVisibility>
 Grasshopper.Rhinoceros.Params.ModelDataParam<ObjectVisibility>
 Grasshopper.Rhinoceros.Display.Params.Param_ObjectVisibility
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectVisibility : ModelDataParam<ObjectVisibility>
Public NotInheritable Class Param_ObjectVisibility
	Inherits ModelDataParam(Of ObjectVisibility)
The Param_ObjectVisibility type exposes the following members.
Constructors
Name | Description
Param_ObjectVisibility
Initializes a new instance of the Param_ObjectVisibility class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace