Grasshopper API
ModelRenderEnvironment Class
 Represents a Rhino render environment. Wraps the functionality of the RenderEnvironment type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Render.ModelRenderContent
 Grasshopper.Rhinoceros.Render.ModelRenderEnvironment
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelRenderEnvironment : ModelRenderContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelRenderEnvironment
	Inherits ModelRenderContent
	Implements IGH_BakeAwareData
The ModelRenderEnvironment type exposes the following members.
Constructors
Name | Description
ModelRenderEnvironment()
Initializes a new instance of the ModelRenderEnvironment class
ModelRenderEnvironment(ModelRenderEnvironment.Attributes)
Initializes a new instance of the ModelRenderEnvironment class
ModelRenderEnvironment(Guid)
Initializes a new instance of the ModelRenderEnvironment class
ModelRenderEnvironment(RenderEnvironment)
Initializes a new instance of the ModelRenderEnvironment class
Top
Properties
Name | Description
TypeName |  (Overrides ModelRenderContent.TypeName.)
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelRenderEnvironment.Attributes to ModelRenderEnvironment)
Implicit(ColorRGBA to ModelRenderEnvironment)
Implicit(RenderEnvironment to ModelRenderEnvironment)
Implicit(String to ModelRenderEnvironment)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace