Grasshopper API
ModelObject Class
 Represents a Rhino model object. Wraps the functionality of the RhinoObject type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Model.ModelObject
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelObject : ModelComponentContent,
	IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData
Public NotInheritable Class ModelObject
	Inherits ModelComponentContent
	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData
The ModelObject type exposes the following members.
Constructors
Name | Description
ModelObject()
Initializes a new instance of the ModelObject class
ModelObject(ModelObject.Attributes)
Initializes a new instance of the ModelObject class
ModelObject(Guid)
Initializes a new instance of the ModelObject class
ModelObject(RhinoObject)
Initializes a new instance of the ModelObject class
ModelObject(RhinoDoc, ObjectAttributes)
Initializes a new instance of the ModelObject class
ModelObject(RhinoDoc, ObjectAttributes, GeometryBase)
Initializes a new instance of the ModelObject class
Top
Properties
Name | Description
Display
Drafting
IsValid |  (Overrides ModelContent.IsValid.)
Layer
ObjectType
Render
TypeName |  (Overrides ModelData.TypeName.)
Url
Visibility
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
GetBoundingBox
ToAttributes
TooltipString |  (Overrides ModelContent.TooltipString().)
ToString |  (Overrides ModelContent.ToString().)
Top
Operators
Name | Description
Implicit(ModelObject.Attributes to ModelObject)
Implicit(RhinoObject to ModelObject)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace