Grasshopper API
GH_DocumentServer.DocumentRemovedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void DocumentRemovedEventHandler(
	GH_DocumentServer sender,
	GH_Document doc
)
Public Delegate Sub DocumentRemovedEventHandler (
	sender As GH_DocumentServer,
	doc As GH_Document
)
Parameters
sender
Type: Grasshopper.Kernel.GH_DocumentServer
doc
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
Grasshopper.Kernel Namespace