Grasshopper API
GH_PointCloud.PointCloudProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_PointCloud>
 Grasshopper.Kernel.Types.GH_PointCloud.PointCloudProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class PointCloudProxy : GH_GooProxy<GH_PointCloud>
Public Class PointCloudProxy
	Inherits GH_GooProxy(Of GH_PointCloud)
The GH_PointCloud.PointCloudProxy type exposes the following members.
Constructors
Name | Description
GH_PointCloud.PointCloudProxy
Initializes a new instance of the GH_PointCloud.PointCloudProxy class
Top
Properties
Name | Description
ContainsColors
ContainsHiddenFlags
ContainsNormals
ContainsValues
HiddenPointCount
ObjectID
PointCount
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace