Grasshopper API
Param_AnnotationUnitsSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationUnitsSettings>
 Grasshopper.Rhinoceros.Params.ModelDataParam<AnnotationUnitsSettings>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationUnitsSettings
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationUnitsSettings : ModelDataParam<AnnotationUnitsSettings>
Public NotInheritable Class Param_AnnotationUnitsSettings
	Inherits ModelDataParam(Of AnnotationUnitsSettings)
The Param_AnnotationUnitsSettings type exposes the following members.
Constructors
Name | Description
Param_AnnotationUnitsSettings
Initializes a new instance of the Param_AnnotationUnitsSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace