Grasshopper API
GH_Dimension.GH_DimensionProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Dimension>
 Grasshopper.Kernel.Types.GH_AnnotationBase.GH_AnnotationBaseProxy<GH_Dimension>
 Grasshopper.Kernel.Types.GH_Dimension.GH_DimensionProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_DimensionProxy : GH_AnnotationBase.GH_AnnotationBaseProxy<GH_Dimension>
Public Class GH_DimensionProxy
	Inherits GH_AnnotationBase.GH_AnnotationBaseProxy(Of GH_Dimension)
The GH_Dimension.GH_DimensionProxy type exposes the following members.
Constructors
Name | Description
GH_Dimension.GH_DimensionProxy
Initializes a new instance of the GH_Dimension.GH_DimensionProxy class
Top
Properties
Name | Description
Measure
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace