Grasshopper API
CentralSettings.PreviewMeshEdgesChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PreviewMeshEdgesChangedEventHandler()
Public Delegate Sub PreviewMeshEdgesChangedEventHandler
See Also
Reference
Grasshopper Namespace