Grasshopper API
Param_ObjectDraftingLineWidth Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectDraftingLineWidth>
 Grasshopper.Kernel.GH_PersistentParam<ObjectDraftingLineWidth>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectDraftingLineWidth
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectDraftingLineWidth : GH_PersistentParam<ObjectDraftingLineWidth>
Public NotInheritable Class Param_ObjectDraftingLineWidth
	Inherits GH_PersistentParam(Of ObjectDraftingLineWidth)
The Param_ObjectDraftingLineWidth type exposes the following members.
Constructors
Name | Description
Param_ObjectDraftingLineWidth
Initializes a new instance of the Param_ObjectDraftingLineWidth class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace