Grasshopper API
CentralSettings.AuthorCopyrightChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AuthorCopyrightChangedEventHandler()
Public Delegate Sub AuthorCopyrightChangedEventHandler
See Also
Reference
Grasshopper Namespace