Grasshopper API
GH_ComponentParamServer.NullParamAttributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Attributes<IGH_Param>
 Grasshopper.Kernel.GH_ComponentParamServer.NullParamAttributes
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class NullParamAttributes : GH_Attributes<IGH_Param>
Public Class NullParamAttributes
	Inherits GH_Attributes(Of IGH_Param)
The GH_ComponentParamServer.NullParamAttributes type exposes the following members.
Constructors
Name | Description
GH_ComponentParamServer.NullParamAttributes
Initializes a new instance of the GH_ComponentParamServer.NullParamAttributes class
Top
Properties
Name | Description
Top
Methods
Name | Description
Read |  (Overrides GH_Attributes<T>.Read(GH_IReader).)
Write |  (Overrides GH_Attributes<T>.Write(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Kernel Namespace