Grasshopper API
ModelStandardViewport.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelSpaceViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelStandardViewport.Attributes
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelSpaceViewport.Attributes,
	IEquatable<ModelStandardViewport.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelSpaceViewport.Attributes
	Implements IEquatable(Of ModelStandardViewport.Attributes)
The ModelStandardViewport.Attributes type exposes the following members.
Constructors
Name | Description
ModelStandardViewport.Attributes
Initializes a new instance of the ModelStandardViewport.Attributes class
Top
Properties
Name | Description
Top
Methods
Name | Description
ToDetails |  (Overrides ModelViewport.Attributes.ToDetails().)
ToModelData |  (Overrides ModelViewport.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace