Grasshopper API
Param_ModelLayer Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelLayer>
 Grasshopper.Kernel.GH_PersistentParam<ModelLayer>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelLayer>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelLayer>
 Grasshopper.Rhinoceros.Model.Params.Param_ModelLayer
 Namespace: Grasshopper.Rhinoceros.Model.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelLayer : ModelContentParam<ModelLayer>
Public NotInheritable Class Param_ModelLayer
	Inherits ModelContentParam(Of ModelLayer)
The Param_ModelLayer type exposes the following members.
Constructors
Name | Description
Param_ModelLayer
Initializes a new instance of the Param_ModelLayer class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Model.Params Namespace