Grasshopper API
ModelViewport.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelPageViewport.Attributes
 Grasshopper.Rhinoceros.Display.ModelSpaceViewport.Attributes
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Attributes : ModelContent.Attributes, IEquatable<ModelViewport.Attributes>
Public Class Attributes
	Inherits ModelContent.Attributes
	Implements IEquatable(Of ModelViewport.Attributes)
The ModelViewport.Attributes type exposes the following members.
Constructors
Name | Description
ModelViewport.Attributes
Initializes a new instance of the ModelViewport.Attributes class
Top
Properties
Name | Description
ConstructionPlane
DisplayMode
UserText
View
Top
Methods
Name | Description
Equals(Object, IEqualityComparer) |  (Overrides ModelContent.Attributes.Equals(Object, IEqualityComparer).)
GetHashCode(IEqualityComparer) |  (Overrides ModelContent.Attributes.GetHashCode(IEqualityComparer).)
ReadData |  (Overrides ModelContent.Attributes.ReadData(GH_IReader).)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
WriteData |  (Overrides ModelContent.Attributes.WriteData(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace