Grasshopper API
GH_Material Class
 Represents a implementation of the Rhino material
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<DisplayMaterial>
 Grasshopper.Kernel.Types.GH_Material
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_Material : GH_Goo<DisplayMaterial>
Public Class GH_Material
	Inherits GH_Goo(Of DisplayMaterial)
The GH_Material type exposes the following members.
Constructors
Name | Description
GH_Material()
Initializes a new instance of the GH_Material class
GH_Material(Color)
 Create a new material based on a colour. The colour is used to control Diffuse, Emission and Transparency. Ambient, Specular and Shine are always default.
GH_Material(DisplayMaterial)
 Create a new Material.
GH_Material(GH_Material)
 Copy another GH_Material instance.
GH_Material(Guid)
 Create a new Material from an RDK material ID.
GH_Material(RenderMaterial)
 Create a new Material.
GH_Material(String)
 Create a new Material from an RDK xml string.
Top
Properties
Name | Description
IsValid |  (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
RdkMaterialId
 Gets or sets the RDK material ID this material is associated with.
RdkMaterialRmtl
 Gets or sets the RDK material RMTL file path.
RdkMaterialXml
 Gets or sets the RDK material Xml string.
Type
 Gets the implied type based on what fields have been assigned.
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
CreateRhinoMaterial
 Creates a standard Rhino material from a colour.
CreateStandardMaterial
 Creates a standard Grasshopper material from a colour.
Duplicate
 Duplicate this material.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateMaterial
 Duplicate this material.
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
MaterialBestGuess
 Gets the best guess RenderMaterial for this shader.
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace