Grasshopper API
GH_PersistentReferenceParam<T> Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
 Grasshopper.Kernel.GH_PersistentReferenceParam<T>
 Grasshopper.Rhinoceros.Params.ModelContentParam<T>
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class GH_PersistentReferenceParam<T> : GH_PersistentParam<T>
where T : class, IGH_ReferencedData
Public MustInherit Class GH_PersistentReferenceParam(Of T As {Class, IGH_ReferencedData})
	Inherits GH_PersistentParam(Of T)
Type Parameters
T
The GH_PersistentReferenceParam<T> type exposes the following members.
Constructors
Name | Description
GH_PersistentReferenceParam<T>
Initializes a new instance of the GH_PersistentReferenceParam<T> class
Top
Properties
Name | Description
Icon |  (Overrides GH_DocumentObject.Icon.)
TypeName |  (Overrides GH_Param<T>.TypeName.)
Top
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
OnVolatileDataCollected |  (Overrides GH_Param<T>.OnVolatileDataCollected().)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace