Grasshopper API
ModelRenderContent Class
 Represents a Rhino render content. Wraps the functionality of the RenderContent type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Render.ModelRenderContent
 Grasshopper.Rhinoceros.Render.ModelRenderEnvironment
 Grasshopper.Rhinoceros.Render.ModelRenderMaterial
 Grasshopper.Rhinoceros.Render.ModelRenderTexture
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelRenderContent : ModelContent
Public MustInherit Class ModelRenderContent
	Inherits ModelContent
The ModelRenderContent type exposes the following members.
Properties
Name | Description
Attribs
TypeName |  (Overrides ModelData.TypeName.)
Top
Methods
Name | Description
DuplicateContent<TContent>
ToAttributes
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace