Grasshopper API
CentralSettings.PanelDefaultFontChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PanelDefaultFontChangedEventHandler()
Public Delegate Sub PanelDefaultFontChangedEventHandler
See Also
Reference
Grasshopper Namespace