Grasshopper API
Param_DisplayColorGradient Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<DisplayColorGradient>
 Grasshopper.Kernel.GH_PersistentParam<DisplayColorGradient>
 Grasshopper.Rhinoceros.Display.Params.Param_DisplayColorGradient
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_DisplayColorGradient : GH_PersistentParam<DisplayColorGradient>,
	IGH_PreviewObject
Public Class Param_DisplayColorGradient
	Inherits GH_PersistentParam(Of DisplayColorGradient)
	Implements IGH_PreviewObject
The Param_DisplayColorGradient type exposes the following members.
Constructors
Name | Description
Param_DisplayColorGradient
Initializes a new instance of the Param_DisplayColorGradient class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
Icon |  (Overrides GH_DocumentObject.Icon.)
IsPreviewCapable
Top
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace