Grasshopper API
AnnotationDimensionSettings.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<AnnotationDimensionSettings.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of AnnotationDimensionSettings.Attributes)
The AnnotationDimensionSettings.Attributes type exposes the following members.
Constructors
Name | Description
AnnotationDimensionSettings.Attributes
Initializes a new instance of the AnnotationDimensionSettings.Attributes class
Top
Properties
Name | Description
BaselineSpacing
CentermarkSize
CentermarkStyle
DecimalSeparator
DimensionLineExtension
ExtensionLineExtension
ExtensionLineOffset
FixedExtension
FixedExtensionLength
RadialTextAngleType
RadialTextLocation
RadialTextOrientation
SuppressExtension1
SuppressExtension2
TextAngleType
TextLocation
TextOrientation
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace