Grasshopper API
CentralSettings.CanvasObsoleteTagsChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasObsoleteTagsChangedEventHandler()
Public Delegate Sub CanvasObsoleteTagsChangedEventHandler
See Also
Reference
Grasshopper Namespace