Grasshopper API
GH_MenuTextBox.TextChangedEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void TextChangedEventHandler(
	GH_MenuTextBox sender,
	string newText
)
Public Delegate Sub TextChangedEventHandler (
	sender As GH_MenuTextBox,
	newText As String
)
Parameters
sender
Type: Grasshopper.GUI.GH_MenuTextBox
newText
Type: System.String
See Also
Reference
Grasshopper.GUI Namespace