Grasshopper API
AnnotationToleranceSettings Class
 Represents annotation tolerance settings.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationToleranceSettings : ModelData
Public NotInheritable Class AnnotationToleranceSettings
	Inherits ModelData
The AnnotationToleranceSettings type exposes the following members.
Constructors
Name | Description
AnnotationToleranceSettings()
Initializes a new instance of the AnnotationToleranceSettings class
AnnotationToleranceSettings(AnnotationToleranceSettings.Attributes)
Initializes a new instance of the AnnotationToleranceSettings class
AnnotationToleranceSettings(DimensionStyle)
Initializes a new instance of the AnnotationToleranceSettings class
Top
Properties
Name | Description
AlternateToleranceResolution
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
Top
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
Operators
Name | Description
Explicit(AnnotationToleranceSettings to DimensionStyle)
Implicit(AnnotationToleranceSettings.Attributes to AnnotationToleranceSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace