Grasshopper API
ClippingArrow.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.ClippingArrow.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<ClippingArrow.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of ClippingArrow.Attributes)
The ClippingArrow.Attributes type exposes the following members.
Constructors
Name | Description
ClippingArrow.Attributes
Initializes a new instance of the ClippingArrow.Attributes class
Top
Properties
Name | Description
ArrowType
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelData.Attributes.ToString().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace