Grasshopper API
ModelHatchLine.Attributes Structure
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Attributes : GH_ISerializable,
	IEquatable<ModelHatchLine.Attributes>
Public Structure Attributes
	Implements GH_ISerializable, IEquatable(Of ModelHatchLine.Attributes)
The ModelHatchLine.Attributes type exposes the following members.
Properties
Name | Description
Angle
Base
Offset
Segments
Top
Methods
Name | Description
Equals(ModelHatchLine.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
From
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToHatchLine
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace