Grasshopper API
GH_InstanceReference.GH_InstanceReferenceProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_InstanceReference>
 Grasshopper.Kernel.Types.GH_InstanceReference.GH_InstanceReferenceProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_InstanceReferenceProxy : GH_GooProxy<GH_InstanceReference>
Public Class GH_InstanceReferenceProxy
	Inherits GH_GooProxy(Of GH_InstanceReference)
The GH_InstanceReference.GH_InstanceReferenceProxy type exposes the following members.
Constructors
Name | Description
GH_InstanceReference.GH_InstanceReferenceProxy
Initializes a new instance of the GH_InstanceReference.GH_InstanceReferenceProxy class
Top
Properties
Name | Description
Definition
ObjectID
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace