Grasshopper API
GH_PatternMatching Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_PatternMatching
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class GH_PatternMatching
Public NotInheritable Class GH_PatternMatching
The GH_PatternMatching type exposes the following members.
Methods
Name | Description
Contains
EndsWith
Equals
IsMatch
MatchRegex
MatchWildcards
StartsWith
Top
See Also
Reference
Grasshopper.Kernel Namespace