Grasshopper API
GH_Hatch Class
 Represents an implementation of a Rhino hatch.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Hatch>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Hatch>
 Grasshopper.Kernel.Types.GH_Hatch
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_Hatch : GH_GeometricGoo<Hatch>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_Hatch
	Inherits GH_GeometricGoo(Of Hatch)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_Hatch type exposes the following members.
Constructors
Name | Description
GH_Hatch()
 Default constructor, creates an invalid hatch.
GH_Hatch(GH_Hatch)
 Create a duplicate of another GH_Hatch. This constructor also copies reference data.
GH_Hatch(Guid)
 Create a new referenced hatch that references a Rhino hatch with the specified ID.
GH_Hatch(Hatch)
 Create a duplicate of an existing hatch.
GH_Hatch(Hatch, ModelHatchPattern)
 Create a duplicate of an existing hatch.
Top
Properties
Name | Description
BackgroundColor
BackgroundPlotColor
BoundaryColor
BoundaryColorSource
BoundaryPlotColor
BoundaryPlotColorSource
BoundaryPlotWeightMillimeters
BoundaryVisible
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this hatch object. The hatch is considered to be loaded when the local hatch instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this hatch. If the hatch is referenced but cannot be loaded, the hatch is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
Pattern
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the hatch is referenced, the local instance of the hatch is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this hatch.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateHatch
 Create a duplicate of this hatch.
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the hatch is referenced and not yet loaded, attempts to load the hatch.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the hatch using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace