Grasshopper API
Param_AnnotationArrow Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationArrow>
 Grasshopper.Kernel.GH_PersistentParam<AnnotationArrow>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationArrow
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationArrow : GH_PersistentParam<AnnotationArrow>
Public NotInheritable Class Param_AnnotationArrow
	Inherits GH_PersistentParam(Of AnnotationArrow)
The Param_AnnotationArrow type exposes the following members.
Constructors
Name | Description
Param_AnnotationArrow
Initializes a new instance of the Param_AnnotationArrow class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace