Grasshopper API
CentralSettings.RibbonVisibleChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void RibbonVisibleChangedEventHandler()
Public Delegate Sub RibbonVisibleChangedEventHandler
See Also
Reference
Grasshopper Namespace