Grasshopper API
GH_Document.GH_ScheduleDelegate Delegate
 Callback signature for Scheduled Solutions.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void GH_ScheduleDelegate(
	GH_Document doc
)
Public Delegate Sub GH_ScheduleDelegate (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
Document that was scheduled.
See Also
Reference
Grasshopper.Kernel Namespace