Grasshopper API
ModelContent.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 More...
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<ModelContent.Attributes>
Public MustInherit Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of ModelContent.Attributes)
The ModelContent.Attributes type exposes the following members.
Constructors
Name | Description
ModelContent.Attributes
Initializes a new instance of the ModelContent.Attributes class
Top
Properties
Name | Description
Name
 The last component of the element Path.
Notes
Parent
 Path of the parent element in 'Root::Parent' format if nested.
Path
 Full content path in 'Root::Parent::Name' format if is nested.
Tags
Top
Methods
Name | Description
AsFrozen
CloneOnWrite<A>
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
IsValidContentName
Read |  (Overrides ModelData.Attributes.Read(GH_IReader).)
ReadData
ToString |  (Overrides ModelData.Attributes.ToString().)
Write |  (Overrides ModelData.Attributes.Write(GH_IWriter).)
WriteData
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Display.ModelDisplayMode.Attributes
 Grasshopper.Rhinoceros.Display.ModelNamedView.Attributes
 Grasshopper.Rhinoceros.Display.ModelViewport.Attributes
 Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderSkylight.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderSun.Attributes