Grasshopper API
GH_Material.MaterialType Enumeration
 Enumerates the possible material types.
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public enum MaterialType
Public Enumeration MaterialType
Members
Member name | Value | Description
Shader | 0 |  Display shader, very basic colour information, nothing more.
RhinoMaterial | 1 |  A material from the Rhino document, identified by ID.
XmlMaterial | 2 |  A material defined by an RDK Xml string.
RmtlMaterial | 3 |  A material loaded from an RMTL file.
See Also
Reference
Grasshopper.Kernel.Types Namespace