Grasshopper API
ModelContentEnablerLoader Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_AssemblyPriority
 Grasshopper.Rhinoceros.ModelContentEnablerLoader
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class ModelContentEnablerLoader : GH_AssemblyPriority
Public Class ModelContentEnablerLoader
	Inherits GH_AssemblyPriority
The ModelContentEnablerLoader type exposes the following members.
Constructors
Name | Description
ModelContentEnablerLoader
Initializes a new instance of the ModelContentEnablerLoader class
Top
Methods
Name | Description
PriorityLoad |  (Overrides GH_AssemblyPriority.PriorityLoad().)
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace