Grasshopper API
IGH_RenderAwareData Interface
 Implement this interface in your IGH_Goo type if it may have render geometry.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public interface IGH_RenderAwareData
Public Interface IGH_RenderAwareData
The IGH_RenderAwareData type exposes the following members.
Methods
Name | Description
AppendRenderGeometry
 Push this geometry down a render pipeline.
Top
See Also
Reference
Grasshopper.Kernel Namespace