Grasshopper API
ModelRenderTexture Class
 Represents a Rhino render texture. Wraps the functionality of the RenderTexture type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Render.ModelRenderContent
 Grasshopper.Rhinoceros.Render.ModelRenderTexture
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelRenderTexture : ModelRenderContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelRenderTexture
	Inherits ModelRenderContent
	Implements IGH_BakeAwareData
The ModelRenderTexture type exposes the following members.
Constructors
Name | Description
ModelRenderTexture()
Initializes a new instance of the ModelRenderTexture class
ModelRenderTexture(ModelRenderTexture.Attributes)
Initializes a new instance of the ModelRenderTexture class
ModelRenderTexture(Guid)
Initializes a new instance of the ModelRenderTexture class
ModelRenderTexture(RenderTexture)
Initializes a new instance of the ModelRenderTexture class
Top
Properties
Name | Description
TypeName |  (Overrides ModelRenderContent.TypeName.)
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelRenderTexture.Attributes to ModelRenderTexture)
Implicit(ColorRGBA to ModelRenderTexture)
Implicit(RenderTexture to ModelRenderTexture)
Implicit(String to ModelRenderTexture)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace