Grasshopper API
ModelLayer.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Model.ModelLayer.Attributes
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelLayer.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelLayer.Attributes)
The ModelLayer.Attributes type exposes the following members.
Constructors
Name | Description
ModelLayer.Attributes
Initializes a new instance of the ModelLayer.Attributes class
Top
Properties
Name | Description
DisplayColor
DraftingColor
Hidden
HiddenOnModel
HiddenOnNewDetail
Linetype
LineWeight
Locked
Material
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
Operators
Name | Description
Implicit(String to ModelLayer.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace