Grasshopper API
Param_AnnotationToleranceSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationToleranceSettings>
 Grasshopper.Rhinoceros.Params.ModelDataParam<AnnotationToleranceSettings>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationToleranceSettings
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationToleranceSettings : ModelDataParam<AnnotationToleranceSettings>
Public NotInheritable Class Param_AnnotationToleranceSettings
	Inherits ModelDataParam(Of AnnotationToleranceSettings)
The Param_AnnotationToleranceSettings type exposes the following members.
Constructors
Name | Description
Param_AnnotationToleranceSettings
Initializes a new instance of the Param_AnnotationToleranceSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace