Grasshopper API
GH_PatternMatching.MatchingMode Enumeration
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public enum MatchingMode
Public Enumeration MatchingMode
Members
Member name | Value | Description
Equals | 0
Wildcards | 1
Regex | 2
Contains | 3
StartsWith | 4
EndsWith | 5
See Also
Reference
Grasshopper.Kernel Namespace