Grasshopper API
ModelComponentContent.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 More...
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class Attributes : ModelContent.Attributes,
	IEquatable<ModelComponentContent.Attributes>
Public MustInherit Class Attributes
	Inherits ModelContent.Attributes
	Implements IEquatable(Of ModelComponentContent.Attributes)
The ModelComponentContent.Attributes type exposes the following members.
Constructors
Name | Description
ModelComponentContent.Attributes
Initializes a new instance of the ModelComponentContent.Attributes class
Top
Properties
Name | Description
UserText
Top
Methods
Name | Description
Equals(Object, IEqualityComparer) |  (Overrides ModelContent.Attributes.Equals(Object, IEqualityComparer).)
GetHashCode(IEqualityComparer) |  (Overrides ModelContent.Attributes.GetHashCode(IEqualityComparer).)
ReadData |  (Overrides ModelContent.Attributes.ReadData(GH_IReader).)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
WriteData |  (Overrides ModelContent.Attributes.WriteData(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle.Attributes
 Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Attributes
 Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes
 Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes
 Grasshopper.Rhinoceros.Model.ModelInstanceDefinition.Attributes
 Grasshopper.Rhinoceros.Model.ModelLayer.Attributes
 Grasshopper.Rhinoceros.Model.ModelObject.Attributes
 Grasshopper.Rhinoceros.Render.ModelTextureMapping.Attributes