Grasshopper API
GH_SubD Class
 Represents a 3D subdivision surface.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<SubD>
 Grasshopper.Kernel.Types.GH_GeometricGoo<SubD>
 Grasshopper.Kernel.Types.GH_SubD
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_SubD : GH_GeometricGoo<SubD>,
	IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData
Public Class GH_SubD
	Inherits GH_GeometricGoo(Of SubD)
	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData, IGH_RenderAwareData
The GH_SubD type exposes the following members.
Constructors
Name | Description
GH_SubD()
Initializes a new instance of the GH_SubD class
GH_SubD(GH_SubD)
Initializes a new instance of the GH_SubD class
GH_SubD(Guid)
Initializes a new instance of the GH_SubD class
GH_SubD(SubD)
Initializes a new instance of the GH_SubD class
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded |  (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid |  (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
AppendRenderGeometry
BakeGeometry
CastFrom |  (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches |  (Overrides GH_GeometricGoo<T>.ClearCaches().)
DestroyPreviewMeshes
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry |  (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateSubD
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
GetPreviewMeshes
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace