Grasshopper API
ModelDisplayMode Class
 Represents a Rhino display mode. Wraps the functionality of the DisplayModeDescription type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelDisplayMode
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelDisplayMode : ModelContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelDisplayMode
	Inherits ModelContent
	Implements IGH_BakeAwareData
The ModelDisplayMode type exposes the following members.
Constructors
Name | Description
ModelDisplayMode()
Initializes a new instance of the ModelDisplayMode class
ModelDisplayMode(ModelDisplayMode.Attributes)
Initializes a new instance of the ModelDisplayMode class
ModelDisplayMode(DisplayModeDescription)
Initializes a new instance of the ModelDisplayMode class
ModelDisplayMode(Guid)
Initializes a new instance of the ModelDisplayMode class
Top
Properties
Name | Description
Unset
Top
Methods
Name | Description
Cast
ToAttributes
TooltipString |  (Overrides ModelContent.TooltipString().)
ToString |  (Overrides ModelContent.ToString().)
Top
Operators
Name | Description
Implicit(ModelDisplayMode.Attributes to ModelDisplayMode)
Implicit(DisplayModeDescription to ModelDisplayMode)
Implicit(Guid to ModelDisplayMode)
Implicit(String to ModelDisplayMode)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace