Grasshopper API
Param_ObjectDrafting Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectDrafting>
 Grasshopper.Rhinoceros.Params.ModelDataParam<ObjectDrafting>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectDrafting
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectDrafting : ModelDataParam<ObjectDrafting>
Public NotInheritable Class Param_ObjectDrafting
	Inherits ModelDataParam(Of ObjectDrafting)
The Param_ObjectDrafting type exposes the following members.
Constructors
Name | Description
Param_ObjectDrafting
Initializes a new instance of the Param_ObjectDrafting class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace