Grasshopper API
Param_MatchText Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<GH_String>
 Grasshopper.Kernel.GH_PersistentParam<GH_String>
 Grasshopper.Rhinoceros.Params.Param_MatchText
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_MatchText : GH_PersistentParam<GH_String>
Public Class Param_MatchText
	Inherits GH_PersistentParam(Of GH_String)
The Param_MatchText type exposes the following members.
Constructors
Name | Description
Param_MatchText
Initializes a new instance of the Param_MatchText class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
MatchingMode
Negate
StateTags |  (Overrides GH_Param<T>.StateTags.)
TypeName |  (Overrides GH_Param<T>.TypeName.)
Top
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_PersistentParam<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
MatchText
Menu_CustomMultiValueItem |  (Overrides GH_PersistentParam<T>.Menu_CustomMultiValueItem().)
Menu_CustomSingleValueItem |  (Overrides GH_PersistentParam<T>.Menu_CustomSingleValueItem().)
Menu_SingleStringValueKeyDown
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
RemoveEffects |  (Overrides GH_Param<T>.RemoveEffects().)
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace