Grasshopper API
ModelSectionStyle.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Drafting.ModelSectionStyle.Attributes
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelSectionStyle.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelSectionStyle.Attributes)
The ModelSectionStyle.Attributes type exposes the following members.
Constructors
Name | Description
ModelSectionStyle.Attributes
Initializes a new instance of the ModelSectionStyle.Attributes class
Top
Properties
Name | Description
BackgroundFillColor
BackgroundFillMode
BackgroundFillPrintColor
BoundaryColor
BoundaryLinetype
BoundaryLineWeight
BoundaryPrintColor
HatchPattern
HatchPatternColor
HatchPatternLineWeight
HatchPatternPrintColor
HatchRotation
HatchScale
IsBoundaryVisible
SectionFillRule
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
Operators
Name | Description
Implicit(String to ModelSectionStyle.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace