Grasshopper API
ObjectDrafting Class
 Represents a Rhino object drafting attributes.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Drafting.ObjectDrafting
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectDrafting : ModelValue
Public NotInheritable Class ObjectDrafting
	Inherits ModelValue
The ObjectDrafting type exposes the following members.
Constructors
Name | Description
ObjectDrafting()
Initializes a new instance of the ObjectDrafting class
ObjectDrafting(ObjectDrafting.Attributes)
Initializes a new instance of the ObjectDrafting class
Top
Properties
Name | Description
Color
LineScale
Linetype
LineWidth
Order
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToDetails
Top
Operators
Name | Description
Implicit(ObjectDrafting.Attributes to ObjectDrafting)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace