Grasshopper API
CentralSettings.CanvasZuiZoomLevelChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasZuiZoomLevelChangedEventHandler()
Public Delegate Sub CanvasZuiZoomLevelChangedEventHandler
See Also
Reference
Grasshopper Namespace