Grasshopper API
ModelLinetype Class
 Represents a Rhino model linetype. Wraps the functionality of the Linetype type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Drafting.ModelLinetype
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelLinetype : ModelComponentContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelLinetype
	Inherits ModelComponentContent
	Implements IGH_BakeAwareData
The ModelLinetype type exposes the following members.
Constructors
Name | Description
ModelLinetype()
Initializes a new instance of the ModelLinetype class
ModelLinetype(ModelLinetype.Attributes)
Initializes a new instance of the ModelLinetype class
ModelLinetype(Guid)
Initializes a new instance of the ModelLinetype class
ModelLinetype(Linetype)
Initializes a new instance of the ModelLinetype class
Top
Properties
Name | Description
CapStyle
JoinStyle
Name |  (Overrides ModelContent.Name.)
Segments
TaperPoints
Unset
Width
WidthUnits
Top
Methods
Name | Description
Cast
ToAttributes
Top
Operators
Name | Description
Implicit(ModelLinetype.Attributes to ModelLinetype)
Implicit(Linetype to ModelLinetype)
Implicit(String to ModelLinetype)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace