Grasshopper API
Param_ModelMeshingParameters Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelMeshingParameters>
 Grasshopper.Kernel.GH_PersistentParam<ModelMeshingParameters>
 Grasshopper.Rhinoceros.Params.Param_ModelMeshingParameters
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelMeshingParameters : GH_PersistentParam<ModelMeshingParameters>
Public NotInheritable Class Param_ModelMeshingParameters
	Inherits GH_PersistentParam(Of ModelMeshingParameters)
The Param_ModelMeshingParameters type exposes the following members.
Constructors
Name | Description
Param_ModelMeshingParameters
Initializes a new instance of the Param_ModelMeshingParameters class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace