Grasshopper API
ModelPageViewport Class
 Represents a Rhino page layout. Wraps the main viewport of a RhinoPageView instance.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelViewport
 Grasshopper.Rhinoceros.Display.ModelPageViewport
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelPageViewport : ModelViewport
Public NotInheritable Class ModelPageViewport
	Inherits ModelViewport
The ModelPageViewport type exposes the following members.
Constructors
Name | Description
ModelPageViewport()
Initializes a new instance of the ModelPageViewport class
ModelPageViewport(ModelPageViewport.Attributes)
Initializes a new instance of the ModelPageViewport class
ModelPageViewport(Guid)
Initializes a new instance of the ModelPageViewport class
ModelPageViewport(RhinoViewport)
Initializes a new instance of the ModelPageViewport class
Top
Properties
Name | Description
PageNumber
PageSettings
Space |  (Overrides ModelViewport.Space.)
ViewportType |  (Overrides ModelViewport.ViewportType.)
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelViewport.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelPageViewport.Attributes to ModelPageViewport)
Implicit(RhinoViewport to ModelPageViewport)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace