Grasshopper API
Param_ModelLinetype Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelLinetype>
 Grasshopper.Kernel.GH_PersistentParam<ModelLinetype>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelLinetype>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelLinetype>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelLinetype
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelLinetype : ModelContentParam<ModelLinetype>
Public NotInheritable Class Param_ModelLinetype
	Inherits ModelContentParam(Of ModelLinetype)
The Param_ModelLinetype type exposes the following members.
Constructors
Name | Description
Param_ModelLinetype
Initializes a new instance of the Param_ModelLinetype class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace