Grasshopper API
Param_ModelContent Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<IGH_ModelContentData>
 Grasshopper.Kernel.GH_PersistentParam<IGH_ModelContentData>
 Grasshopper.Kernel.GH_PersistentReferenceParam<IGH_ModelContentData>
 Grasshopper.Rhinoceros.Params.ModelContentParam<IGH_ModelContentData>
 Grasshopper.Rhinoceros.Params.Param_ModelContent
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelContent : ModelContentParam<IGH_ModelContentData>
Public NotInheritable Class Param_ModelContent
	Inherits ModelContentParam(Of IGH_ModelContentData)
The Param_ModelContent type exposes the following members.
Constructors
Name | Description
Param_ModelContent
Initializes a new instance of the Param_ModelContent class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
TypeName |  (Overrides GH_PersistentReferenceParam<T>.TypeName.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace