Grasshopper API
ItemDisplayColor Class
 Represents a Rhino item display color.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Display.ItemDisplayColor
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ItemDisplayColor : ModelValue
Public NotInheritable Class ItemDisplayColor
	Inherits ModelValue
The ItemDisplayColor type exposes the following members.
Constructors
Name | Description
ItemDisplayColor()
Initializes a new instance of the ItemDisplayColor class
ItemDisplayColor(ItemDisplayColor.Value)
Initializes a new instance of the ItemDisplayColor class
Top
Properties
Name | Description
Color
Source
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Top
Operators
Name | Description
Implicit(ItemDisplayColor to ItemDisplayColor.Value)
Implicit(ItemDisplayColor.Value to ItemDisplayColor)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace