Grasshopper API
GH_Canvas.ModifiersChangedEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ModifiersChangedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub ModifiersChangedEventHandler (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace