Grasshopper API
Param_ModelSpaceViewport Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelSpaceViewport>
 Grasshopper.Kernel.GH_PersistentParam<ModelSpaceViewport>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelSpaceViewport>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelSpaceViewport>
 Grasshopper.Rhinoceros.Display.Params.Param_ModelSpaceViewport
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelSpaceViewport : ModelContentParam<ModelSpaceViewport>
Public NotInheritable Class Param_ModelSpaceViewport
	Inherits ModelContentParam(Of ModelSpaceViewport)
The Param_ModelSpaceViewport type exposes the following members.
Constructors
Name | Description
Param_ModelSpaceViewport
Initializes a new instance of the Param_ModelSpaceViewport class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace