Grasshopper API
CentralSettings.CanvasRadialMenuChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasRadialMenuChangedEventHandler()
Public Delegate Sub CanvasRadialMenuChangedEventHandler
See Also
Reference
Grasshopper Namespace