Grasshopper API
AnnotationLeaderSettings Class
 Represents annotation leader settings.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationLeaderSettings : ModelData
Public NotInheritable Class AnnotationLeaderSettings
	Inherits ModelData
The AnnotationLeaderSettings type exposes the following members.
Constructors
Name | Description
AnnotationLeaderSettings()
Initializes a new instance of the AnnotationLeaderSettings class
AnnotationLeaderSettings(AnnotationLeaderSettings.Attributes)
Initializes a new instance of the AnnotationLeaderSettings class
AnnotationLeaderSettings(DimensionStyle)
Initializes a new instance of the AnnotationLeaderSettings class
Top
Properties
Name | Description
ContentAngleType
CurveType
HasLanding
LandingLength
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
Operators
Name | Description
Explicit(AnnotationLeaderSettings to DimensionStyle)
Implicit(AnnotationLeaderSettings.Attributes to AnnotationLeaderSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace