Grasshopper API
GH_AnnotationBase.GH_AnnotationBaseProxy<T> Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<T>
 Grasshopper.Kernel.Types.GH_AnnotationBase.GH_AnnotationBaseProxy<T>
 Grasshopper.Kernel.Types.GH_Dimension.GH_DimensionProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_AnnotationBaseProxy<T> : GH_GooProxy<T>
where T : GH_AnnotationBase
Public Class GH_AnnotationBaseProxy(Of T As GH_AnnotationBase)
	Inherits GH_GooProxy(Of T)
Type Parameters
T
The GH_AnnotationBase.GH_AnnotationBaseProxy<T> type exposes the following members.
Constructors
Name | Description
GH_AnnotationBase.GH_AnnotationBaseProxy<T>
Initializes a new instance of the GH_AnnotationBase.GH_AnnotationBaseProxy<T> class
Top
Properties
Name | Description
AnnotationStyle
AnnotationType
ObjectID
PlainText
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace