Grasshopper API
AnnotationTextSettings Class
 Represents model text settings.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationTextSettings : ModelData
Public NotInheritable Class AnnotationTextSettings
	Inherits ModelData
The AnnotationTextSettings type exposes the following members.
Constructors
Name | Description
AnnotationTextSettings()
Initializes a new instance of the AnnotationTextSettings class
AnnotationTextSettings(AnnotationTextSettings.Attributes)
Initializes a new instance of the AnnotationTextSettings class
AnnotationTextSettings(DimensionStyle)
Initializes a new instance of the AnnotationTextSettings class
Top
Properties
Name | Description
DrawForward
DrawTextMask
FitText
Font
LineSpaceScale
MaskColor
MaskColorSource
MaskFrame
MaskOffset
TextGap
TextHeight
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
UseKerning
Top
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
Operators
Name | Description
Explicit(AnnotationTextSettings to DimensionStyle)
Implicit(AnnotationTextSettings.Attributes to AnnotationTextSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace