Grasshopper API
GH_ClippingPlane.GH_ClippingPlaneProxy<T> Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<T>
 Grasshopper.Kernel.Types.GH_ClippingPlane.GH_ClippingPlaneProxy<T>
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_ClippingPlaneProxy<T> : GH_GooProxy<T>
where T : GH_ClippingPlane
Public Class GH_ClippingPlaneProxy(Of T As GH_ClippingPlane)
	Inherits GH_GooProxy(Of T)
Type Parameters
T
The GH_ClippingPlane.GH_ClippingPlaneProxy<T> type exposes the following members.
Constructors
Name | Description
GH_ClippingPlane.GH_ClippingPlaneProxy<T>
Initializes a new instance of the GH_ClippingPlane.GH_ClippingPlaneProxy<T> class
Top
Properties
Name | Description
AnnotationStyle
CustomDepth
Depth
LabelStyle
ObjectID
Origin
XAxis
YAxis
ZAxis
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace