Grasshopper API
CentralSettings.AuthorCompanyChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AuthorCompanyChangedEventHandler()
Public Delegate Sub AuthorCompanyChangedEventHandler
See Also
Reference
Grasshopper Namespace