Grasshopper API
GH_AutoSaveSettings.SaveOnDataFlatteningChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SaveOnDataFlatteningChangedEventHandler()
Public Delegate Sub SaveOnDataFlatteningChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace