Grasshopper API
ObjectDraftingColor Class
 Represents a Rhino object drafting color.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectDraftingColor : ModelValue
Public NotInheritable Class ObjectDraftingColor
	Inherits ModelValue
The ObjectDraftingColor type exposes the following members.
Constructors
Name | Description
ObjectDraftingColor()
Initializes a new instance of the ObjectDraftingColor class
ObjectDraftingColor(ObjectDraftingColor.Value)
Initializes a new instance of the ObjectDraftingColor class
Top
Properties
Name | Description
Color
Source
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
Top
Operators
Name | Description
Implicit(ObjectDraftingColor to ObjectDraftingColor.Value)
Implicit(ObjectDraftingColor.Value to ObjectDraftingColor)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace