Grasshopper API
ObjectDisplayColor.Value Structure
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IEquatable<ObjectDisplayColor.Value>,
	IComparable<ObjectDisplayColor.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IEquatable(Of ObjectDisplayColor.Value),
	IComparable(Of ObjectDisplayColor.Value), IComparable
The ObjectDisplayColor.Value type exposes the following members.
Constructors
Name | Description
ObjectDisplayColor.Value(ModelColor)
Initializes a new instance of the ObjectDisplayColor.Value class
ObjectDisplayColor.Value(ObjectColorSource)
Initializes a new instance of the ObjectDisplayColor.Value class
ObjectDisplayColor.Value(ObjectColorSource, ModelColor)
Initializes a new instance of the ObjectDisplayColor.Value class
Top
Properties
Name | Description
ByLayer
ByMaterial
ByParent
Color
Source
Top
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectDisplayColor.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectDisplayColor.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Implicit(ModelColor to ObjectDisplayColor.Value)
Implicit(ObjectColorSource to ObjectDisplayColor.Value)
Implicit(ObjectDisplayColor.Value to ModelColor)
Implicit(ObjectDisplayColor.Value to ObjectColorSource)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace