Grasshopper API
ModelComponentContent Class
 Represents a Rhino model component. Wraps the functionality of the ModelComponent type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 More...
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelComponentContent : ModelContent
Public MustInherit Class ModelComponentContent
	Inherits ModelContent
The ModelComponentContent type exposes the following members.
Properties
Name | Description
Attribs
UserText
Top
Methods
Name | Description
ToAttributes
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
 Grasshopper.Rhinoceros.Drafting.ModelHatchPattern
 Grasshopper.Rhinoceros.Drafting.ModelLinetype
 Grasshopper.Rhinoceros.Model.ModelInstanceDefinition
 Grasshopper.Rhinoceros.Model.ModelLayer
 Grasshopper.Rhinoceros.Model.ModelObject