Grasshopper API
GH_TextDot.GH_TextDotProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_TextDot>
 Grasshopper.Kernel.Types.GH_TextDot.GH_TextDotProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_TextDotProxy : GH_GooProxy<GH_TextDot>
Public Class GH_TextDotProxy
	Inherits GH_GooProxy(Of GH_TextDot)
The GH_TextDot.GH_TextDotProxy type exposes the following members.
Constructors
Name | Description
GH_TextDot.GH_TextDotProxy
Initializes a new instance of the GH_TextDot.GH_TextDotProxy class
Top
Properties
Name | Description
ObjectID
Point
SecondaryText
Text
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace