Grasshopper API
Param_AngularDimension Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<GH_AngularDimension>
 Grasshopper.Kernel.GH_PersistentParam<GH_AngularDimension>
 Grasshopper.Kernel.GH_PersistentGeometryParam<GH_AngularDimension>
 Grasshopper.Kernel.Parameters.Param_AngularDimension
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AngularDimension : GH_PersistentGeometryParam<GH_AngularDimension>,
	IGH_PreviewObject, IGH_BakeAwareObject
Public NotInheritable Class Param_AngularDimension
	Inherits GH_PersistentGeometryParam(Of GH_AngularDimension)
	Implements IGH_PreviewObject, IGH_BakeAwareObject
The Param_AngularDimension type exposes the following members.
Constructors
Name | Description
Param_AngularDimension
Initializes a new instance of the Param_AngularDimension class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsBakeCapable
IsPreviewCapable
Top
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
DrawViewportMeshes
DrawViewportWires
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Parameters Namespace