Grasshopper API
Param_ModelHatchLine Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelHatchLine>
 Grasshopper.Kernel.GH_PersistentParam<ModelHatchLine>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelHatchLine
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelHatchLine : GH_PersistentParam<ModelHatchLine>
Public NotInheritable Class Param_ModelHatchLine
	Inherits GH_PersistentParam(Of ModelHatchLine)
The Param_ModelHatchLine type exposes the following members.
Constructors
Name | Description
Param_ModelHatchLine
Initializes a new instance of the Param_ModelHatchLine class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace