Grasshopper API
GH_ComponentPaletteStyle Enumeration
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public enum GH_ComponentPaletteStyle
Public Enumeration GH_ComponentPaletteStyle
Members
Member name | Value | Description
Alphabetical | 0
TabPanel | 1
Hue | 2
See Also
Reference
Grasshopper.Kernel Namespace