Grasshopper API
GH_Canvas.CanvasPrePaintWidgetsEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasPrePaintWidgetsEventHandler(
	GH_Canvas sender
)
Public Delegate Sub CanvasPrePaintWidgetsEventHandler (
	sender As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace