Grasshopper API
GH_SliderBase.DrawSliderChannel Delegate
 This delegate is used to intervene in the slider drawing process.
 Namespace: Grasshopper.GUI.Base
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void DrawSliderChannel(
	GH_SliderBase slider,
	Graphics G
)
Public Delegate Sub DrawSliderChannel (
	slider As GH_SliderBase,
	G As Graphics
)
Parameters
slider
Type: Grasshopper.GUI.Base.GH_SliderBase
Slider being drawn.
G
Type: System.Drawing.Graphics
Graphics object used for drawing.
See Also
Reference
Grasshopper.GUI.Base Namespace