Grasshopper API
Param_ModelUnitSystem Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelUnitSystem>
 Grasshopper.Kernel.GH_PersistentParam<ModelUnitSystem>
 Grasshopper.Rhinoceros.Params.Param_ModelUnitSystem
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelUnitSystem : GH_PersistentParam<ModelUnitSystem>
Public NotInheritable Class Param_ModelUnitSystem
	Inherits GH_PersistentParam(Of ModelUnitSystem)
The Param_ModelUnitSystem type exposes the following members.
Constructors
Name | Description
Param_ModelUnitSystem
Initializes a new instance of the Param_ModelUnitSystem class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
Fields
Name | Description
Values
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace