Grasshopper API
Param_ModelRenderSun Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelRenderSun>
 Grasshopper.Kernel.GH_PersistentParam<ModelRenderSun>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelRenderSun>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelRenderSun>
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderSun
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelRenderSun : ModelContentParam<ModelRenderSun>,
	IGH_PreviewObject
Public NotInheritable Class Param_ModelRenderSun
	Inherits ModelContentParam(Of ModelRenderSun)
	Implements IGH_PreviewObject
The Param_ModelRenderSun type exposes the following members.
Constructors
Name | Description
Param_ModelRenderSun
Initializes a new instance of the Param_ModelRenderSun class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsPreviewCapable
Top
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace