Grasshopper API
Param_AnnotationDimensionSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationDimensionSettings>
 Grasshopper.Rhinoceros.Params.ModelDataParam<AnnotationDimensionSettings>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationDimensionSettings
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationDimensionSettings : ModelDataParam<AnnotationDimensionSettings>
Public NotInheritable Class Param_AnnotationDimensionSettings
	Inherits ModelDataParam(Of AnnotationDimensionSettings)
The Param_AnnotationDimensionSettings type exposes the following members.
Constructors
Name | Description
Param_AnnotationDimensionSettings
Initializes a new instance of the Param_AnnotationDimensionSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace