Grasshopper API
GH_SubD.GH_SubDProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_SubD>
 Grasshopper.Kernel.Types.GH_SubD.GH_SubDProxy
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_SubDProxy : GH_GooProxy<GH_SubD>
Public Class GH_SubDProxy
	Inherits GH_GooProxy(Of GH_SubD)
The GH_SubD.GH_SubDProxy type exposes the following members.
Constructors
Name | Description
GH_SubD.GH_SubDProxy
Initializes a new instance of the GH_SubD.GH_SubDProxy class
Top
Properties
Name | Description
Area
EdgeCount
FaceCount
ObjectID
Solid
VertexCount
Volume
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace