Grasshopper API
ModelHatchLine Class
 Represents a Rhino model hatch line.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Drafting.ModelHatchLine
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelHatchLine : ModelValue
Public NotInheritable Class ModelHatchLine
	Inherits ModelValue
The ModelHatchLine type exposes the following members.
Constructors
Name | Description
ModelHatchLine()
Initializes a new instance of the ModelHatchLine class
ModelHatchLine(ModelHatchLine.Attributes)
Initializes a new instance of the ModelHatchLine class
ModelHatchLine(HatchLine)
Initializes a new instance of the ModelHatchLine class
Top
Properties
Name | Description
Angle
Base
Offset
Segments
Top
Methods
Name | Description
Cast
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToHatchLine
ToString |  (Overrides ModelValue.ToString().)
Top
Operators
Name | Description
Implicit(ModelHatchLine.Attributes to ModelHatchLine)
Implicit(HatchLine to ModelHatchLine)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace