Grasshopper API
CentralSettings.CanvasFullNamesChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasFullNamesChangedEventHandler()
Public Delegate Sub CanvasFullNamesChangedEventHandler
See Also
Reference
Grasshopper Namespace