Grasshopper API
Param_ModelStandardViewport Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelStandardViewport>
 Grasshopper.Kernel.GH_PersistentParam<ModelStandardViewport>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelStandardViewport>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelStandardViewport>
 Grasshopper.Rhinoceros.Display.Params.Param_ModelStandardViewport
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelStandardViewport : ModelContentParam<ModelStandardViewport>
Public NotInheritable Class Param_ModelStandardViewport
	Inherits ModelContentParam(Of ModelStandardViewport)
The Param_ModelStandardViewport type exposes the following members.
Constructors
Name | Description
Param_ModelStandardViewport
Initializes a new instance of the Param_ModelStandardViewport class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace