Grasshopper API
Param_ObjectDisplayColor Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectDisplayColor>
 Grasshopper.Kernel.GH_PersistentParam<ObjectDisplayColor>
 Grasshopper.Rhinoceros.Display.Params.Param_ObjectDisplayColor
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectDisplayColor : GH_PersistentParam<ObjectDisplayColor>
Public NotInheritable Class Param_ObjectDisplayColor
	Inherits GH_PersistentParam(Of ObjectDisplayColor)
The Param_ObjectDisplayColor type exposes the following members.
Constructors
Name | Description
Param_ObjectDisplayColor
Initializes a new instance of the Param_ObjectDisplayColor class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace