Grasshopper API
Param_ModelAnnotationStyle Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelAnnotationStyle>
 Grasshopper.Kernel.GH_PersistentParam<ModelAnnotationStyle>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelAnnotationStyle>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelAnnotationStyle>
 Grasshopper.Rhinoceros.Annotations.Params.Param_ModelAnnotationStyle
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelAnnotationStyle : ModelContentParam<ModelAnnotationStyle>
Public NotInheritable Class Param_ModelAnnotationStyle
	Inherits ModelContentParam(Of ModelAnnotationStyle)
The Param_ModelAnnotationStyle type exposes the following members.
Constructors
Name | Description
Param_ModelAnnotationStyle
Initializes a new instance of the Param_ModelAnnotationStyle class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace