Grasshopper API
GH_TextDot Class
 Represents an implementation of a Rhino text dot.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<TextDot>
 Grasshopper.Kernel.Types.GH_GeometricGoo<TextDot>
 Grasshopper.Kernel.Types.GH_TextDot
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_TextDot : GH_GeometricGoo<TextDot>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_TextDot
	Inherits GH_GeometricGoo(Of TextDot)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_TextDot type exposes the following members.
Constructors
Name | Description
GH_TextDot()
 Default constructor, creates an invalid text dot.
GH_TextDot(GH_TextDot)
 Create a duplicate of another GH_TextDot. This constructor also copies reference data.
GH_TextDot(Guid)
 Create a new referenced text dot that references a Rhino text dot with the specified ID.
GH_TextDot(TextDot)
 Create a duplicate of an existing text dot.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this text dot object. The text dot is considered to be loaded when the local text dot instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this text dot. If the text dot is referenced but cannot be loaded, the text dot is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the text dot is referenced, the local instance of the text dot is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this text dot.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateTextDot
 Create a duplicate of this text dot.
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the text dot is referenced and not yet loaded, attempts to load the text dot.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the text dot using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace