Grasshopper API
ModelRenderSkylight.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderSkylight.Attributes
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelContent.Attributes,
	IEquatable<ModelRenderSkylight.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelContent.Attributes
	Implements IEquatable(Of ModelRenderSkylight.Attributes)
The ModelRenderSkylight.Attributes type exposes the following members.
Constructors
Name | Description
ModelRenderSkylight.Attributes
Initializes a new instance of the ModelRenderSkylight.Attributes class
Top
Properties
Name | Description
Enabled
Environment
EnvironmentOverride
Top
Methods
Name | Description
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace