Grasshopper API
GH_Canvas.CanvasPostPaintOverlayEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasPostPaintOverlayEventHandler(
	GH_Canvas sender
)
Public Delegate Sub CanvasPostPaintOverlayEventHandler (
	sender As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace