Grasshopper API
GH_Document.FilePathChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void FilePathChangedEventHandler(
	Object sender,
	GH_DocFilePathEventArgs e
)
Public Delegate Sub FilePathChangedEventHandler (
	sender As Object,
	e As GH_DocFilePathEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocFilePathEventArgs
See Also
Reference
Grasshopper.Kernel Namespace