Grasshopper API
ModelInstanceDefinition Class
 Represents a Rhino block definition. Wraps the functionality of the InstanceDefinition type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Model.ModelInstanceDefinition
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelInstanceDefinition : ModelComponentContent,
	IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData
Public NotInheritable Class ModelInstanceDefinition
	Inherits ModelComponentContent
	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_PreviewMeshData
The ModelInstanceDefinition type exposes the following members.
Constructors
Name | Description
ModelInstanceDefinition()
Initializes a new instance of the ModelInstanceDefinition class
ModelInstanceDefinition(ModelInstanceDefinition.Attributes)
Initializes a new instance of the ModelInstanceDefinition class
ModelInstanceDefinition(Guid)
Initializes a new instance of the ModelInstanceDefinition class
ModelInstanceDefinition(InstanceDefinition)
Initializes a new instance of the ModelInstanceDefinition class
Top
Properties
Name | Description
FilePath
IsValid |  (Overrides ModelContent.IsValid.)
Objects
Unset
UpdateType
Url
UrlDescription
Top
Methods
Name | Description
BakeGeometry
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
GetBoundingBox
ToAttributes
Top
Operators
Name | Description
Implicit(ModelInstanceDefinition.Attributes to ModelInstanceDefinition)
Implicit(InstanceDefinition to ModelInstanceDefinition)
Implicit(String to ModelInstanceDefinition)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace