Grasshopper API
GH_MaterialPreviewControl.ColourChangedEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ColourChangedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub ColourChangedEventHandler (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI Namespace