Grasshopper API
GH_Dimension Class
 Represents an implementation of a Rhino dimension base class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Dimension
 Grasshopper.Kernel.Types.GH_AngularDimension
 Grasshopper.Kernel.Types.GH_Centermark
 Grasshopper.Kernel.Types.GH_LinearDimension
 Grasshopper.Kernel.Types.GH_OrdinateDimension
 Grasshopper.Kernel.Types.GH_RadialDimension
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class GH_Dimension : GH_AnnotationBase
Public MustInherit Class GH_Dimension
	Inherits GH_AnnotationBase
The GH_Dimension type exposes the following members.
Constructors
Name | Description
GH_Dimension()
 Default constructor, creates an invalid dimension.
GH_Dimension(Dimension)
 Create a duplicate of an existing dimension.
GH_Dimension(GH_Dimension)
 Create a duplicate of another GH_Dimension. This constructor also copies reference data.
GH_Dimension(Guid)
 Create a new referenced dimension that references a Rhino dimension with the specified ID.
GH_Dimension(ObjRef)
Initializes a new instance of the GH_Dimension class
GH_Dimension(Dimension, ModelAnnotationStyle)
 Create a duplicate of an existing dimension.
Top
Properties
Name | Description
Value
ValueType |  (Overrides GH_AnnotationBase.ValueType.)
Top
Methods
Name | Description
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_AnnotationBase.CastTo<T>(T).)
EmitProxy |  (Overrides GH_AnnotationBase.EmitProxy().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace