Grasshopper API
ObjectDraftingLinetype Class
 Represents a Rhino object drafting linetype.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectDraftingLinetype : ModelValue
Public NotInheritable Class ObjectDraftingLinetype
	Inherits ModelValue
The ObjectDraftingLinetype type exposes the following members.
Constructors
Name | Description
ObjectDraftingLinetype()
Initializes a new instance of the ObjectDraftingLinetype class
ObjectDraftingLinetype(ObjectDraftingLinetype.Value)
Initializes a new instance of the ObjectDraftingLinetype class
Top
Properties
Name | Description
Linetype
Source
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Top
Operators
Name | Description
Implicit(ObjectDraftingLinetype to ObjectDraftingLinetype.Value)
Implicit(ObjectDraftingLinetype.Value to ObjectDraftingLinetype)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace