Grasshopper API
AnnotationUnitsSettings.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelData.Attributes,
	IStructuralEquatable, IEquatable<AnnotationUnitsSettings.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelData.Attributes
	Implements IStructuralEquatable, IEquatable(Of AnnotationUnitsSettings.Attributes)
The AnnotationUnitsSettings.Attributes type exposes the following members.
Constructors
Name | Description
AnnotationUnitsSettings.Attributes
Initializes a new instance of the AnnotationUnitsSettings.Attributes class
Top
Properties
Name | Description
AngleFormat
AngleResolution
AngleRoundoff
AngleZeroSuppression
LengthDisplay
LengthFactor
LengthPrefix
LengthResolution
LengthRoundoff
LengthSuffix
LengthZeroSuppression
StackFractionFormat
StackHeightScale
Top
Methods
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Object, IEqualityComparer)
From
GetHashCode() |  (Overrides Object.GetHashCode().)
GetHashCode(IEqualityComparer)
ToDetails |  (Overrides ModelData.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace