Grasshopper API
ModelSectionStyle Class
 Represents a Rhino model section style. Wraps the functionality of the SectionStyle type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Drafting.ModelSectionStyle
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelSectionStyle : ModelComponentContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelSectionStyle
	Inherits ModelComponentContent
	Implements IGH_BakeAwareData
The ModelSectionStyle type exposes the following members.
Constructors
Name | Description
ModelSectionStyle()
Initializes a new instance of the ModelSectionStyle class
ModelSectionStyle(ModelSectionStyle.Attributes)
Initializes a new instance of the ModelSectionStyle class
ModelSectionStyle(Guid)
Initializes a new instance of the ModelSectionStyle class
ModelSectionStyle(SectionStyle)
Initializes a new instance of the ModelSectionStyle class
Top
Properties
Name | Description
BackgroundFillColor
BackgroundFillMode
BackgroundFillPrintColor
BoundaryColor
BoundaryLinetype
BoundaryLineWeight
BoundaryPrintColor
HatchPattern
HatchPatternColor
HatchPatternLineWeight
HatchPatternPrintColor
HatchRotation
HatchScale
IsBoundaryVisible
Name |  (Overrides ModelContent.Name.)
SectionFillRule
Top
Methods
Name | Description
Cast
ToAttributes
Top
Operators
Name | Description
Implicit(ModelSectionStyle.Attributes to ModelSectionStyle)
Implicit(SectionStyle to ModelSectionStyle)
Implicit(String to ModelSectionStyle)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace