Grasshopper API
ObjectRender Class
 Represents a Rhino object render attributes.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Render.ObjectRender
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ObjectRender : ModelValue
Public NotInheritable Class ObjectRender
	Inherits ModelValue
The ObjectRender type exposes the following members.
Constructors
Name | Description
ObjectRender()
Initializes a new instance of the ObjectRender class
ObjectRender(ObjectRender.Attributes)
Initializes a new instance of the ObjectRender class
Top
Properties
Name | Description
CastsShadows
Material
ReceivesShadows
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToAttributes
ToDetails
Top
Operators
Name | Description
Implicit(ObjectRender.Attributes to ObjectRender)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace