Grasshopper API
GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AutoSaveFileFormatChangedEventHandler()
Public Delegate Sub AutoSaveFileFormatChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace