Grasshopper API
ModelValue Class
 Represents a value in a Rhino model.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 More...
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelValue : IGH_ModelData,
	ICloneable
Public MustInherit Class ModelValue
	Implements IGH_ModelData, ICloneable
The ModelValue type exposes the following members.
Properties
Name | Description
IsValidWhyNot
TypeDescription
Top
Methods
Name | Description
CastTo<T>
Clone
Read
ReadValue<T>
ScriptVariable
TooltipString
ToString |  (Overrides Object.ToString().)
Write
WriteValue<T>
Top
Remarks
 This type is the base type of a family of immutable types.
See Also
Reference
Grasshopper.Rhinoceros Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Display.ObjectDisplay
 Grasshopper.Rhinoceros.Display.ObjectDisplayColor
 Grasshopper.Rhinoceros.Display.ObjectVisibility
 Grasshopper.Rhinoceros.Drafting.ModelHatchLine
 Grasshopper.Rhinoceros.Drafting.ObjectDrafting
 Grasshopper.Rhinoceros.Drafting.ObjectDraftingColor
 Grasshopper.Rhinoceros.Drafting.ObjectDraftingLinetype
 Grasshopper.Rhinoceros.Drafting.ObjectDraftingLineWidth
 Grasshopper.Rhinoceros.ModelMeshingParameters
 Grasshopper.Rhinoceros.ModelUnitSystem
 Grasshopper.Rhinoceros.Render.ObjectRender
 Grasshopper.Rhinoceros.Render.ObjectRenderMaterial