Grasshopper API
ModelContentName Structure
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct ModelContentName : IEquatable<ModelContentName>,
	IComparable<ModelContentName>, IComparable
Public Structure ModelContentName
	Implements IEquatable(Of ModelContentName), IComparable(Of ModelContentName),
	IComparable
The ModelContentName type exposes the following members.
Properties
Name | Description
IsDefault
IsDefaultOrEmpty
IsEmpty
Parent
Separator
Stem
Top
Methods
Name | Description
Combine
CompareTo(ModelContentName)
CompareTo(Object)
Equals(ModelContentName)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Split
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Division
Equality(ModelContentName, ModelContentName)
Equality(ModelContentName, String)
Equality(String, ModelContentName)
Implicit(ModelContentName to String)
Implicit(String to ModelContentName)
Inequality(ModelContentName, ModelContentName)
Inequality(ModelContentName, String)
Inequality(String, ModelContentName)
OnesComplement
Top
Fields
Name | Description
Comparer
Empty
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace