Grasshopper API
ObjectDisplay.Attributes Structure
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Attributes : GH_ISerializable,
	IEquatable<ObjectDisplay.Attributes>
Public Structure Attributes
	Implements GH_ISerializable, IEquatable(Of ObjectDisplay.Attributes)
The ObjectDisplay.Attributes type exposes the following members.
Properties
Name | Description
Color
Mode
WireDensity
Top
Methods
Name | Description
Equals(ObjectDisplay.Attributes)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode |  (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace