Grasshopper API
Param_DisplayColorStop Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<DisplayColorStop>
 Grasshopper.Kernel.GH_PersistentParam<DisplayColorStop>
 Grasshopper.Rhinoceros.Display.Params.Param_DisplayColorStop
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_DisplayColorStop : GH_PersistentParam<DisplayColorStop>
Public Class Param_DisplayColorStop
	Inherits GH_PersistentParam(Of DisplayColorStop)
The Param_DisplayColorStop type exposes the following members.
Constructors
Name | Description
Param_DisplayColorStop
Initializes a new instance of the Param_DisplayColorStop class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
Methods
Name | Description
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace