Grasshopper API
Param_Hatch Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<GH_Hatch>
 Grasshopper.Kernel.GH_PersistentParam<GH_Hatch>
 Grasshopper.Kernel.GH_PersistentGeometryParam<GH_Hatch>
 Grasshopper.Kernel.Parameters.Param_Hatch
 Namespace: Grasshopper.Kernel.Parameters
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_Hatch : GH_PersistentGeometryParam<GH_Hatch>,
	IGH_PreviewObject, IGH_BakeAwareObject
Public Class Param_Hatch
	Inherits GH_PersistentGeometryParam(Of GH_Hatch)
	Implements IGH_PreviewObject, IGH_BakeAwareObject
The Param_Hatch type exposes the following members.
Constructors
Name | Description
Param_Hatch
Initializes a new instance of the Param_Hatch class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
Icon |  (Overrides GH_DocumentObject.Icon.)
IsBakeCapable
IsPreviewCapable
Top
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
DrawViewportMeshes
DrawViewportWires
HtmlHelp_Source |  (Overrides GH_DocumentObject.HtmlHelp_Source().)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Parameters Namespace