Grasshopper API
Param_ObjectDisplayMode Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelDisplayMode>
 Grasshopper.Kernel.GH_PersistentParam<ModelDisplayMode>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelDisplayMode>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelDisplayMode>
 Grasshopper.Rhinoceros.Display.Params.Param_ObjectDisplayMode
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectDisplayMode : ModelContentParam<ModelDisplayMode>
Public NotInheritable Class Param_ObjectDisplayMode
	Inherits ModelContentParam(Of ModelDisplayMode)
The Param_ObjectDisplayMode type exposes the following members.
Constructors
Name | Description
Param_ObjectDisplayMode
Initializes a new instance of the Param_ObjectDisplayMode class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace