Grasshopper API
ModelSpaceViewport Class
 Represents a Rhino modeling viewport. Wraps a viewport that displays the model.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelViewport
 Grasshopper.Rhinoceros.Display.ModelSpaceViewport
 Grasshopper.Rhinoceros.Display.ModelDetailViewport
 Grasshopper.Rhinoceros.Display.ModelStandardViewport
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelSpaceViewport : ModelViewport
Public MustInherit Class ModelSpaceViewport
	Inherits ModelViewport
The ModelSpaceViewport type exposes the following members.
Constructors
Name | Description
ModelSpaceViewport(ModelSpaceViewport.Attributes)
Initializes a new instance of the ModelSpaceViewport class
ModelSpaceViewport(ModelSpaceViewport.Attributes, Guid)
Initializes a new instance of the ModelSpaceViewport class
Top
Properties
Name | Description
Attribs
Space |  (Overrides ModelViewport.Space.)
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelViewport.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(RhinoViewport to ModelSpaceViewport)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace