Grasshopper API
ModelData Class
 Represents a Rhino model chunk of data.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 More...
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelData : IGH_ModelData,
	ICloneable, IComparable, IEquatable<ModelData>, IStructuralEquatable
Public MustInherit Class ModelData
	Implements IGH_ModelData, ICloneable, IComparable, IEquatable(Of ModelData),
	IStructuralEquatable
The ModelData type exposes the following members.
Properties
Name | Description
Attribs
DefaultAttributes
IsValidWhyNot
TypeDescription
Top
Methods
Name | Description
Cast<A, T>
CastTo<T>
Equals(ModelData)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Read
ToAttributes
ToDetails
TooltipString
ToString |  (Overrides Object.ToString().)
Write
Top
Fields
Name | Description
Serial
Top
Remarks
 This type is the base type of a family of immutable types.
See Also
Reference
Grasshopper.Rhinoceros Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationArrow
 Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings
 Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings
 Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings
 Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings
 Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings
 Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings
 Grasshopper.Rhinoceros.Annotations.ClippingArrow
 Grasshopper.Rhinoceros.Display.PageSettings
 Grasshopper.Rhinoceros.Drafting.ClippingDrawingSettings
 Grasshopper.Rhinoceros.ModelContent