Grasshopper API
CentralSettings.AuthorWebsiteChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AuthorWebsiteChangedEventHandler()
Public Delegate Sub AuthorWebsiteChangedEventHandler
See Also
Reference
Grasshopper Namespace