Grasshopper API
ModelRenderSkylight Class
 Represents a Rhino skylight. Wraps the functionality of the Skylight type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Render.ModelRenderSkylight
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelRenderSkylight : ModelContent
Public NotInheritable Class ModelRenderSkylight
	Inherits ModelContent
The ModelRenderSkylight type exposes the following members.
Constructors
Name | Description
ModelRenderSkylight
Initializes a new instance of the ModelRenderSkylight class
Top
Properties
Name | Description
Enabled
Environment
EnvironmentOverride
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelRenderSkylight.Attributes to ModelRenderSkylight)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace