Grasshopper API
CentralSettings.UiScaleChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void UiScaleChangedEventHandler()
Public Delegate Sub UiScaleChangedEventHandler
See Also
Reference
Grasshopper Namespace