Grasshopper API
GH_AutoSaveSettings.EnableAutoSaveChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void EnableAutoSaveChangedEventHandler()
Public Delegate Sub EnableAutoSaveChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace