Grasshopper API
GH_RadialDimension Class
 Represents an implementation of a Rhino radial dimension.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_Dimension
 Grasshopper.Kernel.Types.GH_RadialDimension
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_RadialDimension : GH_Dimension
Public Class GH_RadialDimension
	Inherits GH_Dimension
The GH_RadialDimension type exposes the following members.
Constructors
Name | Description
GH_RadialDimension()
 Default constructor, creates an invalid radial dimension.
GH_RadialDimension(GH_RadialDimension)
 Create a duplicate of another GH_RadialDimension. This constructor also copies reference data.
GH_RadialDimension(Guid)
 Create a new referenced radial dimension that references a Rhino dimension with the specified ID.
GH_RadialDimension(RadialDimension)
 Create a duplicate of an existing radial dimension.
GH_RadialDimension(RadialDimension, ModelAnnotationStyle)
 Create a duplicate of an existing radial dimension.
Top
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_Dimension.ValueType.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Dimension.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateRadialDimension
 Create a duplicate of this radial dimension.
ToString
 Format the dimension using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace