Grasshopper API
AnnotationArrow Class
 Represents an arrowhead type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationArrow
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationArrow : ModelData
Public NotInheritable Class AnnotationArrow
	Inherits ModelData
The AnnotationArrow type exposes the following members.
Constructors
Name | Description
AnnotationArrow()
Initializes a new instance of the AnnotationArrow class
AnnotationArrow(ArrowType)
Initializes a new instance of the AnnotationArrow class
AnnotationArrow(AnnotationArrow.Attributes)
Initializes a new instance of the AnnotationArrow class
Top
Properties
Name | Description
ArrowBlock
ArrowType
Top
Methods
Name | Description
Cast
Top
Operators
Name | Description
Implicit(ArrowType to AnnotationArrow)
Implicit(AnnotationArrow.Attributes to AnnotationArrow)
Implicit(InstanceDefinition to AnnotationArrow)
Implicit(ModelInstanceDefinition to AnnotationArrow)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace