Grasshopper API
CentralSettings.RibbonAllIconsChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void RibbonAllIconsChangedEventHandler()
Public Delegate Sub RibbonAllIconsChangedEventHandler
See Also
Reference
Grasshopper Namespace