Grasshopper API
ModelRenderMaterial.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderMaterial.Attributes
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelRenderContent.Attributes,
	IEquatable<ModelRenderMaterial.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelRenderContent.Attributes
	Implements IEquatable(Of ModelRenderMaterial.Attributes)
The ModelRenderMaterial.Attributes type exposes the following members.
Constructors
Name | Description
ModelRenderMaterial.Attributes
Initializes a new instance of the ModelRenderMaterial.Attributes class
Top
Properties
Name | Description
RenderMaterial
Top
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
Operators
Name | Description
Implicit(String to ModelRenderMaterial.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace