Grasshopper API
ModelData.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 More...
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class Attributes : ICloneable
Public MustInherit Class Attributes
	Implements ICloneable
The ModelData.Attributes type exposes the following members.
Constructors
Name | Description
ModelData.Attributes
Initializes a new instance of the ModelData.Attributes class
Top
Methods
Name | Description
Clone
Read
SubClone
ToDetails
ToModelData
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationArrow.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationArrowSettings.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationLeaderSettings.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationTextSettings.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationToleranceSettings.Attributes
 Grasshopper.Rhinoceros.Annotations.AnnotationUnitsSettings.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes