Grasshopper API
CentralSettings.PreviewPointStyleChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PreviewPointStyleChangedEventHandler()
Public Delegate Sub PreviewPointStyleChangedEventHandler
See Also
Reference
Grasshopper Namespace