Grasshopper API
CentralSettings.RibbonDrawTabIconsChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void RibbonDrawTabIconsChangedEventHandler()
Public Delegate Sub RibbonDrawTabIconsChangedEventHandler
See Also
Reference
Grasshopper Namespace