Grasshopper API
GH_Document.EnableSolutionsChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void EnableSolutionsChangedEventHandler(
	bool state
)
Public Delegate Sub EnableSolutionsChangedEventHandler (
	state As Boolean
)
Parameters
state
Type: System.Boolean
See Also
Reference
Grasshopper.Kernel Namespace