Grasshopper API
ModelConstructionPlane Class
 Represents a construction plane. Wraps the functionality of the ConstructionPlane type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.Display.ModelConstructionPlane
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelConstructionPlane : IGH_GeometricGoo,
	IEquatable<ModelConstructionPlane>, IGH_PreviewData, IGH_BakeAwareData
Public NotInheritable Class ModelConstructionPlane
	Implements IGH_GeometricGoo, IEquatable(Of ModelConstructionPlane),
	IGH_PreviewData, IGH_BakeAwareData
The ModelConstructionPlane type exposes the following members.
Constructors
Name | Description
ModelConstructionPlane()
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(ConstructionPlane)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(Guid)
 Create a new referenced view that references a RhinoView or NamedView object with the specified ref_guid.
ModelConstructionPlane(ModelConstructionPlane)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(Plane)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(RhinoView)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(RhinoViewport)
Initializes a new instance of the ModelConstructionPlane class
ModelConstructionPlane(Plane, String)
Initializes a new instance of the ModelConstructionPlane class
Top
Properties
Name | Description
GridSpacing
IsReferencedGeometry
IsValid
LineCount
Plane
ReferenceID
SnapSpacing
ThickLineFrequency
Title
Top
Methods
Name | Description
Cast
CastTo<Q>
Equals(ModelConstructionPlane)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetBoundingBox
GetHashCode |  (Overrides Object.GetHashCode().)
Morph
ToConstructionPlane
ToString |  (Overrides Object.ToString().)
Transform
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace