Grasshopper API
ModelMeshingParameters Class
 Represents some meshing parameters. Wraps the functionality of the MeshingParameters type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.ModelMeshingParameters
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelMeshingParameters : ModelValue
Public NotInheritable Class ModelMeshingParameters
	Inherits ModelValue
The ModelMeshingParameters type exposes the following members.
Constructors
Name | Description
ModelMeshingParameters
Initializes a new instance of the ModelMeshingParameters class
Top
Properties
Name | Description
DefaultAnalysis
DefaultRender
FastRender
QualityRender
Unset
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
ToMeshingParameters
Top
Operators
Name | Description
Implicit(MeshingParameters to ModelMeshingParameters)
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace