Grasshopper API
ModelEarthAnchorPoint.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Attributes
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelContent.Attributes
Public NotInheritable Class Attributes
	Inherits ModelContent.Attributes
The ModelEarthAnchorPoint.Attributes type exposes the following members.
Constructors
Name | Description
ModelEarthAnchorPoint.Attributes
Initializes a new instance of the ModelEarthAnchorPoint.Attributes class
Top
Properties
Name | Description
Elevation
ElevationCoordinateSystem
Latitude
Longitude
ModelCompass
Top
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace