Grasshopper API
Param_ModelPageViewport Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelPageViewport>
 Grasshopper.Kernel.GH_PersistentParam<ModelPageViewport>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelPageViewport>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelPageViewport>
 Grasshopper.Rhinoceros.Display.Params.Param_ModelPageViewport
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelPageViewport : ModelContentParam<ModelPageViewport>
Public NotInheritable Class Param_ModelPageViewport
	Inherits ModelContentParam(Of ModelPageViewport)
The Param_ModelPageViewport type exposes the following members.
Constructors
Name | Description
Param_ModelPageViewport
Initializes a new instance of the Param_ModelPageViewport class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace