Grasshopper API
AnnotationDateTimeFormat Class
 Represents a Date Time format.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<String>
 Grasshopper.Kernel.Types.GH_String
 Grasshopper.Rhinoceros.Annotations.AnnotationDateTimeFormat
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationDateTimeFormat : GH_String,
	IEquatable<AnnotationDateTimeFormat>
Public NotInheritable Class AnnotationDateTimeFormat
	Inherits GH_String
	Implements IEquatable(Of AnnotationDateTimeFormat)
The AnnotationDateTimeFormat type exposes the following members.
Constructors
Name | Description
AnnotationDateTimeFormat()
Initializes a new instance of the AnnotationDateTimeFormat class
AnnotationDateTimeFormat(GH_String)
Initializes a new instance of the AnnotationDateTimeFormat class
AnnotationDateTimeFormat(String)
Initializes a new instance of the AnnotationDateTimeFormat class
Top
Properties
Name | Description
DisplayName
Top
Methods
Name | Description
CastFrom |  (Overrides GH_String.CastFrom(Object).)
Duplicate |  (Overrides GH_String.Duplicate().)
Equals(AnnotationDateTimeFormat)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace