Grasshopper API
GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SaveOnObjectAddedChangedEventHandler()
Public Delegate Sub SaveOnObjectAddedChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace