Grasshopper API
GH_MaterialPreviewControl.SelectedChangedEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SelectedChangedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub SelectedChangedEventHandler (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI Namespace