Grasshopper API
ModelDetailViewport Class
 Represents a Rhino standard modeling viewport. Wraps the child viewports of a page layout RhinoPageView instance.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelViewport
 Grasshopper.Rhinoceros.Display.ModelSpaceViewport
 Grasshopper.Rhinoceros.Display.ModelDetailViewport
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelDetailViewport : ModelSpaceViewport
Public NotInheritable Class ModelDetailViewport
	Inherits ModelSpaceViewport
The ModelDetailViewport type exposes the following members.
Constructors
Name | Description
ModelDetailViewport()
Initializes a new instance of the ModelDetailViewport class
ModelDetailViewport(ModelDetailViewport.Attributes)
Initializes a new instance of the ModelDetailViewport class
ModelDetailViewport(Guid)
Initializes a new instance of the ModelDetailViewport class
ModelDetailViewport(RhinoViewport)
Initializes a new instance of the ModelDetailViewport class
Top
Properties
Name | Description
ViewportType |  (Overrides ModelViewport.ViewportType.)
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelSpaceViewport.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelDetailViewport.Attributes to ModelDetailViewport)
Implicit(RhinoViewport to ModelDetailViewport)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace