Grasshopper API
GH_Canvas.CanvasPaintEndEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasPaintEndEventHandler(
	GH_Canvas sender
)
Public Delegate Sub CanvasPaintEndEventHandler (
	sender As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace