Grasshopper API
GH_AutoSaveSettings.SaveOnObjectRemovedChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SaveOnObjectRemovedChangedEventHandler()
Public Delegate Sub SaveOnObjectRemovedChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace