Grasshopper API
ModelAnnotationStyle Class
 Represents a Rhino model annotation style. Wraps the functionality of the DimensionStyle type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelAnnotationStyle : ModelComponentContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelAnnotationStyle
	Inherits ModelComponentContent
	Implements IGH_BakeAwareData
The ModelAnnotationStyle type exposes the following members.
Constructors
Name | Description
ModelAnnotationStyle()
Initializes a new instance of the ModelAnnotationStyle class
ModelAnnotationStyle(ModelAnnotationStyle.Attributes)
Initializes a new instance of the ModelAnnotationStyle class
ModelAnnotationStyle(DimensionStyle)
Initializes a new instance of the ModelAnnotationStyle class
ModelAnnotationStyle(Guid)
Initializes a new instance of the ModelAnnotationStyle class
Top
Properties
Name | Description
ArrowSettings
DimensionScale
DimensionSettings
LeaderSettings
TextSettings
ToleranceSettings
UnitsSettings
Unset
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelAnnotationStyle.Attributes to ModelAnnotationStyle)
Implicit(DimensionStyle to ModelAnnotationStyle)
Implicit(String to ModelAnnotationStyle)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace