Grasshopper API
Param_ClippingDrawingSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ClippingDrawingSettings>
 Grasshopper.Rhinoceros.Params.ModelDataParam<ClippingDrawingSettings>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ClippingDrawingSettings
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ClippingDrawingSettings : ModelDataParam<ClippingDrawingSettings>
Public NotInheritable Class Param_ClippingDrawingSettings
	Inherits ModelDataParam(Of ClippingDrawingSettings)
The Param_ClippingDrawingSettings type exposes the following members.
Constructors
Name | Description
Param_ClippingDrawingSettings
Initializes a new instance of the Param_ClippingDrawingSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace