Grasshopper API
Param_AnnotationArrowSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<AnnotationArrowSettings>
 Grasshopper.Rhinoceros.Params.ModelDataParam<AnnotationArrowSettings>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationArrowSettings
 Namespace: Grasshopper.Rhinoceros.Annotations.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_AnnotationArrowSettings : ModelDataParam<AnnotationArrowSettings>
Public NotInheritable Class Param_AnnotationArrowSettings
	Inherits ModelDataParam(Of AnnotationArrowSettings)
The Param_AnnotationArrowSettings type exposes the following members.
Constructors
Name | Description
Param_AnnotationArrowSettings
Initializes a new instance of the Param_AnnotationArrowSettings class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations.Params Namespace