Grasshopper API
ModelLayer Class
 Represents a Rhino model layer. Wraps the functionality of the Layer type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Model.ModelLayer
 Namespace: Grasshopper.Rhinoceros.Model
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelLayer : ModelComponentContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelLayer
	Inherits ModelComponentContent
	Implements IGH_BakeAwareData
The ModelLayer type exposes the following members.
Constructors
Name | Description
ModelLayer()
Initializes a new instance of the ModelLayer class
ModelLayer(ModelLayer.Attributes)
Initializes a new instance of the ModelLayer class
ModelLayer(Guid)
Initializes a new instance of the ModelLayer class
ModelLayer(Layer)
Initializes a new instance of the ModelLayer class
Top
Properties
Name | Description
DisplayColor
DraftingColor
Hidden
HiddenOnModel
HiddenOnNewDetail
Linetype
LineWeight
Locked
Material
SectionStyle
Unset
Top
Methods
Name | Description
Cast
ToAttributes
Top
Operators
Name | Description
Implicit(ModelLayer.Attributes to ModelLayer)
Implicit(Layer to ModelLayer)
Implicit(String to ModelLayer)
Top
See Also
Reference
Grasshopper.Rhinoceros.Model Namespace