Grasshopper API
Param_ObjectDraftingColor Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectDraftingColor>
 Grasshopper.Kernel.GH_PersistentParam<ObjectDraftingColor>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectDraftingColor
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectDraftingColor : GH_PersistentParam<ObjectDraftingColor>
Public NotInheritable Class Param_ObjectDraftingColor
	Inherits GH_PersistentParam(Of ObjectDraftingColor)
The Param_ObjectDraftingColor type exposes the following members.
Constructors
Name | Description
Param_ObjectDraftingColor
Initializes a new instance of the Param_ObjectDraftingColor class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace