Grasshopper API
GH_Canvas.NavigationSettingsChangedEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void NavigationSettingsChangedEventHandler()
Public Delegate Sub NavigationSettingsChangedEventHandler
See Also
Reference
Grasshopper.GUI.Canvas Namespace