Grasshopper API
Param_ModelSectionStyle Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelSectionStyle>
 Grasshopper.Kernel.GH_PersistentParam<ModelSectionStyle>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelSectionStyle>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelSectionStyle>
 Grasshopper.Rhinoceros.Drafting.Params.Param_ModelSectionStyle
 Namespace: Grasshopper.Rhinoceros.Drafting.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelSectionStyle : ModelContentParam<ModelSectionStyle>
Public NotInheritable Class Param_ModelSectionStyle
	Inherits ModelContentParam(Of ModelSectionStyle)
The Param_ModelSectionStyle type exposes the following members.
Constructors
Name | Description
Param_ModelSectionStyle
Initializes a new instance of the Param_ModelSectionStyle class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting.Params Namespace