Grasshopper API
Param_ObjectDisplay Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ObjectDisplay>
 Grasshopper.Rhinoceros.Params.ModelDataParam<ObjectDisplay>
 Grasshopper.Rhinoceros.Display.Params.Param_ObjectDisplay
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ObjectDisplay : ModelDataParam<ObjectDisplay>
Public NotInheritable Class Param_ObjectDisplay
	Inherits ModelDataParam(Of ObjectDisplay)
The Param_ObjectDisplay type exposes the following members.
Constructors
Name | Description
Param_ObjectDisplay
Initializes a new instance of the Param_ObjectDisplay class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace