Grasshopper API
ModelTextureSlot Class
 Represents a composite texture slot used in material definitions.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.Render.ModelTextureSlot
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelTextureSlot : ModelValue
Public NotInheritable Class ModelTextureSlot
	Inherits ModelValue
The ModelTextureSlot type exposes the following members.
Constructors
Name | Description
ModelTextureSlot()
Initializes a new instance of the ModelTextureSlot class
ModelTextureSlot(ModelTextureSlot.Attributes)
Initializes a new instance of the ModelTextureSlot class
ModelTextureSlot(RenderContent, String)
Initializes a new instance of the ModelTextureSlot class
Top
Properties
Name | Description
Amount
Color
Enabled
Number
Texture
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelTextureSlot.Attributes to ModelTextureSlot)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace