Grasshopper API
IGH_DocumentObject.SolutionExpiredEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void SolutionExpiredEventHandler(
	IGH_DocumentObject sender,
	GH_SolutionExpiredEventArgs e
)
Public Delegate Sub SolutionExpiredEventHandler (
	sender As IGH_DocumentObject,
	e As GH_SolutionExpiredEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.IGH_DocumentObject
e
Type: Grasshopper.Kernel.GH_SolutionExpiredEventArgs
See Also
Reference
Grasshopper.Kernel Namespace