Grasshopper API
GH_ParameterContext Class
 Data passed to IGH_ContextualParameter.AutoAssignContextualData to help define a context state of Rhino/Grasshopper
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ParameterContext
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_ParameterContext
Public Class GH_ParameterContext
The GH_ParameterContext type exposes the following members.
Constructors
Name | Description
GH_ParameterContext
Initializes a new instance of the GH_ParameterContext class
Top
Properties
Name | Description
IsScripted
Name
RhinoDoc
SolveIndex
Top
See Also
Reference
Grasshopper.Kernel Namespace