Grasshopper API
ModelViewport Class
 Represents a Rhino viewport. Wraps the main viewport of a RhinoView instance.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelViewport
 Grasshopper.Rhinoceros.Display.ModelPageViewport
 Grasshopper.Rhinoceros.Display.ModelStandardViewport
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class ModelViewport : ModelContent,
	IGH_BakeAwareData
Public Class ModelViewport
	Inherits ModelContent
	Implements IGH_BakeAwareData
The ModelViewport type exposes the following members.
Properties
Name | Description
Attribs
DefaultAttributes |  (Overrides ModelData.DefaultAttributes.)
DisplayMode
Space
Unset
ViewportType
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelViewport.Attributes to ModelViewport)
Implicit(RhinoViewport to ModelViewport)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace