Grasshopper API
ModelDataParam<T> Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Rhinoceros.Params.ModelDataParam<T>
 More...
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelDataParam<T> : GH_Param<T>
where T : class, IGH_ModelData
Public MustInherit Class ModelDataParam(Of T As {Class, IGH_ModelData})
	Inherits GH_Param(Of T)
Type Parameters
T
The ModelDataParam<T> type exposes the following members.
Constructors
Name | Description
ModelDataParam<T>
Initializes a new instance of the ModelDataParam<T> class
Top
Properties
Name | Description
Icon |  (Overrides GH_DocumentObject.Icon.)
TypeName |  (Overrides GH_Param<T>.TypeName.)
Top
Methods
Name | Description
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Rhinoceros.Params.ModelDataParam<T>
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationArrowSettings
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationDimensionSettings
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationLeaderSettings
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationTextSettings
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationToleranceSettings
 Grasshopper.Rhinoceros.Annotations.Params.Param_AnnotationUnitsSettings
 Grasshopper.Rhinoceros.Display.Params.Param_ObjectDisplay
 Grasshopper.Rhinoceros.Display.Params.Param_ObjectVisibility
 Grasshopper.Rhinoceros.Drafting.Params.Param_ClippingDrawingSettings
 Grasshopper.Rhinoceros.Drafting.Params.Param_ObjectDrafting
 Grasshopper.Rhinoceros.Render.Params.Param_ObjectRender