Grasshopper API
ModelLinetype.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Drafting.ModelLinetype.Attributes
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelLinetype.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelLinetype.Attributes)
The ModelLinetype.Attributes type exposes the following members.
Constructors
Name | Description
ModelLinetype.Attributes
Initializes a new instance of the ModelLinetype.Attributes class
Top
Properties
Name | Description
CapStyle
JoinStyle
Segments
TaperPoints
Width
WidthUnits
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
Operators
Name | Description
Implicit(String to ModelLinetype.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace