Grasshopper API
GH_FileWatcher.FileChanged Delegate
 Delegate method for file change callbacks.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void FileChanged(
	GH_FileWatcher sender,
	string filename,
	WatcherChangeTypes change
)
Public Delegate Sub FileChanged (
	sender As GH_FileWatcher,
	filename As String,
	change As WatcherChangeTypes
)
Parameters
sender
Type: Grasshopper.Kernel.GH_FileWatcher
FileWatcher that invoked the delegate.
filename
Type: System.String
Path to file that is being watched.
change
Type: System.IO.WatcherChangeTypes
The type of change that occured.
See Also
Reference
Grasshopper.Kernel Namespace