Grasshopper API
CentralSettings.CreateSolutionUndoRecordChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CreateSolutionUndoRecordChangedEventHandler()
Public Delegate Sub CreateSolutionUndoRecordChangedEventHandler
See Also
Reference
Grasshopper Namespace