Grasshopper API
GH_Canvas.CanvasPrePaintObjectsEventHandler Delegate
 Namespace: Grasshopper.GUI.Canvas
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void CanvasPrePaintObjectsEventHandler(
	GH_Canvas sender
)
Public Delegate Sub CanvasPrePaintObjectsEventHandler (
	sender As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace