Grasshopper API
AnnotationDimensionSettings Class
 Represents annotation dimension settings.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.Annotations.AnnotationDimensionSettings
 Namespace: Grasshopper.Rhinoceros.Annotations
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class AnnotationDimensionSettings : ModelData
Public NotInheritable Class AnnotationDimensionSettings
	Inherits ModelData
The AnnotationDimensionSettings type exposes the following members.
Constructors
Name | Description
AnnotationDimensionSettings()
Initializes a new instance of the AnnotationDimensionSettings class
AnnotationDimensionSettings(AnnotationDimensionSettings.Attributes)
Initializes a new instance of the AnnotationDimensionSettings class
AnnotationDimensionSettings(DimensionStyle)
Initializes a new instance of the AnnotationDimensionSettings class
Top
Properties
Name | Description
BaselineSpacing
CentermarkSize
CentermarkStyle
DecimalSeparator
DimensionLineExtension
ExtensionLineExtension
ExtensionLineOffset
FixedExtension
FixedExtensionLength
RadialTextAngleType
RadialTextLocation
RadialTextOrientation
SuppressExtension1
SuppressExtension2
TextAngleType
TextLocation
TextOrientation
Top
Methods
Name | Description
GetDimensionStyle
ToAttributes
Top
Operators
Name | Description
Explicit(AnnotationDimensionSettings to DimensionStyle)
Implicit(AnnotationDimensionSettings.Attributes to AnnotationDimensionSettings)
Top
See Also
Reference
Grasshopper.Rhinoceros.Annotations Namespace