Grasshopper API
GH_PersistentGeometryParam<T> Class
 Derives from GH_PersistentParam(Of T), but adds some useful functions for dealing with geometric data types.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
 Grasshopper.Kernel.GH_PersistentGeometryParam<T>
 More...
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class GH_PersistentGeometryParam<T> : GH_PersistentParam<T>,
	IRcpAwareObject
where T : class, IGH_GeometricGoo
Public MustInherit Class GH_PersistentGeometryParam(Of T As {Class, IGH_GeometricGoo})
	Inherits GH_PersistentParam(Of T)
	Implements IRcpAwareObject
Type Parameters
T
Data type of this parameter.
The GH_PersistentGeometryParam<T> type exposes the following members.
Constructors
Name | Description
GH_PersistentGeometryParam<T>(GH_InstanceDescription)
Initializes a new instance of the GH_PersistentGeometryParam<T> class
GH_PersistentGeometryParam<T>(GH_InstanceDescription, Boolean) |  Obsolete.
Initializes a new instance of the GH_PersistentGeometryParam<T> class
Top
Properties
Name | Description
StateTags |  (Overrides GH_Param<T>.StateTags.)
Top
Methods
Name | Description
AppendAdditionalMenuItems |  (Overrides GH_PersistentParam<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
ClearData |  (Overrides GH_Param<T>.ClearData().)
ConversionCallback |  (Overrides GH_Param<T>.ConversionCallback(Object, T).)
EraseGeometryCaches
ExpireSolution |  (Overrides GH_ActiveObject.ExpireSolution(Boolean).)
OnVolatileDataCollected
 This override removes all instances that fail to load their geometry.
 (Overrides GH_Param<T>.OnVolatileDataCollected().)
PublishRcpItem
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
RegisterRemoteIdsDespiteSources
 Call this method if you wish to register remote ids in the volatile data despite having one or more sources. You should only need to do this if you converted non-referenced data into volatile referenced data.
RemoteIdExpired
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
 Grasshopper.Kernel.GH_PersistentGeometryParam<T>
 Grasshopper.Kernel.Parameters.Param_AngularDimension
 Grasshopper.Kernel.Parameters.Param_Centermark
 Grasshopper.Kernel.Parameters.Param_ClippingPlane
 Grasshopper.Kernel.Parameters.Param_Hatch
 Grasshopper.Kernel.Parameters.Param_InstanceReference
 Grasshopper.Kernel.Parameters.Param_Leader
 Grasshopper.Kernel.Parameters.Param_Light
 Grasshopper.Kernel.Parameters.Param_LinearDimension
 Grasshopper.Kernel.Parameters.Param_OrdinateDimension
 Grasshopper.Kernel.Parameters.Param_RadialDimension
 Grasshopper.Kernel.Parameters.Param_TextDot
 Grasshopper.Kernel.Parameters.Param_TextEntity
 Grasshopper.Rhinoceros.Display.Params.Param_ModelConstructionPlane
 Grasshopper.Rhinoceros.Display.Params.Param_ModelView