Grasshopper API
GH_Document.DefaultPreviewColourChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void DefaultPreviewColourChangedEventHandler(
	Color colour
)
Public Delegate Sub DefaultPreviewColourChangedEventHandler (
	colour As Color
)
Parameters
colour
Type: System.Drawing.Color
See Also
Reference
Grasshopper.Kernel Namespace