Grasshopper API
GH_FileWatcher.FileChangedSimple Delegate
 Delegate method for file change callbacks.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void FileChangedSimple(
	string filename
)
Public Delegate Sub FileChangedSimple (
	filename As String
)
Parameters
filename
Type: System.String
Path to file that is being watched.
Remarks
See Also
Reference
Grasshopper.Kernel Namespace