Grasshopper API
Param_ItemDisplayColor Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ItemDisplayColor>
 Grasshopper.Kernel.GH_PersistentParam<ItemDisplayColor>
 Grasshopper.Rhinoceros.Display.Params.Param_ItemDisplayColor
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ItemDisplayColor : GH_PersistentParam<ItemDisplayColor>
Public NotInheritable Class Param_ItemDisplayColor
	Inherits GH_PersistentParam(Of ItemDisplayColor)
The Param_ItemDisplayColor type exposes the following members.
Constructors
Name | Description
Param_ItemDisplayColor
Initializes a new instance of the Param_ItemDisplayColor class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace