Grasshopper API
ModelNamedView Class
 Represents a Rhino named view. Wraps a ViewInfo instance in the named views table.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelNamedView
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Since: 8.14
Syntax
public sealed class ModelNamedView : ModelContent,
	IGH_BakeAwareData
Public NotInheritable Class ModelNamedView
	Inherits ModelContent
	Implements IGH_BakeAwareData
The ModelNamedView type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Cast
CastTo<T>(T) |  (Overrides ModelContent.CastTo<T>(T).)
ToAttributes
Top
Operators
Name | Description
Implicit(ModelNamedView.Attributes to ModelNamedView)
Implicit(ViewInfo to ModelNamedView)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace