Grasshopper API
ItemDisplayColor.Value Structure
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IEquatable<ItemDisplayColor.Value>,
	IComparable<ItemDisplayColor.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IEquatable(Of ItemDisplayColor.Value),
	IComparable(Of ItemDisplayColor.Value), IComparable
The ItemDisplayColor.Value type exposes the following members.
Constructors
Name | Description
ItemDisplayColor.Value(ItemColorSource)
Initializes a new instance of the ItemDisplayColor.Value class
ItemDisplayColor.Value(ModelColor)
Initializes a new instance of the ItemDisplayColor.Value class
ItemDisplayColor.Value(ItemColorSource, ModelColor)
Initializes a new instance of the ItemDisplayColor.Value class
Top
Properties
Name | Description
ByLayer
ByObject
ByParent
Color
Source
Top
Methods
Name | Description
CompareTo(Object)
CompareTo(ItemDisplayColor.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ItemDisplayColor.Value)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Implicit(ItemColorSource to ItemDisplayColor.Value)
Implicit(ModelColor to ItemDisplayColor.Value)
Implicit(ItemDisplayColor.Value to ModelColor)
Implicit(ItemDisplayColor.Value to ItemColorSource)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace