Grasshopper API
ObjectRenderMaterial.Value Structure
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct Value : GH_ISerializable, IStructuralEquatable,
	IEquatable<ObjectRenderMaterial.Value>, IComparable<ObjectRenderMaterial.Value>, IComparable
Public Structure Value
	Implements GH_ISerializable, IStructuralEquatable, IEquatable(Of ObjectRenderMaterial.Value),
	IComparable(Of ObjectRenderMaterial.Value), IComparable
The ObjectRenderMaterial.Value type exposes the following members.
Constructors
Name | Description
ObjectRenderMaterial.Value(ModelRenderMaterial)
Initializes a new instance of the ObjectRenderMaterial.Value class
ObjectRenderMaterial.Value(ObjectMaterialSource)
Initializes a new instance of the ObjectRenderMaterial.Value class
ObjectRenderMaterial.Value(ObjectMaterialSource, ModelRenderMaterial)
Initializes a new instance of the ObjectRenderMaterial.Value class
Top
Properties
Name | Description
ByLayer
ByParent
Default
Material
Source
Top
Methods
Name | Description
CompareTo(Object)
CompareTo(ObjectRenderMaterial.Value)
Deconstruct
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ObjectRenderMaterial.Value)
Equals(Object, IEqualityComparer)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetHashCode(IEqualityComparer)
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Implicit(ModelRenderMaterial to ObjectRenderMaterial.Value)
Implicit(ObjectMaterialSource to ObjectRenderMaterial.Value)
Implicit(ObjectRenderMaterial.Value to ModelRenderMaterial)
Implicit(ObjectRenderMaterial.Value to ObjectMaterialSource)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace