Grasshopper API
Param_ModelAttributeKey Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<GH_String>
 Grasshopper.Kernel.GH_PersistentParam<GH_String>
 Grasshopper.Rhinoceros.Params.Param_ModelAttributeKey
 Namespace: Grasshopper.Rhinoceros.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelAttributeKey : GH_PersistentParam<GH_String>
Public NotInheritable Class Param_ModelAttributeKey
	Inherits GH_PersistentParam(Of GH_String)
The Param_ModelAttributeKey type exposes the following members.
Constructors
Name | Description
Param_ModelAttributeKey
Initializes a new instance of the Param_ModelAttributeKey class
Top
Properties
Name | Description
BaseProperty
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
StateTags |  (Overrides GH_Param<T>.StateTags.)
Top
Methods
Name | Description
AddedToDocument |  (Overrides GH_DocumentObject.AddedToDocument(GH_Document).)
Read |  (Overrides GH_PersistentParam<T>.Read(GH_IReader).)
Write |  (Overrides GH_PersistentParam<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Params Namespace