Grasshopper API
PushContentPermissions Enumeration
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[FlagsAttribute]
public enum PushContentPermissions
<FlagsAttribute>
Public Enumeration PushContentPermissions
Members
Member name | Value | Description
None | 0
Find | 1
Add | 2
Modify | 4
Bake | 3
Push | 7
See Also
Reference
Grasshopper.Rhinoceros Namespace