Grasshopper API
ModelRenderEnvironment.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderEnvironment.Attributes
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelRenderContent.Attributes,
	IEquatable<ModelRenderEnvironment.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelRenderContent.Attributes
	Implements IEquatable(Of ModelRenderEnvironment.Attributes)
The ModelRenderEnvironment.Attributes type exposes the following members.
Constructors
Name | Description
ModelRenderEnvironment.Attributes
Initializes a new instance of the ModelRenderEnvironment.Attributes class
Top
Properties
Name | Description
RenderEnvironment
Top
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
Operators
Name | Description
Implicit(String to ModelRenderEnvironment.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace