Grasshopper API
ModelView Class
 Represents a 3D view frustum. Wraps the functionality of the ViewportInfo type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.Display.ModelView
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelView : IGH_GeometricGoo,
	IEquatable<ModelView>, IGH_PreviewData, IGH_BakeAwareData
Public NotInheritable Class ModelView
	Implements IGH_GeometricGoo, IEquatable(Of ModelView),
	IGH_PreviewData, IGH_BakeAwareData
The ModelView type exposes the following members.
Constructors
Name | Description
ModelView()
Initializes a new instance of the ModelView class
ModelView(Guid)
 Create a new referenced view that references a RhinoView or NamedView object with the specified ref_guid.
ModelView(ModelView)
Initializes a new instance of the ModelView class
ModelView(RhinoView)
Initializes a new instance of the ModelView class
ModelView(RhinoViewport)
Initializes a new instance of the ModelView class
ModelView(ViewInfo)
Initializes a new instance of the ModelView class
ModelView(ViewportInfo)
Initializes a new instance of the ModelView class
ModelView(ViewportInfo, String)
Initializes a new instance of the ModelView class
Top
Properties
Name | Description
IsValid
Title
Top
Methods
Name | Description
Cast
CastTo<Q>
Equals(ModelView)
Equals(Object) |  (Overrides Object.Equals(Object).)
GetBoundingBox
GetHashCode |  (Overrides Object.GetHashCode().)
Morph
ToString |  (Overrides Object.ToString().)
ToViewportInfo
Transform
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace