Grasshopper API
GH_EtoUtil Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_EtoUtil
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class GH_EtoUtil
<ExtensionAttribute>
Public NotInheritable Class GH_EtoUtil
The GH_EtoUtil type exposes the following members.
Methods
Name | Description
CenterFormOnCursor
 Positions a Form so that it is centered around the cursor
CenterFormOnEditor
 Positions a Form so that it is centered on the active editor. If the editor doesn't exist or is hidden, the form will be centered on the screen instead.
CenterFormOnScreen
 Positions a Form so that it is centered on the current screen. The current screen being defined as the screen containing the cursor.
CenterFormOnWindow
 Positions a Form so that it is centered on the supplied window. If the window doesn't exist or is hidden, the form will be centered on the screen instead.
Top
See Also
Reference
Grasshopper.GUI Namespace