Grasshopper API
GH_TextEntity Class
 Represents an implementation of a Rhino text entity.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_GeometricGoo<AnnotationBase>
 Grasshopper.Kernel.Types.GH_AnnotationBase
 Grasshopper.Kernel.Types.GH_TextEntity
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_TextEntity : GH_AnnotationBase
Public Class GH_TextEntity
	Inherits GH_AnnotationBase
The GH_TextEntity type exposes the following members.
Constructors
Name | Description
GH_TextEntity()
 Default constructor, creates an invalid text entity.
GH_TextEntity(GH_TextEntity)
 Create a duplicate of another GH_TextEntity. This constructor also copies reference data.
GH_TextEntity(Guid)
 Create a new referenced text entity that references a Rhino text object with the specified ID.
GH_TextEntity(TextEntity)
 Create a duplicate of an existing text entity.
GH_TextEntity(TextEntity, ModelAnnotationStyle)
 Create a duplicate of an existing text entity.
Top
Properties
Name | Description
TypeDescription |  (Overrides GH_AnnotationBase.TypeDescription.)
TypeName |  (Overrides GH_AnnotationBase.TypeName.)
Value
ValueType |  (Overrides GH_AnnotationBase.ValueType.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_AnnotationBase.CastTo<T>(T).)
DuplicateAnnotation
 Create a duplicate of this annotation.
 (Overrides GH_AnnotationBase.DuplicateAnnotation().)
DuplicateTextEntity
 Create a duplicate of this text entity.
ToString
 Format the text entity using default grasshopper formatting logic.
 (Overrides GH_AnnotationBase.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace