Grasshopper API
ModelTags Structure
 Represents an immutable set of strings.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct ModelTags : GH_ISerializable, IReadOnlyCollection<string>,
	IEquatable<ModelTags>, IStructuralEquatable, IComparable, IComparable<ModelTags>
Public Structure ModelTags
	Implements GH_ISerializable, IReadOnlyCollection(Of String),
	IEquatable(Of ModelTags), IStructuralEquatable, IComparable, IComparable(Of ModelTags)
The ModelTags type exposes the following members.
Constructors
Name | Description
ModelTags
Initializes a new instance of the ModelTags class
Top
Properties
Name | Description
Count
IsDefault
IsDefaultOrEmpty
IsEmpty
Top
Methods
Name | Description
AddRange
CompareTo(ModelTags)
CompareTo(Object)
Contains
Equals(ModelTags)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetEnumerator
GetHashCode |  (Overrides ValueType.GetHashCode().)
RemoveRange
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Addition
Equality
Implicit(ModelTags to String)
Implicit(String to ModelTags)
Inequality
Subtraction
Top
Fields
Name | Description
Empty
Top
Remarks
 Comparison is not case sensitive.
See Also
Reference
Grasshopper.Rhinoceros Namespace