Grasshopper API
ModelColor Structure
 Represents a color stored on a model.
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public struct ModelColor : IGH_Goo,
	IFormattable, IEquatable<ModelColor>, IComparable, IComparable<ModelColor>
Public Structure ModelColor
	Implements IGH_Goo, IFormattable, IEquatable(Of ModelColor),
	IComparable, IComparable(Of ModelColor)
The ModelColor type exposes the following members.
Methods
Name | Description
CastTo<T>
CompareTo
Equals(ModelColor)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
FromArgb(Int32)
FromArgb(Byte, Byte, Byte)
FromArgb(Byte, Byte, Byte, Byte)
GetHashCode |  (Overrides ValueType.GetHashCode().)
ToArgb
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Equality(Color, ModelColor)
Equality(ModelColor, ModelColor)
Equality(ModelColor, Color)
Explicit(ModelColor to ColorRGBA)
Implicit(Color to ModelColor)
Implicit(ColorRGBA to ModelColor)
Implicit(ModelColor to Color)
Inequality(Color, ModelColor)
Inequality(ModelColor, ModelColor)
Inequality(ModelColor, Color)
Top
Remarks
 This is an opaque representation of a color with conversion methods to and from other color types.
See Also
Reference
Grasshopper.Rhinoceros Namespace