Grasshopper API
Param_ModelView Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelView>
 Grasshopper.Kernel.GH_PersistentParam<ModelView>
 Grasshopper.Kernel.GH_PersistentGeometryParam<ModelView>
 Grasshopper.Rhinoceros.Display.Params.Param_ModelView
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_ModelView : GH_PersistentGeometryParam<ModelView>,
	IGH_PreviewObject, IGH_BakeAwareObject
Public Class Param_ModelView
	Inherits GH_PersistentGeometryParam(Of ModelView)
	Implements IGH_PreviewObject, IGH_BakeAwareObject
The Param_ModelView type exposes the following members.
Constructors
Name | Description
Param_ModelView
Initializes a new instance of the Param_ModelView class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
Icon |  (Overrides GH_DocumentObject.Icon.)
IsBakeCapable
IsPreviewCapable
Top
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
DrawViewportMeshes
DrawViewportWires
HtmlHelp_Source |  (Overrides GH_DocumentObject.HtmlHelp_Source().)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Read |  (Overrides GH_PersistentGeometryParam<T>.Read(GH_IReader).)
Write |  (Overrides GH_PersistentGeometryParam<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace