Grasshopper API
DisplayColorStop Class
 Represents a gradient colour stop. Wraps the functionality of the ColorStop type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<ColorStop>
 Grasshopper.Rhinoceros.Display.DisplayColorStop
 Namespace: Grasshopper.Rhinoceros.Display
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class DisplayColorStop : GH_Goo<ColorStop>
Public NotInheritable Class DisplayColorStop
	Inherits GH_Goo(Of ColorStop)
The DisplayColorStop type exposes the following members.
Constructors
Name | Description
DisplayColorStop()
 Blank constructor
DisplayColorStop(ColorStop)
Initializes a new instance of the DisplayColorStop class
DisplayColorStop(DisplayColorStop)
Initializes a new instance of the DisplayColorStop class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateColorStop
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Rhinoceros.Display Namespace