Grasshopper API
ModelHatchPattern.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.ModelComponentContent.Attributes
 Grasshopper.Rhinoceros.Drafting.ModelHatchPattern.Attributes
 Namespace: Grasshopper.Rhinoceros.Drafting
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelComponentContent.Attributes,
	IEquatable<ModelHatchPattern.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelComponentContent.Attributes
	Implements IEquatable(Of ModelHatchPattern.Attributes)
The ModelHatchPattern.Attributes type exposes the following members.
Constructors
Name | Description
ModelHatchPattern.Attributes
Initializes a new instance of the ModelHatchPattern.Attributes class
Top
Properties
Name | Description
Lines
Units
Top
Methods
Name | Description
ToDetails |  (Overrides ModelComponentContent.Attributes.ToDetails().)
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
Top
Operators
Name | Description
Implicit(String to ModelHatchPattern.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Drafting Namespace