Grasshopper API
Param_ModelRenderEnvironment Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelRenderEnvironment>
 Grasshopper.Kernel.GH_PersistentParam<ModelRenderEnvironment>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelRenderEnvironment>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelRenderEnvironment>
 Grasshopper.Rhinoceros.Render.Params.Param_ModelRenderEnvironment
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelRenderEnvironment : ModelContentParam<ModelRenderEnvironment>
Public NotInheritable Class Param_ModelRenderEnvironment
	Inherits ModelContentParam(Of ModelRenderEnvironment)
The Param_ModelRenderEnvironment type exposes the following members.
Constructors
Name | Description
Param_ModelRenderEnvironment
Initializes a new instance of the Param_ModelRenderEnvironment class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace