Grasshopper API
Param_ModelTextureMapping Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelTextureMapping>
 Grasshopper.Kernel.GH_PersistentParam<ModelTextureMapping>
 Grasshopper.Kernel.GH_PersistentReferenceParam<ModelTextureMapping>
 Grasshopper.Rhinoceros.Params.ModelContentParam<ModelTextureMapping>
 Grasshopper.Rhinoceros.Render.Params.Param_ModelTextureMapping
 Namespace: Grasshopper.Rhinoceros.Render.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Param_ModelTextureMapping : ModelContentParam<ModelTextureMapping>,
	IGH_PreviewObject
Public NotInheritable Class Param_ModelTextureMapping
	Inherits ModelContentParam(Of ModelTextureMapping)
	Implements IGH_PreviewObject
The Param_ModelTextureMapping type exposes the following members.
Constructors
Name | Description
Param_ModelTextureMapping
Initializes a new instance of the Param_ModelTextureMapping class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
IsPreviewCapable
Top
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Render.Params Namespace