Grasshopper API
Param_ModelConstructionPlane Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<ModelConstructionPlane>
 Grasshopper.Kernel.GH_PersistentParam<ModelConstructionPlane>
 Grasshopper.Kernel.GH_PersistentGeometryParam<ModelConstructionPlane>
 Grasshopper.Rhinoceros.Display.Params.Param_ModelConstructionPlane
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Param_ModelConstructionPlane : GH_PersistentGeometryParam<ModelConstructionPlane>,
	IGH_PreviewObject, IGH_BakeAwareObject
Public Class Param_ModelConstructionPlane
	Inherits GH_PersistentGeometryParam(Of ModelConstructionPlane)
	Implements IGH_PreviewObject, IGH_BakeAwareObject
The Param_ModelConstructionPlane type exposes the following members.
Constructors
Name | Description
Param_ModelConstructionPlane
Initializes a new instance of the Param_ModelConstructionPlane class
Top
Properties
Name | Description
ClippingBox
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Hidden
Icon |  (Overrides GH_DocumentObject.Icon.)
IsBakeCapable
IsPreviewCapable
Top
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
DrawViewportMeshes
DrawViewportWires
HtmlHelp_Source |  (Overrides GH_DocumentObject.HtmlHelp_Source().)
InstantiateT |  (Overrides GH_Param<T>.InstantiateT().)
Menu_AppendManageCollection |  (Overrides GH_PersistentParam<T>.Menu_AppendManageCollection(ToolStripDropDown).)
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
PreferredCast |  (Overrides GH_Param<T>.PreferredCast(Object).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Read |  (Overrides GH_PersistentGeometryParam<T>.Read(GH_IReader).)
RemoteIdExpired |  (Overrides GH_PersistentGeometryParam<T>.RemoteIdExpired(RhinoDoc, Guid, GH_RemoteIdChange).)
Write |  (Overrides GH_PersistentGeometryParam<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace