Grasshopper API
GH_GDLParser Class
 Provided functionality for parsing and writing Grasshopper Descriptor Language text.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GDL.GH_GDLParser
 Namespace: Grasshopper.Kernel.GDL
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class GH_GDLParser
Public NotInheritable Class GH_GDLParser
The GH_GDLParser type exposes the following members.
Methods
Name | Description
ParseGDL
 Convert a GDL text into an actual document.
Top
See Also
Reference
Grasshopper.Kernel.GDL Namespace