Grasshopper API
Param_ModelView.VSource Enumeration
 Namespace: Grasshopper.Rhinoceros.Display.Params
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public enum VSource
Public Enumeration VSource
Members
Member name | Value | Description
NamedViews | 0
ModelViewports | 1
PageLayouts | 1
See Also
Reference
Grasshopper.Rhinoceros.Display.Params Namespace