Grasshopper API
ModelUnitSystem Class
 Represents a Rhino Unit System. Wraps the functionality of the UnitSystem type.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelValue
 Grasshopper.Rhinoceros.ModelUnitSystem
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class ModelUnitSystem : ModelValue
Public NotInheritable Class ModelUnitSystem
	Inherits ModelValue
The ModelUnitSystem type exposes the following members.
Constructors
Name | Description
ModelUnitSystem()
Initializes a new instance of the ModelUnitSystem class
ModelUnitSystem(ModelUnitSystem.Value)
Initializes a new instance of the ModelUnitSystem class
ModelUnitSystem(ActiveSpace, RhinoDoc)
Initializes a new instance of the ModelUnitSystem class
Top
Properties
Name | Description
ActiveSpace
BaseSystem
Factor
IsValid |  (Overrides ModelValue.IsValid.)
MetersPerUnit
Name
Top
Methods
Name | Description
AdjustDocumentUnitSystem
Cast
CastTo<T>(T) |  (Overrides ModelValue.CastTo<T>(T).)
Copy
Equals |  (Overrides Object.Equals(Object).)
GetHashCode |  (Overrides Object.GetHashCode().)
TooltipString |  (Overrides ModelValue.TooltipString().)
Top
Operators
Name | Description
Implicit(ModelUnitSystem to ModelUnitSystem.Value)
Implicit(ModelUnitSystem.Value to ModelUnitSystem)
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace