Grasshopper API
ModelRenderTexture.Attributes Class
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData.Attributes
 Grasshopper.Rhinoceros.ModelContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderContent.Attributes
 Grasshopper.Rhinoceros.Render.ModelRenderTexture.Attributes
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class Attributes : ModelRenderContent.Attributes,
	IEquatable<ModelRenderTexture.Attributes>
Public NotInheritable Class Attributes
	Inherits ModelRenderContent.Attributes
	Implements IEquatable(Of ModelRenderTexture.Attributes)
The ModelRenderTexture.Attributes type exposes the following members.
Constructors
Name | Description
ModelRenderTexture.Attributes
Initializes a new instance of the ModelRenderTexture.Attributes class
Top
Properties
Name | Description
RenderTexture
Top
Methods
Name | Description
ToModelData |  (Overrides ModelData.Attributes.ToModelData().)
ToString |  (Overrides ModelContent.Attributes.ToString().)
Top
Operators
Name | Description
Implicit(String to ModelRenderTexture.Attributes)
Top
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace