Grasshopper API
CentralSettings.AuthorEMailChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void AuthorEMailChangedEventHandler()
Public Delegate Sub AuthorEMailChangedEventHandler
See Also
Reference
Grasshopper Namespace