Grasshopper API
IGH_ContextualComponent Interface
 Base interface for contextual components. This makes accessing non-strongly-typed functionality easier.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public interface IGH_ContextualComponent
Public Interface IGH_ContextualComponent
The IGH_ContextualComponent type exposes the following members.
Properties
Name | Description
Archive
 Gets instance of embedded Grasshopper GH_Archive
Top
See Also
Reference
Grasshopper.Kernel Namespace