Grasshopper API
ModelContent Class
 Represents a Rhino model element.
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 More...
 Namespace: Grasshopper.Rhinoceros
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public abstract class ModelContent : ModelData,
	IGH_ModelContentData, IEquatable<ModelContent>
Public MustInherit Class ModelContent
	Inherits ModelData
	Implements IGH_ModelContentData, IEquatable(Of ModelContent)
The ModelContent type exposes the following members.
Properties
Name | Description
Attribs
Id
IsReferencedData
IsReferencedDataLoaded
IsValid |  (Overrides ModelData.IsValid.)
IsValidWhyNot |  (Overrides ModelData.IsValidWhyNot.)
Name
Notes
Parent
Path
Tags
Top
Methods
Name | Description
AsFrozen
 Try to obtain a dereferenced snapshot of itself.
Cast(Object)
Cast<A, T>(Object)
CastTo<T>(T) |  (Overrides ModelData.CastTo<T>(T).)
Equals(ModelContent)
Equals(Object) |  (Overrides ModelData.Equals(Object).)
FromId
GetHashCode |  (Overrides ModelData.GetHashCode().)
InternaliseData
LoadReferencedData
Read |  (Overrides ModelData.Read(GH_IReader).)
RenderItem
RuntimeId
SubCast<A, T>
ToAttributes
TooltipString |  (Overrides ModelData.TooltipString().)
ToString |  (Overrides ModelData.ToString().)
UnloadReferencedData
Write |  (Overrides ModelData.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Rhinoceros Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Rhinoceros.ModelData
 Grasshopper.Rhinoceros.ModelContent
 Grasshopper.Rhinoceros.Display.ModelDisplayMode
 Grasshopper.Rhinoceros.Display.ModelNamedConstructionPlane
 Grasshopper.Rhinoceros.Display.ModelNamedView
 Grasshopper.Rhinoceros.Display.ModelViewport
 Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint
 Grasshopper.Rhinoceros.ModelComponentContent
 Grasshopper.Rhinoceros.Render.ModelRenderContent
 Grasshopper.Rhinoceros.Render.ModelRenderSkylight
 Grasshopper.Rhinoceros.Render.ModelRenderSun