Grasshopper API
GH_Document.ObjectsAddedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void ObjectsAddedEventHandler(
	Object sender,
	GH_DocObjectEventArgs e
)
Public Delegate Sub ObjectsAddedEventHandler (
	sender As Object,
	e As GH_DocObjectEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocObjectEventArgs
See Also
Reference
Grasshopper.Kernel Namespace