Grasshopper API
IGH_DocumentObject.PreviewExpiredEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void PreviewExpiredEventHandler(
	IGH_DocumentObject sender,
	GH_PreviewExpiredEventArgs e
)
Public Delegate Sub PreviewExpiredEventHandler (
	sender As IGH_DocumentObject,
	e As GH_PreviewExpiredEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.IGH_DocumentObject
e
Type: Grasshopper.Kernel.GH_PreviewExpiredEventArgs
See Also
Reference
Grasshopper.Kernel Namespace