Grasshopper API
SlotType Enumeration
 Namespace: Grasshopper.Rhinoceros.Render
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public enum SlotType
Public Enumeration SlotType
Members
Member name | Value | Description
None | 0
Number | 1
Color | 2
See Also
Reference
Grasshopper.Rhinoceros.Render Namespace