Grasshopper API
GH_DetailView Class
 Represents a Rhino model detail view. Wraps the functionality of the DetailView type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<DetailView>
 Grasshopper.Kernel.Types.GH_GeometricGoo<DetailView>
 Grasshopper.Kernel.Types.GH_DetailView
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_DetailView : GH_GeometricGoo<DetailView>
Public Class GH_DetailView
	Inherits GH_GeometricGoo(Of DetailView)
The GH_DetailView type exposes the following members.
Constructors
Name | Description
GH_DetailView()
 Default constructor, creates an invalid detail view.
GH_DetailView(DetailView)
 Create a duplicate of an existing detail view.
GH_DetailView(GH_DetailView)
 Create a duplicate of another GH_DetailView. This constructor also copies reference data.
GH_DetailView(Guid)
 Create a new referenced detail view that references a Rhino detail view with the specified ID.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
IsGeometryLoaded
 Gets the load state of this detail view object. The detail view is considered to be loaded when the local detail view instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this detail view. If the detail view is referenced but cannot be loaded, the detail view is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the detail view is referenced, the local instance of the detail view is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateDetailView
 Create a duplicate of this hatch.
DuplicateGeometry
 Create a duplicate of this hatch.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry()
 If the geometry is referenced and not yet loaded, attempts to load the geometry.
 (Overrides GH_GeometricGoo<T>.LoadGeometry().)
LoadGeometry(RhinoDoc)
 If the detail view is referenced and not yet loaded, attempts to load the detail view.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the detail view using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace