Grasshopper API
CentralSettings.FormattingChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void FormattingChangedEventHandler()
Public Delegate Sub FormattingChangedEventHandler
See Also
Reference
Grasshopper Namespace