Grasshopper SDK
GH_ScriptVariant Implicit Conversion (Int32 to GH_ScriptVariant)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16265.1000 (6.0.16265.01000)
Syntax
public static implicit operator GH_ScriptVariant (
	int in
)
Public Shared Widening Operator CType (
	in As Integer
) As GH_ScriptVariant
Parameters
in
Type: System.Int32
Return Value
Type: GH_ScriptVariant
See Also
Reference
GH_ScriptVariant Class
Implicit Overload
Grasshopper.Kernel.Expressions Namespace