Grasshopper API
GH_RhinoScriptInterface.RunAsCommand Method
 Namespace: Grasshopper.Plugin
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Result RunAsCommand(
	GH_Document ghDoc,
	Command command,
	RhinoDoc rhinoDoc,
	RunMode mode
)
Public Function RunAsCommand (
	ghDoc As GH_Document,
	command As Command,
	rhinoDoc As RhinoDoc,
	mode As RunMode
) As Result
Parameters
ghDoc
Type: Grasshopper.Kernel.GH_Document
command
Type: Command
rhinoDoc
Type: RhinoDoc
mode
Type: RunMode
Return Value
Type: Result
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace