Grasshopper SDK
GH_SettingsServer.Clear Method
 Destroy all settings.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace