Grasshopper SDK
GH_Surface.ClearCaches Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace