Grasshopper SDK
Complex.Secant Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public Complex Secant()
Public Function Secant As Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace