Grasshopper API
GH_SubD.LoadGeometry Method
Overload List
Name | Description
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_SubD Class
Grasshopper.Kernel.Types Namespace