Grasshopper API
Instances.BakeIcon24 Property
 Gets the 24x24 pixel bake icon.
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public static Bitmap BakeIcon24 { get; }
Public Shared ReadOnly Property BakeIcon24 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Instances.BakeIcon24"]
See Also
Reference
Instances Class
Grasshopper Namespace