Grasshopper API
GH_RenderArgs.MaterialCache Property
 Gets the material cache.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Dictionary<int, RenderMaterial> MaterialCache { get; }
Public ReadOnly Property MaterialCache As Dictionary(Of Integer, RenderMaterial)
	Get
Property Value
Type: Dictionary<Int32, RenderMaterial>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.MaterialCache"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace