Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectChangeChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public delegate void SaveOnObjectChangeChangedEventHandler()
Public Delegate Sub SaveOnObjectChangeChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace