Grasshopper SDK
GH_Document.ContextChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16265.1000 (6.0.16265.01000)
Syntax
public delegate void ContextChangedEventHandler(
	Object sender,
	GH_DocContextEventArgs e
)
Public Delegate Sub ContextChangedEventHandler (
	sender As Object,
	e As GH_DocContextEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocContextEventArgs
See Also
Reference
Grasshopper.Kernel Namespace