Grasshopper SDK
CentralSettings.TooltipWiggleRadiusChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public delegate void TooltipWiggleRadiusChangedEventHandler()
Public Delegate Sub TooltipWiggleRadiusChangedEventHandler
See Also
Reference
Grasshopper Namespace