Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public delegate void SaveOnObjectAddedChangedEventHandler()
Public Delegate Sub SaveOnObjectAddedChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace