Grasshopper SDK
CentralSettings.PreviewBumpZBufferChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16265.1000 (6.0.16265.01000)
Syntax
public delegate void PreviewBumpZBufferChangedEventHandler()
Public Delegate Sub PreviewBumpZBufferChangedEventHandler
See Also
Reference
Grasshopper Namespace