Grasshopper SDK
GH_FontServer.StandardFamilyChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16265.1000 (6.0.16265.01000)
Syntax
public delegate void StandardFamilyChangedEventHandler()
Public Delegate Sub StandardFamilyChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace